{"file_path": "../../raw_kb_v2\\article\\360043438153\\index.html", "content": {"Title": "Enable SSO with OpenID Connect", "Article Body": "Intro\n                       \n\n                        You can log in to Domo using either our built-in authentication system or a single sign-on (SSO) solution from a supported provider. Domo offers two SSO solutions: Security Assertion Markup Language (SAML) authentication and OpenID Connect (OIDC). This article discusses OIDC. For information on authentication using SAML, see our article about\n                        \n                         Understanding and Configuring Domo Single Sign-On Using SAML\n                        \n                        .\n                       \n\n                        In Domo, you must have an Admin default security role or a custom role with the Manage All Company Settings grant enabled to set up SSO. For more information about default roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n                        This article describes using OpenID Connect in Domo in the following categories:\n                       \n\n\n\n                          Benefits of OpenID Connect\n                         \n\n\n\n                          Configure OpenID Connect\n                         \n\n\n\n                          Advanced settings\n                         \n\n\n\n\n\n                        Benefits of OpenID Connect\n                       \n\n                        Although SAML is the primary SSO protocol for enterprise organizations, many organizations are switching to OIDC because it:\n                       \n\n\n                         works better on mobile devices.\n                        \n\n                         is ideal for external users/non-employees.\n                        \n\n                         is based on OAuth 2, making it a better fit for developers.\n                        \n\n                         is simpler to configure and less expensive to purchase, making SSO accessible to small businesses and enterprises.\n                        \n\n                         is an industry standard supported by identity systems such as Azure Active Directory, Auth0, Google G Suite, Okta, and OneLogin.\n                        \n\n\n                        OIDC is native to some identity providers (IdPs), such as Azure AD. Other IdPs require an integration system, such as Okta, Google, or Ping. You can configure SSO with\n                        \n                         Azure Active Directory\n                        \n                        or any other supported IdP.\n                       \n\n                        SAML and DSO Compatibility\n                       \n\n                        Both SAML and OIDC Connect can run concurrently, making it easy to segment internal and external users. This is also useful for separating the SSO solutions you use for Domo access and Domo Embed. For example, you can use SAML to control employee access to Domo and OIDC to embed maps into other websites and applications.\n                       \n\n                        You can also use Direct Sign-On (DSO) while both SSO methods are in use. To do this, you must configure DSO in\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        >\n                        \n                         Authentication\n                        \n                        >\n                        \n                         SAML (SSO)\n                        \n                        , even though it applies to both SAML and OIDC. For more information on DSO, see our article about\n                        \n                         Understanding and Configuring Domo Single Sign-On Using SAML\n                        \n                        .\n                       \n\n                        Support Internal and External Users\n                       \n\n                        Enterprises often have employees who are not in their corporate directory but still need access to Domo. It is possible to allow them to sign-in using DSO, but this can be difficult dfor large numbers of users.\n                       \n\n                        A better solution is to use OIDC to implement a second IdP specifically for external users, allowing you to share content with people who are not in your corporate directory. Users who come to Domo without authentication are sent to the SAML IdP by default.\n                       \n\n\n\n                        Configure OpenID Connect\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           To configure OIDC, you must have an Admin security profile in Domo and have admin access to the IdP.\n                          \n\n\n\n\n                        Configure Using Metadata From Your IdP\n                       \n\n                        If your IdP allows you to use metadata import—almost all IdPs do—you can import your OIDC metadata into Domo. This streamlines configuration by automatically setting up most of your settings. Otherwise, you need to manually enter the authentication request endpoint URL, client ID and secret, and other details.\n                       \n\n                        By default, Domo assumes that you want to use metadata for your configuration. This means that you only need to enter the client ID and client secret generated by your IdP, along with the IdP's config URL. The config retrieves all the metadata from the IdP, so you don't need to enter any additional information.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Almost all IdPs have well-known configs. If you do not know the config for your IdP, you can likely find it by doing an online search (for example, \"Azure well-known config\" to find the well-known config for Azure). If your IdP does not have a known configuration, follow the steps in the\n                           \n                            next heading\n                           \n                           to manually enter metadata.\n                          \n\n\n\n\n\n                         In the navigation header, go to\n                         \n                          More\n                         \n                         >\n                         \n                          Admin\n                         \n                         .\n                         \n\n\n\n\n\n                         From the\n                         \n                          Authentication\n                         \n                         menu in the Admin Settings, select\n                         \n                          OpenID Connect (SSO)\n                         \n                         .\n                         \n\n\n                         In the\n                         \n                          Well known config\n                         \n                         field, enter the\n                         \n                          well-known config URL for your IdP\n                         \n                         .\n                         \n\n\n                         Enter the client ID for your app in the\n                         \n                          Client ID\n                         \n                         field and the secret for your app in the\n                         \n                          Client Secret\n                         \n                         field. Both of these credentials should be generated when you create an app for your IdP.\n                         \n\n\n                         (Conditional) If your IdP requires an assertion endpoint URL from Domo, select the clipboard icon next to\n                         \n                          OpenID Connect Assertion Endpoint URL\n                         \n                         and paste the copied URL into the appropriate location in your IdP settings.\n                         \n\n\n                         (Optional) If you want to enable any advanced settings, select their checkboxes. Advanced settings are discussed in the following section.\n                         \n\n\n                         In the upper-right corner, turn on the\n                         \n                          Enable OIDC\n                         \n                         toggle.\n                         \n\n\n\n\n\n                         Select\n                         \n                          Save Config\n                         \n                         .\n                        \n\n\n\n\n                        Configure Manually\n                       \n\n                        If your IdP does not have a well-known config (which is usually the case if your organization has created its own IdP), you must enter the metadata for the IdP manually. To do this, follow the steps below.\n                       \n\n\n                         In the navigation header, go to\n                         \n                          More\n                         \n                         >\n                         \n                          Admin.\n                         \n\n\n\n\n\n                         From the\n                         \n                          Authentication\n                         \n                         menu in the Admin Settings, select\n                         \n                          OpenID Connect (SSO)\n                         \n                         .\n                         \n\n\n                         Select\n                         \n                          Manual entry\n                         \n                         .\n                         \n\n\n\n\n\n                         Fill in all the fields with the information found in your IdP.\n                         \n\n\n                         (Conditional) If your IdP requires an assertion endpoint URL from Domo, select the clipboard icon next to\n                         \n                          OpenID Connect Assertion Endpoint URL\n                         \n                         and paste the copied URL into the appropriate location in your IdP settings.\n                         \n\n\n                         (Optional) If you want to enable any advanced settings, select their checkboxes. Advanced settings are discussed in the following section.\n                         \n\n\n                         In the upper-right corner, turn on the\n                         \n                          Enable OIDC\n                         \n                         toggle.\n                         \n\n\n\n\n                         Select\n                         \n                          Save Config\n                         \n                         .\n                        \n\n\n\n\n                          Video - OpenID Connect (SSO)\n                         \n\n\n\n\n\n\n\n\n\n                        Advanced Settings\n                       \n\n                        Advanced settings are available for both metadata-driven and manual configurations. Note that these settings do not take effect until you save your configuration.\n                       \n\n                        The following advanced settings are available:\n                       \n\n\n\n\n\n                            Setting\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Only invited people can access Domo\n                           \n\n\n\n                            Domo only matches users coming from the IdP; it does not create new users.\n                           \n\n\n\n\n\n                            On logout, direct people to the following URL\n                           \n\n\n\n                            Allows you to specify the URL that users are redirected to when they log out of Domo.\n                           \n\n\n\n\n\n                            Import groups from identity provider\n                           \n\n\n\n                            Allows you to pull in groups from your identity provider.\n                           \n\n\n\n\n\n                            Mixed mode login\n                           \n\n\n\n                            If you enable this setting, users who visit Domo without authenticating via the IdP are prompted for a username and password, while users who visit Domo with authentication via the IdP are allowed in without having to enter any credentials.\n                           \n\n\n\n\n\n                            Show Domo sign-in screen/Skip to identity provider\n                           \n\n\n\n                            Allows you to choose whether users are shown a Domo login screen or redirected to the IdP instead.", "Preview Article": "Click here to preview", "URL Name": "360043438153", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003049", "Archived Date": "", "Language": "English", "Primary Version": "Enable SSO with OpenID Connect", "Article Total View Count": "5,278", "": "", "Article Created Date": "10/24/2022, 9:05 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Enable SSO with OpenID Connect\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Implementing SSO\n              \n", "url": "/s/topic/0TO5w000000ZanoGAC"}]}