{"file_path": "../../raw_kb_v2\\article\\360043437953\\index.html", "content": {"Title": "Using the Domo PowerPoint Plugin", "Article Body": "Intro\n                       \n\n                        Use the Domo PowerPoint plugin to pull Domo Cards into a PowerPoint presentation. This plugin provides much more power and flexibility than the other available methods for showing Cards in PowerPoint.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n                              The Domo PowerPoint plugin can be used\n                              \n                               only\n                              \n                              in PowerPoint on Windows machines\n                             \n                             and is only supported by Office 2000 and later.\n                            \n\n                             Multi-factor verification is\n                             \n                              not\n                             \n                             available for the PowerPoint plugin.\n                            \n\n\n                              This plugin can be used by Admin-, Privileged-, and Editor-level users by default.\n                              \n                               To enable Participants to access Tool Downloads and obtain this plugin, please contact Support.\n                              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                          Video - PowerPoint Plugin\n                         \n\n\n\n\n\n\n\n\n\n                        What you can do with the plugin\n                       \n\n                        Using this plugin, you can do all of the following:\n                       \n\n\n\n                          Connect to the server for the desired Domo instance.\n                         \n\n\n\n                          Create a template for displaying Cards in your presentation. You can include or exclude attributes such as Card title, summary number, description, owner name, last modify date, and so on.\n                         \n\n\n\n                          Specify the page in Domo that Cards are being pulled from.\n                         \n\n\n\n                          Refresh the Cards in a presentation.\n                         \n\n\n\n                          Specify the types of Cards that are pulled into Domo (Visualization Cards, document Cards, custom Apps, etc.).\n                         \n\n\n\n                        Downloading the plugin\n                       \n\n                        You can download the Domo PowerPoint plugin in the Admin Settings.\n                       \n\n\n                         To download the Domo PowerPoint plugin,\n                        \n\n\n\n\n                          In Domo, navigate to\n                          \n                           Admin Settings\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Tool Downloads\n                          \n                          .\n                         \n\n\n\n                          Scroll down to the\n                          \n                           Domo PowerPoint plug-in\n                          \n                          section.\n                         \n\n\n\n                          Click\n                          \n                           Try the PPT Plug-In\n                          \n                          .\n                         \n\n\n\n                          After the plugin finishes downloading, follow the steps in the wizard to install it to your computer.\n                         \n\n\n\n                        The plugin will now be available when you open PowerPoint.\n                       \n\n                        Sequence of steps\n                       \n\n                        The process for using the plugin to pull Domo Cards into PowerPoint can be summarized as follows:\n                       \n\n\n\n\n                           Connect to the server\n                          \n                          for the Domo instance you want to pull Cards from.\n                         \n\n\n\n\n                           Set up a template\n                          \n                          to control how Cards will appear when pulled into PowerPoint.\n                         \n\n\n\n\n                           Download the Cards\n                          \n                          from the desired Domo page or subpage into PowerPoint.\n                         \n\n\n\n                          After your presentation is saved, you can\n                          \n                           refresh the Cards\n                          \n                          as necessary to keep the data up to date.\n                         \n\n\n\n                        Parts of the Domo tab in PowerPoint\n                       \n\n                        After you have installed the Domo PowerPoint plugin, a\n                        \n                         Domo\n                        \n                        tab appears near the end of the main tab row in PowerPoint. This tab appears as follows:\n                       \n\n\n\n\n                        The following table describes the components of this tab:\n                       \n\n\n\n\n                           Component\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Connect to Domo\n                          \n\n                           Lets you connect to a specified Domo instance.\n                          \n\n\n\n                           \"Templates\" Options\n                          \n\n                           Let you choose whether one, two, or four Domo Cards appear in the currently selected slide.\n                          \n\n\n\n                           \"Custom Layout\" Options\n                          \n\n\n                            Let you include various layout items in the currently selected slide.\n                            \n                             Visualization\n                            \n                            adds a single-Card visualization layer to the slide. All of the other options add macros for swapping in text. For example, if you clicked\n                            \n                             Owner Name\n                            \n                            , a text macro reading \"@DomoOwnerName-1\" would appear under the visualization layer. This would then be replaced with the actual Card owner's name when the Card was pulled into Domo.\n                           \n\n\n\n\n                           Clear All\n                          \n\n                           Deletes all layout attributes from the currently selected slide (including visualization layers).\n                          \n\n\n\n                           Choose Page\n                          \n\n                           Lets you specify a page in Domo from which to retrieve Cards. The wizard populates with all pages you have access to.\n                          \n\n\n\n                           Refresh Cards\n                          \n\n                           Refreshes all of the Cards in this PowerPoint presentation, updating the underlying data as necessary.\n                          \n\n\n\n                           Settings\n                          \n\n                           Lets you specify the types of Cards that are pulled from Domo into PowerPoint. You can choose Visualization Cards (here called \"Chart Cards\"), document Cards, table Cards, or custom Domo Apps. Here you can also turn Domo watermarks (Domo's logo on rendered Card images) on or off. Be aware that this option requires a contractual agreement with Domo that allows for white label usage of this tool.\n                          \n\n\n\n                           Help\n                          \n\n                           Provides basic instructions for using the Domo PowerPoint plugin.\n                          \n\n\n\n\n                        Connecting to a Domo server\n                       \n\n                        You can connect to the server for any Domo instance for which you have access.\n                       \n\n\n                         To connect to a Domo server,\n                        \n\n\n\n\n                          Click the\n                          \n                           Connect to Domo\n                          \n                          button on the left side of the Domo tab in PowerPoint.\n                          \n\n\n\n\n                          A dialog appears requesting that you add a connection.\n                         \n\n\n\n                          Click\n                          \n                           Add\n                          \n                          .\n                         \n\n\n\n                          Enter the URL for your Domo server in the field, then click\n                          \n                           Next\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Enter your Domo credentials in the fields, then click\n                          \n                           Next\n                          \n                          .\n                          \n\n\n\n\n                          If you have entered your credentials correctly, a \"Success\" dialog appears. In addition, an access token is created within Domo. For more information about access tokens, see\n                          \n                           Managing Access Tokens\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Finish\n                          \n                          .\n                         \n\n\n\n                        Setting up a Card template\n                       \n\n                        Before pulling Domo Cards into PowerPoint, you must set up a template for them. The plugin pulls all Cards from a page and allocates them according to the template in the currently selected slide. For example, if you select a slide with a four-Card template then choose a Domo page with 32 Cards, those Cards would populate the next eight slides in your presentation, with four Cards appearing per slide as per your template.\n                       \n\n                        You can also insert text macros for swapping in Card text attributes such as title, description, owner name, and so on. When the Cards are pulled in, the real text will replace the macros you have inserted. All macros are prefaced with a @ symbol and are thus easily identified.\n                       \n\n                        You can edit Domo Card layout items just as you can any other elements in PowerPoint. For example, you can add text, move elements around on a slide, and so on.\n                       \n\n                        This section discusses the various options available for setting up Card template layouts.\n                       \n\n                        Specifying the number of Cards in a slide\n                       \n\n                        You can specify whether one, two, or four Cards is added to a template. You do this by clicking\n                        \n                         Single Card\n                        \n                        ,\n                        \n                         Dual Card\n                        \n                        , or\n                        \n                         Four Cards\n                        \n                        , respectively, in the Domo toolbar. If you click one of these options in a blank slide, a visualization layer is added to the slide, divided into the specified number of Card templates. If you click one of these options in a slide that already contains a template, that option replaces the current template. For example, if the slide contains a two-Card template and you click\n                        \n                         Four Cards\n                        \n                        , the four-Card template replaces the two-Card template.\n                       \n\n                        The single-Card and two-Card templates come with preinserted text macros for swapping in text. You can move these, remove them entirely, or add different ones if desired.\n                       \n\n                        The single-Card template includes macros for the Card title, summary number, description, owner name, and last update date, as follows:\n                       \n\n\n\n\n                        The dual-Card template includes macros for the titles, summary numbers, owner names, and last update dates for both Cards, as follows (note that description text macro does not appear by default):\n                       \n\n\n\n\n                        The four-Card template does\n                        \n                         not\n                        \n                        include preinserted text macros; however, you can insert these manually using the\n                        \n                         Custom Layout\n                        \n                        options. These are described in the next section.\n                       \n\n                        Inserting text using Custom Layout macros\n                       \n\n                        For any Card template, you can insert macros for Card attributes such as title, description, owner, etc. As described above, when you pull Cards into Domo, the real attribute text replaces the macros.\n                       \n\n                        The following macros are available:\n                       \n\n\n\n\n                           Macro\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Card Title\n                          \n\n                           The title of this Card as it appears in Domo. For more information about setting Card titles, see\n                           \n                            Editing the Name or Description of a Visualization Card\n                           \n                           .\n                          \n\n\n\n                           Summary Number\n                          \n\n                           This Card's summary number as it appears in Domo. For more information about configuring summary numbers, see\n                           \n                            Configuring Your Chart Summary Number\n                           \n                           .\n                          \n\n\n\n                           Description\n                          \n\n                           The description of this Card as it appears in Domo. For more information about adding or editing a Card's description, see\n                           \n                            Editing the Name or Description of a Visualization Card\n                           \n                           .\n                          \n\n\n\n                           Owner Name\n                          \n\n                           The name of the Domo user who owns this Card. For more information about Card ownership, see\n                           \n                            Changing a Card Owner\n                           \n                           .\n                          \n\n\n\n                           Data Last Updated\n                          \n\n                           The date when the data in this Card was last refreshed. For more information, see\n                           \n                            Updating or Refreshing the DataSet for a Visualization Card\n                           \n                           .\n                          \n\n\n\n                           Card Last Modified\n                          \n\n                           The date when this Card was last edited. For more information, see\n                           \n                            Understanding Cards\n                           \n                           .\n                          \n\n\n\n\n                        The other option in this list,\n                        \n                         Visualization\n                        \n                        , is not a text macro. This is the macro that pulls in the actual content for a given Card. These macros appear in the following format: @DomoVisualization-\n                        \n                         x\n                        \n                        , where\n                        \n                         x\n                        \n                        is the number corresponding to this visualization on the slide. This is important because all text macros also end with a number, which matches the number of the corresponding visualization. So, for example, if you had a four-Card template, the visualizations would be numbered 1 through 4. If you then inserted an\n                        \n                         Owner Name\n                        \n                        macro, it would appear as follows:\n                        \n                         @DomoOwnerName-1.\n                        \n                        Then, if you were to pull in Cards for this slide, this macro would be replaced by the name of the owner for\n                        \n                         @DomoVisualization-1\n                         \n                          .\n                         \n\n                        Make sure you match up your text macros with the correct visualizations, or you could end up with Cards paired with the wrong attributes!\n                       \n\n\n\n\n\n\n\n\n\n\n                             Tip:\n                            \n                            You can quickly add macros with incrementing numbers (\n                           \n\n                            @DomoOwnerName-1, @DomoOwnerName-2,\n                           \n                           etc.)\n                           \n                            by\n                           \n\n                            repeatedly clicking the button for that macro.\n                           \n\n\n\n\n\n                        Removing everything from a slide\n                       \n\n                        You can quickly remove all visualization layers and macros from a slide by clicking\n                        \n                         Clear All\n                        \n                        in the Domo tab.\n                       \n\n                        Pulling Cards into PowerPoint\n                       \n\n                        After you have set up a Card template as described in the previous sections, it is time to pull Domo Cards into PowerPoint based on your template. You do this by clicking\n                        \n                         Choose Page\n                        \n                        then following the steps in the wizard.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            When pulling Domo Cards into PowerPoint, make sure you have selected the slide containing your template. Otherwise one card is allocated per slide.\n                            \n\n\n\n\n\n\n\n                        Before doing this, you may want to specify the types of Cards pulled into PowerPoint when you import. Currently the following types of Cards can be pulled from Domo into PowerPoint:\n                       \n\n\n\n                          Visualization Cards (\"Chart Cards\")\n                         \n\n\n\n                          Table Cards\n                         \n\n\n\n                          Document Cards\n                         \n\n\n\n                          Custom Domo Apps\n                         \n\n\n\n                          Sumo Cards (only pulls Sumo table data, not Card attributes such as colors, etc.)\n                         \n\n\n\n                        Poll Cards and Notebook Cards\n                        \n                         cannot\n                        \n                        be pulled into PowerPoint at this time.\n                       \n\n                        You can select and deselect the types of Cards pulled into PowerPoint from Domo in the\n                        \n                         DomoOffice\n                        \n\n                         Settings\n                        \n                        dialog, which you can access by clicking\n                        \n                         Settings\n                        \n                        in the Domo tab. For each type of Card, you can toggle it on (\"Enabled\") or off (\"Disabled\"). For example, in the following screenshot, all Card types are enabled and will be pulled into PowerPoint upon import\n                        \n                         except for\n                        \n                        custom Domo Apps.\n                       \n\n\n\n\n                        Once you have set up your templates and established the types of Cards to be pulled, you can select the page with Cards to retrieve. You do this in the\n                        \n                         Get Cards\n                        \n                        dialog, which you can access by clicking\n                        \n                         Choose Page\n                        \n                        in the Domo tab. This dialog lists all Domo pages and subpages you have access to.\n                       \n\n\n                         To download Domo Cards into PowerPoint,\n                        \n\n\n\n\n                          Select the PowerPoint slide that contains the template you want to base your Cards on.\n                         \n\n\n\n                          Click\n                          \n                           Choose Page\n                          \n                          in the Domo tab.\n                         \n\n\n\n                          Scroll down to navigate to the page or subpage you want, or filter the list using any of the filters at the top of the dialog.\n                          \n                          The first filter lets you filter by entering the name of the desired page; the second filter lets you choose from parent pages; and the third filter lets you filter by page owner.\n                         \n\n\n\n                          Once you find the page you want to import from, select it then click\n                          \n                           Next\n                          \n                          .\n                          \n                          All of the Cards of the type(s) you enabled in\n                          \n                           Settings\n                          \n                          are downloaded.\n                         \n\n\n\n                          Click\n                          \n                           Create Slides\n                          \n                          .\n                          \n                          The Domo Cards you have downloaded are inserted into the slides in your presentation.\n                         \n\n\n\n                        Refreshing Domo Cards in a presentation\n                       \n\n                        You can refresh a presentation with Domo Cards. When you do this, all Cards in the presentation are updated to show the most recent data.\n                       \n\n\n                         To refresh a presentation with Domo Cards,\n                        \n\n\n\n                         Click\n                         \n                          Refresh Cards\n                         \n                         in the Domo tab.\n                        \n\n\n                        All of the Cards should update to show their most recent data.\n                       \n\n                        Troubleshooting\n                       \n\n                        Several users have reported an issue in which Microsoft disables the plugin after a crash; hence the plugin is still installed but is in a disabled state, so the\n                        \n                         Domo\n                        \n                        tab doesn't appear. Reinstalling the plugin leaves it in the disabled state. Below are instructions to re-enable the plugin.\n                       \n\n\n                         To re-enable the PowerPoint Plugin\n                        \n\n                         ,\n                        \n\n\n\n\n                          Open PowerPoint.\n                         \n\n\n\n                          Select\n                          \n                           File > Options\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Add-ins\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Manage\n                          \n                          dropdown, select\n                          \n                           COM Add-ins\n                          \n                          , then click\n                          \n                           Go\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Check the box next to\n                          \n                           Domo PowerPoint\n                          \n                          then click\n                          \n                           OK\n                          \n                          .\n                         \n\n\n\n                        If the box is already checked and the\n                        \n                         Domo\n                        \n                        tab still doesn't appear, make sure you don't have multiple versions of the plugin installed. You can remove extra instances by doing the following:\n                       \n\n\n\n                          In the Windows Control Panel, go to\n                          \n                           Add/Remove Programs\n                          \n                          .\n                         \n\n\n\n                          Remove all instances of \"Domo PowerPoint.\"\n                         \n\n\n\n                          Reinstall the plugin.\n                         \n\n\n\n\n                         Reauthorizing Server Connections:\n                        \n\n\n                        When you trying to reauthorize a connection for a server of your connections,\n                        \n                        there is a user that is getting the following error in PowerPoint using the plugin-in:\n                       \n\n\n                         Case 1:\n                        \n\n                        Error getting the user from '.\n                        \n                         domo.com\n                        \n                        '.\n                        \n                        Please reauthorize this account.\n                        \n                        or\n                        \n\n                         Case 2:\n                        \n\n                        There was a problem authenticating with '.\n                        \n                         domo.com\n                        \n                        ':\n                        \n                        Could not find an associated user in '.\n                        \n                         domo.com\n                        \n                        '\n                       \n\n                        If you face this issue after reauthoring a connection for a server of your connections,\n                        \n                        Below are instructions to re-reauthorize your account using the plugin.\n                       \n\n                        To re-enable the PowerPoint Plugin,\n                       \n\n                        1. Open\n                        \n                         PowerPoint\n                        \n                        . Select\n                        \n                         Domo\n                        \n                        >\n                        \n                         Connected\n                        \n                        .\n                        \n                        2.\n                        \n                         Delete\n                        \n                        your account. Then click\n                        \n                         Close\n                        \n                        and\n                        \n                         PowerPoint\n                        \n                        .\n                        \n                        3.\n                        \n                         Restart\n                        \n                        your PC.\n                        \n                         Open\n                        \n                        PowerPoint.\n                        \n                         Re-Connect\n                        \n                        to a Domo server.", "Preview Article": "Click here to preview", "URL Name": "360043437953", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004255", "Archived Date": "", "Language": "English", "Primary Version": "Using the Domo PowerPoint Plugin", "Article Total View Count": "14,100", "": "", "Article Created Date": "10/24/2022, 9:35 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Using the Domo PowerPoint Plugin\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Plugins For Sharing Domo Content\n              \n", "url": "/s/topic/0TO5w000000Zao3GAC"}]}