{"file_path": "../../raw_kb_v2\\article\\360043439273\\index.html", "content": {"title": "\n\n\n DomoStats - People\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomoStats gives you the freedom to explore how your team is using Domo. Because DomoStats is powered by a live Domo DataSet with no configuration, you can easily build Cards, alerts, and workflows around the metrics you want to see as well as use the pre-built dashboard.\n\n\n This DomoStats - People App gives Admins a list of all their users so they can see who is in Domo and their level of activity all in one place. Watch adoption levels and take action quickly to help people get onboard by knowing login trends and seeing who still needs to log in. Keep your instance secure and make sure everyone is working at the best level for them.\n\n####\n\n***Video - DomoStats - People App****\n\nRequirements\n--------------\n\nYou must have Admin-level access to download from the Appstore.\n\n\n Deploying the DomoStats App\n-----------------------------\n\nYou can use the pre-built dashboard or build any of your own content\n\nusing the DomoStats DataSets in the Data Center\n\n.\n\n\n You can download and power up the dashboard by following these steps:\n\n. Search for \"DomoStats People\" in the Appstore.\n2. Click the orange\n **Get**\n button.\n3. (Conditional) If there are already any versions of the App installed on your Domo instance, click\n **Add New**\n .\n4. Once the sample page is ready, click\n **Connect**\n to connect the Page to your DomoStats DataSets. Or select\n **Assign**\n if you want to assign another Domo user to set up the data.\n\nThe Dashboard\n---------------\n\n\n###\n Data\n\nThe following data is included in the download of the DomoStats - People App and can be found in the Data Center as a \"DomoStats\"-type DataSet.\n\n\n DataSets include:\n\n People\n\nDataFlows include:\n\n DomoStats People with Activity Log\n\n*Note:**\n All DataSets powering the App run once a day. Runtime is every 24 hours from when the App is first deployed. While the run frequency cannot be changed, you can edit the runtime in the DataSet settings. For more information on how to schedule DataSets, see\n\nDataSet Scheduling\n\n.\n\n##\n Cards\n\nThe following Cards are included in the pre-built dashboard.\n\n  |  |  |\n| --- | --- | --- |\n| **Collection**  | **Card**  | **Description**  |\n|\n Users\n  |\n User Departments & Roles\n  |\n Shows the number of Domo users in each role by department.\n  |\n|\n Running Total of Users\n  |\n The running total of users in the instance over time.\n\n*Note:**\n Information does not include users that have been removed from the instance.\n\n\n |\n|\n User Roles\n  |\n Tracks the number of users in your Domo instance, grouped by role.\n  |\n|\n User Departments\n  |\n Shows the number of Domo users in each of your departments.\n  |\n|\n User Directory\n  |\n Displays a list of all Domo users, sorted alphabetically by first name.\n  |\n|\n Logins\n  |\n Login Rate - Last 14 Days\n  |\n Shows the percentage of users that logged into Domo during the given time period.\n  |\n|\n Zero Logins\n  |\n Displays the users that have been invited to Domo, but have yet to login.\n  |\n|\n Days Since Last Login\n  |\n The number of users whose last login was within the time range of the given buckets.\n  |\n|\n Most Recent Logins\n  |\n Tracks the most recent login date of all users over time. Darker shades represent higher numbers of users that last logged in on a given date.\n  |\n|\n User Last Logins\n  |\n Shows the number of days since each user has logged in.\n  |\n|\n User Activity\n  |\n Role Activities\n  |\n The number and type of actions taken by each role in the last 14 days.\n  |\n|\n Top Content Creators\n  |\n Displays the individuals responsible for creating the most content in your instance.\n\n*Note:**\n For more information on the point system for this Card, please refer to the Card description once downloaded.\n\n\n |\n|\n Top Security Admins\n  |\n Displays the individuals in your instance that have been most involved in security/admin type actions.\n\n*Note**\n**:**\n For more information on the point system for this Card, please refer to the Card description once downloaded.\n\n\n |\n|\n Top Card Managers\n  |\n Displays the individuals in your instance that have been most involved in Card Management type actions.\n\n*Note**\n**:**\n For more information on the point system for this Card, please refer to the Card description once downloaded.\n\n\n |\n|\n Role Participation\n  |\n Shows the number of Cards created and the number of Cards viewed by users of each role. Bubble size denotes the number of participating users of the specified role.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043439273\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003043\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDomoStats - People\n\n", "article_total_view_count": "\n\n\n 4,883\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:05 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "domostats__people", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "governance_tools", "url": "/s/topic/0TO5w000000ZannGAC"}]}