{"file_path": "../../raw_kb_v2\\article\\8255638008343\\index.html", "content": {"title": "\n\n\n QuickBooks Connector\n\n\n", "article_body": "\n\n\n QuickBooks is an accounting software used to help small businesses accept payments, pay bills, and complete payroll. Use the Domo QuickBooks connector to bring QuickBooks data into Domo, including bills, bill payments, deposits, invoices, journal entries, purchase orders, and more. Using Domo and QuickBooks together gives you customizable dashboards that you can create by integrating your QuickBooks data with essential marketing, sales, or operational data.\n\n\n Once your data is in Domo, you can give managers and stakeholders financial transparency with powerful and flexible charts, visualizing things like balance sheets, cash flow, vendor balances, and more. And you can access all your data in real time, from any device.\n\n\n|  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Pulling financial accounting reports.\n  |\n| **Primary Metrics**  | * Revenue\n* Costs\n* P&L line items\n* Balance sheet items\n |\n|\n**Primary Company Roles**\n | * Accountants\n* Purchasers\n* CFOs\n* Controllers\n |\n|\n**Average Implementation Time**\n |\n Report runtime will depend on how large the reports in QuickBooks are. Smaller date ranges will take less.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 3\n  |\n\nBest Practices\n----------------\n\nThe connector should run on\n\n\n**Replace**\n\n\n at any reasonable schedule.\n\n\n**Append**\n\n\n will cause duplicates.\n\n\n Prerequisites\n---------------\n\nTo connect to your [insert Connector name here] account and create a DataSet, you must have the following:\n\n Your QuickBooks Connector username.\n* Your QuickBooks Connector password.\n\nConnecting to Your\n\nQuickBooks Connector\n\nAccount\n-------------------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the [insert Connector name here] Connector page. The components of the other panes on this page,\n\n\n**Scheduling,**\n\n\n and\n\n\n**Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo\n\nQuickBooks Connector\n\nConnector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n\n\n**Connect**\n\n\n (or select\n\n\n**Add Account**\n\n\n if you have existing\n\nQuickBooks Connector\n\naccounts in Domo) to open the\n\nQuickBooks Connector\n\nOAuth screen where you can enter your\n\nQuickBooks Connector\n\nusername and password. Once you have entered valid\n\nQuickBooks Connector\n\ncredentials, you can use the same account any time you go to create a new\n\nQuickBooks Connector\n\nDataSet. You can manage connector accounts in the\n\n\n**Accounts**\n\n\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\n\n If you are already logged into\n\nQuickBooks Connector\n\nwhen you connect in Domo, you are authenticated automatically when you click\n\n\n**Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of QuickBooks Connector.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n\n\n**Reports**\n\n\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the\n\nQuickBooks Connector\n\nreport you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Accounts\n  |\n\nRetrieve a list of accounts\n\n.\n  |\n|\n Bill\n  |\n\nRetrieve a list of bills that represent a request-for-payment from a third party for goods/services rendered, received, or both.\n\n|\n|\n Bill Payment\n  |\n\nRetrieve a list of data representing payment transactions for a bill.\n\n|\n|\n Credit Memo\n  |\n\nRetrieves a list of credit memos representing a refund or credit of payment.\n\n|\n|\n Deposit\n  |\n Retrieves a list of transactions representing deposits.\n  |\n|\n Estimate\n  |\n Retrieves a list of estimates that represent a proposal for a financial transaction from a business to a customer for goods or services.\n  |\n|\n Invoice\n  |\n Retrieves a list of invoices representing a sales form the customer uses to pay for a product or service.\n  |\n|\n Journal Entry\n  |\n Retrieves a list of journal entries.\n  |\n|\n Payment\n  |\n Retrieves a list of payments.\n  |\n|\n Purchase\n  |\n\n\n Retrieves a list of purchases such as a purchase made from a vendor.\n\n\n |\n|\n Purchase Order\n  |\n\n\n Retrieves a list of purchase orders that represent a request to purchase goods.\n\n\n |\n|\n Refund Receipt\n  |\n\n\n Retrieves a list of refund receipts representing refunds to the customer.\n\n\n |\n|\n Sales Receipt\n  |\n\n\n Retrieves a list of sales receipts that represent the sales receipt given to a customer.\n\n\n |\n|\n Time Activity\n  |\n\n\n Retrieves a list of time activities representing a record of time worked by a vendor or employee.\n\n\n |\n|\n Transfer\n  |\n\n\n Retrieves a list of transfers representing a transfer of funds between two accounts.\n\n\n |\n|\n Vendor Credit\n  |\n\n\n Retrieves a list of vendor credits that represent a refund or credit of payment.\n\n\n |\n\n|\n|\n\nDate Filter By\n\n|\n\nSelect the date filter method.\n\n|\n|\n\nCreated Date Duration\n\n|\n\nSelect the created date duration for the report (a Single Date, or a Date Range).\n\n|\n|\n\nAccount Status\n\n|\n\nSelect account status.\n\n|\n|\n Transaction Date\n  |\n\nSelect the start date for the report.\n\n|\n|\n Report Date\n  |\n\nSelect report date using relative or specific dates. Relative meaning number of days from today or a specific date using the date selector\n\n|\n|\n Specific Date\n  |\n\nSelect the report date using the date picker, this option is only available when Report Date is set to 'Specific'\n\n|\n|\n Date Offset\n  |\n\nThis adjusts the current date the given number of days into the past. Example: 0 for today, 1 for yesterday.\n\n|\n|\n Aging Method\n  |\n\nSelect aging method.\n\n|\n|\n Days Per Aging Period\n  |\n\nEnter the number of days per aging period.\n\n|\n|\n Number of Periods\n  |\n\nEnter the number of aging periods to be shown in the report.\n\n|\n|\n Due Date Duration\n  |\n\nSelect the due date duration for the report (a Single Date, or a Date Range).\n\n|\n|\n Transaction Date Duration\n  |\n\nSelect the transaction date range for the report.\n\n|\n|\n Accounting Method\n  |\n Select the desired accounting method.\n  |\n|\n Summarize Column By\n  |\n Select how you want your report data to be broken down. For example, if you select\n **Month**\n , your report data is broken down by month.\n  |\n|\n Account Receivable Paid Status\n  |\n\nSelect account receivable paid status.\n\n|\n|\n Select Columns\n  |\n\nCheck this to be given an option, otherwise a default selection will be given. Schema will always be maintained, even if selections are changed. Note - this is for advanced users as QuickBooks may return errors based on column selection.\n\n|\n|\n Enable Pivot Parsing\n  |\n Select whether you want to pivot your report data by the selected\n **Summarize Column By**\n\n\n value.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the\n\n\n API does this Connector use?\n\nThis connector uses version 3 of the Quickbooks API (\n\nhttps://quickbooks.api.intuit.com/v3/company/\n\n).\n\n###\n Which endpoint(s) does each report call in this Connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Accounts\n  |\n /account\n  |\n|\n Bill\n  |\n /bill\n  |\n|\n Bill Payment\n  |\n /billpayment\n  |\n|\n Credit Memo\n  |\n /creditmemo\n  |\n|\n Deposit\n  |\n /deposit\n  |\n|\n Estimate\n  |\n /estimate\n  |\n|\n Invoice\n  |\n /i\n\nnvoice\n  |\n|\n Journal Entry\n  |\n /journalentry\n  |\n|\n Payment\n  |\n /payment\n  |\n|\n Purchase\n  |\n /purchase\n  |\n|\n Purchase Order\n  |\n /purchaseorder\n  |\n|\n Refund Receipt\n  |\n /refundreceipt\n  |\n|\n Sales Receipt\n  |\n /salesreceipt\n  |\n|\n Time Activity\n  |\n /timeactivity\n  |\n|\n Transfer\n  |\n /transfer\n  |\n|\n Vendor Credit\n  |\n /vendorcredit\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the email address or user ID, and the password of your Intuit account, or your Google account credentials.\n\n###\n How do I know my login credentials are secure?\n\nThe login process uses the OAuth process so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n Do I need a certain kind of account with the data service to set up the connector?\n\nAn Intuit account can be used to set up the connector.\n\n###\n How frequently will my data update?\n\nMost information about the summary is updated every 24 hours. It is recommended to configure the datasets to run every 24 hours.\n\n###\n Can this connector pull custom fields?\n\nNo. Reports and columns are predefined by QuickBooks.\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 8255638008343\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003833\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nQuickBooks Connector\n\n", "article_total_view_count": "\n\n\n 2,477\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "quickbooks_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}