{"file_path": "../../raw_kb_v2\\article\\360058760314\\index.html", "content": {"title": "\n\n\n Xero Connector Update\n\n\n", "article_body": "\n\nWhat is happening?\n--------------------\n\nXero is deprecating the authentication method that Domo uses in the Connector in favor of a more modern standard, OAuth 2.0.\n\n\n Who will be affected by this change?\n--------------------------------------\n\nThis change will only affect customers using the\n\nXero Payroll\n\nConnectors. Only Xero and Xero Payroll DataSets will be affected by this change.\n\n\n How will this affect customers using the Xero or Xero Payroll Connectors?\n---------------------------------------------------------------------------\n\n\n1. When Domo updates the Connector, existing Xero and Xero Payroll Connectors will stop running due to an authentication error. After the update, customers will need to create a new Xero account in the Data Center, associate that account with each of their DataSets by setting it as the Account in the DataSet, and saving the update.\n2. The update to the Connectors will now also allow customers to select a tenant to connect to. Customers who have multiple Xero tenants will need to verify that their DataSets are configured to pull from the right tenant and select the correct one if needed. Customers with only one tenant will not need to verify the tenant being used.\n\nWhy is Domo making this change?\n---------------------------------\n\nXero is deprecating its authentication method at the beginning of December. We are making this change to allow our customers to continue to connect and pull data.\n\n\n FAQs\n------\n\n\n#####\n What type of account do I need to create and how do I do that?\n\nYou will need to create a Xero OAuth account. You can use the same Account for both Xero and Xero Payroll.  Follow these steps to create a Xero OAuth Account:\n\n. Navigate to the\n **Accounts**\n section of the Data Center by clicking on the Accounts icon in the left-hand pane in the Data Center.\n2. In the Accounts screen, click on\n **Add Account**\n .\n3. In the Add Account modal, search for Xero OAuth and then click\n **Connect**\n .\n4. The Log in to Xero window will appear. Enter your username and password for Xero, and click on\n **Log In**\n .\n5. You should now see your Xero OAuth Account in your list of Accounts.\n\n\n#####\n Can I create and associate the new account ahead of time?\n\nAny Accounts created before the cutover date will not be able to connect using the OAuth 2.0 protocol. Consequently, customers will need to create a new account and associate it with the DataSets on the cutover date.\n\n####\n Can’t I just update the account I have on the day of the cutover to avoid having to update all the DataSets?\n\nUnfortunately, that is not possible. The current account you are using will continue to try to authenticate using the older authentication protocol even if you try to reconnect it after the cutover.\n\n####\n What happens if I don’t create a new account?\n\nIf you don’t create a new account and associate it with your DataSets, the DataSets will fail.\n\n####\n I have multiple Xero or Xero Payroll tenants. What happens if I don’t update the tenant in the Connector?\n\nAfter the Connector is updated, it will receive a list of tenants that the credentials you used have access to. By default, the Connector will choose the first tenant in the list it receives. If you do not verify and explicitly set the tenant to use, the Connector may not pull data from the tenant you were expecting it to.\n\n####\n How do I verify which tenant the Connector is connecting to?\n\nAfter the update, you will see a drop-down box in the Connector settings that shows which tenant you are connecting to.\n\n####\n How do I get help?\n\nIf you need any assistance, please contact Domo Support. For information on contacting Support, see\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360058760314\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003258\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nXero Connector Update\n\n", "article_total_view_count": "\n\n\n 4,663\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "xero_connector_update", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}