{"file_path": "../../raw_kb_v2\\article\\360042935114\\index.html", "content": {"title": "\n\n\n Powering Up Business-in-a-Box Dashboards\n\n\n", "article_body": "\n\nCards in pre-installed Business-in-a-Box dashboards are initially powered with sample data, allowing you to get a sense of how the cards would look when connected to your own live data.  Cards with sample data appear with a \"Sample Data\" watermark\n\nto indicate they are not yet live. The following screenshot shows an example of a card with sample data:\n\nThe process for powering up Business-in-a-Box dashboards with live data is similar to that of deploying apps from the Appstore. You select a DataSet containing all of the columns (fields) required to power up the cards in this dashboard. Then you drag columns from your DataSet onto the matching columns in the dashboard. (If the columns have the same name, they are matched automatically.) You must do this for all individual DataSets required to power up the dashboard. This process is described in greater detail below. For information about deploying Appstore apps, see\n\nDeploying Apps from the Appstore\n\n.\n\n\n**Notes:**\n\n If you do not have an \"Admin\" or \"Privileged\" security role in Domo (or a custom role with \"Use Appstore\" enabled), you cannot power up cards in a Business-in-a-Box dashboard; however, you can send a request that cards in the dashboard be powered up. For more information about default security roles in Domo, see\n\nManaging Roles\n\n.\n* Any user granted access to a Business-in-a-Box dashboard will also be granted access to the DataSet used to power it..\n\n*To power a Business-in-a-Box dashboard,**\n\n. Navigate to the Business-in-a-Box dashboard with cards you want to power up.\n\n\n For more information about navigating to a dashboard, see\n\nAccessing Business-in-a-Box Dashboards\n\n.\n2. Click\n **Connect Data**\n at the top of the window.\n\nA bar appears displaying the number of DataSets required to power up the cards in the dashboard, an\n **Assign**\n button, and tiles for connecting to each required DataSet.\n3. Do one of the following:\n\n* To assign another user to power up these cards...\n\n\t1. Click\n\t\t **Assign**\n\t\t .\n\n\n\t\t The\n\t\t **Assign**\n\t\t dialog appears.\n\t\t2. In the\n\t\t **Select data specialist**\n\t\t field, select the user you want to assign to power these cards.\n\t\t3. (Optional) Change the email message to be sent to the assignees if you want.\n\t\t4. Click\n\t\t **Send**\n\t\t .\n\n\n\t\t The person or group members are assigned the task to power the cards.\n\t* To power up the cards yourself...\n\n\t1. Click the\n\t\t **Connect**\n\t\t button for any one of the required DataSets in the blue bar.\n\n\n\t\t Two panes appear on your screen, one (marked as \"1\") asking you to select your DataSet and the other (marked as \"2\") showing the fields you'll need to match columns from your DataSet to.\n\t\t2. In pane 1, select the DataSet you want to use to power the dashboard.\n\n\n\t\t You can use the\n\t\t **Filter**\n\t\t option to filter by data type (text, number, or date) or search for a particular DataSet by name using the search tool. You can also show a preview of the DataSet by clicking\n\t\t **Data Preview**\n\t\t at the bottom of the screen.\n\n\n\t\t Optionally, you can click\n\t\t **Download Example**\n\t\t to download a CSV file that includes the columns to match along with sample data for each column. You can use this file as a template for filling in the data in the columns,\n\n\t upload it to Domo\n\n\t , then select it here as your DataSet.\n\n\n\t\t Once you select a DataSet, if there are any columns with names that match any column names in pane 2, those columns are matched automatically. Matched columns are indicated using green checkmarks. You do not need to match these columns manually.\n\t\t3. (Conditional) If there are any columns from your DataSet whose matching columns in pane 2 have different names, you will need to match these manually, by dragging and dropping columns from pane 1 to their matching columns in pane 2.\n\t\t4. Once all your columns are matched, click\n\t\t **Connect**\n\t\t .\n\t\t5. Click\n\t\t **Okay**\n\t\t .\n\n\n\t\t All cards in the Business-in-a-Box dashboard that are connected to this DataSet should now be powered with your own live data.\n\t\t6. Repeat the above instructions for all DataSets shown in the blue bar to power all cards in the dashboard.\n\nIf at any time you want to change the matched columns for a given DataSet, you can do so by clicking\n **Change**\n for that DataSet then making the desired changes.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042935114\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004308\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nPowering Up Business-in-a-Box Dashboards\n\n", "article_total_view_count": "\n\n\n 4,757\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:36 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "powering_up_businessinabox_dashboards", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "business_in_a_box", "url": "/s/topic/0TO5w000000ZanBGAS"}]}