{"file_path": "../../raw_kb_v2\\article\\360043432293\\index.html", "content": {"title": "\n\n\n RetailNext Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nRetailNext is a leading provider of in-store analytics. The RetailNext connector allows you to bring in all kinds of data, from foot traffic to total transaction count, about your store. It also provides data from locations, times and days to fuel complicated analysis. To learn more about the RetailNext API, visit their page (\n\nhttps://retailnext.atlassian.net/wik.../174817482/API\n\n).\n\n\n You connect to your RetailNext account in the Data Center. This topic discusses the fields and menus that are specific to the RetailNext connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your RetailNext account and create a DataSet, you must have the following:\n\n Your RetailNext access key\n* Your RetailNext secret key\n\nTo obtain these credentials, reach out to your RetailNext account representative.\n\n\n Connecting to Your RetailNext Account\n---------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the RetailNext Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your RetailNext account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter your RetailNext access key.\n  |\n|\n Secret Key\n  |\n Enter your RetailNext secret key.\n  |\n\n\n Once you have entered valid RetailNext credentials, you can use the same account any time you go to create a new RetailNext DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the RetailNext report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n All Transactions\n  |\n Returns the total number of sales and return transactions for a specified period.\n  |\n|\n Average Age\n  |\n Returns the average age of shoppers who enter the store.\n  |\n|\n Average Dwell Time\n  |\n Returns the average amount of time shoppers stand in a specified dwell zone.\n  |\n|\n Average Transaction Value (ATV)\n  |\n Returns the average net sales amount per transaction.\n  |\n|\n Average Unit Retail (AUR)\n  |\n Returns the average net sales amount per item sold.\n  |\n|\n Average Units per Transaction (UPT)\n  |\n Returns the average number of items purchased per transaction.\n  |\n|\n Conversation Rate\n  |\n Returns the percentage of shoppers visiting the store who make a purchase.\n  |\n|\n Dwell Conversion Rate\n  |\n Percentage of shoppers dwelling in a location who purchase an item from that location.\n  |\n|\n Dwells\n  |\n Returns the number of shoppers who stand in a specified dwell zone for longer than a defined minimum amount of time.\n  |\n|\n Engagement Rate\n  |\n Returns the percentage of shoppers walking by a location who stop at that location.\n  |\n|\n Exposure Rate\n  |\n Returns the percentage of shoppers who walk by a specific location as compared to the total store traffic.\n  |\n|\n Female Average Age\n  |\n Returns the average age of female shoppers who enter the store.\n  |\n|\n Female Percentage\n  |\n Returns the percentage of shoppers who are female.\n  |\n|\n Guest Wi-Fi Uptake\n  |\n Returns the ratio of wi-fi users to detected devices in the store.\n  |\n|\n Labor Hours\n  |\n Returns the total number of hours worked by staff members.\n  |\n|\n Male Average Age\n  |\n Returns the average age of male shoppers who enter the store.\n  |\n|\n Male Percentage\n  |\n Returns the percentage of shoppers who are male.\n  |\n|\n MDD Capture Rate\n  |\n Returns the percentage of people passing by the store who enter the store.\n  |\n|\n Mobile Device Detection Rate\n  |\n Returns the percentage of shoppers who enter the store with a detected mobile device.\n  |\n|\n Net Items\n  |\n Returns the number of items sold after subtracting returns for a specified period.\n  |\n|\n Net Transactions Value\n  |\n Returns the net transactions value.\n  |\n|\n New Guest Wi-Fi Users\n  |\n Returns the number of wi-fi users enrolling for the first time during a specified period.\n  |\n|\n New Shopper Percentage\n  |\n Returns the percentage of shoppers visiting the store for the first time.\n  |\n|\n New Shoppers\n  |\n Returns the number of new shoppers in the store.\n  |\n|\n Number of Visits (non-unique)\n  |\n Returns the total number of visits to your store.\n  |\n|\n Passby Traffic\n  |\n Returns the number of people who walk by the store, including those who enter.\n  |\n|\n Repeat Guest Wi-Fi Users\n  |\n Returns the number of unique wi-fi users who did not enroll for the first time during a specified period.\n  |\n|\n Repeat Shopper Percentage\n  |\n Returns the percentage of shoppers who have visited the store before today.\n  |\n|\n Repeat Shoppers\n  |\n Returns the number of repeat shoppers.\n  |\n|\n Return Amount\n  |\n Returns your net return amount.\n  |\n|\n Return Items Count\n  |\n Returns the total number of returned items.\n  |\n|\n Return Transactions\n  |\n Returns the total number of return transactions for a specified period.\n  |\n|\n Return Transactions Value\n  |\n Returns the total value of your return transactions.\n  |\n|\n Sales\n  |\n Returns the sales amount for the store, rounded.\n  |\n|\n Sales Amount\n  |\n Returns the total sales amount for the store.\n  |\n|\n Sales Items Count\n  |\n Returns the total number of sales items.\n  |\n|\n Sales Per Square Unit\n  |\n Returns the net sales per square unit of space.\n  |\n|\n Sales Transactions\n  |\n Returns the total number of sales transactions for a specified period.\n  |\n|\n Sales Transactions Values\n  |\n Returns the total value of sales transactions.\n  |\n|\n Shoppers Per Labor Hour\n  |\n Returns the ratio of shoppers who entered the store to labor hours.\n  |\n|\n Shopper Yield\n  |\n Returns the average net sale amount for each shopper visiting the store within a specified period.\n  |\n|\n Staff Per Hour\n  |\n Returns the number of staff members present in the stour per hour.\n  |\n|\n Staff Productivity\n  |\n Returns the net sales per staff hour.\n  |\n|\n Staff Traffic In\n  |\n Returns the number of staff members who walk into the store.\n  |\n|\n Staff Traffic Out\n  |\n Returns the number of staff members who walk out of the store.\n  |\n|\n Total Guest Wi-Fi Users\n  |\n Returns the number of unique wi-fi users for a specified period.\n  |\n|\n Transactions per Square Unit\n  |\n Returns the total number of sales transactions per square unit of space.\n  |\n|\n Unique Passby Traffic\n  |\n Returns the number of individual shoppers who walk by the store (each person is counted only once for the date range selected).\n  |\n|\n Unique Traffic\n  |\n Returns the number of individual shoppers who enter the store (each person is counted only once for the date range selected).\n  |\n|\n Unique Wireless Events Detected Inside\n  |\n Returns the unique wireless events detected in the store.\n  |\n|\n Unique Wireless Passby Events\n  |\n Returns the number of unique wireless passby events.\n  |\n|\n Visit Frequency\n  |\n Returns the average number of times a shopper enters the store within a specified time period.\n  |\n|\n Wireless New Visitors\n  |\n Returns the number of new wireless devices.\n  |\n|\n Wireless New Visitors Rate\n  |\n Returns the percentage of new wireless devices.\n  |\n|\n Wireless Passby Capture Rate\n  |\n Returns the percentage of unique wireless passby events.\n  |\n|\n Wireless Passby Events\n  |\n Returns the number of wireless passby events.\n  |\n|\n Wireless Repeat Visitors\n  |\n Returns the number of repeat wireless devices.\n  |\n|\n Wireless Repeat Visitors Rate\n  |\n Returns the percentage of repeat wireless devices.\n  |\n|\n Wireless Visit Frequency\n  |\n Returns the wireless visit frequency.\n  |\n\n|\n|\n Locations\n  |\n Select at least one location to return information for.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date.\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date.\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Choose Time\n  |\n Select whether you want your report to show data for hours in which your store is open or specific hours you choose.\n  |\n|\n Choose Start Time\n  |\n Select the desired start time for the data in your report.\n  |\n|\n Choose End Time\n  |\n Select the desired end time for the data in your report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How frequently will my data update?\n\nAs often as needed.\n\n####\n Are there any API limits I should be aware of?\n\nNo.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043432293\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003669\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nRetailNext Connector\n\n", "article_total_view_count": "\n\n\n 4,667\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "retailnext_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}