{"file_path": "../../raw_kb_v2\\article\\360058889834\\index.html", "content": {"Title": "GBTW: 9 Success Factors in Returning to a Physical Facility", "Article Body": "Intro\n                       \n\n                        When planning a return to the workplace, or a change to the way you use your workplace after a period of working from home, there are many things to consider. Particularly when public health guidelines dictate changes to your prior process, it can help to organize your leaders and make a plan before you schedule teams to return on-site.\n                       \n\n                        Based on Domo's experience and that of several customers who have reopened their offices after shutting down during the 2020 pandemic, this checklist provides factors you will want to consider with your C-Suite, HR leaders, Facilities teams, IT, and others as you make your plan to return to work.\n                       \n\n                        Your plan, together with the technology provided by the Domo\n                        \n                         Get Back to Work solution\n                        \n                        (GBTW), will help you effectively use your physical space and reach desired levels of productivity, safety, and confidence from your most valuable resource - your team.\n                       \n\n                        Timing\n                       \n\n                        Planning the return date of workers to your facility can be complex but must be done carefully with input from all impacted parties. Naturally, there's an urgency to return to the way things were previously in hopes that the business impact of the shutdown will be mitigated. However, it may be worth choosing a date carefully to drive optimal benefit. Input should be considered from these parties:\n                       \n\n\n\n\n                           C-Suite\n                          \n                          to evaluate the costs and benefits to the business for the time spent with the facilities closed.\n                         \n\n\n\n\n                           HR leaders\n                          \n                          to evaluate the teams' sentiment. How anxious is the team to return vs. stay home from the office? Are there segments of the employee base who will work better in the office or at home?\n                         \n\n\n\n\n                           Local government\n                          \n                          health recommendations and dates of expected changes to levels of alert.\n                         \n\n\n\n\n                           Facilities and IT\n                          \n                          teams required runway to prepare the facilities for modified work configurations.\n                         \n\n\n\n\n                           Technology and analytics\n                          \n                          teams time required to prepare the Domo Get Back to Work solution or other means to track the activities of the returning workers.\n                         \n\n\n\n                        Return Rate\n                       \n\n                        Planning a single day for everyone to return to work in the office may not be realistic. Consider the following:\n                       \n\n\n\n                          Facilities in different regions may have varied health or legal situations.\n                         \n\n\n\n                          Varied required work activities.\n                         \n\n\n\n                          Differences in the makeup of the employee force that would impact the plan.\n                         \n\n\n\n                        Space Planning\n                       \n\n                        Determine how you may need to reconfigure your physical space to comply with your local public health guidelines, company policy, and the desired cultural environment for your team. Example items to consider are:\n                       \n\n\n\n                          6 ft distancing\n                         \n\n\n\n                          Partitions between desks\n                         \n\n\n\n                          Traffic flow around desks\n                         \n\n\n\n                          Mask policy at desks vs in common spaces\n                         \n\n\n\n                        Cohort Models\n                       \n\n                        You will need to determine how to manage your team in the case of a future health incident. For example, if part of the team becomes sick, you will need a plan for what people that work near them should do. Dividing your workforce into easily defined cohorts and creating protocols to assure the members do not have any cross-cohort interaction may help you take actions for whole groups at once while remaining confident your other cohorts are not impacted. Consider the following:\n                       \n\n                        Levels of Granularity\n                       \n\n                        Smaller groups will allow for more focused attention to issues but will reduce the ability of teams for wide interaction across teams. Large cohorts will allow for more varied opportunities for face-to-face interaction but will present a risk for larger portions of the employee force to be exposed to infection. Options include:\n                       \n\n\n\n                          BLE beacon tracing\n                         \n\n\n\n                          Wi-Fi mobile device tracking\n                         \n\n\n\n                          Door entry data\n                         \n\n\n\n                          Mobile check-in data\n                         \n\n\n\n                        Physical Considerations\n                       \n\n                        Space utilization may need to change to foster cohort management. For example, a building with two floors may naturally split into two cohorts, but if they both share one break room, a second break room may need to be designed to assure cohorts don't mix. Consider also that each cohort will need separate entrances and exits, dedicated elevators, stairs, and other amenities. Options for physical space-based cohort design may include division by:\n                       \n\n\n\n                          Building\n                         \n\n\n\n                          Floor\n                         \n\n\n\n                          Parts of floors\n                         \n\n\n\n                        Seating Models\n                       \n\n                        Seating models may need to be modified to assure appropriate distance between employees who will be working at desks. Some facilities' space use may be at a low enough capacity that workers can all be accommodated with adequate space and little modification to the historical seating arrangements while others that are already densely occupied may require some decisions about who can use the space and when. In the event that the pre-shutdown seating chart is unworkable, a hoteling plan, creative work shifts, or new assigned seating may be required. Also, consider plans that require different workers to take turns occupying the same work areas or desks will also require adequate sanitation procedures between occupants. Options include:\n                       \n\n\n\n                          Hoteling reservation system (e.g. Office Space app)\n                         \n\n\n\n                          Open Hoteling via first come first serve\n                         \n\n\n\n                          Assigned seating that is dispersed\n                         \n\n\n\n                          Open/Stay/Move model that has some open desks in every area that employees can claim as they come in\n                         \n\n\n\n                        Common Areas\n                       \n\n                        Common areas may require a significant portion of the space planning effort. Consideration must be made for break and lunchrooms, waiting rooms, meeting spaces, and any shared workspaces. Options include:\n                       \n\n\n\n                          Restrictions on capacities or activities that can take place in the space, such as no buffet-style food service or no more than two people in this conference room.\n                         \n\n\n\n                          Modifications or reconfiguration of the actual spaces such as reducing chairs available in meeting rooms, removing couches in common areas, or increasing spacing between tables in lunchrooms.\n                         \n\n\n\n                          Possible closure of some common areas such as game rooms or on-site fitness facilities.\n                         \n\n\n\n                        Staging\n                       \n\n                        In addition to the configuration of the space per the above plan, there are staging efforts for that space you'll want to consider in order to make the experience work for your team. Primarily, these include signage to provide instructions for the changing facility, additional cleaning supplies, and the possible removal of items that may threaten the spread of infection.\n                       \n\n                        Signage\n                       \n\n                        Signs may be added to the facility to provide instruction on changed procedures, remind teams of company policies, and inform about the cleaning schedule for the area. These should be highly visible, enforce positive behavior, and ideally support company brand and foster inclusivity.\n                       \n\n                        Instructional or Procedural Signs\n                       \n\n                        Entrances\n                       \n\n\n\n                          Indicators of which doors are entrance only and which are temporarily closed\n                         \n\n\n\n                          Entry instructions\n                         \n\n\n\n                          General COVID-19 procedures or policies\n                         \n\n\n\n                          Cones, ground tapes, and/or stickers to allow queuing of 6 ft distancing at entrances\n                         \n\n\n\n                        Common areas and conference rooms\n                       \n\n\n\n                          Large printed signs, printed signs, and TV screen savers that remind of mask policy, social distancing, etc.\n                         \n\n\n\n                          Social distance stickers to remind of what 6 ft looks like placed throughout the building and in strategic locations.\n                         \n\n\n\n                          Sanitation station signs listing what's available and instructions for use.\n                         \n\n\n\n                        Policy Signs\n                       \n\n                        On-site employee communication with specific instructions to help provide a level of comfort. When employees know what is taking place, they can understand the intent is to make things safe for them.\n                       \n\n                        Cleaning Schedules\n                       \n\n                        Schedules posted and updated so employees know when a space was last cleaned by a cleaning crew.\n                       \n\n                        Cleaning and Sanitation Stations\n                       \n\n                        Cleaning and sanitation stations may need to be made widely available for employees to frequently sanitize their hands, and to access supplies to assist them in sanitizing their workspaces or areas they contact as they move about the facility. Common locations would include:\n                       \n\n\n\n                          Common areas near desks and workspaces\n                         \n\n\n\n                          Restrooms\n                         \n\n\n\n                          Break rooms\n                         \n\n\n\n                          Conference rooms\n                         \n\n\n\n                          Entry areas\n                         \n\n\n\n                          Printer or work prep areas\n                         \n\n\n\n                        What to include in a Sanitation Station\n                       \n\n                        Sanitation stations may include:\n                       \n\n\n\n                          Desk cleaners\n                         \n\n\n\n                          Hand sanitizers\n                         \n\n\n\n                          Masks\n                         \n\n\n\n                        Office Item Removal\n                       \n\n                        Item removal may be necessary due to being difficult to sanitize because of its design or its frequency of use or to enable correct distancing practices. Some of these items may be replaced with single-use items. Removed or reduced items may include:\n                       \n\n\n\n                          Communal snacks in bowls or large containers\n                         \n\n\n\n                          Vending machines\n                         \n\n\n\n                          Desk phones\n                         \n\n\n\n                          Whiteboard markers and erasers belonging to a meeting room\n                         \n\n\n\n                          Conference room phones\n                         \n\n\n\n                          Extra chairs in confined spaces\n                         \n\n\n\n                          Extra tables and chairs in the break and eating rooms\n                         \n\n\n\n                          Common area used touchpads, keyboards, cables, and monitors\n                         \n\n\n\n                          Extra printers\n                         \n\n\n\n                        Staffing\n                       \n\n                        Selected teams will need reorganization or training on new processes to support the modified facility management procedures. These may include members of the Information Technology (IT) and Facilities teams.\n                       \n\n                        IT Responsibilities\n                       \n\n                        Reopening Preparation\n                       \n\n\n\n                          Activating or removing shared assets such as printers and touch screen kiosks.\n                         \n\n\n\n                          Development of policies for employees' management of their computer hardware such as bringing their laptop, keyboard, mouse, and power adapter each day from home to reduce the amount of cleaning needed.\n                         \n\n\n\n                          Preparation of hoteling desks provisioned with items such as a monitor, display adapter, and power strip so they support the employee's laptop computer.\n                         \n\n\n\n                          Removal of phones from desks and conference rooms. Employees use cell phones or computers for calls.\n                         \n\n\n\n                        Onsite Support During Office Hours\n                       \n\n\n\n                          Planned IT support coverage based on cohort models. For example, one IT support employee being assigned to work on each floor to avoid cross-floor contact.\n                         \n\n\n\n                          Use of existing Help Desk processes paired with additional signs placed on desks to give employees reference of how to receive IT help.\n                         \n\n\n\n                        Facilities Responsibilities\n                       \n\n                        Reopening Preparation\n                       \n\n\n\n                          Training the entrance team to welcome employees back into the building with correct protocols or turn non-qualifiers away with appropriate messaging.\n                         \n\n\n\n                          Create reference materials for use by entrance facilitators.\n                         \n\n\n\n                          Securing touchless temperature scanners or temperature kiosks with facial recognition.\n                         \n\n\n\n                          Execution of the\n                          \n                           space plan\n                          \n                          .\n                         \n\n\n\n                          Execution of the\n                          \n                           staging requirements\n                          \n                          .\n                         \n\n\n\n                        Onsite Support During Office Hours\n                       \n\n\n\n                          Similar to IT support, plan support coverage and mechanisms to receive help.\n                         \n\n\n\n                          Determining cohort needs of support staff and if they are allowed to cross cohorts.\n                         \n\n\n\n                        Cleaning\n                       \n\n                        Previously used cleaning protocols will likely need to be enhanced. Therefore, working with the facilities management team is necessary to develop new protocols for the frequency and type of cleaning as well as creating instructions for cleaners and employees about their responsibilities. Proper cleaning provides not only increased protection from disease but showing the process and communicating about it to employees delivers a positive message that instills confidence in the program. The plan must meet the needs of:\n                       \n\n\n\n                          Community health officials' instruction\n                         \n\n\n\n                          Company policy\n                         \n\n\n\n                          Workers' sense of safety\n                         \n\n\n\n                        Onsite operation of the cleaning plans must be performed and reported according to a set protocol for the cleaning crew. Additionally, employees must also be aware of their responsibilities and have access to supplies needed to clean items and areas they're accountable for as part of their work routine or on an as-used basis. Consider the following:\n                       \n\n\n\n                          Cleaning crew cleans on weekends with a deep cleaner.\n                         \n\n\n\n                          Employees clean their desk upon arrival and as they leave with provided supplies.\n                         \n\n\n\n                        The cleaning plan needs to include any additional activities that need to be considered if employees or groups of employees are found to be sick or test positive for an illness to ensure facilities are safe. Prior to opening the building, and as needed post-opening, the building plan might include being completely disinfected using an electrostatic disinfection device or equivalent equipment.\n                       \n\n                        Facility Reopening Test\n                       \n\n                        Prior to inviting the first cohort back to the workplace, a practice drill or two should be conducted with a test group with a follow-up feedback session. Care should be taken to simulate as real a situation as possible to bring to the surface all issues that may arise. This will give the leaders and the program managers from HR, Facilities, and other teams time to revise or improve the plan before workers are present. Components of the test might include:\n                       \n\n\n\n                          Physical entry process flow\n                         \n\n\n\n                          Individual workspace and hoteling\n                         \n\n\n\n                          Cleaning stations and supplies\n                         \n\n\n\n                          Revised or restricted common areas, break rooms, and meeting rooms\n                         \n\n\n\n                          Systems and Get Back to Work solution functionality\n                         \n\n\n\n                        Legal Considerations\n                       \n\n                        Employers need to work with their legal teams to surface any relevant liabilities in bringing teams back to the workplace. For some, there may be no required nation, but for other organizations, or in certain global regions, it may be expedient to set in place specific new terms for employer liability. If there are any changes to legal obligations around the new working situation, communication to the employees, and any required acceptance must be planned before returning to the office. Consider the following:\n                       \n\n\n\n                          Is there a letter or notice that must be shared directly with each employee or can it be part of a daily check-in or posted in a visible place at the facility?\n                         \n\n\n\n                          Do we require signed documentation of the employee's agreement to the terms of the new work environment?\n                         \n\n\n\n                          Is there any required training that employees must complete ahead of time in order to be allowed back to the facility?\n                         \n\n\n\n                        Privacy Considerations\n                       \n\n                        As part of the process to check workers into the office, information is requested to determine whether they're safe to enter the workplace. Policies must be defined and adhered to with regard to health-related personally identifiable information (PII.) Having these in place before opening is important as they will impact:\n                       \n\n\n\n                          The types of questions that are asked and in what situations?\n                         \n\n\n\n                          The level of detail that will be stored. For example, do we record the exact temperature of an employee, just whether they passed the temperature test, or just whether they passed entry requirements without defining what variables they passed or failed?\n                         \n\n\n\n                          The type of information that is shared and with whom in the organization it's shared with when action must be taken for contact tracing or cohort management. (e.g. if someone gets sick, what do we tell the team that needs to get tested?)\n                         \n\n\n\n                        Communications\n                       \n\n                        Paramount to the success of your program is your people and how they embrace it. Effective communication to the teams should inspire confidence, resolve concerns, and enable them to make decisions to take action as needed.\n                       \n\n                        Pre-return Announcement\n                       \n\n                        The announcement before returning to the office should include:\n                       \n\n\n\n                          Guidelines for who is allowed to return.\n                         \n\n\n\n                          Which phase the company is in, what is the policy, and who that involves.\n                         \n\n\n\n                        Program Operational Materials\n                       \n\n                        Program operational training materials should be issued to the following GBTW staff:\n                       \n\n\n\n                          Entry team\n                         \n\n\n\n                          Cleaning team\n                         \n\n\n\n                          IT support team\n                         \n\n\n\n                          Facilities Management\n                         \n\n\n\n                          Data management and Analytics team that manage the GBTW systems and data\n                         \n\n\n\n                        Workers' Training Material\n                       \n\n                        Training materials for employees should cover the following topics:\n                       \n\n\n\n                          Procedures for using GBTW tools such as the Domo Safe Worker app so they can receive credentials to enter the building.\n                         \n\n\n\n                          Process to enter the building.\n                         \n\n\n\n                          Process for interacting with others, using equipment, and sanitation.\n                         \n\n\n\n                          Process for managing incidents such as testing positive or co-workers who test positive.", "Preview Article": "Click here to preview", "URL Name": "360058889834", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004130", "Archived Date": "", "Language": "English", "Primary Version": "GBTW: 9 Success Factors in Returning to a Physical Facility", "Article Total View Count": "4,678", "": "", "Article Created Date": "10/24/2022, 9:24 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              GBTW: 9 Success Factors in Returning to a Physical Facility\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}