{"file_path": "../../raw_kb_v2\\article\\360042930194\\index.html", "content": {"Title": "DocuSign Connector", "Article Body": "Intro\n                       \n\n\n                         DocuSign provides services for facilitating electronic exchanges of contracts and signed documents. Domo's DocuSign connector allows you to speed up transactions and cut costs by retrieving data about DocuSign entities such as users, folders, templates, and so on. To learn more about the DocuSign API, visit their website. (\n                         \n                          https://www.docusign.com/developer-center/documentation\n                         \n                         )\n                        \n\n\n                        The DocuSign connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n\n                         You connect to your DocuSign account in the Data Center. This topic discusses the fields and menus that are specific to the DocuSign connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector lets you retrieve data for DocuSign users and documents managed using DocuSign.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Signed/unsigned documents\n                             \n\n\n\n                              Template documents\n                             \n\n\n\n                              Rejected document signings\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              Legal\n                             \n\n\n\n                              HR\n                             \n\n\n\n                              Sales\n                             \n\n\n\n                              Realtors\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            Less than an hour\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n\n\n                          Make sure the credentials and the report configuration are valid.\n                         \n\n\n\n                          Use \"Replace.\" If you use \"Append,\" you may need to deduplicate using a DataFlow.\n                         \n\n\n\n                          The connector pages data back for date-driven reports. Entering the number of days back will pull that many days back but will also increase the connector runtime. Only pull the data you need. If you have data older than the days back you have entered, the connector will keep going without getting any more data before it finishes.\n                         \n\n\n\n\n                         Prerequisites\n                        \n\n\n\n                         To connect to your DocuSign account and create a DataSet, you must have the email address and password you use to sign in to your DocuSign account.\n                        \n\n\n\n                         Connecting to Your DocuSign Account\n                        \n\n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the DocuSign Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your DocuSign account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n\n                              Field\n                             \n\n\n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n\n\n\n                             Email Address\n                            \n\n\n\n\n\n                             Enter the email address you use to log into your DocuSign account.\n                            \n\n\n\n\n\n\n\n                             Password\n                            \n\n\n\n\n\n                             Enter the password you use to log into your DocuSign account.\n                            \n\n\n\n\n\n\n\n                         Once you have entered valid DocuSign credentials, you can use the same account any time you go to create a new DocuSign DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n                         Details Pane\n                        \n\n\n\n                         This pane contains two primary menus in which you can select a DocuSign report and pertinent accounts.\n                        \n\n\n\n\n\n\n\n\n                              Menu\n                             \n\n\n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n\n                             Select a DocuSign report. The following reports are available:\n                            \n\n\n\n\n\n\n\n                                 Account Information\n                                \n\n\n\n\n\n                                 Returns information about the selected account.\n                                \n\n\n\n\n\n\n\n                                 Account Information Billing Plan\n                                \n\n\n\n\n\n                                 Returns billing plan information about the selected account.\n                                \n\n\n\n\n\n\n\n                                 Brands Profile Information\n                                \n\n\n\n\n\n                                 Returns a list of brand profiles associated with the selected account.\n                                \n\n\n\n\n\n\n\n                                 Envelopes\n                                \n\n\n\n\n\n                                 Returns envelope status changes for all envelopes in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Envelopes Audit Events\n                                \n\n\n\n\n\n                                 Returns audit events for all envelopes in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Envelopes Custom Fields\n                                \n\n\n\n\n\n                                 Returns custom field information for all envelopes in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Envelopes Documents\n                                \n\n\n\n\n\n                                 Returns a list of documents associated with all envelopes in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Envelopes Notifications\n                                \n\n\n\n\n\n                                 Returns reminder and expiration information for all envelopes in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Envelopes Status\n                                \n\n\n\n\n\n                                 Returns the overall status for all envelopes in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Folders\n                                \n\n\n\n\n\n                                 Returns a list of folders for the selected account.\n                                \n\n\n\n\n\n\n\n                                 Groups\n                                \n\n\n\n\n\n                                 Returns a list of user groups in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Permission Profiles\n                                \n\n\n\n\n\n                                 Returns a list of permission profiles for the selected account.\n                                \n\n\n\n\n\n\n\n                                 Templates\n                                \n\n\n\n\n\n                                 Returns the list of templates for the selected account.\n                                \n\n\n\n\n\n\n\n                                 Unsupported File Types\n                                \n\n\n\n\n\n                                 Returns a list of file types that are not supported for uploads in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Users\n                                \n\n\n\n\n\n                                 Return a list of users in the selected account.\n                                \n\n\n\n\n\n\n\n                                 Users Information\n                                \n\n\n\n\n\n                                 Returns information for all users in the selected account, including name, ID, user type, email, etc.\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Account\n                            \n\n\n\n\n\n                             Select the DocuSign account you want to pull information for.\n                            \n\n\n\n\n\n\n\n                             Start Days\n                            \n\n\n\n\n\n                             Enter the number of past days for which you want to pull data.\n                            \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        Do I need a certain kind of account to set up this connector?\n                       \n\n                        Any DocuSign account can be used to set up the connector.\n                       \n\n                        How frequently will my data update?\n                       \n\n                        As often as needed.\n                       \n\n                        Can I use the same DocuSign account for multiple DataSets?\n                       \n\n                        Yes.", "Preview Article": "Click here to preview", "URL Name": "360042930194", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003443", "Archived Date": "", "Language": "English", "Primary Version": "DocuSign Connector", "Article Total View Count": "4,674", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              DocuSign Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}