{"file_path": "../../raw_kb_v2\\article\\360043438893\\index.html", "content": {"title": "\n\n\n Inviting Others to Join Domo\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can invite users to join Domo. There are two primary methods for doing this, which are as follows:\n\n Standard invite. The Domo interface includes a number of\n **Invite**\n buttons in various locations, including the user Profile page, the card Details view, the Analyzer view, etc. If you have an \"Admin\" or \"Privileged\" default security role and you invite a user or users in this way, the new users are brought into Domo as the default role you have set for your instance (if you have not changed the default role, it is automatically set to \"Privileged\".) You can also invite users to Domo if you have a custom role with \"Add New People\" enabled. If you have this role AND \"Manage All Roles\" enabled, you can invite users to Domo and assign them to any custom role.\n* Social user invite. When you invite a user to Domo using the\n **Invite**\n option found in Buzz, he/or she is given a security role of \"Social.\" Social users have access only to Buzz, Profiles, and Projects and Tasks, and can invite other Social users to join Domo.\n\n*Note:**\n These emails can be blocked by email spam filters. If your users are not receiving welcome emails, please check with your IT department to ensure our emails are whitelisted in the spam filter.\n\n\n For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n\n\n Depending on settings, Domo restricts sending invitations to people whose email address contains an authorized domain. For more information, see\n\nSpecifying Authorized Domains for Invited Users\n\n.\n\n\n For information about how an invited user connects to Domo and finishes setting up an account, see\n\nJoining Domo\n\n.\n\n\n For more information about the Profile page, see\n\nProfile Page Layout\n\n.\n\n\n For information about adding new users to Domo, see\n\nAdding Users to Domo\n\n.\n\n\n Inviting Social users\n-----------------------\n\nIf you want to invite Social users to Domo (that is, users with access only to Buzz, Profiles, and Projects and Tasks), you can use the\n **Invite**\n button found in Buzz. Users of any security role (including other \"Social\" users) can invite other users in this way. You can also invite social users in the Admin Settings as described above; however, this method is much quicker.\n\n\n**Note:**\n If you do not want users in your company's Domo to be able to invite Social users into Domo, you can disable this by going into\n **More > Admin > Feature settings > Buzz**\n and checking the box that reads \"Allow all users to invite Social users.\" You must have an \"Admin\" security profile to be able to access this tab. For more information, see our articles about\n\nBuzz\n\n.\n\n\n The\n **Invite**\n button for Social users is found at the bottom of the Buzz menu.\n\nWhen you click this button, a dialog appears with two options.\n\nThese options provide two different ways of inviting team members to Domo. If you click the\n **Get Link**\n button, Domo generates a shareable URL you can send to team members via email, text, etc. If you prefer to invite team members one by one, you can do so by entering their email addresses in the\n **Enter email addresses**\n field at the bottom of the dialog.\n\n\n**To invite a Social user to Domo,**\n\n. Click the button in Buzz described above.\n\n\n The\n **Invite Your Team to Buzz**\n dialog appears.\n2. Do one of the following:\n\n* Click\n\t **Get Link**\n\t , copy the automatically generated link, and send it to your team via email, text, etc.\n\t* Enter team members' email addresses one by one in the\n\t **Enter email addresses**\n\t field. When finished, click\n\t **Invite**\n\t .\n\n\n\t**Note:**\n\n If any authorized domains have been specified in\n\t **More >**\n\t**Admin**\n\t**> Network security > Authorized domains (for invites)**\n\t , all email addresses you enter\n\t *must*\n\t belong to one of those domains. When you begin to type an email address, it autocompletes with all possible authorized domains. If the domain for your entered email address does not appear in the autocomplete list, you cannot invite users from this domain. For more information, see\n\n Specifying Authorized Domains for Invited Users\n\n .\n\nIf you have an \"Admin\" security role or a custom role with \"Edit Users,\" \"Manage All Access Tokens,\" or \"Manage All Company Settings\" enabled, you can manage all of your automatically-generated invite links (\"Easy Links\") in the Admin Settings, under\n **More > Admin > More > Manage easy links**\n .\n\nHere you can see all Easy Links, with the amount of time remaining for each to be active (3 days is the maximum) and the number of uses left (100 is the maximum). You can deactivate a single Easy Link by checking the box next to it then clicking\n **Deactivate**\n . Or, if you do not want to allow Easy Links for security reasons, you can turn off this functionality altogether by clicking the green toggle button next to \"Easy links enabled.\"\n\n\n Inviting Users with Other Security Roles\n------------------------------------------\n\nYou can invite team members to Domo by clicking any of the other\n **Invite**\n buttons found throughout the Domo interface and entering the users' email addresses. When you invite team members in this way, you can assign them to certain roles depending on your own security role.\n\n If you have an \"Admin\" default security role, you can invite users to Domo with any role, either default or custom.\n* If you have a \"Privileged\" default security role, you can only invite users to Domo as \"Privileged\" or \"Participant\" users.\n* If you have a \"Participant\" default security role, you can only invite users to Domo as \"Social\" users (see above).\n* If you have a custom role with \"Add New People\" AND \"Manage All Roles\" enabled, you can invite users to Domo with any role, just as if you were an \"Admin\"-level user.\n\nSome of the locations the\n **Invite**\n buttons are found in are as follows:\n\n In the\n\nuser Profile\n\n, under the reports diagram.\n* In the\n\nDetails view\n\nfor a card. Depending on your access, you may be able to share the card and invite in a single action.\n* In the\n\nAnalyzer view\n\nfor a card.\n\n\n**Video - Invite in Card Details and Analyzer**\n\n*To invite a user to Domo as \"Privileged\"- or \"Participant\"-level,**\n\n. Click any\n **Invite**\n button in Domo.\n\n\n The\n **Invite Them to Domo**\n dialog appears.\n2. Enter team members' email addresses one by one in the\n **Enter email addresses**\n field. When finished, click\n **Invite**\n .\n\n*Note:**\n\n\n If any authorized domains have been specified in\n **More > Admin**\n**> Network security > Authorized domains (for invites)**\n , all email addresses you enter\n *must*\n belong to one of those domains. When you begin to type an email address, it autocompletes with all possible authorized domains. If the domain for your entered email address does not appear in the autocomplete list, you cannot invite users from this domain. For more information, see\n\nSpecifying Authorized Domains for Invited Users\n\n.\n\nFAQ\n-----\n\n*The user I'm trying to invite isn't receiving the email notification. What should I do?**\n\n\n These emails can sometimes be blocked by email spam filters. If your users are not receiving the welcome \"You've Been Domo'd\" email, please check with your IT department to ensure our emails are whitelisted in the spam filter.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043438893\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004070\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nInviting Others to Join Domo\n\n", "article_total_view_count": "\n\n\n 5,166\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "inviting_others_to_join_domo", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "controlling_access_in_domo", "url": "/s/topic/0TO5w000000ZanMGAS"}, {"text": "user_and_group_management", "url": "/s/topic/0TO5w000000ZapJGAS"}]}