{"file_path": "../../raw_kb_v2\\article\\360051709994\\index.html", "content": {"title": "\n\n\n Deprecated Chart Properties\n\n\n", "article_body": "\n\nThe following chart properties have been deprecated. Note that for properties you applied by checking a box, if you applied the property before it became deprecated, the property still appears in your Chart Properties and is checked. However, if you uncheck the box and then resave the chart, the option is no longer available.\n\n\n Property\n  |\n Description\n  |\n| --- | --- |\n|\n Legend Position\n  |\n Determined whether legends appear above or below certain charts, if at all.\n  |\n|\n Zero Line Width (for Bubble and Scatter Plot graphs)\n  |\n Determined the width of the \"zero line\" on most single-axis charts, in pixels.\n  |\n|\n Show Data Label\n  |\n Turned on data labels for most chart types.\n  |\n|\n Show One Label\n  |\n Turned on a \"total\" label for vertical Stacked Bar charts. This has been replaced by the\n **Show Total Label**\n property, which is available for vertical as well as horizontal Stacked Bar charts.\n  |\n|\n Disable Interactivity\n  |\n Turned off interactivity in many chart types.\n  |\n|\n Title Position\n  |\n Determined whether value scale labels in some types of Vertical Bar charts appeared to the left of the chart or above it.\n  |\n|\n Use Legacy Funnel\n  |\n When this box was checked, the legacy version of the Funnel graph was used. This version showed both value and percent columns in the legend, and percentages for each layer in the legend were derived from the total value of the chart,\n *not*\n from the previous layer.\n  |\n|\n Allow Wide Bars\n  |\n Determined whether the bar in a Vertical Bar graph with a single bar used the full width of the available space. If this box was checked, the bar took up all of the space in the graph. Otherwise, a normal-sized bar appeared in the center of the chart space.\n  |\n|\n Allow Tall Bars\n  |\n Determined whether the bar in a Horizontal Bar graph with a single bar used the full height of the available space. If this box was checked, the bar took up all of the space in the graph. Otherwise, a normal-sized bar appeared in the center of the chart space.\n  |\n|\n Series 1-16\n  |\n Let you specify custom colors for up to sixteen series in most kinds of graphs. With the Analyzer release in August 2017, these properties have been replaced by the \"Color Rules\" functionality. For more information, see\n\nSetting Color Rules for a Chart\n\n.\n  |\n|\n Minimum Value\n  |\n Let you set the minimum value on a scale marker range. Replaced by \"Lower Value.\"\n  |\n|\n Maximum Value\n  |\n Let you set the maximum value on a scale marker range. Replaced by \"Upper Value.\"\n  |\n|\n Show Lines\n  |\n Determined whether red dotted lines demarcated the minimum and maximum values of your scale marker range.\n  |\n|\n Fill Outliers\n  |\n Determined whether outliers were filled in when scale markers were set.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360051709994\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004649\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDeprecated Chart Properties\n\n", "article_total_view_count": "\n\n\n 2,408\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:18 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "deprecated_chart_properties", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_properties", "url": "/s/topic/0TO5w000000ZaodGAC"}]}