{"file_path": "../../raw_kb_v2\\article\\000005147\\index.html", "content": {"Title": "Admin Settings: Governance", "Article Body": "Intro\n                       \n\n                        This article describes the various pages in the\n                        \n                         Governance\n                        \n                        section of the Admin Settings. To learn more about the Admin Settings, see our\n                        \n                         Admin Settings Overview\n                        \n                        article.\n                        \n                        You can navigate this article by selecting a page from the following list:\n                       \n\n\n\n                          People\n                         \n\n\n\n                          Groups\n                         \n\n\n\n                          Roles\n                         \n\n\n\n                          A\n                         \n\n                          ttributes\n                         \n\n\n\n                          Activity log\n                         \n\n\n\n                          Licenses\n                         \n\n\n\n                          Sandbox\n                         \n\n\n\n                          Toolkit\n                         \n\n\n\n\n\n                        People\n                       \n\n                        On the\n                        \n                         People\n                        \n                        section of the\n                        \n                         Governance\n                        \n                        section, the panel displays information for all users in the instance.\n                       \n\n\n\n                        You can learn more about the components in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            People list\n                           \n\n\n\n                            The list of users in Domo. You can use the\n                            \n                             Search\n                            \n                            bar on the right-hand side to locate a specific person in the list.\n                           \n\n\n\n\n                           Search field\n                          \n\n                           Lets you locate a particular user in your company's Domo instance.\n                          \n\n\n\n\n                            Role\n                           \n\n\n\n                            A list of the user's security access role. A number of default roles are available in Domo, and each of these has different access rights in Domo. For example, users with an \"Admin\" security role have almost universal access in Domo. For more information about default security roles, see\n                            \n                             Default Security Role Reference\n                            \n                            .\n                           \n\n                            You can also create custom security roles with privileges selected specifically for that role. For example, you could create a role with all of the default privileges of the \"Participant\" role as well as the ability to deploy apps from the Appstore. For more information, see\n                            \n                             Managing Custom Roles\n                            \n                            .\n                           \n\n\n\n\n                           Add/Export options\n                           \n\n\n\n\n\n\n                             Add New Person\n                            \n                            allows you to invite someone to Domo. This adds a user profile for that user in the\n                            \n                             People\n                            \n                            sub-tab in the\n                            \n                             Governance\n                            \n                            tab and also sends them an email message so they can set their own credentials and sign in to Domo. For more information, see\n                            \n                             Inviting Others to Join Domo\n                            \n                            .\n                           \n\n\n                             Bulk Import\n                            \n                            lets you add users to your Domo in bulk by uploading a specially formatted CSV file with your user information. For more information, see\n                            \n                             Adding Users to Domo\n                            \n                            .\n                           \n\n\n                             Bulk Export\n                            \n                            lets you generate a list of all users in your Domo instance in CSV format. For more information, see\n                            \n                             Generating a List of Users\n                            \n                            .\n                           \n\n\n\n\n\n                        User Attributes\n                       \n\n                        The User attributes screen allows you to see all of the information about a specific person such as their profile, groups, and content they can access.\n                       \n\n\n\n\n                        You can learn more about the components in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Profile\n                          \n\n                           Displays the user's personal and company details, their localization selections, and where they fit in the org chart.\n                          \n\n\n\n                           Groups\n                          \n\n\n                            The list of groups this user is a member of. Different groups have different content they can access; therefore, this user has access to all content his/her group can access.\n                           \n\n                            You can add a new membership to this user using the Add to groups option. For more information, see\n                            \n                             Managing Users and Groups\n                            \n                            .\n                           \n\n\n\n\n                           Pages\n                          \n\n                           Displays the Pages that the user has access to.\n                          \n\n\n\n                           Cards\n                          \n\n                           Displays the Cards that the user has access to.\n                          \n\n\n\n                           Mobile App\n                          \n\n                           Lets you customize the layout of this user's Domo Mobile home screen by dragging the tiles to different positions in a list. You can also add selected Pages, Domo features (such as Buzz), Cards, and Projects to tiles then reposition them the way you want them.\n                          \n\n\n\n\n                            Change Password\n                           \n\n\n                           Lets you change the password for the user.\n                          \n\n\n\n\n                           Start a Chat\n                          \n\n                           Starts a Buzz conversation with the user.\n                          \n\n\n\n\n                           Add Content\n                          \n\n                           Lets you share Cards or Pages with the user.\n                          \n\n\n\n\n                           Add to groups\n                          \n\n                           Lets you add the user to groups.\n                          \n\n\n\n\n                           Reset Overview Content\n                          \n\n                           Lets you reset the Cards that appear in the Overview Page for the selected user. For more information, see\n                           \n                            Specifying Default Overview Content for Users\n                           \n                           .\n                          \n\n\n\n\n                           Delete Person\n                          \n\n                           Deletes the user from Domo.\n                          \n\n\n\n\n                           Last Activity\n                          \n\n\n                            The date of the most recent activity by this user. This does not include other user's actions that may have impacted this user, like sharing of content. Note that there can be up to a 24-hour delay between the activity and reporting on this screen.\n                           \n\n\n\n\n\n\n\n                        Groups\n                       \n\n                        In the\n                        \n                         Groups\n                        \n                        section of the Admin Settings, a list of all groups in the Domo instance displays, along with a panel of groups statistics for the instance.\n                       \n\n                        For more information, see\n                        \n                         Creating and Managing User Groups\n                        \n                        .\n                        \n\n                        You can use the following table to find out more about the components of the\n                        \n                         Groups\n                        \n                        section:\n                       \n\n\n\n\n                           Component\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Dashboard\n                          \n\n\n                            Shows the number of groups of a certain type in your Domo instance, and allow lets you filter the groups listing to only show groups of that type. The following filters are available:\n                           \n\n\n\n\n                               Groups created\n                              \n                              . Shows all groups sorted by creation date in ascending order (newest to oldest).\n                             \n\n\n\n\n                               Dynamic groups\n                              \n                              . Shows all groups with dynamic rules for determining members (for example, such a group may include all members of the \"Corporate Sales\" department; if a new hire is added to this department, they are automatically added to the group).\n                             \n\n\n\n\n                               Closed groups\n                              \n                              . Shows all groups with \"Closed\" status, meaning only the group owners are allowed to invite new members.\n                             \n\n\n\n\n                               Directory groups\n                              \n                              . Shows all \"Directory\" groups, i.e. those that have been generated through an\n                              \n                               SSO provider\n                              \n                              .\n                             \n\n\n\n\n                               System groups\n                              \n                              . Shows all groups generated within the Domo instance, usually associated with a\n                              \n                               custom security role\n                              \n                              .\n                             \n\n\n\n\n                               Empty groups\n                              \n                              . Shows all groups with no members.\n                             \n\n\n\n\n\n\n                           Refresh icon\n                          \n\n                           Refreshes the groups listing.\n                          \n\n\n\n                           Settings icon\n                          \n\n\n                            Opens the\n                            \n                             Group settings\n                            \n                            sub-tab, in which you can toggle the following options:\n                           \n\n\n\n\n                               Add the admin group [selected group] as an owner automatically during all groups creations\n                              \n                              . When checked, any user in the group selected in\n                              \n                               Admin group\n                              \n                              is added as an owner to all new groups. This is set to the \"Manage all groups\" grant by default. For more information about grants, see\n                              \n                               Managing Custom Roles\n                              \n                              .\n                             \n\n\n\n\n                               [Selected group] can be removed as owner during group creation or after by any owner\n                              \n                              . When checked, any user added as a group owner through the selected group may be removed as an owner by any other owner.\n                             \n\n\n\n\n                               Hide system groups in the group management pages\n                              \n                              . When checked, system groups are not shown in the groups listing in\n                              \n                               Admin Settings > Groups\n                              \n                              .\n                             \n\n\n\n\n\n\n                           New group icon\n                          \n\n                           Lets you add a closed, open, or dynamic group to your Domo instance using the group creation wizard.\n                          \n\n\n\n                           Your group filters\n                          \n\n                           Lets you filter the group listing to show all groups in your instance, those of which you are an owner, or those of which you are a member.\n                          \n\n\n\n                           Group listing\n                          \n\n\n                            Shows all groups in your instance that pass the filters you have applied (if any). For any group, you can see the group name, owners, group type (open, ad hoc, directory, closed, dynamic, or system), the people in the group, and the amount of time since the group was last modified. For all columns, you can apply sorts and filters by clicking the\n                            \n                            or\n                            \n                            icon in the column header.\n                           \n\n\n\n                              For the \"Group\" column, you can click\n                              \n                              to sort the group names alphabetically or reverse-alphabetically.\n                             \n\n\n\n                              For the \"Owners\" column, you can click\n                              \n                              to select a specific owner to filter on.\n                             \n\n\n\n                              For the \"Group Type\" column, you can click\n                              \n                              to choose a different group type to filter on.\n                             \n\n\n\n\n                                 Open\n                                \n                                groups are those in which any member can invite another person to the group.\n                               \n\n\n\n\n                                 Closed\n                                \n                                groups are those in which only owners can invite other members.\n                               \n\n\n\n\n                                 Dynamic\n                                \n                                groups are those that use dynamic rules to determine members.\n                               \n\n\n\n\n                                 Ad hoc\n                                \n                                groups are \"legacy groups\" created within Domo (not through a third-party SSO system) before open, closed, and dynamic groups were released.\n                               \n\n\n\n\n                                 Directory\n                                \n                                groups are those that have been generated through a third-party SSO system.\n                               \n\n\n\n\n                                 System\n                                \n                                groups are groups generated automatically within the Domo instance, usually associated with a\n                                \n                                 custom security role\n                                \n                                .\n                               \n\n\n\n\n\n                              For the \"People\" column, you can choose people from a list to filter to see just their groups.\n                             \n\n\n\n                              For the \"Modified\" column, you can set up a date filter to see groups modified on a given date, between two specified dates, or before or after a certain date.\n                             \n\n\n\n                            When you check the box for one or more groups, a number of additional icons appear in the top right corner of the\n                            \n                             Groups\n                            \n                            page. These allow you to perform bulk actions on the groups. The following options are available:\n                           \n\n\n\n\n                              . Lets you add users from your Domo instance to this group as new members. (Owners only.)\n                             \n\n\n\n\n                              . Lets you send a\n                              \n                               Buzz message\n                              \n                              to all members of this group.\n                             \n\n\n\n\n                              . Lets you share a selected Page or Card with all members of this group.\n                             \n\n\n\n\n                              . Lets you choose to either change the group types for or add owners to multiple groups. (Owners only.)\n                             \n\n\n\n\n                              . Lets you delete all of the selected groups. (Owners only.)\n                             \n\n\n\n                            If you click within the cell for a group name, a details view for the group appears. Here you can do all of the following:\n                           \n\n\n\n                              View a listing of the members of the group.\n                             \n\n\n\n                              Change the name of the group.\n                             \n\n\n\n                              Add a description, or edit it if one already exists.\n                             \n\n\n\n                              Change the group type (open, closed, and dynamic groups only).\n                             \n\n\n\n                              View the SSO settings for a directory group.\n                             \n\n\n\n                              Set or change the owners.\n                             \n\n\n\n                              Add members to the group.\n                             \n\n\n\n                              Send a\n                              \n                               Buzz message\n                              \n                              to all members of this group.\n                             \n\n\n\n                              Share a selected Page or Card with all members of this group.\n                             \n\n\n\n                              Delete members from the group.\n                             \n\n\n\n\n\n\n                           Group management checkbox\n                          \n\n\n                            When toggled, filters the group listing to show only those groups you have rights to manage.\n                           \n\n\n\n                            Note:\n                           \n                           Some functions are only available when this checkbox is checked. For example, when disabled, you see these options in the blue bar:\n                           \n\n\n\n\n                           When enabled you’ll see these options:\n                           \n\n\n\n\n\n\n                           Search field\n                          \n\n                           Lets you search the group listing to show only specific groups.\n                          \n\n\n\n\n\n\n                        Roles\n                       \n\n                        When you select\n                        \n                         Roles\n                        \n                        in the sub-tab menu, the interface for creating and managing custom roles appears. Here, you can create new roles using default roles as templates, change the grants (privileges) assigned to certain roles, change the security role for multiple users, and see a grid view that compares roles by grants.\n                       \n\n\n\n\n                        This sub-tab is discussed in much more detail in\n                        \n                         Managing Roles\n                        \n                        .\n                       \n\n\n\n                        Attributes\n                       \n\n                        The\n                        \n                         Attributes\n                        \n                        section of the Admin Settings lets you create and manage user attributes to control dynamic group membership. This is especially helpful when using dynamic PDP as it allows you to build dynamic PDP filters based on user attributes such as name, email, and department. Attributes can also include multi-value lists.\n                       \n\n                        For more information, see our\n                        \n                         Attributes\n                        \n                        article.\n                       \n\n\n\n                        Activity Log\n                       \n\n                        To learn about activity logs, see our article about\n                        \n                         Viewing Activity Logs\n                        \n                        .\n                       \n\n\n\n                        Licenses\n                       \n\n                        To learn about licenses, see our article about\n                        \n                         Adding User Licenses in Domo\n                        \n                        .\n                       \n\n\n\n                        Sandbox\n                       \n\n                        See our\n                        \n                         Domo Sandbox\n                        \n                        article for information.\n                       \n\n\n\n                        Toolkit\n                       \n                       The Governance Toolkit contains many useful features including Group Management, Schema Management, and PDP Automation. For more information, see our\n                       \n                        Governance Tools\n                       \n                       documents.", "Preview Article": "Click here to preview", "URL Name": "000005147", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005147", "Archived Date": "", "Language": "English", "Primary Version": "Admin Settings: Governance", "Article Total View Count": "1,063", "": "", "Article Created Date": "3/8/2023, 3:53 AM", "First Published Date": "3/13/2023, 2:10 PM"}, "title": "\n              Admin Settings: Governance\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Governance Tools\n              \n", "url": "/s/topic/0TO5w000000ZannGAC"}]}