{"file_path": "../../raw_kb_v2\\article\\1500003094902\\index.html", "content": {"title": "\n\n\n Snapchat Ads OAuth Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSnapchat represents a new direction in social media, with its predominantly young users craving a more in-the-moment way of sharing and communicating via technology. Use Domo's Snapchat Ads OAuth Connector to receive details about organizations, ads, campaigns and more. To learn more about the Snapchat Ads API, visit their page (\n\nhttps://developers.snapchat.com/ads/\n\n).\n\n\n You connect to your Snapchat Ads account in the Data Center. This topic discusses the fields and menus that are specific to the Snapchat Ads OAuth connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\n\n To connect to your Snapchat Ads OAuth account and create a DataSet, you must have the username and password of a Snapchat Ads account that has access to the Ad accounts you are interested in.\n\n\n Connecting to Your Snapchat Ads OAuth Account\n------------------------------------------------\n\n\n This section enumerates the options in the\n\n*Credentials**\n\nand\n\n*Details**\n\npanes in the Snapchat Ads OAuth Connector page.\n\nThe components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\n\n The Domo Snapchat Ads OAuth connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n\n*Connect**\n\n(or select\n\n*Add Account**\n\nif you have existing Snapchat Ads accounts in Domo) to open the Snapchat Ads OAuth screen where you can enter your Snapchat Ads credentials. Once you have entered valid Snapchat Ads credentials, you can use the same account any time you go to create a new Snapchat Ads OAuth DataSet.\n\nYou can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\nIf you are already logged into Snapchat Ads when you connect in Domo, you are authenticated automatically when you click\n\n*Add account**\n\n. If you want to connect to an account that is different from the one you are logged into, you must first log out of Snapchat Ads OAuth.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n\nSelect the Snapchat Ads OAuth report you want to run. The following reports are available:\n\n  |  |\n| --- | --- |\n|\n Object Info: Organizations\n  |\n This report returns all the organizations the logged in user can access.\n  |\n|\n Object Info: Ad Accounts\n  |\n This report returns all ad accounts for the specified Organization.\n  |\n|\n Object Info: Campaigns\n  |\n This report returns all campaigns within a specified ad account.\n  |\n|\n Object Info: All Campaigns\n  |\n This report returns all campaigns within the specified ad accounts. Supports multiple ad accounts.\n  |\n|\n Object Info: Ad Squads\n  |\n This report returns all ad squads within a specified campaign or ad account.\n  |\n|\n Object Info: All Ad Squads\n  |\n This report returns all ad squads within a specified campaign or ad account. Supports multiple ad accounts.\n  |\n|\n Object Info: Ads\n  |\n This report returns all ads within a specified ad squad or ad account.\n  |\n|\n Object Info: All Ads\n  |\n This report returns all ads within a specified ad squad or ad account. Supports multiple ad accounts.\n  |\n|\n Statistics: Campaign (deprecated)\n  |\n This report returns statistics for the specified Campaign, or for all Ads or Ad Squads owned by that Campaign.\n  |\n|\n Statistics: Campaign (Insights and Dimensions)\n  |\n This report returns statistics for the specified Campaign, or for all Ads or Ad Squads owned by that Campaign using the updated Insights and Dimensions query.\n  |\n|\n Statistics: All Campaigns (Insights and Dimensions)\n  |\n This report returns statistics for the specified Campaign, or for all Ads or Ad Squads owned by that Campaign using the updated Insights and Dimensions query. Supports multiple ad accounts.\n  |\n|\n Statistics: Ad Squad (deprecated)\n  |\n This report returns statistics for a single, specified Ad Squad.\n  |\n|\n Statistics: Ad Squad (Insights and Dimensions)\n  |\n This report returns statistics for a single, specified Ad Squad using the updated Insights and Dimensions query.\n  |\n|\n Statistics: All Ad Squads (Insights and Dimensions)\n  |\n This report returns statistics for specified Ad Squad using the updated Insights and Dimensions query. Supports multiple ad accounts.\n  |\n|\n Statistics: Ad (deprecated)\n  |\n This report returns statistics for a single, specified Ad.\n  |\n|\n Statistics: Ad (Insights and Dimensions)\n  |\n This report returns statistics for a single, specified Ad using the updated Insights and Dimensions query.\n  |\n|\n Statistics: All Ads (Insights and Dimensions)\n  |\n This report returns statistics for specified Ad using the updated Insights and Dimensions query. Supports multiple ad accounts.\n  |\n|\n Campaign Statistics Merge\n  |\n This report returns statistics for the requested campaigns as it is merged with organization and campaigns report.\n  |\n|\n Ad Squads Statistics Merge\n  |\n This report returns statistics for the requested ad squads as it is merged with organization, ad account and ad squads report.\n  |\n|\n Ads Statistics Merge\n  |\n This report returns statistics for the requested ads as it is merged with organization, ad account, ad squads and ads report.\n  |\n\n|\n|\n Organization\n  |\n Select the organization you want to retrieve data for.\n  |\n|\n Ad Account\n  |\n Select the ad account you want to retrieve data for.\n  |\n|\n Ad Account Selection Criteria\n  |\n Select whether you want to retrieve ad data from a selected ad account or all ad accounts.\n  |\n|\n Select Ads By\n  |\n Select the type of object that owns the Ads to return.\n  |\n|\n Select Ad Squads By\n  |\n Select the type of object that owns the Ad Squads to return.\n  |\n|\n Campaign Selection Criteria\n  |\n Select whether you want to retrieve selected campaigns or all campaigns.\n  |\n|\n Campaign\n  |\n Select the campaign you want to retrieve data for.\n  |\n|\n Ad Squad Selection Criteria\n  |\n Select whether you want to retrieve data for all Ad Squads or selected Ad Squads.\n  |\n|\n Ad Squad\n  |\n Select the ad squad you want to retrieve data for.\n  |\n|\n Ad Selection Criteria\n  |\n Select whether you want to retrieve data for all Ads or selected Ads.\n  |\n|\n Ad\n  |\n Select the ad you want to retrieve data for.\n  |\n|\n Breakdown\n  |\n Select whether you want to break down results by ad, ad squad, or campaign.\n  |\n|\n Granularity\n  |\n Select how data will be aggregated in your report.\n  |\n|\n Dimension\n  |\n Select how your data will be grouped in your report.\n  |\n|\n Pivot\n  |\n Select how your data will be pivoted in your report.\n  |\n|\n Fields\n  |\n Select the fields (columns) you want to include in your report:\n  |\n|\n Conversion Source Types\n  |\n App, Offline, Total, or Web\n  |\n|\n Swipe Up Attribution Window\n  |\n Select a Swipe Up Attribution Window of 1, 7, or 28 days.\n  |\n|\n View Attribution Window\n  |\n Select the desired View Attribution Window. Note that this value must be smaller than the\n ****Swipe Up Attribution Window****\n .\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n ****End Date****\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n ****Start Date****\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n ****Days Back to End At****\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****Days Back to Start From****\n and 5 for\n ****Days Back to End At****\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n ****Days Back to Start From****\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****Days Back to Start From****\n and 5 for\n ****Days Back to End At****\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n###\n\nWhat version of the Snapchat API does this connector use?\n\nThis connector uses version 1 of the Snapchat API (\n\nhttps://adsapi.snapchat.com/v1.\n\n)\n\n###\n\nWhich endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Object Info: Organizations\n  |\n /me/organizations\n  |\n|\n Object Info: Ad Accounts\n  |\n /organizations/{organization-id}/adaccounts\n  |\n|\n Object Info: Campaigns\n  |\n /adaccounts/{ad\\_account\\_id}/campaigns\n  |\n|\n Object Info: All Campaigns\n  |\n /adaccounts/{ad\\_account\\_id}/campaigns\n  |\n|\n Object Info: Ad Squads\n  |\n adSquadsBy/{campaignId}/adsquads\n  |\n|\n /adSquadsBy/{adSquadId}/adsquads\n  |\n|\n Object Info: All Ad Squads\n  |\n /adSquadsBy/{campaignId}/adsquads\n  |\n|\n /adSquadsBy/{adAccountId}/adsquads\n  |\n|\n Object Info: Ads\n  |\n /AdsVia/{ad\\_squad\\_id}/ads\n  |\n|\n /AdsVia/{Id}/ads\n  |\n|\n Object Info: All Ads\n  |\n /AdsVia/{ad\\_squad\\_id}/ads\n  |\n|\n /AdsVia/{adAccountId}/ads\n  |\n|\n Statistics: Campaign (deprecated)\n  |\n /campaigns/{campaign-id}/stats\n  |\n|\n Statistics: Campaign (Insights and Dimensions)\n  |\n /campaigns/{campaignId}/stats\n  |\n|\n Statistics: All Campaign (Insights and Dimensions)\n  |\n /campaigns/{adAccIdAndTimeZone}/stats\n  |\n|\n Statistics: Ad Squad (deprecated)\n  |\n /adsquads/{adsquad-id}/stats\n  |\n|\n Statistics: Ad Squad (Insights and Dimensions)\n  |\n /adsquads/{adSquadId}/stats\n  |\n|\n Statistics: All Ad Squads (Insights and Dimensions)\n  |\n /adsquads/{adAccIdAndTimeZone}/stats\n  |\n|\n Statistics: Ad (deprecated)\n  |\n /ads/{ad-id}/stats\n  |\n|\n Statistics: Ad (Insights and Dimensions)\n  |\n /ads/{adId}/stats\n  |\n|\n Statistics: All Ads (Insights and Dimensions)\n  |\n /ads/{adAccIdAndTimeZone}/stats\n  |\n|\n Campaign Statistics Merge\n  |\n /getAndWriteCampaignStatsData\n  |\n|\n Ad Squads Statistics Merge\n  |\n /getAndWriteAdSquadsStatsData\n  |\n|\n Ads Statistics Merge\n  |\n /getAndWriteAdsStatsData\n  |\n\n\n####\n\nWhat kind of credentials do I need to power up this connector?\n\nYou need the username and password of a Snapchat Ads account that has access to the Ad accounts you are interested in.\n\n###\n\nHow do I know if my data is finalized?\n\nData for a given day can be changed by Snapchat for up to 48 hours after the end of that day in the Ad Accounts timezone.\n\n\n The data that is returned has a column called \"finalized\\_data\\_end\\_time\". This is the time of the most recently finalized data. Any data before that time is finalized. Any data after that time is still subject to change.\n\n###\n\nHow do I get information about more than one Ad, Ad Squad, or Campaign at once?\n\nThe \"Statistics: Ad (Insights and Dimensions)\" and \"Statistics: Ad Squad (Insights and Dimensions)\" reports provide the data for a single or objects (ad or ad squad) at once. To get information about multiple objects, you need to use the \"Statistics: Campaign (Insights and Dimensions)\" report.\n\n\n This report allows you to select the metrics to report, and how the data should be broken down. Data can be broken down by Ad, Ad Squad, or Campaign. If you select one of these, the data will be reported for all individual Ads, Ad Squads, or Campaigns.\n\nTroubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500003094902\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003240\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSnapchat Ads OAuth Connector\n\n", "article_total_view_count": "\n\n\n 4,663\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "snapchat_ads_oauth_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}