{"file_path": "../../raw_kb_v2\\article\\360043430353\\index.html", "content": {"title": "\n\n\n Projects and Tasks Layout\n\n\n", "article_body": "\n\nIntro\n-------\n\nUsing the\n\nProjects & Tasks\n\ntool in Domo, you can create projects made up of various tasks and assign users to complete those tasks. There are several types of projects—\"Personal Tasks,\" which are tasks you create that are\n *only*\n seen by you; \"My Projects,\" which are projects to which you are assigned as a team member; and \"Company Projects,\" which are tasks assigned to all teams, whether or not you are a member. Company projects can be made public or private. Public company projects can be viewed, accessed, and edited by anyone in your company, and private company projects can only be viewed by members of the team assigned to that project.\n\nThe page also contains a project named \"Tasks That You Have Assigned,\" which contains all tasks you have assigned to other users. This project contains only the three basic task lists—\"To Do,\" \"Working On,\" and \"Completed.\" Any tasks you have assigned that are in custom-made lists are pulled into the appropriate basic list. (For example, if you had created a list called \"Ideas\" based on the basic \"To Do\" list, the tasks from \"Ideas\" would be pulled into \"To Do\" in the \"Tasks That You Have Assigned\" project.) For more information about lists, see\n\nAdding a Task List to a Project\n\n.\n\n\n All projects you are able to access in Domo appear in your main\n\nProjects & Tasks\n\npage, which you can access by clicking\n\nin the top right corner of the screen. You can click the name of any project here—including your Personal Tasks—to open a details page for that project.\n\n\n For more information about Projects and Tasks, see\n\nProjects and Tasks\n\n.\n\n*Video - Projects and Tasks Overview**\n\nProject Listing page\n----------------------\n\nThe project listing page is the first page you see when you click\n\n. This page lists all of the projects you have access to. Projects are divided into these lists—\"Personal Tasks\" (which only you can view and access); \"My Projects\" (projects to which you have been assigned as a team member); \"Company Projects\" (all projects you are allowed to view, including those which have been marked as \"Public\"), and \"Tasks That You Have Assigned,\" which combines all of the tasks you have assigned to others from all projects.\n\n\n The following screenshot shows the most important components of this page:\n\nThe following table describes these components in greater detail:\n\n\n Component\n  |\n Description\n  |\n| --- | --- |\n|\n New project button\n  |\n Displays the\n **Create New Project**\n dialog, in which you can give the project a name, description, and due date; assign team members; and specify whether this project is public or private. After you enter this information and click\n **Done**\n , a details page opens for this project. The options in this dialog are described in greater detail in the next section.\n  |\n|\n Project filter\n  |\n Lets you filter the projects in this page so you can find the specific one you want.\n  |\n|\n New task indicator\n  |\n Indicates the number of tasks in this project in the \"To Do\" list and any custom-made lists based on the basic \"To Do\" list type.\n  |\n|\n Open/closed tasks\n  |\n Indicates how many tasks in this project are open (meaning they are in a \"To Do\" or \"Working On\" list) or closed (meaning they are in a \"Completed\" list).\n  |\n\n\n###\n Create New Project dialog\n\nThis dialog appears when you click\n **Create New Project**\n in the project listing page.\n\nThe options available in this dialog are as follows:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Project Name\n  |\n The name of this project\n  |\n|\n Team Members\n  |\n The users you want to assign to this project. If the project is set to Private, only team members are able to view, access, and edit the project.\n  |\n|\n Privacy\n  |\n The privacy setting for the project, either Public or Private. If the project is set to Public, anyone can view, access, and edit it, not just the team members assigned to it. In addition, all activity for the project appears in Buzz. If the project is set to Private, only team members can view, access, and edit the project, and only they see activity for the project in Buzz.\n  |\n|\n Project Description\n  |\n A description for this project. This property is optional.\n  |\n|\n Due Date\n  |\n The date that you expect this project to be completed by. This property is optional.\n  |\n\nProject Details page\n----------------------\n\nWhen you click on any project in the project listing page, a details page for that project appears. This page shows the number of open and closed tasks for the project, the due date, the team members, and workflow lists for the project. Every project you create initially contains three task workflow lists—\"To Do,\" \"Working On,\" and \"Completed\"—but you can create new lists if you want. You can assign tasks to workflow lists, move tasks between lists, or even move the lists themselves.\n\n\n The following screenshot shows the most important components of this page:\n\nThe following table describes these components in greater detail:\n\n\n Component\n  |\n Description\n  |\n| --- | --- |\n|\n Privacy indicator\n  |\n Indicates whether this project has been set to \"public\" or \"private.\" If the project is private, a lock icon like the one shown here appears; if the project is public, nothing appears here.\n  |\n|\n Project menu\n  |\n Provides options for opening the\n **Edit Project**\n dialog for this project, for jumping to other projects to which you have been assigned, for viewing the project archives, and for returning to the project listing page.\n  |\n|\n Project info\n  |\n Shows you the number of open and closed tasks in this project, the due date, and the team members assigned to the project. This information is found in the filter panel, so you do not see it if the panel is closed.\n  |\n|\n Task tags\n  |\n Allow you to filter tasks based on tags you add when you create a task. For example, in the previous screenshot, the user added the tag \"doc\" to all of the tasks that involve creating documentation, so the \"doc\" tag appears here. If the user then clicks \"doc,\" the tasks in the project are filtered to show only the tasks with the \"doc\" tag. For more information about creating tasks, see\n\nCreating and Assigning Project Tasks\n\n. Task tags are found in the filter panel, so you do not see them if the panel is closed.\n  |\n|\n Task filter\n  |\n Lets you filter the tasks in this page by description keyword. The task filter is found in the filter panel, so you do not see it if the panel is closed.\n  |\n|\n Add to Project button\n  |\n Lets you quickly add new team members to this project. When you click this button, the\n **Edit project**\n dialog opens, with the list of users open by default so you can quickly select the new team member you want.\n  |\n|\n Filter toggle\n  |\n Shows/hides the filter panel.\n  |\n|\n Assign Task button\n  |\n Lets you create a new task, assign it to one or more team members, specify whether the task is personal or part of a project, and specify a due date, project, and tags. Tasks you create in this way are sent directly to the \"To Do\" list for the project.\n  |\n|\n New List button\n  |\n Lets you create a new list. You enter a name for the list and select a list type, either \"To-Do,\" \"In Progress,\" or \"Completed.\"\n  |\n|\n Filter panel\n  |\n Contains filter options, along with project information such as the number of open and closed tasks, the due date, and team members. You can show or hide the options in the filter panel using the filter toggle.\n  |\n|\n Task lists\n  |\n The columns that show the progress of tasks in a project. All projects start with these lists—\"To Do,\" \"Working On,\" and \"Completed.\" You can add new lists using the New List button; however, all new lists you create are based on one of the three basic list types.\n\n\n You can move tasks between lists as often as you want.\n\n\n You can add tasks to any list by entering the task name in the empty field under the appropriate list or by clicking the\n **New Task**\n button and filling out the task information there (tasks created in this way are automatically sent to the \"To Do\" list). You can move lists, archive all of the tasks in a list, or archive the lists themselves by mousing over the top of the list and selecting the desired option from the\n\nmenu that appears. You can click and drag tasks between lists, or click any task to bring up a dialog with additional options for that task. Finally, you can \"like\" a task by clicking the\n\nicon.\n\n\n A\n\nicon on a task indicates that the task contains one or more attachments. A\n\nindicates that the due date for this task has expired.\n\n\n Tasks in the \"Completed\" list are displayed as \"crossed out\" to indicate that they are completed.\n  |\n|\n Like icon\n  |\n Allows you to \"like\" this task.\n  |\n|\n Clear filters\n  |\n Resets all filters you have applied to the project. This option is found in the filter panel, so you do not see it if the panel is closed.\n  |\n\n\n###\n Edit Project dialog\n\nThis dialog has the same options as the\n **Create New Project**\n dialog, described previously, as well as an option that allows you to delete the project. You can access this dialog from a project details page by mousing over the arrow to the right of the project name and selecting\n **Edit This Project**\n .\n\n##\n Assign Task dialog\n\nThis dialog appears when you click\n **Assign Task**\n in a project details page.\n\nThis dialog provides many options for creating and assigning a task. You can assign team members to complete the task, set a due date, specify whether the task is personal or part of a project, specify the project, and create tags.\n\n\n The options available in this dialog are as follows:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n \"This task is\" radio buttons\n  |\n Let you specify whether this is a personal task (in which case the task is sent to the \"To Do\" list in your Personal Tasks page) or part of a project (in which case the task is sent to the \"To Do\" list for the project you select).\n  |\n|\n Project\n  |\n The project this task is assigned to. If you change the project for a task, it is moved to the \"To Do\" list for that project.\n  |\n|\n Task\n  |\n The name of this task.\n  |\n|\n Due Date\n  |\n The target date when you expect this task to be completed.\n  |\n|\n Description\n  |\n A description of this task.\n  |\n|\n Owner\n  |\n The designated owner for this task.\n  |\n|\n Contributors\n  |\n The user(s) assigned to complete this task. If you assign a user who is not a member of this team, they automatically become a team member.\n  |\n|\n Tags\n  |\n Tags you can use to filter tasks. When you enter a tag for a task, that tag is added to the\n **Tags**\n area of the project details page. Clicking the tag then filters the page to show only tasks that include that tag.\n  |\n|\n Save\n  |\n Saves this task to the \"To Do\" list. From there, you can move it to another list or edit it as necessary.\n  |\n\n\n###\n Edit Task dialog\n\nThis dialog provides the same options as the\n **New Task**\n dialog, as well as several others, such as a live log of all activity for this task and the ability to add and download attachments. You can access this dialog by clicking the task you want to edit.\n\nIn addition to the options described in the previous section, this dialog provides the following options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Activity field\n  |\n Allows you to comment on this task. Comments you enter here appear in the live activity log for this task.\n  |\n|\n Attachments\n  |\n Lets you add attachments such as pictures, documents, etc. to this task. You can also download attachments in the\n **Edit Task**\n dialog if there are any available. When you add pictures as attachments, they appear as pictures in the workflow; you do not need to download them to see them. You can delete an attachment by mousing over the attachment and clicking the \"x\" that appears.\n  |\n|\n Archive\n  |\n Sends this task to the project archives. For more information, see\n\nArchiving Project Tasks and Lists\n\n.\n  |\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043430353\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004357\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nProjects and Tasks Layout\n\n", "article_total_view_count": "\n\n\n 4,830\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:45 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "projects_and_tasks_layout", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "projects_and_tasks", "url": "/s/topic/0TO5w000000Zao5GAC"}]}