{"file_path": "../../raw_kb_v2\\article\\000005150\\index.html", "content": {"Title": "Subset Processing in Magic ETL", "Article Body": "Intro\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           This feature is in beta. Visit this link to\n                           \n                            join the beta\n                           \n                           .\n                          \n\n\n\n\n                        Subset Processing in Magic ETL provides a precise and efficient solution to data processing. With Subset Processing, you can choose to load only the batches updated since the last successful execution or you can specify the batches to be loaded based on their creation date or partition name. You can customize your approach to your organization's specific needs. To learn more about partitions, data architecture, and how to optimize your data pipeline, visit our\n                        \n                         Data Center Overview\n                        \n                        topic in the knowledge base.\n                       \n\n                        This article provides information about using Subset Processing in the following topics:\n                       \n\n\n\n                          Partition basics\n                         \n\n\n\n                          Partition best practices\n                         \n\n\n\n                          Configure initial data processing\n                         \n\n\n\n                          Use case\n                         \n\n\n\n                          Configure update method\n                         \n\n\n\n\n\n                        Partition Basics\n                       \n\n                        Partitions are a way of organizing your data into groups to make data updates faster and more efficient. The graphic below illustrates\n                        \n\n                        replacing and appending data with partitions.\n                       \n\n\n\n                        A common way to understand partitions is to think of an encyclopedia—a collection of books that are part of the same set, but individually different. If an update is made to one book and it is republished, you can buy a new copy of that book without replacing the entire set of books. Partitions divide your data into separate collections, or subsets, so that when you replace some data, you do not need to replace all of it. Appending data when using partitions is like buying a new volume of the encyclopedia and adding it to the end of your collection on the shelf.\n                        \n\n                        The following notes further define using the partitions:\n                       \n\n\n                         Partition key tags divide data into subsets.\n                        \n\n                         Ingestion of new data only affects the specified partitions.\n                        \n\n                         Accessing and updating only the necessary data partitions makes the process faster and more efficient.\n                        \n\n\n\n\n                        Partition Best Practices\n                       \n\n                        A good partition needs to be large enough to take advantage of the enhanced processing speed that partitioning offers, but also\n                        \n\n                        granular enough to meet your specific needs.\n                        \n\n                        For most situations, a date-based, day-level partition strikes a good balance between these alternatives. However, if you need to keep more than five year's worth of day-based partitions in a single DataSet, you may want to consider using a week-level or month-level partition instead.\n                        \n\n                        Some organizations need partitions that are more granular than day level. If that is the case for your organization, you can create a custom partition by combining two or more columns in your DataFlow. For example, if you have eight store locations, you might want to create a partition that combines the store ID and the date.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           There is a 1500-partition limit for each DataSet. If you create too many partitions, you may reach this limit and experience problems. In the example from the previous paragraph, if you create a partition key using store ID + date, you can only store 187 day's worth of data. (1500 partitions divided by 8 stores.)\n                          \n\n\n\n\n\n\n                        Configure Initial Data Processing\n                       \n\n                        Magic ETL provides three data selection methods when configuring your input DataSet for a DataFlow: All, New, and Filter by batch. These methods are described in the process below.\n                       \n\n\n\n                        Follow the steps below to set up initial data processing in Magic ETL.\n                       \n\n\n                         Access Magic ETL by locating your DataSet in Domo and going to the\n                         \n                          Data\n                         \n                         tab for the DataSet.\n                        \n\n                         In the\n                         \n                          Data\n                         \n                         tab, select\n                         \n                          Open With\n                         \n                         >\n                         \n                          Magic ETL\n                         \n                         .\n                         \n                         The Magic ETL interface opens with your DataSet on the canvas as the input DataSet.\n                         \n\n\n\n\n                         Select the DataSet on the canvas to expand the editor at the bottom of the screen and display four tabs:\n                         \n                          Configuration\n                         \n                         ,\n                         \n                          Details\n                         \n                         ,\n                         \n                          Data\n                         \n                         , and\n                         \n                          Notes\n                         \n                         .\n                        \n\n                         In the\n                         \n                          Configuration\n                         \n                         tab, expand the\n                         \n                          Data Selection\n                         \n                         menu and choose the data selection method that meets your needs. These methods are described below:\n                         \n\n\n                            All —\n                           \n                           This is the default option. Selecting this option loads all rows from the selected input DataSet. Some DataFlow options may be automatically optimized.\n                           \n                            To learn more about automatic optimization, see our\n                            \n                             Magic ETL DataFlow Auto Append Processing\n                            \n                            article.\n                           \n\n\n\n                            New —\n                           \n                           Select this option if you want to load to the DataSet batches updated since the last successful execution, including restated partitions.\n                           \n                            If you select this option and your DataSet has a replace operation, the next DataFlow execution loads all batches from the replace and any batches appended since the replace. Your outputs continue to perform the action that you have saved for the DataFlow (such as append or replace).\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               If you occasionally replace all batches in your input DataSet and always append to your output DataSet within the DataFlow, there may be duplicate data in your output DataSet.\n                              \n\n\n\n\n\n\n\n                             Filter by batch —\n                            \n                            Select this option if you want to specify which batches to load based on their creation date or, in the case of partitions, their name. If you choose this option, you must also complete the section of the editor labeled\n                            \n                             Filter by Batch\n                            \n                            .\n                           \n\n\n                             In the\n                             \n                              Import data when\n                             \n                             field, there are two options:\n                            \n\n\n\n\n\n\n                              If you want to load data using a specific processing date, select\n                              \n                               Data processed\n                              \n                              . Then select the logic you want from the list options in the\n                              \n                               Date is in\n                              \n                              fields.\n                             \n\n\n\n\n\n\n\n\n                              If you want to load data using a custom expression, select\n                              \n                               Custom expression\n                              \n                              . Use the formula field to create a custom expression. The table below contains information about what values you can use to write a custom expression.\n                             \n\n\n                               When it comes to partitioning a DataSet, the process is based on the metadata about the DataSet rather than the values within the data itself. This means that when you define a subset of the DataSet, you are not selecting specific values within the data, but rather are selecting a subset of the metadata that defines the data.\n                              \n\n\n\n\n\n\n\n\n\n\n\n\n\nbatch.id\n\n\n\n                                  The numerical identifier for a data part. (This is system generated.)\n                                 \n\n\n\n\n\nbatch.name\n\n\n\n                                  The symbolic name for a data part.\n                                 \n\n\n\n\n\nbatch.created\n\n\n\n                                  The timestamp indicating when the upload of the data part corresponding to part\n                                  \n                                   .\n                                  \n                                  id began.\n                                 \n\n\n\n\n\nbatch.completed\n\n\n\n                                  The timestamp indicating when the upload of the data part corresponding to part\n                                  \n                                   .\n                                  \n                                  id was completed.\n                                 \n\n\n\n\n\nbatch.recorded\n\n\n\n                                  The timestamp indicating when the data part corresponding to part\n                                  \n                                   .\n                                  \n                                  id was added to the DataSet.\n                                 \n\n\n\n\n\ncursor_batch.id\n\n\n\n                                  The identifier of the most recent batch successfully processed by this DataFlow. Compare with batch.id.\n                                 \n\n\n\n\npartition.name\n\n\n                                 The name of the partition with which the batch is associated. Identical to batch\n                                 \n                                  .\n                                 \n                                 name in this context. The value is null if the batch is not associated with a partition.\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Use Case\n                       \n\n                        The formula displayed in this image (there is a code sample below) takes advantage of the fact that the input DataSet is partitioned by date. This means that the data is split into different partitions based on the date, which allows the formula to use date-related functions to filter the data.\n                       \n\n\n\n\n                        The formula creates a filter that compares the partition name (which is a date) to the current date. If the current date is the first day of the month, the filter allows all partitions from the past year to pass through. If the current date is any other day of the month, the filter only allows the last 30 day's worth of partitions to pass through.\n                       \n\n                        This filtering strategy enables you to process less data every day while still maintaining a full year's worth of data one time per month. You can use this approach in various scenarios, and we recommend that you experiment\n                        \n\n                        with it.\n                       \nDATE(batch.name) >= CURRENT_DATE() – (CASE WHEN DAYOFMONTH(CURRENT_DATE()) = 1 THEN 365 ELSE 30 END)\n\n\n\n\n                        Configure Update Method\n                       \n\n                        The following data update methods are available in Magic ETL:\n                       \n\n\n\n\n                           Update Method\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Replace\n                          \n\n                           Each execution replaces the output DataSet's contents with its latest results.\n                          \n\n\n\n                           Append\n                          \n\n                           Each execution appends its results to the output DataSet as a new batch.\n                          \n\n\n\n                           Partition\n                          \n\n                           Each execution groups rows into batches according to a name, which is the value of a specific column. Each unique batch name in a DataSet is called a partition. These partitions are all appended to the DataSet, and any pre-existing partitions with matching names are replaced. Finally, if a partition filter expression is specified, all partitions are evaluated against it and any that do not pass are deleted.\n                           \n\n\n\n\n\n\n\n\n                                Important:\n                               \n\n\n\n\n                                   Data partitions are limited to 1500 data versions on any output DataSet that uses data partitions.\n                                  \n\n\n\n\n\n                                   Column Value must be non-null and not exceed 128 bytes.\n                                  \n\n\n\n\n\n\n\n\n\n\n\n\n                        To learn more about update methods, see our\n                        \n                         DataSet Update Methods\n                        \n                        and\n                        \n                         Data Fundamentals\n                        \n                        articles.\n                        \n\n                        Follow the steps below to configure the update method for your DataSet in Magic ETL.\n                       \n\n\n                         After you have an output DataSet on your canvas for the DataFlow, select the output DataSet to expand the editor at the bottom of the screen.\n                        \n\n                         In the\n                         \n                          Configuration\n                         \n                         tab of the editor, choose the update method that meets your needs from the\n                         \n                          Update Method\n                         \n                         list (Replace, Append, or Partition).\n                        \n\n                         (Conditional) If you select Partition as the update method, you must then select the column you want to use to divide the data from the\n                         \n                          Partition name column\n                         \n                         list.\n                         \n                         After you select a column, enable\n                         \n                          Specify which partitions to keep\n                         \n                         unless you want to delete all partitions.\n                         \n\n\n\n\n                         (Optional) If you enable\n                         \n                          Specify which partitions to keep\n                         \n                         , a field displays in which you can enter an expression. This expression keeps any specified partitions; all other partitions are deleted. Note that this field only validates the\n                         \n                          partition.name\n                         \n                         expression.", "Preview Article": "Click here to preview", "URL Name": "000005150", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005150", "Archived Date": "", "Language": "English", "Primary Version": "Subset Processing in Magic ETL", "Article Total View Count": "1,340", "": "", "Article Created Date": "3/9/2023, 9:03 PM", "First Published Date": "3/13/2023, 12:04 PM"}, "title": "\n              Subset Processing in Magic ETL\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}