{"file_path": "../../raw_kb_v2\\article\\4405765083543\\index.html", "content": {"title": "\n\n\n HarvestApp Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Harvest provides time tracking and online invoicing tools and services for freelancers and small businesses. The Domo HarvestApp connector allows you to get your Harvest data into Domo and begin analyzing data to optimize hiring and invoicing decisions.\n\nTo learn more about the Harvest API, visit their page (\n\nhttp://help.getharvest.com/api/\n\n).\n\n\n You connect to your Harvest account in the Data Center. This topic discusses the fields and menus that are specific to the HarvestApp connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Harvest account and create a DataSet, you must have your Harvest username and password. Alternatively, you can use your Google account to login.\n\n\n Connecting to Your Harvest Account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the HarvestApp Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo HarvestApp connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Harvest accounts in Domo) to open the Harvest OAuth screen where you can enter your Harvest username and password. (You can also enter Google credentials to authenticate.) Once you have entered valid credentials, you can use the same account any time you go to create a new HarvestApp DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Harvest when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Harvest.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the HarvestApp report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n All Clients\n  |\n Retrieve a list of all clients. Using the date selector, you can retrieve all clients updated after the specified date.\n  |\n|\n All Contacts\n  |\n Retrieve a list of all contacts. Using the date selector, you can retrieve all contacts updated after the specified date.\n  |\n|\n All Expenses\n  |\n Retrieve a list of all expenses. Using the date selector, you can retrieve all expenses updated after the specified date.\n  |\n|\n All Projects\n  |\n Retrieve a list of all projects. Using the date selector, you can retrieve all projects updated after the specified date.\n  |\n|\n All Roles\n  |\n Retrieve a list of all roles.\n  |\n|\n All Tasks\n  |\n Retrieve a list of all tasks. Using the date selector, you can retrieve all tasks updated after the specified date.\n  |\n|\n All Task Assignments\n  |\n Retrieve a list of all task assignments. Using the date selector, you can retrieve all task assignments updated after the specified date.\n  |\n|\n All Time Entries\n  |\n Retrieve a list of all time entries. Using the date selector, you can retrieve all time entries updated after the specified date.\n  |\n|\n All User Assignments\n  |\n Retrieve a list of all user assignments. Using the date selector, you can retrieve all user assignments updated after the specified date.\n  |\n|\n All Users\n  |\n Retrieve a list of all all users. Using the date selector, you can retrieve all users updated after the specified date.\n  |\n|\n All Project Assignments\n  |\n Retrieve a list of all project assignments. Using the date selector, you can retrieve all project assignments updated after the specified date for all users.\n  |\n|\n Company\n  |\n Retrieve info about your current company.\n  |\n|\n Expense Categories\n  |\n Retrieve a list of expense categories. Using the date selector, you can retrieve all expense categories updated after the specified date.\n  |\n|\n Invoices\n  |\n Retrieve a list of invoices. Using the date selector, you can retrieve all invoices updated after the specified date.\n  |\n|\n Invoice Item Categories\n  |\n Retrieve a list of invoice item categories. Using the date selector, you can retrieve all invoice item categories updated after the specified date.\n  |\n|\n Invoice Messages\n  |\n Retrieve a list of invoice messages. Using the date selector, you can retrieve all invoice messages for each invoice updated after the provided date.\n  |\n|\n Invoice Payments\n  |\n Retrieve a list of invoice payments. Using the date selector, you can retrieve all invoice payments for each invoice updated after the provided date.\n  |\n\n|\n|\n Harvest Account\n  |\n Select the\n\nHarvest account you would like to retrieve data from.\n  |\n|\n Duration\n  |\n\nHarvest allows you to select a single updated since date.\n\n|\n|\n Report Updated Since Date\n  |\n Select the report date using relative or specific dates. Relative meaning number of days from today or a specific date using the date selector\n  |\n|\n Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the HarvestApp API does this connector use?\n\nThis connector uses version 2 of the HarvestApp API (\n\nhttps://api.harvestapp.com/v2/\n\n).\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n All Clients\n  |\n /clients\n  |\n|\n All Contacts\n  |\n /contacts\n  |\n|\n All Expenses\n  |\n /expenses\n  |\n|\n All Projects\n  |\n /projects\n  |\n|\n All Roles\n  |\n /roles\n  |\n|\n All Tasks\n  |\n /tasks\n  |\n|\n All Task Assignments\n  |\n /projects/{projectId}/task\\_assignments\n  |\n|\n All Time Entries\n  |\n /time\\_entries\n  |\n|\n All User Assignments\n  |\n /projects/{projectId}/user\\_assignments\n  |\n|\n All Users\n  |\n /users\n  |\n|\n All Project Assignments\n  |\n /users/{userId}/project\\_assignments\n  |\n|\n Company\n  |\n /company\n  |\n|\n Expense Categories\n  |\n /expense\\_categories\n  |\n|\n Invoices\n  |\n /invoices\n  |\n|\n Invoice Item Categories\n  |\n /invoice\\_item\\_categories\n  |\n|\n Invoice Messages\n  |\n /invoices/{invoiceId}/messages\n  |\n|\n Invoice Payments\n  |\n /invoices/{invoiceId}/payments\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need your Harvest email id and password, or Google account credentials to power up this connector.\n\n###\n How do I know my login credentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n Can I use the same account multiple times to create datasets?\n\nYes\n\n###\n When I click 'Add Account', why am I getting automatically validated without needing to enter credentials?\n\nIf you are already logged into Harvest when you connect to Domo, you are authenticated automatically as you click Add account. If you want to connect to an account that is different from the one you are logged into, you must first log out of Harvest.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nHarvest limits 100 requests per 15 seconds.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4405765083543\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003218\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nHarvestApp Connector\n\n", "article_total_view_count": "\n\n\n 2,347\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "harvestapp_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}