{"file_path": "../../raw_kb_v2\\article\\360063698733\\index.html", "content": {"Title": "Creating an Adrenaline DataFlow", "Article Body": "Intro\n                       \n\n                        Adrenaline DataFlows are an in-house built, high-scale, and high-performance data transformation tool for massive DataSets in Domo powered by the Adrenaline engine. It uses a SQL script-based transformation interface, similar to MySQL DataFlows. Adrenaline DataFlows allow you to rapidly summarize and aggregate massive DataSets into smaller, more performant outputs. Adrenaline DataFlows are able to deliver high-performance by leveraging architectural investments and performance improvements made to Domo's Adrenaline engine over time.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This feature is available\n                             \n                              on demand and paid.\n                             \n\n\n\n\n\n                            To request this feature be enabled,\n                           \n\n\n\n\n                               Reach out to your Domo Customer Success Manager, Technical Consultant, or Account Executive.\n                              \n\n\n\n\n\n                               If you do not have contact information for your CSM, TC, or AE, contact Technical Support. For information on how to contact Support, please see:\n                               \n                                Getting Help\n                               \n\n\n\n\n\n\n                             Depending on the feature, you may be required to complete training before you can use the feature.\n                            \n\n\n\n\n\n\n\n\n                        Use Cases\n                       \n\n                        Adrenaline DataFlows are designed to work with massive input DataSets, even in the Billions of rows of data. We recommend Adrenaline DataFlows for the following use cases:\n                       \n\n                        1. Building high-performance Dashboards from massive DataSets. Instead of directly building cards off such large DataSets, we recommend using Adrenaline DataFlows to create summarized and aggregated smaller outputs which should then be used to power fast, high-performance dashboards. For cases where access to the full data is needed, we recommend setting up Drill Paths to the original DataSet from the visualizations built from the summarized DataFlow outputs.\n                       \n\n                        2. Data transformations that require scanning the entire length of massive DataSets e.g., COUNT DISTINCT, SUM, and other aggregate operations.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Domo does not recommend using Adrenaline DataFlows for doing row-by-row transformations, where DataFlow outputs have similar row counts as input DataSets.\n                          \n\n\n\n\n\n\n                        Creating an Adrenaline DataFlow\n                       \n\n                        1. In the navigation header, go to\n                        \n                         Data\n                        \n                        .\n                       \n\n\n\n\n\n\n                        2. From the rail, select\n                        \n                         DataFlows\n                        \n                        .\n                       \n\n\n\n\n\n\n                        3. In the\n                        \n                         Magic Transform\n                        \n                        menu, select\n                        \n                         SQL\n                        \n                        .\n                       \n\n                        A DataFlow types modal displays.\n                       \n\n\n\n\n                        4. From the options, choose\n                        \n                         Adrenaline\n                        \n                        .\n                       \n\n\n\n\n\n\n                        5. Enter a\n                        \n                         DataFlow Name & Description\n                        \n                        , select\n                        \n                         DataSets\n                        \n                        ,\n                        \n                         Transforms\n                        \n                        , and\n                        \n                         Output DataSets.\n                        \n\n\n\n                         After selecting DataSets, click\n                         \n                          Choose DataSet\n                         \n                         . You can also\n                         \n                          Create New\n                         \n                         DataSets.\n                        \n\n                         To remove a DataSet from the flow, select the\n                         \n                         and choose\n                         \n                          Delete\n                         \n                         .\n                        \n\n                         After entering SQL for transforms and output DataSets, select\n                         \n                          Apply\n                         \n                         .\n                        \n\n\n\n\n\n                        The Adrenaline DataFlow has been created.\n                       \n\n\n\n                        FAQs\n                       \n\n\n                         At what input DataSet sizes should I consider Adrenaline Transformations versus other DataFlows?\n                        \n\n\n                        We recommend using Adrenaline DataFlows when you want to operate with massive input DataSets, even in the Billions of rows of input data.\n                       \n\n\n                         Are there any limits on executions for Adrenaline DataFlows?\n                        \n\n\n                        Yes, by default Adrenaline DataFlow executions are capped to a 30-min timeout.\n                        \n                         If your DataFlow is timing out, please review your dataflow transformations to remove joins on string data, filter to only the required data, and reduce the complexity of each transform.\n                        \n\n                         If your DataFlow requires additional time to complete, we can extend timeouts on a case-by-case basis. Please reach out via Support to increase execution time for your specific use case.\n                        \n\n\n\n                         Are Adrenaline DataFlows available by default?\n                        \n\n\n                        Adrenaline DataFlows are a Premium feature. Please reach out to your Domo account team to learn more about pricing plans, including a limited free trial to test out your use cases.\n                       \n\n\n                         How do I track Adrenaline DataFlows usage?\n                        \n\n\n                        DomoStats for DataFlows will provide DataFlow execution stats for Adrenaline DataFlows.\n                       \n\n\n                         How do I control access to Adrenaline DataFlows in my Domo instance?\n                        \n\n\n                        You must either be an Admin or have a role with the \"Edit Adrenaline DataFlow\" grant enabled. For more information about roles and grants, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n                         Why isn’t my data sorted correctly when I preview in the designer?\n                        \n\n\n                        In the designer, your data is optimized for rapid previewing so sorting is not applied. However, your data will be correctly sorted when your DataFlow executes.", "Preview Article": "Click here to preview", "URL Name": "360063698733", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004586", "Archived Date": "", "Language": "English", "Primary Version": "Creating an Adrenaline DataFlow", "Article Total View Count": "5,088", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Creating an Adrenaline DataFlow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               SQL DataFlows\n              \n", "url": "/s/topic/0TO5w000000Zao9GAC"}]}