{"file_path": "../../raw_kb_v2\\article\\360048925554\\index.html", "content": {"Title": "AWS Domo Verizon IoT Pipeline", "Article Body": "Creating the IoT Pipeline\n                       \n\n                        Preparation\n                       \n\n\n                         Register an account with Verizon ThingSpace. You will be provided a username, password, and billing account ID. You will also need a client ID and secret key from Verizon’s developer page.\n                         \n\n                           Reference: ThingSpace Critical Asset Sensor Pilot - Streaming Quick Start Guide - v1.3\n                          \n\n\n\n                         In addition to the Verizon ThingSpace account and developer credentials, you will need an AWS account with admin permissions to install AWS CloudFormation templates. If you do not have these permissions, you can pass these instructions to your DevOps or IT Administration team to create the AWS CloudFormation templates, or to grant permissions to your AWS user.\n                        \n\n\n                        AWS CloudFormation\n                       \n\n                        Domo has developed an AWS CloudFormation template to make deploying a complex IoT pipeline as simple as possible. This diagram describes the architecture in further detail:\n                       \n\n\n\n\n                        On the Edge, Critical Asset Sensors publish data on regular intervals into Verizon ThingSpace, which updates an AWS Thing Device Shadow document. The IoT Device Shadow Document data is selected with an IoT Rule. One rule will select from all device shadows, that have the name format ts_123456789012345, which is ts_ plus the IMEI of the device on the Edge. ThingSpace creates these device shadow documents, so no special naming is required. In addition, the pipeline will automatically scale to select any new devices in your fleet. Once they are added to your Verizon billing account and the devices are charged and turned on, Verizon will create shadows for the new devices and begin pushing data to AWS. The rule was designed to automatically select data from the new devices and ingest their data without any action from the administrator. After the data is selected by the IoT Rule, it is forwarded to an IoT Analytics Channel. This channel collects all the events from the Rule and funnels them into the data pipeline. The IoT Analytics Pipeline selects all the data attributes and normalizes the data for ingestion into the data lake. The data then passes into the IoT Analytics DataStore, where it is stored for DataSet creation. A dataset is created on a regular chron schedule of 15 minutes to ingest the IoT data in the DataStore.\n                       \n\n                        In Domo, an AWS IoT Analytics connector is created to ingest the normalized data into Domo. On a regular interval, data will be ingested into Domo. You can use Domo’s powerful ETL tools to join the data with other data sources. You can create cards and visualizations that can give more insight into your IoT data. Using these cards and dashboards, you can then create alerts to get notification when values stray out of acceptable tolerances. Using Domo Buzz, your people can connect with each other and data to have meaningful conversations about the data.\n                       \n\n                        Deploying the AWS CloudFormation Template\n                       \n\n\n                         Sign into the AWS Console. Assume a role if required by your organization’s policies. Currently the pipeline only supports regions that support AWS IoT Analytics:\n                         \n\n                           US East (Ohio)\n                          \n\n                           US East (N. Virginia)\n                          \n\n                           US West (Oregon)\n                          \n\n                           Asia Pacific (Tokyo)\n                          \n\n                           EU (Frankfurt)\n                          \n\n                           EU (Ireland)\n                          \n\n\n\n                         Click\n                         \n                          Services\n                         \n                         , then search for CloudFormation. Click on the auto-complete entry for CloudFormation.\n                        \n\n                         Click\n                         \n                          Create Stack\n                         \n                         . Select\n                         \n                          Template is ready\n                         \n                         . Under\n                         \n                          Specify Template\n                         \n                         , select\n                         \n                          Upload a template file\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Choose file\n                         \n                         and navigate to the JSON template that was provided in the POC.\n                        \n\n                         Follow the steps to deploy the CloudFormation Template.\n                        \n\n\n                        Domo Configuration App\n                       \n\n                        Domo has developed a Domo App to assist in creating the pipeline connections between Verizon and AWS. The\n                        \n                         Verizon Critical Asset Sensor Configuration Tool\n                        \n                        is deployed to your Domo instance.\n                       \n\n\n                         To create a new instance of the App, do the following:\n                         \n\n                           Log in to your Domo instance.\n                          \n\n                           Click the\n                           \n                            More\n                           \n                           icon at the top center of the menu bar.\n                          \n\n                           Click\n                           \n                            Asset Library\n                           \n                           .\n                           \n\n\n\n\n\n                           Click on the\n                           \n                            Verizon IoT Configuration Tool\n                           \n                           icon.\n                           \n\n\n\n\n\n                           Click\n                           \n                            New Card\n                           \n                           .\n                           \n\n\n\n\n\n                           With your mouse in the charcoal gray area, scroll to the bottom of the page.\n                          \n\n                           Click\n                           \n                            Account Mappings\n                           \n                           , then click\n                           \n                            Verizon\n                           \n                           .\n                           \n\n\n\n\n\n                           Click\n                           \n                            Select Account…\n                           \n                           then\n                           \n                            Add Account…\n                           \n                           . If no previous accounts were added, the display may not show\n                           \n                            Select Account…\n                           \n                           .\n                          \n\n                           Scroll to fit all the fields in your view and enter your credentials, then click\n                           \n                            Connect\n                           \n                           . After the account is mapped, scroll back up to the top and click\n                           \n                            Save and Finish\n                           \n                           . No\n                           \n                            Datapoint Mappings\n                           \n                           are required for this app.\n                          \n\n\n\n                         Saving the app should take you to your instance of the App Card. If it doesn’t, it should appear on your\n                         \n                          Overview\n                         \n                         page. This is found in the left navigation pane, which can be pinned and unpinned. If it is unpinned, mouse over to the left side and it will appear. Using the pushpin icon will pin the left navigation menu.\n                        \n\n                         Open the app card, by finding it on your\n                         \n                          Overview\n                         \n                         page and clicking the\n                         \n                          Wrench\n                         \n                         icon then clicking\n                         \n                          Details\n                         \n                         .\n                        \n\n                         The first page of the app looks like this:\n                         \n\n\n\n\n\n                         Enter your Verizon Billing Account ID and click\n                         \n                          Next\n                         \n                         . The App will display a spinner for a moment and then will show some information:\n                         \n\n                           Verizon’s AWS account ID This is Verizon’s account ID in AWS. You will need this to enable a service IAM role that Verizon will be able to assume to push IoT data into the pipeline.\n                          \n\n                           External ID The service IAM role is secured using this security string, and only allows Verizon to assume the role when this External ID matches the ID in AWS. We’ll enable this permission in AWS now.\n                          \n\n\n\n                         Sign in to AWS. Browse to IAM (Identity and Access Management). From the IAM Dashboard, click Roles in the left column. Find the IAM Service Role created by CloudFormation. The name of this role will contain \"ThingSpaceIoTServiceRole\" in its name.\n                        \n\n                         Click the\n                         \n                          Trust Relationships\n                         \n                         tab. You can see the Trusted Entity has been populated with Verizon's AWS Account ID on the right. Under\n                         \n                          Conditions\n                         \n                         , a ExternalId field is entered but has no value.\n                        \n\n                         Click\n                         \n                          Edit Trust Relationship\n                         \n                         . This displays the IAM Policy document. Paste the External ID generated in the app as the value for the field \"sts:ExternalId\". Click\n                         \n                          Update Trust Policy\n                         \n                         to save the values.\n                        \n\n                         Copy the IAM Role ARN.\n                        \n\n                         Go back to the Domo App. Click\n                         \n                          Next\n                         \n                         . Now we will create an AWS Streaming Target in Verizon ThingSpace. Select the region from the dropdown. Enter the ARN you copied in the previous step. Give the target a name and optional description. Click\n                         \n                          Next\n                         \n                         .\n                        \n\n                         Now we will create an AWS Streaming Subscription. Enter your email address for error events from ThingSpace and give the subscription a name. Click\n                         \n                          Finish\n                         \n                         .\n                        \n\n                         The last page of the App displays all the information for the resources that were created. Copy the information and save for your records. All the panels in the app are scrollable, so you can see more information if it does not fit in the view finder.\n                        \n\n                         The app is only needed to be used once to spin up the pipeline.\n                        \n\n\n                        Data should begin flowing into AWS IoT Core once you have charged and turned on the devices. To turn on the device for the first time, press and hold the touch sensitive button in the center of the device. The device does not turn off. When on battery power, the device does not flash the LED lights during beaconing to save battery.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Any Subsequent users will need to create their own app and follow the same process.", "Preview Article": "Click here to preview", "URL Name": "360048925554", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003150", "Archived Date": "", "Language": "English", "Primary Version": "AWS Domo Verizon IoT Pipeline", "Article Total View Count": "2,402", "": "", "Article Created Date": "10/24/2022, 9:10 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              AWS Domo Verizon IoT Pipeline\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}