{"file_path": "../../raw_kb_v2\\article\\1500000974662\\index.html", "content": {"title": "\n\n\n MySQL SSH Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMySQL is an open-source relational database management system. The MySQL SSH Writeback connector supports a secure connection to export your data from a Domo DataSet to the provided MySQL database. You export data to a MySQL database in the Data Center.\n\n\n You configure your Domo-MySQL connection in the Data Center. This topic discusses the fields and menus that are specific to the MySQL SSH Writeback Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nPrerequisites\n---------------\n\nTo configure this connector, you must have the following:\n\n The hostname of the server you are SSH-tunneling through\n* Your SSH server port number, username, password, private key, and private key passphrase\n* The hostname or IP address of your database server\n* Your MySQL port number, username, password, and database name\n\n*Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys generated by OpenSSL.**\n\n*Important**\n : You will need the following permissions on MySQL:\n * FILE\n* CREATE\n* DROP\n* INSERT\n* SELECT\n* UPDATE\n\nConfiguring the Connection\n----------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the MySQL SSH Writeback Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your MySQL account where you want your data to be copied to. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n SSH Server Host Name\n  |\n Enter your SSH server host name.\n  |\n|\n SSH Port Number\n  |\n Enter your SSH server port number.\n  |\n|\n SSH Username\n  |\n Enter your SSH sever username.\n  |\n|\n SSH Password\n  |\n Enter your SSH server password.\n  |\n|\n SSH Private Key\n  |\n Enter the SSH private key in PEM format (either DES or RSA).\n  |\n|\n SSH Private Key Passphrase\n  |\n Enter your SSH server private key passphrase.\n  |\n|\n MySQL JDBC Driver\n  |\n Select the MySQL JDBC driver to use.\n  |\n|\n Host\n  |\n Enter your hostname or IP address of your database server.\n  |\n|\n Port\n  |\n Enter your MySQL port number.\n  |\n|\n Username\n  |\n Enter your MySQL username.\n  |\n|\n Password\n  |\n Enter your MySQL password.\n  |\n|\n Database\n  |\n Enter your MySQL database name.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to set up a new Domo-MySQL connection. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n DataSet ID\n  |\n\nEnter your Domo dataset ID(GUID) located in the dataset URL.\n\nFor example, in the URL\n\nhttps://mycompany.domo.com/datasources/845305d8-da3d-4107-a9d6-13ef3f86d4a4/details/overview\n\n, the DataSet ID is\n\n845305d8-da3d-4107-a9d6-13ef3f86d4a4.\n\n|\n|\n How would you like to select your table?\n  |\n Specify whether you would like to create a new table or select an existing table to export your DataSet data to.\n  |\n|\n Table Name\n  |\n\nSelect whether you would like to use the\n\n\n dataset ID or a custom name for the table name.\n\n|\n|\n Custom Table Name\n  |\n Enter the name for the SQL table to write the dataset data to.\n  |\n|\n Delete existing table and create a new table with the same name\n  |\n\nSelect this checkbox if you want Domo to delete the existing table and create a new one with the same name.\n\n\n**WARNING**\n : This deletes the existing table and the data cannot be recovered once deleted.\n\n|\n|\n Existing Table\n  |\n Select the table to write the dataset data to.\n  |\n|\n Update Operation Type\n  |\n\nSelect whether you want to append data, overwrite new data, or upsert data while updating it.\n\n|\n|\n Use Column Mapping\n  |\n Select the checkbox if you wish to provide Dataset Column Name and Table Column Name mapping. If this option is selected, only those columns that are provided in the Text Areas will be updated/inserted.\n  |\n|\n Dataset Column Names\n  |\n Enter the comma separated list of Dataset Column Names.\n  |\n|\n Table Column Names\n  |\n Enter the comma separated list of Table Column Names. Table Column Names should correspond to the Dataset Column Names in the same sequence. The Number of Dataset Column Names should be equal to Table Column Names for proper mapping.\n  |\n|\n Primary Column\n  |\n Select the column name that should be primary key column.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n\nWhat kind of credentials do I need to power up this Connector?\n\n\n You need the following:\n\n\n* The hostname of the server you are SSH-tunneling through\n* Your SSH server port number, username, password, private key, and private key passphrase\n* The hostname or IP address of your database server\n* Your MySQL port number, username, password, and database name\n* You also need to s\n\nelect the MySQL JDBC driver to use\n\n\n####\n Are there any API limits I should be aware of?\n\n\n No\n\n\n####\n\nHow do I find the Input Dataset ID?\n\n\n Your Domo input dataset id is in the URL of the dataset you are exporting data from. For example:\n\nhttps://customer.domo.com/datasources/\n\n*aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee**\n /details/settings\n\nTroubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500000974662\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004002\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMySQL SSH Writeback Connector\n\n", "article_total_view_count": "\n\n\n 4,705\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "mysql_ssh_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}