{"file_path": "../../raw_kb_v2\\article\\360042930554\\index.html", "content": {"Title": "Cvent Connector", "Article Body": "Intro\n                       \n\n\n                         Cvent, Inc. is a publicly held software-as-a-service company that specializes in meetings management technology.\n                        \n                        To learn more about the Cvent API, visit their page (\n                        \n                         http://www.cvent.com/en/event-manage...grations.shtml\n                        \n                        ).\n                       \n\n                        You connect to your Cvent account in the Data Center. This topic discusses the fields and menus that are specific to the Cvent connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Use this connector to analyze and report conference metrics to learn from and optimize these large meetings.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              How many people signed up for a meeting?\n                             \n\n\n\n                              How many people actually showed up?\n                             \n\n\n\n                              How many total people attended each meeting?\n                             \n\n\n\n                              What survey feedback are we getting?\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            It varies based on the organization, but most companies will want C-level roles to have access to the data at some point.\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            1 hour\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your Cvent account and create a DataSet, you must have the following:\n                       \n\n\n\n                          Your Cvent account number. You can find this in your Cvent Administration Profile page.\n                         \n\n\n\n                          Your Cvent API username and password. You can request these credentials from Cvent.\n                         \n\n\n\n                        Before you connect to Cvent in Domo, you should whitelist the following IP addresses to your Cvent account:\n                       \n\n\n                         54.208.95.237\n                        \n\n\n\n                         54.208.87.122\n                        \n\n\n\n                         54.208.95.167\n                        \n\n\n\n                         54.208.94.194\n                        \n\n\n\n                         50.207.240.162\n                        \n\n\n\n                         50.207.241.62\n                        \n\n\n\n                         52.18.90.222\n                        \n\n\n\n                         52.62.103.83\n                        \n\n\n\n                         34.198.214.100\n                        \n\n\n\n\n                        Connecting to Your Cvent Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Cvent Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Cvent account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Cvent Account Number\n                          \n\n                           Enter your Cvent account number.\n                          \n\n\n\n                           Cvent API Username\n                          \n\n                           Enter your Cvent API username.\n                          \n\n\n\n                           Cvent API Password\n                          \n\n                           Enter your Cvent API password.\n                          \n\n\n\n                           Cvent Environment\n                          \n\n                           Select respective Environment from the dropdown. i.e. Production Account, Sandbox Account and EU Production Account.\n                          \n\n\n\n\n                        For information about obtaining these credentials, see \"Prerequisites,\" above.\n                       \n\n\n                         Once you have entered valid Cvent credentials, you can use the same account any time you go to create a new Cvent DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a single menu from which you select a Cvent report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Cvent report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Appointment\n                              \n\n                               Returns a list of appointments for the authenticated user's account.\n                              \n\n\n\n                               Appointment Attendee\n                              \n\n                               Returns a list of appointment attendees for the authenticated user's account.\n                              \n\n\n\n                               Approver\n                              \n\n                               Returns a list of approvers for the authenticated user's account.\n                              \n\n\n\n                               Budget\n                              \n\n                               Returns budget details for the authenticated user's account, such as tax type, gratuity type, etc.\n                              \n\n\n\n                               Budget Item\n                              \n\n                               Returns a list of budget items for the authenticated user's account.\n                              \n\n\n\n                               Campaign\n                              \n\n                               Returns a list of campaigns for the authenticated user's account.\n                              \n\n\n\n                               Contacts\n                              \n\n                               Returns a list of contacts for the authenticated user's account.\n                              \n\n\n\n                               Contacts Custom Details\n                              \n\n                               Returns a list of contact custom details for the authenticated user's account.\n                              \n\n\n\n                               Contact Group\n                              \n\n                               Returns a list of contact groups for the authenticated user's account.\n                              \n\n\n\n                               Conversion Rate\n                              \n\n                               Returns conversion rate information for the authenticated user's account.\n                              \n\n\n\n                               eMarketing Email History\n                              \n\n                               Returns the eMarketing email history for the authenticated user's account.\n                              \n\n\n\n                               Event\n                              \n\n                               Returns a list of events for the authenticated user's account.\n                              \n\n\n\n                               Event Cards\n                              \n\n                               Returns a list of event cards for the authenticated user's account.\n                              \n\n\n\n                               Event Details\n                              \n\n                               Returns event details for the authenticated user's account.\n                              \n\n\n\n                               Event Email History\n                              \n\n                               Returns the event email history for the authenticated user's account.\n                              \n\n\n\n                               Event Question\n                              \n\n                               Returns event questions for the authenticated user's account.\n                              \n\n\n\n                               Guest\n                              \n\n                               Returns a list of guests for the authenticated user's account.\n                              \n\n\n\n                               Invitee\n                              \n\n                               Returns a list of invitees for the authenticated user's account.\n                              \n\n\n\n                               Meeting Request\n                              \n\n                               Returns a list of meeting requests for the authenticated user's account.\n                              \n\n\n\n                               Meeting Request Custom Details\n                              \n\n                               Returns meeting request custom details for the authenticated user's account.\n                              \n\n\n\n                               Meeting Request Sleeping Room Details\n                              \n\n                               Returns meeting request sleeping room details for the authenticated user's account.\n                              \n\n\n\n                               Meeting Request User\n                              \n\n                               Returns a list of meeting request users for the authenticated user's account.\n                              \n\n\n\n                               Meeting Request Survey\n                              \n\n                               Returns a list of meeting request surveys for the authenticated user's account.\n                              \n\n\n\n                               Proposal\n                              \n\n                               Returns a list of proposals for the authenticated user's account.\n                              \n\n\n\n                               Proposal Sleeping Room\n                              \n\n                               Returns a list of proposal sleeping rooms for the authenticated user's account.\n                              \n\n\n\n                               Proposal Estimated Costs\n                              \n\n                               Returns a list of guests for the authenticated user's account.\n                              \n\n\n\n                               Rate History\n                              \n\n                               Returns the rate history for the authenticated user's account.\n                              \n\n\n\n                               Registration\n                              \n\n                               Returns registration information for the authenticated user's account.\n                              \n\n\n\n                               Registration with Order Details\n                              \n\n                               Returns registration information with order details for the authenticated user's account.\n                              \n\n\n\n                               Registration with Survey Details\n                              \n\n                               Returns registration with survey details for the authenticated user's account.\n                              \n\n\n\n                               Respondent\n                              \n\n                               Returns a list of respondents for the authenticated user's account.\n                              \n\n\n\n                               Response\n                              \n\n                               Returns a list of responses for the authenticated user's account.\n                              \n\n\n\n                               RFP\n                              \n\n                               Returns RFP details for the authenticated user's account.\n                              \n\n\n\n                               RFP Meeting Room Details\n                              \n\n                               Returns RFP meeting room details for the authenticated user's account.\n                              \n\n\n\n                               RFP Question Details\n                              \n\n                               Returns RFP question details for the authenticated user's account.\n                              \n\n\n\n                               RFP Sleeping Room Details\n                              \n\n                               Returns RFP sleeping room details for the authenticated user's account.\n                              \n\n\n\n                               RFP Supplier Details\n                              \n\n                               Returns RFP supplier details for the authenticated user's account.\n                              \n\n\n\n                               Session\n                              \n\n                               Returns session details for the authenticated user's account.\n                              \n\n\n\n                               Speaker\n                              \n\n                               Returns a list of speakers for the authenticated user's account.\n                              \n\n\n\n                               Supplier\n                              \n\n                               Returns a list of suppliers for the authenticated user's account.\n                              \n\n\n\n                               Supplier Proposal\n                              \n\n                               Returns a list of supplier proposals for the authenticated user's account.\n                              \n\n\n\n                               Supplier RFP\n                              \n\n                               Returns supplier RFP details for the authenticated user's account.\n                              \n\n\n\n                               Survey\n                              \n\n                               Returns a list of surveys for the authenticated user's account.\n                              \n\n\n\n                               Survey Email History\n                              \n\n                               Returns the survey email history for the authenticated user's account.\n                              \n\n\n\n                               Survey Question\n                              \n\n                               Returns a list of survey questions for the authenticated user's account.\n                              \n\n\n\n                               Table Assignment\n                              \n\n                               Returns a list of table assignments for the authenticated user's account.\n                              \n\n\n\n                               Transaction\n                              \n\n                               Returns a list of transactions for the authenticated user's account.\n                              \n\n\n\n                               User\n                              \n\n                               Returns a list of users for the authenticated user's account.\n                              \n\n\n\n                               User Group\n                              \n\n                               Returns a list of user groups for the authenticated user's account.\n                              \n\n\n\n                               User Role\n                              \n\n                               Returns a list of user roles for the authenticated user's account.\n                              \n\n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n                        Check your credentials to make sure you have the proper access rights.", "Preview Article": "Click here to preview", "URL Name": "360042930554", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003397", "Archived Date": "", "Language": "English", "Primary Version": "Cvent Connector", "Article Total View Count": "2,418", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Cvent Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}