{"file_path": "../../raw_kb_v2\\article\\360042926994\\index.html", "content": {"Title": "Marin Social Connector", "Article Body": "Intro\n                       \n\n                        Marin Social is a powerful campaign management, reporting, and optimization solution that helps you scale your programs, make better decisions, and acquire high-value customers across social networks. Use Domo's Marin Social connector to retrieve data about campaigns, clients, advertisements, and so on. To learn more about the Marin Social API, you can download their API documentation here:\n                        \n                         http://kb.socialmoov.com/wp-content/uploads/2015/09/API-Documentation_2.1.7.docx\n                        \n                        .\n                       \n\n                        You connect to your Marin Social account in the Data Center. This topic discusses the fields and menus that are specific to the Marin Social connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Marin Social account and create a DataSet, you must have a Marin Social API key. You should receive an API key upon creating a Marin Social account.\n                       \n\n                        Connecting to Your Marin Social Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Marin Social Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Marin Social account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Marin Social API key.\n                          \n\n\n\n\n\n                         Once you have entered valid Marin Social credentials, you can use the same account any time you go to create a new Marin Social DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Marin Social report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Accounts\n                              \n\n                               Returns all accounts for your agency.\n                              \n\n\n\n                               Account Audiences\n                              \n\n                               Returns all audiences for a selected account ID.\n                              \n\n\n\n                               Account Lead Forms\n                              \n\n                               Returns all lead forms for a selected account ID.\n                              \n\n\n\n                               Ad Statistics\n                              \n\n                               Returns ad statistics for a given client ID, campaign ID, ad ID, and timeframe.\n                              \n\n\n\n                               Advertisers\n                              \n\n                               Returns all advertisers for your agency.\n                              \n\n\n\n                               Campaigns\n                              \n\n                               Returns all campaigns for your account.\n                              \n\n\n\n                               Campaign Ads\n                              \n\n                               Returns all campaign ads for a given client ID and campaign ID.\n                              \n\n\n\n                               Campaign Statistics\n                              \n\n                               Returns campaign statistics for a given client ID, campaign ID, level, and timeframe.\n                              \n\n\n\n                               Clients\n                              \n\n                               Returns all clients for your account.\n                              \n\n\n\n                               Client Campaigns\n                              \n\n                               Returns all client campaigns for a given client ID.\n                              \n\n\n\n                               Client Users\n                              \n\n                               Returns all client users for a given client ID.\n                              \n\n\n\n                               Funding Instruments\n                              \n\n                               Returns all funding instruments for a given account ID.\n                              \n\n\n\n                               Objects\n                              \n\n                               Returns all funding instruments for a given object ID.\n                              \n\n\n\n                               Statistics\n                              \n\n                               Returns statistics for a given client ID, level, and timeframe.\n                              \n\n\n\n                               Users\n                              \n\n                               Returns all users for your account.\n                              \n\n\n\n\n\n\n\n                           Account ID\n                          \n\n                           Select the IDs for all accounts you want to retrieve information for.\n                          \n\n\n\n                           Client ID\n                          \n\n                           Select the IDs for all clients you want to retrieve information for.\n                          \n\n\n\n                           Campaign ID\n                          \n\n                           Select the IDs for all campaigns you want to retrieve information for.\n                          \n\n\n\n                           Ad ID\n                          \n\n                           Select the IDs for all ads you want to retrieve information for.\n                          \n\n\n\n                           Time\n                          \n\n                           Select whether you want data in your report to be broken down by day, month, or period.\n                          \n\n\n\n                           Level\n                          \n\n                           Select the reporting level for the data.\n                          \n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042926994", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003739", "Archived Date": "", "Language": "English", "Primary Version": "Marin Social Connector", "Article Total View Count": "2,353", "": "", "Article Created Date": "10/24/2022, 9:14 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Marin Social Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}