{"file_path": "../../raw_kb_v2\\article\\360052122294\\index.html", "content": {"title": "\n\n\n About Partition Connectors\n\n\n", "article_body": "\n\nIntro​\n--------\n\nPartitioning is the database process where very large tables are divided into multiple smaller parts. By splitting a large table into smaller and individual tables, queries that access only a fraction of the data can run faster because there is less data to scan.\n\n\n Use Domo's Partition connectors to retrieve your data faster as Domo supports date partitioning and reduces the number of API calls. The main goal of partitioning is to aid in the maintenance of large tables and to reduce the overall response time to read and load the data for specific operations. Partitioning enables faster query execution and distribution of files over multiple storage devices.\n\n\n Domo supports Partitioning feature for the database connectors like MariaDB, Amazon Redshift, MySQL, IBM Informix, Amazon Aurora, IBM DB2, Oracle Database, Snowflake, Vertica, Amazon Athena, PostgreSQL, Google Analytics, and more.\n\n##\n Frequently Asked Questions\n\nWhy should I prefer using a Partition connector over a regular connector?\n\n\n Partition connector supports data partitioning, thus optimizes your database performance while maintaining data integrity. A Partition connector will always fetch your data faster using the date partitioning and will reduce the number of API calls. In some partition connectors, you can specify the partition column name if you want partitioning to be done on a specific column.\n\n###\n What are the benefits of partitioning data?\n\nData partitioning has the following advantages:\n\n Improves query performance and manageability\n* Simplifies common administration tasks\n* Acts as a key tool for building systems with extremely high availability requirements\n* Allows accessing a large part of a single partition\n\n\n####\n How the data is partitioned in Domo?\n\nDomo supports Date partitioning.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360052122294\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003983\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAbout Partition Connectors\n\n", "article_total_view_count": "\n\n\n 4,944\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "about_partition_connectors", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "partition_connectors", "url": "/s/topic/0TO5w000000ZapAGAS"}]}