{"file_path": "../../raw_kb_v2\\article\\360042933614\\index.html", "content": {"Title": "Form Viewer App", "Article Body": "Intro\n                       \n\n                        Form Viewer is a free app you can use to view, edit, and submit forms.  Use the\n                        \n                         Form Builder App\n                        \n                        to create forms and templates, and then use Form Viewer to enter data into those forms. You can download and install both apps from the Domo Appstore.\n                       \n\n                        Form Viewer can exist on one or more Domo dashboards. The response data from Form Viewer is stored in App DB, and then synced to the Domo Data Center. Typically, you must then transform the data in Domo.\n                       \n\n                        This article details the configuration process for the Form Viewer app. If you are creating multiple instances of Form Viewer, we strongly recommend that you complete the configuration process once, for a single instance of Form Viewer, and then choose\n                        \n                         Save As\n                        \n                        to create another app card so that you do not have to go through the configuration process again.\n                       \n\n                        After creating and configuring a form, you can make it available in your Domo instance or use public embed to make it available for non-Domo users. For more information about public embed, see the\n                        \n                         Public Embed\n                        \n                        heading later in this article and our article on\n                        \n                         Sharing Content Outside of Domo with Embed\n                        \n                        .\n                       \n\n                        Each user can only interact with one form in an instance of Form Viewer, but you can make multiple submissions to that form and return to edit submissions anytime unless the form is deleted, depending on the configuration in the\n                        \n                         Form Builder App\n                        \n                        . To learn more, see\n                        \n                         Previous Submissions\n                        \n                        , below.\n                       \n\n                        To learn about how the response data is collected, see the heading for\n                        \n                         Response DataSets\n                        \n                        .\n                       \n\n                        Configuration\n                       \n\n                        Begin by downloading Form Viewer from the Appstore.\n                       \n\n\n\n                        When you download the app, Domo creates a dashboard for it automatically. You can add additional cards for the app from the Domo\n                        \n                         Asset Library\n                        \n                        .\n                       \n\n\n                        Connecting to the FormDefinition DataSets\n                       \n\n                        When you configure Form Builder for the first time, a series of FormDefinition DataSets are created that display in the Data Center. When you deploy Form Viewer for the first time, it has a series of placeholder DataSets. To use Form Viewer, you must disconnect from its placeholder DataSets and connect to the FormDefinition DataSets created by Form Builder.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           After you connect to the FormDefinition DataSets for one instance of Form Viewer, we strongly recommend that you\n                           \n                            Save As\n                           \n                           if you want to create other instances of Form Viewer to avoid needing to complete the configuration process again.\n                          \n\n\n\n\n                        There are nine FormDefinition DataSets, as follows:\n                       \n\n\n                         ExportForms\n                        \n\n                         ExportGroups\n                        \n\n                         ExportTags\n                        \n\n                         ExportSubmittedUsers\n                        \n\n                         ExportSections\n                        \n\n                         ExportItems\n                        \n\n                         ExportColumns\n                        \n\n                         ExportFilters\n                        \n\n                         ExportPreviousResponseItems\n                        \n\n\n                        When you first open a new instance Form Viewer, there is an option to connect to the Form Definition DataSets from a ribbon at the top of the screen, shown here.\n                       \n\n\n\n\n                        If you close the ribbon or come back to connect the DataSets at another time, the ribbon may not display. In that case, follow the steps below to connect Form Viewer to the FormDefinition DataSets.\n                       \n\n\n                         Navigate to your instance of Form Viewer.\n                        \n\n                         Hover over the app card to display\n                         \n\n                          Card options\n                         \n                         in the top ribbon.\n                        \n\n                         Select\n                         \n                          Card options\n                         \n                         >\n                         \n                          Edit Card\n                         \n                         .\n                         \n                         The card editor displays.\n                        \n\n                         (Optional) Check the box for\n                         \n                          Fullpage\n                         \n                         if you want to see the full page of the app as you edit.\n                         \n\n\n\n\n\n                          Go to the bottom of the card editor screen to view the data\n                          \n                           Mapping\n                          \n                          area. There are two tabs:\n                          \n                           DataSets\n                          \n                          and\n                          \n                           Collections\n                          \n                          .\n                          \n                          During the configuration process, if you see a red indicator like the one shown below for either tab, it means there is an issue with the mapping for that tab.\n                         \n\n\n\n\n\n                         In the\n                         \n\n                          DataSets\n                         \n                         tab, select the DataSet list at the top of the tab to view and search for the FormDefinition DataSets.\n                         \n\n\n\n\n                         Select the first of the FormDefinition DataSets, as listed above.\n                         \n                         The target DataSet and column mappings should fill in appropriately in the card editor, but if you need to change anything, you can do it here.\n                         \n\n\n\n\n\n\n\n                         Select the DataSet list again and select the next FormDefinition DataSet. Repeat steps 6–7 to connect to all nine of the FormDefinition DataSets.\n                        \n\n                         Select\n                         \n                          Save & Finish\n                         \n                         before navigating away from the card editor.\n                         \n\n\n\n\n\n                        Configuring Collections\n                       \n\n                        In\n                        \n                         Mapping\n                        \n                        , the\n                        \n                         Collections\n                        \n                        tab allows you to view the four collections for Form Viewer, shown here:\n                       \n\n\n                         AppData\n                        \n\n                         UserSettings\n                        \n\n                         FormSessions\n                        \n\n                         StyleConfig\n                        \n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           You need to configure the collections before using Form Viewer. For a new app card, you can do this by toggling the switch to\n                           \n                            Automatically create un-configured collections with app defaults\n                           \n                           at the top of the\n                           \n                            Collections\n                           \n                           tab. If you don't see this option when creating a new app card, contact\n                           \n                            Domo Support\n                           \n                           .\n                           \n                           When you are creating a new instance of Form Viewer, if you\n                           \n                            Save As\n                           \n                           from an existing version, the collections are already configured.\n                          \n\n\n\n\n                        Fixing a Collections Error\n                       \n\n                        If you see a red error indicator by the\n                        \n                         Collections\n                        \n                        tab, follow the steps below.\n                       \n\n\n                         Select the collections list.\n                         \n\n\n\n\n                         Select the collection that you need to configure. Any collections that aren't connecting display a warning sign.\n                        \n\n                         Select the button that displays the\n                         \n\n                           Collection Name\n                          \n\n                         .\n                         \n\n\n\n\n                         Make any needed changes.\n                        \n\n                         Select\n                         \n                          Save & Finish\n                         \n                         before navigating away from the card editor.\n                         \n\n\n\n\n                       If you cannot find the errored collection or need other assistance, contact\n                       \n                        Domo Support\n                       \n                       .\n                       \n\n\n                        Selecting a Form to Display\n                       \n\n                        After you have configured your instance of Form Viewer and saved your changes, a list of available forms to display appears in Form Viewer.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Because only one form can display in an instance of Form Viewer, the form you choose is permanent in this instance. To view a different form, you must create a new instance of the Form Viewer app card or enter your responses via Form Builder.\n                          \n\n\n\n\n                        Follow the steps below to set up the form to display.\n                       \n\n\n                         Locate the form you want to display in the list and select it. A preview of the first page of the form displays.\n                        \n\n                         Use the preview to verify that you have the correct form.\n                        \n\n                         Click\n                         \n                          Select Form\n                         \n                         .\n                         \n                         A dialog displays to confirm your form selection and ask if you want to enable Public Embed for the form. When you check the box and enable the form for Public Embed, a warning displays that the change is permanent.\n                         \n                          To learn more about public embed, see the\n                          \n                           Public Embed\n                          \n                          heading later in this article, or our article on\n                          \n                           Sharing Content Outside of Domo with Embed\n                          \n                          .\n                         \n\n\n\n\n\n                         Select\n                         \n                          Confirm\n                         \n                         .\n                        \n\n\n                        Customize Form Appearance\n                       \n\n                        Admins can customize the following aspects of your instance of Form Viewer by adjusting the\n                        \n                         Application Settings\n                        \n                        :\n                       \n\n\n\n                          Submission Notification —\n                         \n                         Select whether the notification for a form submission displays as full screen, popup, or none.\n                        \n\n\n\n                           New Submission Button —\n                          \n                          Edit the text that displays on the\n                          \n                           New Submission\n                          \n                          button (up to 25 characters).\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Make sure to select\n                           \n                            Save\n                           \n                           to save your changes to these items before continuing.\n                           \n\n\n\n\n\n\n\n                          Form details —\n                         \n                         Adjust the color and icon size for the header; the form background color; the size of field borders; and adjust color, font, size, and style for the various text, sections, and buttons in your form.\n                        \n\n\n                        There is a\n                        \n                         Preview\n                        \n                        of your edited form available.\n                       \n\n\n\n\n                        Admins can follow the steps below to access and edit these settings.\n                       \n\n\n                         From the default page of Form Viewer, hover over the app card until\n                         \n                          Card options\n                         \n                         displays.\n                        \n\n                         Select\n                         \n                          Card options\n                         \n                         >\n                         \n                          Edit Card\n                         \n                         .\n                         \n                         The card editor screen displays.\n                        \n\n                       Make sure to select\n                       \n                        Save & Finish\n                       \n                       before navigating away from the card editor.\n                       \n\n\n                        Public Embed\n                       \n\n                        Making your form available in a public space can be a powerful data collection tool. However, there are also a few steps you need to take to make sure it's done correctly.\n                       \n\n                        Enable Public Embed During Setup\n                       \n\n                        Before you create the public embed URL, while\n                        \n                         selecting the form to display\n                        \n                        , you need to check the box to indicate that you want to embed the form publicly. When you check the box and enable the form for Public Embed, a warning displays that the change is permanent.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Checking the box for Public Embed means the following:\n                           \n\n\n\n                               The collections for the form are write-only for all users\n                              \n\n\n\n\n\n                               You are restricted from selecting a multi-session form because you can't fetch the existing sessions.\n                              \n\n\n\n\n                              Anyone can submit a response if they're viewing the response from the public embed URL.\n                             \n\n\n\n                              You cannot resume an existing session with the form. If you navigate away, you lose your responses.\n                             \n\n\n\n                              You cannot resume a session started on a different device.\n                             \n\n\n\n                              You are restricted from using/viewing your previous responses.\n                             \n\n\n\n                              You have permissions for the form equal to those of the person who enabled Public Embed. Learn about\n                              \n                               Proper Ownership\n                              \n                              below.\n                             \n\n\n                           If you DON'T check the box, but still enable the card for Public Embed, the app displays an error and does not allow anyone to submit a response from the Public Embed URL.\n                          \n\n\n\n\n\n\n\n\n\n                        Proper Ownership\n                       \n\n                        When preparing a publicly embedded form, the person who creates the public embed URL and the person who configures Form Viewer and chooses the form to display should be distinct from one another.\n                       \n\n                        For example, Person A creates and configures the instance of Form Viewer and choose the form to display. A different individual, Person B, should create the public embed URL. Additionally, Person B in this situation should\n                        \n                         not\n                        \n                        be assigned a privileged role.\n                       \n\n                        To learn more, please reference our article on\n                        \n                         Sharing Content Outside of Domo with Embed\n                        \n                        .\n                       \n\n\n\n                        Previous Submissions\n                       \n\n                        If a form is set up to allow previous submissions to be viewed (you can do this in\n                        \n                         Form Builder\n                        \n                        ), and there are previous submissions to the form, then the default screen for an instance of Form Viewer displaying that form is the\n                        \n                         Previous submissions\n                        \n                        page.\n                       \n\n                        Under\n                        \n                         Previous submissions\n                        \n                        , you can see a list of previews of previous submissions to the form with the fields that were configured in Form Builder as part of the preview. Select the submission to view it.\n                       \n\n\n\n\n                        Editing and Deleting Submissions\n                       \n\n                        These options are only available if a form is set up in\n                        \n                         Form Builder\n                        \n                        to allow previous submissions to be edited and/or deleted.\n                       \n\n\n                         If the form is set up to allow previous submissions to be edited, a user can edit any of their previous submissions by selecting the submission and making any changes. After making any changes, select\n                         \n                          Done\n                         \n                         to be redirected back to the\n                         \n                          Previous Submissions\n                         \n                         page.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Users are the only ones who can edit their own previous submissions. Form owners and admins may view all submissions, but can only edit their own submissions.\n                            \n\n\n\n\n\n\n\n                         If the form is set up to allow previous submissions to be deleted, you can delete any of the previous submissions by selecting\n                         \n\n                          Delete\n                         \n                         .\n                        \n\n\n\n\n                        Response DataSets\n                       \n\n                        You can use one form that you create in Form Builder to collect data, whether in one or more instances of Form Viewer, or in Form Builder itself. All responses from different instances of either app appear in different DataSets. If more than one user enters data into the form from the same instance of the app, that data appears in the same DataSet.\n                       \n\n                        Example\n                       \n\n                        Person A and Person B each use a separate instance of Form Viewer to enter data into the same form.\n                        \n                        Person C, who created the form, also enters data into the form from Form Builder.\n                        \n                        Person D enters data into the form from the same instance of Form Viewer as Person A.\n                        \n\n                        In this example, there would be three DataSets of responses:\n                       \n\n\n                         Responses from Person A and Person D\n                        \n\n                         Responses from Person B\n                        \n\n                         Responses from Person C\n                        \n\n\n                        By default, each of the response DataSets have the following naming convention:\n                       \n\n                        <\n                        \n                         form name\n                        \n                        > Responses - <\n                        \n                         GUID of form\n                        \n                        >_<\n                        \n                         GUID of instance of Form Builder or Viewer\n                        \n                        >\n                       \n\n                        To learn more about the response data, see\n                        \n                         Understanding Form Response Data\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042933614", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004206", "Archived Date": "", "Language": "English", "Primary Version": "Form Viewer App", "Article Total View Count": "5,326", "": "", "Article Created Date": "10/24/2022, 9:27 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Form Viewer App\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}