{"file_path": "../../raw_kb_v2\\article\\360042932954\\index.html", "content": {"Title": "Writing Amazon Kinesis Data to Domo", "Article Body": "Intro\n                       \n\n                        You can write the data being pushed to your Amazon Kinesis Stream into a Domo DataSet, using an Amazon Lambda function and a Domo JSON Webhook DataSet.\n                        \n\n\n\n\n                        Prerequisites\n                       \n\n                        To write data from a Kinesis Stream to Domo, you will need the following:\n                       \n\n\n\n                          a Kinesis Stream receiving data in JSON format, with one JSON object per Kinesis record\n                         \n\n\n\n                          an active Domo instance\n                         \n\n\n\n                        Step 1 – Create a JSON Webhook DataSet\n                       \n\n                        Data pushed to Kinesis will be copied into a JSON Webhook dataset. Follow these instructions to create this DataSet:\n                       \n\n\n\n                          In the Domo Appstore, find and click on the JSON Webhook connector.\n                         \n\n\n\n                          Click\n                          \n                           Get the Data\n                          \n                          .\n                         \n\n\n\n                          Copy and save the link in the\n                          \n                           Webhook URL\n                          \n                          field. (Note that you cannot change this field.)\n                          \n\n\n\n\n\n\n                          (Optional) If you want a secret credential to be required for the Webhook when data is sent to it, enter it into the\n                          \n                           Webhook Secret\n                          \n                          field. (For the remainder of these steps, we will assume a Webhook Secret is not being used.)\n                         \n\n\n\n                          Select whether the DataSet will Append or Replace. It is set to Append by default, which is typically what Kinesis users need.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Name your DataSet and click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        Your DataSet will appear to run, but there won’t be any data in it. It will only contain data after JSON data is sent to the Webhook URL. The system will automatically check for any new data every 15 minutes. Selecting\n                        \n                         Run DataSet\n                        \n                        will not speed up the process.\n                       \n\n                        Step 2 – Create an Amazon Lambda Function\n                       \n\n                        To get data from the Kinesis Stream into the Webhook, you will use an Amazon Lambda function. This is a small JavaScript function which will be called whenever new data is pushed to your Kinesis Stream. The function will consolidate all the new Kinesis records into a single JSON array and send that data to the Webhook. Each record will become a single row in the Domo DataSet.\n                       \n\n                        Follow these instructions to create the Lambda Function:\n                       \n\n\n\n                          In the AWS Management Console, choose the Lambda service. (Note that your AWS UI may be slightly different.)\n                          \n\n\n\n\n\n\n                          In the menu on the left, choose\n                          \n                           Functions\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Create function\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Fill out the fields to author the function from scratch:\n                         \n\n\n\n                            Name – Give your function a descriptive, memorable name.\n                           \n\n\n\n                            Runtime – Select the language your function will use. This tutorial uses Node.js 8.10. Note that it is also possible to create functions using Java, C#, Go, Python, or Ruby.\n                           \n\n\n\n                            Role – Select\n                            \n                             Choose an existing role\n                            \n                            . Work with your AWS administrator to make sure that there is a role appropriate for this function. The role needs to be able to read from Kinesis, write to CloudWatch (for logging), and make HTTPS calls.\n                            \n\n\n\n\n\n\n\n\n                          Click\n                          \n                           Create function\n                          \n                          .\n                         \n\n\n\n                          After the Lambda function has been created, add Kinesis as a trigger to it by selecting\n                          \n                           Kinesis\n                          \n                          from the menu on the left of the screen.\n                          \n\n\n\n\n\n\n                          Configure the trigger by filling out the required fields. Generally, the default values are acceptable:\n                         \n\n\n\n                            Kinesis stream – Select the Stream that you want to use to trigger this function. This is the stream that is getting the data you want to copy to Domo.\n                           \n\n\n\n                            Consumer – Leave this as\n                            \n                             No consumer\n                            \n                            .\n                           \n\n\n\n                            Batch Size – You can adjust this based on how much data your Kinesis Stream has to handle. To start, leave it at 100.\n                           \n\n\n\n                            Starting Position – Set this to\n                            \n                             Latest\n                            \n                            . That way, the function will be given the most recent data in the Kinesis Stream.\n                           \n\n\n\n                            Enable Trigger – Make sure this box is checked.\n                           \n\n\n\n\n\n                          Click\n                          \n                           Add\n                          \n                          .\n                         \n\n\n\n                          Click the name of the Function so that the Function Code panel appears.\n                          \n\n\n\n\n\n\n                          Set the code fields to the following:\n                         \n\n\n\n                            Code entry type – Edit code inline\n                           \n\n\n\n                            Runtime – Node.js 8.10\n                           \n\n\n\n                            Handler – index.handler\n                           \n\n\n\n\n\n                          The code window should show a file called\n                          \n                           index.js\n                          \n                          . Replace all of the code in that file with the following:\n                         \n\n\n                           /**\n                           \n                           * Stream data from AWS Kinesis to Domo via Webhook\n                           \n                           */\n                          \n\n\n\n                           'use strict';\n                          \n\n\n\n                           const https = require('https');\n                          \n\n\n\n                           // This is called when the Lambda function is triggered.\n                           \n                           // It should be configured to be triggered by data in a Kinesis Stream\n                           \n                           exports.handler = (event, context, callback) => {\n                           \n                           let count = 0;\n                          \n\n\n\n                           // Build an array of all of the JSON objects that came in from Kinesis\n                           \n                           let collectedData = [];\n                           \n                           event.Records.forEach((record) => {\n                           \n                           // Kinesis data is base64 encoded so decode here\n                           \n                           const data = new Buffer(record.kinesis.data, 'base64').toString('ascii');\n                           \n                           // console.log('Decoded payload:', JSON.stringify(data, null, 2));\n                           \n                           console.log('Decoded payload:', data);\n                          \n\n\n\n                           // Assumes that each Kinesis record contains only 1 JSON object\n                           \n                           let item = JSON.parse(data);\n                           \n                           collectedData[count] = item;\n                          \n\n\n\n                           count += 1;\n                           \n                           });\n                          \n\n\n\n                           // The array of objects will be passed to the webhook in a single POST call\n                           \n                           let postData = JSON.stringify(collectedData);\n                           \n                           let options = {\n                           \n                           host: process.env.WEBHOOK_HOST, // Should generally be \"\n                           \n                            webhooks.demo.domo.com\n                           \n                           \"\n                           \n                           path: process.env.WEBHOOK_ENDPOINT, // Should be the rest of the webhook URL given by Domo\n                           \n                           method: 'POST',\n                           \n                           headers: {\n                           \n                           'Content-Type': 'application/json',\n                           \n                           'Content-Length': postData.length\n                           \n                           }\n                           \n                           };\n                          \n\n\n\n                           const req = https.request(options, (res) => {\n                           \n                           console.log('statusCode: ' + res.statusCode);\n                          \n\n\n\n                           res.on('data', (d) => {\n                           \n                           console.log('data: ' + d);\n                           \n                           })\n                          \n\n\n\n                           });\n                          \n\n\n\n                           req.on('error', (e) => {\n                           \n                           console.error('*** ERROR ***');\n                           \n                           console.error(e);\n                           \n                           });\n                          \n\n\n\n                           req.write(postData);\n                          \n\n\n\n                           req.end();\n                          \n\n\n\n                           console.log('Pushed ' + count + ' record(s) to the webhook');\n                           \n                           };\n                          \n\n\n\n\n                          Below the code window, add two environment variables:\n                         \n\n\n\n\n                             WEBHOOK_HOST\n                            \n                            – This should be the domain in the Webhook URL given in the DataSet you created in step 1 of these instructions. It will typically be\n                            \n\n                              webhooks.domo.com\n                             \n\n                            .\n                           \n\n\n\n\n                             WEBHOOK_ENDPOINT\n                            \n                            – This should be everything in the Webhook URL starting with “\n                            \n                             /streams\n                            \n                            ”. This will be a very long alphanumeric string of characters.\n                            \n\n\n\n\n\n\n\n\n                          From the menu in the editor, select\n                          \n                           File --> Save\n                          \n                          .\n                         \n\n\n\n                          At the top of the screen, click\n                          \n                           Save\n                          \n                          to save all changes to your Lambda function.\n                         \n\n\n\n                        Now, whenever data is pushed into your Kinesis Stream, this Lambda function will run. The function will take the individual Kinesis records, combine them into a single JSON array, and pass that JSON array to the Webhook dataset via an HTTPS POST call. This will copy your data into Domo.", "Preview Article": "Click here to preview", "URL Name": "360042932954", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003158", "Archived Date": "", "Language": "English", "Primary Version": "Writing Amazon Kinesis Data to Domo", "Article Total View Count": "2,461", "": "", "Article Created Date": "10/24/2022, 9:10 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Writing Amazon Kinesis Data to Domo\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}