{"file_path": "../../raw_kb_v2\\article\\360043434453\\index.html", "content": {"title": "\n\n\n Google Plus Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n**Important:**\n Google+ APIs have been shut down as of\n **March 7, 2019**\n . For more information, visit:\n\nhttps://developers.google.com/+/api-shutdown\n\n\n Google+ is a social network and social layer for Google services. Use Domo's Google+ connector to retrieve data about activity streams, comments, and people. To learn more about the Google+ API, visit their page (\n\nhttps://developers.google.com/+/api/\n\n).\n\n\n This Advanced version of the Google+ connector provides more reports than the simplified version as well as more advanced configuration options. It also lets you pull more than 30 days worth of data. To learn more about the simplified version, see\n\nGoogle+ Connector\n\n.\n\n\n The Google+ Advanced connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Google+ Advanced account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the Google+ Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is useful for helping you track the performance of your social media efforts.\n  |\n|\n**Primary Metrics**\n | * Likes\n* Follows\n* Shares\n* Impressions\n* Reach\n* Engagement\n |\n|\n**Primary Company Roles**\n | * Social campaign manager\n* Marketing director\n |\n|\n**Average Implementation Time**\n |\n Less than an hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 3\n  |\n\nPrerequisites\n---------------\n\nTo connect to a Google+ account and create a DataSet, you must have the password for the account you want to connect to.\n\n\n Connecting to Your Google+ Account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google+ Advanced Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google+ Advanced connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google accounts in Domo) to open the Google OAuth screen where you can select the account you want to connect to. After selecting an account, you are asked for the password for that account. Once you have entered a valid password, you can use the same account any time you go to create a new Google+ DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of the currently active Google account.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select a Google+ Advanced report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Activity Details\n  |\n Returns information about the activity with the provided activity ID. For information about obtaining an activity ID, see\n\nFAQs\n\n.\n  |\n|\n Comment Details\n  |\n Returns information about the comment with the provided comment ID. For information about obtaining a comment ID, see\n\nFAQs\n\n.\n  |\n|\n In Your Circles Count (Deprecated)\n  |\n Returns the total number of users in the authenticated user's circles.\n *This report is no longer supported by Google*\n .\n  |\n|\n List of Activities\n  |\n Returns a list of posts for the authenticated user, along with the number of comments and \"+1\"s each post received.\n  |\n|\n List of People Details\n  |\n Returns details about users in the authenticated user's circle.\n  |\n|\n List of Moments (Deprecated)\n  |\n Returns a list of the authenticated user's actions, such as making a purchase or commenting on a blog.\n *This report is no longer supported by Google*\n .\n  |\n|\n Specific Person Details\n  |\n Returns information about the selected user.\n  |\n\n\n |\n|\n Activity ID\n  |\n Enter the ID for the activity you want to retrieve data for. You can find activity IDs for a specific user by running the\n **List of Activities**\n report.\n  |\n|\n Comment ID\n  |\n Enter the ID of the comment you want to retrieve data for. You can find comment IDs by running the\n **Comments**\n report.\n  |\n|\n User ID\n  |\n Select the ID for the user in your circle you want to retrieve information for. Select\n **me**\n to retrieve data for the authenticated user.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for all time, a specific date, or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nIf you run into problems, check credentials and permissions.\n\n\n FAQs\n------\n\n\n####\n How do I know my Google+ credentials are secure?\n\nThe connector uses OAuth, which authenticates the account with Google without Domo ever having to access your Google account credentials.\n\n###\n Do I need a certain kind of account?\n\nAny Google account that has Google+ enabled can be used.\n\n###\n How frequently will my data update?\n\nChanges to your data are available almost immediately; however, it is recommend you run your DataSets every 24 hours.\n\n###\n Where do I get an Activity ID for the \"Activity Details\" report?\n\nThe Activity ID can be found by running the \"List of Activities\" report and copying the value found in the \"ID\" column.\n\n###\n Where do I get a Comment ID for the \"Comment Details\" report?\n\nThe Comment ID can be found by running the \"List of Comments\" report and copying the value found in the \"ID\" column.\n\n###\n Why does the \"In Your Circles Count\" report say I have 0 people in my circles?\n\nGoogle disabled this report on its side. It is still available in the connector to keep existing reports from breaking.\n\n###\n Are there any API limits I should be aware of?\n\nGoogle allows roughly 5 queries per second per user. Note that a single DataSet run may require multiple queries.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043434453\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003482\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Plus Advanced Connector\n\n", "article_total_view_count": "\n\n\n 4,639\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_plus_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}