{"file_path": "../../raw_kb_v2\\article\\000005156\\index.html", "content": {"Title": "Variance Chart", "Article Body": "Intro\n                       \n\n                        Unlike other chart types that show data directly, variance charts show the differences between two sets of data, such as actual versus budget or actual versus forecast.\n                       \n\n                        Below are two charts. The first shows sales versus budget data as a simple two-line chart, while the second shows the same data as a variance chart. Notice that the variance chart highlights the delta, or difference, data. This is useful when you want to analyze differences between lines.\n                       \n\n\n\n\n\n\n\n\n                        Powering Variance Charts\n                       \n\n                        A variance chart requires a `Date` field and an `Actual` value. Although not required, a `Target` value is key to emphasizing the power of the chart. For information about value, category, and series data, see our article about\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In Analyzer, you can choose the columns containing the data for your variance chart. For more information about choosing data columns, see our article about\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        The following image shows how data from a typical column-based spreadsheet is converted into a variance chart:\n                       \n\n\n\n\n                        Customizing Variance Charts\n                       \n\n                        You can customize the appearance of a variance chart in several ways, many of which are possible with the\n                        \n                         Chart Properties\n                        \n                        tool. For more information, see our article about\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n                        Some unique properties of variance charts are shown in the following table:\n                        \n\n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Value Format\n                           \n\n\n\n                            Determines whether currency symbols are appended to values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Percent Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in percent values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Line Style\n                           \n\n\n\n                            Allows you to select a default, straight, curved, or steeped line style between points. You can see which one looks best for your data.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > Positive Color\n                           \n\n\n\n                            Allows you to select the color displayed when the variance is positive.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > Negative Color\n                           \n\n\n\n                            Allows you to select the color displayed when the variance is negative.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            General > Show Absolute Difference\n                           \n\n\n\n                            Displays the values as absolute differences relative to zero. This better visualizes the size or scope of the differences.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Actual Line\n                           \n\n\n\n                            Allows you to set the type, color, and thickness of the actual line.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Target Line\n                           \n\n\n\n                            Allows you to set the value, label, type, color, and thickness of the target line.", "Preview Article": "Click here to preview", "URL Name": "000005156", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005156", "Archived Date": "", "Language": "English", "Primary Version": "Variance Chart", "Article Total View Count": "1,127", "": "", "Article Created Date": "3/13/2023, 7:58 PM", "First Published Date": "3/13/2023, 8:37 PM"}, "title": "\n              Variance Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}