{"file_path": "../../raw_kb_v2\\article\\1500003419382\\index.html", "content": {"Title": "Dependency Gantt Chart", "Article Body": "Intro\n                       \n\n                        Dependency Gantt charts are used to illustrate project schedules. Each task in a project is represented as a horizontal bar with a start date and end date. Tasks are represented along the vertical axis, and dates are represented along the horizontal axis. You can break tasks down by project, in which case each project is shown in a different color and appears as a legend item. However, projects are optional in Gantt charts. The Dependency Gantt chart handles changes in dates for you and gives many new display options to communicate project timelines.\n                       \n\n                        Powering Dependency Gantt charts\n                       \n\n                        Dependency Gantt charts require three columns or rows of data from your DataSet—one for tasks, one with start dates for each task, and one for end dates for each task. If you want, you can also add an additional column containing project category data to a Gantt chart. Adding project category data to a Gantt chart causes the bars for each category to appear in different colors, indicating multiple projects. Also, a legend is added to the chart showing you which project category is which.\n                       \n\n                        For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your Gantt chart. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows how the data looks when displayed in the Card Details view of the chart:\n                       \n\n\n\n\n                        The following graphic shows how the data looks inside of the Analyzer view of the chart:\n                       \n\n\n\n\n                        Customizing Dependency Gantt charts\n                       \n\n                        You can customize the appearance of a Dependency Gantt chart by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n                        Unique properties of Dependency Gantt charts include the following:\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example (s)\n                           \n\n\n\n\n\n\n                           Time Scale (X) > Show Label\n                          \n\n                           Hides or shows time scale labels. Labels are shown by default.\n                          \n\n\n\n\n\n\n\n\n                           Hover Text Settings > Text\n                          \n\n\n                            Lets you replace the default hover text with your own custom text. You can insert any of a variety of macros to reference the start date, percent of completion, category, etc. For more information, see\n                            \n                             Formatting Data Label and Hover Text in Your Chart\n                            \n                            .\n                           \n\n                            In the example at right, the user replaced the default hover text with the following macro:\n                            \n                             %_PERCENT_COMPLETE% complete\n                            \n                            .", "Preview Article": "Click here to preview", "URL Name": "1500003419382", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004661", "Archived Date": "", "Language": "English", "Primary Version": "Dependency Gantt Chart", "Article Total View Count": "4,922", "": "", "Article Created Date": "10/24/2022, 10:20 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Dependency Gantt Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}