{"file_path": "../../raw_kb_v2\\article\\360043432873\\index.html", "content": {"Title": "Open Exchange Rates Advanced Connector", "Article Body": "Intro\n                        \n\n\n\n                        Open Exchange Rates provides real-time exchange rates and currency conversion data. Use Domo’s Open Exchange Rates Advanced connector to retrieve the latest exchange rates, historical data for a given day or date range, or a list of world currencies. To learn more about the Open Exchange Rates API, visit their website (\n                        \n                         https://docs.openexchangerates.org/\n                        \n                        ).\n                       \n\n                        There is also a simplified version of this connector that allows you to see exchange rates for a base world currency. To learn more about this connector, see\n                        \n                         Open Exchange Rates Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector returns exchange rate information and lists of world currencies.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              World currencies\n                             \n\n\n\n                              Historical exchange rates\n                             \n\n\n\n                              Latest exchange rates\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              Sales\n                             \n\n\n\n                              Finance\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            Less than 1 hour\n                           \n\n\n\n\n\n\n                             Ease of Use (in a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n                        The Open Exchange Rates Advanced connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to Open Exchange Rates in the\n                        \n                         Data Center\n                        \n                        . This topic discusses the fields and menus that are specific to the Open Exchange Rates Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Best Practices\n                       \n\n                        The \"Currencies\" report only returns countries and their associated currency symbols. To pull the conversation rate, you'll need to use the \"Latest\" or \"Time Series Queries\" report then join it back to the \"Currencies\" report using the\n                        \n                         Currency Symbol\n                        \n                        field.\n                       \n\n                        Prerequisites\n                       \n\n                        None.\n                       \n\n                        Connecting to Open Exchange Rates\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Details\n                         \n\n                        pane in the Open Exchange Rates Advanced Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Report\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select an Open Exchange Rates Advanced report. The following reports are available:\n                           \n\n\n\n\n\n                                Currencies\n                               \n\n\n\n                                Returns a list of world currencies.\n                               \n\n\n\n\n\n                                Historical Data\n                               \n\n\n\n                                Returns exchange rates for a specific date.\n                               \n\n\n\n\n\n                                Latest\n                               \n\n\n\n                                Returns a list of the latest exchange rates.\n                               \n\n\n\n\n\n                                Time Series Queries\n                               \n\n\n\n                                Returns exchange rates for a range of dates.\n                               \n\n\n\n\n\n\n\n\n\n                            Base Currency\n                           \n\n\n\n                            Enter the three-letter abbreviation for the desired base currency. If you do not enter a base currency, USD will be used by default.\n                           \n\n\n\n\n\n                            Specific Currencies\n                           \n\n\n\n                            Enter a comma-separated list of three-letter currency abbreviations to request the exchange rates for those currencies. For example:\n                            \n                             EGP,CNY,GEL\n                            \n                            to return the exchange rates for Egyptian pounds, Chinese yuan, and Georgian lari.\n                           \n\n\n\n\n\n                            Date\n                           \n\n\n\n                            Enter a date in\n                            \n                             yyyy-mm-dd\n                            \n                            format to retrieve exchange rates for that date. For example:\n                            \n                             2014-08-28\n                            \n\n\n\n\n\n\n                            Start Days\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with End Days to create a range of represented days. For example, if you entered\n                            \n                             10\n                            \n                            for Start Days and\n                            \n                             5\n                            \n                            for End Days, the report would contain data for 10 days ago up until 5 days ago. Enter\n                            \n                             0\n                            \n                            for today.\n                           \n\n\n\n\n\n                            End Days\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with Start Days to create a range of represented days. For example, if you entered\n                            \n                             10\n                            \n                            for Start Days and\n                            \n                             5\n                            \n                            for End Days, the report would contain data for 10 days ago up until 5 days ago. Enter\n                            \n                             0\n                            \n                            for today.\n                           \n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n\n                          Be aware of the API limits for your specific account. Free accounts only allow for 1000 API requests per month.\n                         \n\n\n\n                          Error Code Reference:\n                          \n                           https://docs.openexchangerates.org/docs/errors", "Preview Article": "Click here to preview", "URL Name": "360043432873", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003624", "Archived Date": "", "Language": "English", "Primary Version": "Open Exchange Rates Advanced Connector", "Article Total View Count": "4,689", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Open Exchange Rates Advanced Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}