{"file_path": "../../raw_kb_v2\\article\\360043434853\\index.html", "content": {"Title": "Basecamp Connector", "Article Body": "Intro\n                        \n\n\n\n\n                         Basecamp is a web-based project management tool. The Basecamp connector integrates Domo with Basecamp to extract data from the Basecamp API. You can use this connector to retrieve data about documents, attachments, calendar events, projects, people, and the like. To learn more about the Basecamp API, visit their Github page (\n                        \n\n                         https://github.com/basecamp/bc3-api\n                        \n\n                         ).\n                        \n\n\n                        The Basecamp connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n\n                         You connect to your Basecamp account in the Data Center. This topic discusses the fields and menus that are specific to the Basecamp connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector is appropriate for retrieving project status and task and project completion rates.\n                           \n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            Project managers\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            10 minutes\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n\n\n\n                         Prerequisites\n                        \n\n\n\n                         To connect to your Basecamp account and create a DataSet, you must have the following:\n                        \n\n\n\n\n\n                           The username or email address you use to log into Basecamp\n                          \n\n\n\n\n\n                           The password you use to log into Basecamp\n                          \n\n\n\n\n\n                         Connecting to Your Basecamp Account\n                        \n\n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Basecamp Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         The Domo Basecamp connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                         \n                          Connect\n                         \n                         (or select\n                         \n                          Add Account\n                         \n                         if you have existing Basecamp accounts in Domo) to open the Basecamp OAuth screen where you can enter your Basecamp username/email address and password. Once you have entered valid Basecamp credentials and authorized Domo to connect to Basecamp, you can use the same account any time you go to create a new Basecamp DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Basecamp when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Basecamp.\n                          \n\n\n\n\n\n                         Details Pane\n                        \n\n\n\n                         This pane contains two primary menus,\n                         \n                          Account ID\n                         \n                         and\n                         \n                          Reports\n                         \n                         , along with various other menus which may or may not appear depending on the report type you select.\n                        \n\n\n\n\n\n\n\n\n                              Menu\n                             \n\n\n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n\n\n\n                             Account ID\n                            \n\n\n\n\n\n                             Select the Basecamp account ID you want to retrieve information for.\n                            \n\n\n\n\n\n                           Report\n                          \n\n\n\n                             Select a Basecamp report. The following reports are available:\n                            \n\n\n\n\n\n\n\n                                 Accesses\n                                \n\n\n\n\n\n                                 Returns a list of people with access to a given project.\n                                \n\n\n\n\n\n\n\n                                 Attachments\n                                \n\n\n\n\n\n                                 Returns a list of attachments for all projects.\n                                \n\n\n\n\n\n\n\n                                 Calendars\n                                \n\n\n\n\n\n                                 Returns a list of all calendars, sorted alphabetically.\n                                \n\n\n\n\n\n\n\n                                 Calendar Events\n                                \n\n\n\n\n\n                                 Returns a list of upcoming calendar events.\n                                \n\n\n\n\n\n\n\n                                 Calendar Events Past\n                                \n\n\n\n\n\n                                 Returns a list of past calendar events.\n                                \n\n\n\n\n\n\n\n                                 Documents\n                                \n\n\n\n\n\n                                 Returns a list of documents for all projects.\n                                \n\n\n\n\n\n\n\n                                 Events\n                                \n\n\n\n\n\n                                 Returns a list of all events for the account.\n                                \n\n\n\n\n\n\n\n                                 People\n                                \n\n\n\n\n\n                                 Returns a list of people with access to the account.\n                                \n\n\n\n\n\n\n\n                                 Projects\n                                \n\n\n\n\n\n                                 Returns a list of all active projects for the given project type.\n                                \n\n\n\n\n\n\n\n                                 Projects Archived\n                                \n\n\n\n\n\n                                 Returns a list of all archived projects.\n                                \n\n\n\n\n\n\n\n                                 Stars\n                                \n\n\n\n\n\n                                 Returns a list of stars for all active projects.\n                                \n\n\n\n\n\n\n\n                                 To-Do Lists\n                                \n\n\n\n\n\n                                 Returns to-do lists for all active projects for the given list type.\n                                \n\n\n\n\n\n\n\n                                 To-Dos\n                                \n\n\n\n\n\n                                 Returns a list of to-do items in all to-do lists.\n                                \n\n\n\n\n\n\n\n                                 Topics\n                                \n\n\n\n\n\n                                 Returns a list of topics for all projects.\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Project Type\n                            \n\n\n\n\n\n                             Select a Basecamp project type.\n                            \n\n\n\n\n\n\n\n                             To-Do List Type\n                            \n\n\n\n\n\n                             Select a Basecamp to-do list type.\n                            \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        How do I know my Basecamp 3 account credentials are secure?\n                       \n\n                        The login process uses the OAuth process so your Basecamp credentials are never seen or stored by Domo. This keeps your login secure.\n                       \n\n                        How frequently will my data update?\n                       \n\n                        As often as needed.\n                       \n\n                        Can this connector pull custom fields?\n                       \n\n                        No. Reports and columns are predefined by Basecamp.\n                       \n\n                        What is the difference between the Basecamp and the Basecamp 3 connector?\n                       \n\n                        The Basecamp 3 connector provides more reports and also has more options available to retrieve filtered, customized, and meaningful data.", "Preview Article": "Click here to preview", "URL Name": "360043434853", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003435", "Archived Date": "", "Language": "English", "Primary Version": "Basecamp Connector", "Article Total View Count": "4,635", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Basecamp Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}