{"file_path": "../../raw_kb_v2\\article\\360043429913\\index.html", "content": {"Title": "Adding a Beast Mode Calculation to Your Chart", "Article Body": "Intro\n                        \n\n\n\n                        You can use Beast Mode to add a calculation for use in transforming columns in your chart.\n                       \n\n\n\n                          Video - Intro to Beast Mode\n                         \n\n\n\n\n\n\n\n\n\n\n\n                          Video - Creating a Calculated Field\n                         \n\n\n\n\n\n\n\n\n\n\n\n                          Video - Case Statement Overview\n                         \n\n\n\n\n\n\n\n\n\n                        Parts of the Beast Mode dialog\n                       \n\n                        The following screenshot shows how the Beast Mode dialog looks:\n                       \n\n\n\n\n                        You can learn about the user interface components of the Beast Mode dialog in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Calculated Field Name\n                           \n\n\n\n                            Contains the name of a calculation, which appears in the Categories list in Analyzer, and as the heading of the transform column in cards. You can edit the name. This name cannot be the same as the name of any column in the DataSet; otherwise an error appears reading, \"Your specified name for the calculation is invalid.\"\n                           \n\n\n\n\n\n                            Formula\n                           \n\n\n\n                            Contains the functions you want in your calculation.You can add column names, calculations, and functions to your calculation by double-clicking items in the\n                            \n                             DataSet Fields\n                            \n                            and\n                            \n                             Functions\n                            \n                            lists. You can validate your calculation by clicking\n                            \n                             Validate Formula\n                            \n                            (which appears after you edit the calculation in the\n                            \n                             Formula\n                            \n                            field) or by clicking\n                            \n                             Save & Close\n                            \n                            . If the calculation passes, a \"Valid Formula\" message appears. If the calculation does not pass, an \"Invalid Formula\" message appears.\n                           \n\n\n\n\n\n                            DataSet Fields\n                           \n\n\n\n                            Lists categories, values, and calculations that you can double-click to add to your calculation.Calculation columns appear as categories in the list.You can search for items in the list or filter by type. If you enter\n                            \n                             =\n                            \n                            (equal sign) as the first character, only Beast Mode calculations display.\n                           \n\n\n\n\n\n                            Functions\n                           \n\n\n\n                            Lists categories of functions that you can double-click to add to your calculation.You can search for items in the list or filter by type.\n                           \n\n\n\n\n\n                            Function Description\n                           \n\n\n\n                            Displays the description of the selected function.\n                           \n\n\n\n\n\n                            Share Calculation on DataSet\n                           \n\n\n\n                            Lets you share the selected calculation on the DataSet, meaning the calculation is available for use in other cards powered up by this DataSet.\n                           \n\n\n\n\n\n                            Save & Close\n                           \n\n\n\n                            Lets you validate and save the selected calculation, and close the dialog.The calculation\n                            \n                             must\n                            \n                            be valid before you can use it to power up charts.\n                           \n\n\n\n\n\n                        Adding a Beast Mode calculation\n                       \n\n                        Use the information in this section to add calculations for transforming data using Beast Mode.\n                       \n\n\n                         To add a Beast Mode calculation,\n                        \n\n\n\n\n                          On the KPI card where you want to add a calculation, click\n                          \n                          , then select\n                          \n                           Edit Card\n                          \n                          .\n                         \n\n\n\n                          In Analyzer, click\n                          \n                           Add Calculated Field\n                          \n                          .\n                          \n                          For more information about Analyzer, see\n                          \n                           Analyzer Layout\n                          \n                          .\n                         \n\n                          The Beast Mode dialog appears.\n                         \n\n\n\n                          In\n                          \n                           Calculated Field Name\n                          \n                          , enter the title of the calculation.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The title is used as the heading of the created column that may appear in Cards. If you name the Beast Mode the same name as another Beast Mode or column in the DataSet, a modal will pop up allowing you to change the Beast Mode name (along with any others that need to be fixed.)\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             It is best to avoid naming Beast Modes as a single keyword that is used in a function, such as \"Date\" or \"Sum\". Using words like this can cause the Beast Mode to fail. Whereas \"Date Created\" and \"Sum of Sales\" are acceptable.\n                            \n\n\n\n\n\n\n                          In\n                          \n                           Formula\n                          \n                          , enter the calculation you want.\n                          \n                          You can add column names and functions to your calculation by double-clicking items in the\n                          \n                           DataSet Fields\n                          \n                          and\n                          \n                           Functions\n                          \n                          lists.\n                          \n                          For more information about functions, see\n                          \n                           Beast Mode Functions Reference Guide\n                          \n                          .\n                         \n\n\n\n                          (Optional) Mark the option to share the calculation with any cards using the DataSet.\n                         \n\n\n\n                          Click\n                          \n                           Save & Close\n                          \n                          to validate the syntax of the calculation and save your changes.\n                          \n                          If there are errors, revise your calculation.\n                          \n                          After saving, the calculation column appears in the Categories list for the card in Analyzer.\n                         \n\n\n\n\n                         To edit a Beast Mode calculation,\n                        \n\n\n\n\n                          On the KPI card where you want to edit a calculation, click\n                          \n                          , then select\n                          \n                           Edit Card\n                          \n                          .\n                          \n                          For more information about Analyzer, see\n                          \n                           Analyzer Layout\n                          \n                          .\n                         \n\n\n\n                          In Analyzer, in the\n                          \n                           Categories\n                          \n                          list, click the calculation column you want to edit.\n                         \n\n\n\n                          Make any changes you want, then click\n                          \n                           Save & Close\n                          \n                          .\n                         \n\n\n\n\n                         To delete a Beast Mode calculation,\n                        \n\n\n\n\n                          On the KPI card where you want to edit a calculation, click\n                          \n                          , then select\n                          \n                           Edit Card\n                          \n                          .\n                          \n                          For more information about Analyzer, see\n                          \n                           Analyzer Layout\n                          \n                          .\n                         \n\n\n\n                          In Analyzer, in the\n                          \n                           Categories\n                          \n                          list, mouse over the calculation column you want to remove, then click\n                          \n                           X\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Remove\n                          \n                          to confirm deleting the calculation.\n                         \n\n\n\n                        Calculation usage notes\n                       \n\n\n\n                          Most calculations use one of the following general formats:\n                         \n\n\n\n\n\n                              Format\n                             \n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n\n                               FUNCTIONNAME(`Column Name`)\n                              \n\n\n\n\n                              Used when some single, specific change is applied to all of the cells in a column. Examples of functions used in this kind of calculation include\n                              \n                               AVG\n                              \n                              ,\n                              \n                               MONTHNAME\n                              \n                              , and\n                              \n                               CEILING\n                              \n                              .\n                             \n\n\n\n\n\n\n                               FUNCTIONNAME(`Column Name1`,`Column Name2`,...)\n                              \n\n\n\n\n                              Used when a calculation is applied across two or more columns. One example of a function used in this kind of calculation is\n                              \n                               CONCAT\n                              \n                              , which combines strings from different columns.\n                             \n\n\n\n\n\n\n                               FUNCTIONNAME(`Column Name`,\n                               \n                                somevalue\n                               \n                               )\n                              \n\n\n\n\n                              Used when a calculation involving a specified value is applied to a column. An example of a function used in this kind of calculation is\n                              \n                               POWER\n                              \n                              . When using this calculation, you specify the power you want all the cells in a column to be raised to.\n                             \n\n\n\n\n\n\n                               FUNCTIONNAME(`Column Name`, '\n                               \n                                string\n                               \n                               ')\n                              \n\n\n\n\n                              Used when a calculation involving a specified string is applied to a column. An example of a function used in this kind of calculation is\n                              \n                               DATE_FORMAT\n                              \n                              . When using this calculation, you specify specifier characters to use in formatting the date value. For more information, see\n                              \n                               Date Format Specifier Characters in Beast Mode\n                              \n                              .\n                             \n\n\n\n\n\n\n\n\n\n                          In calculations, Beast Mode function names are\n                          \n                           not\n                          \n                          case sensitive.\n                         \n\n\n\n                          In calculations, column names are case sensitive and are separated by commas. Do\n                          \n                           not\n                          \n                          use Beast Mode function names as column names; Beast Mode function names are reserved.\n                         \n\n\n\n                          Use backticks (aka\n                          \n                           backquotes\n                          \n                          ) (`) or double quotes (\") for column names:\n                          \n                           `Customers`\n                          \n                          or\n                          \n                           \"Customers\"\n                          \n\n                          Wrap column names of two or more words with backticks (`) or double quotes (\"). If you use any column name that matches the name of a function (such as\n                          \n                           DATE\n                          \n                          ), then use backticks or double quotes (\") to wrap the column name.\n                         \n\n\n\n                          Use single quotes (') for strings:\n                          \n                           'mystring'\n                          \n\n\n\n\n                          You can escape a quote using two single quotes:\n                          \n                           'O''Neal'\n                          \n\n\n\n\n                          You can insert a space in a calculation using single quotes:\n                          \n                           ' '\n                          \n\n                          This is useful with functions like\n                          \n                           CONCAT\n                          \n                          when you need to combine strings.\n                         \n\n\n\n                          You can use most standard arithmetic operators in your custom calculations, such as + (addition), - (subtraction), * (multiplication), / (division), and so on.\n                         \n\n\n\n                          You cannot refer to a specific calculation by name in another calculation.\n                          \n                          For example, if you create a calculation called \"MaxColumn1,\" you cannot use that name when defining another calculation.\n                         \n\n\n\n                          Calculations can be completed automatically as you enter them.\n                         \n\n\n\n                            As you enter functions, a list of functions appears, which you can select from.\n                           \n\n\n\n                            If you enter a backtick ('), a list of column names appears, which you can select from.\n                           \n\n\n\n\n\n                          When you check the box for\n                          \n                           Share Calculation on DataSet\n                          \n                          for a calculation, that calculation is saved to the DataSet. The calculation is then available for use in any other charts that use this DataSet.\n                         \n\n\n\n                          If your calculation aggregates rows in your DataSet, you can apply it to your card summary number. For more information, see the\n                          \n                           next\n                          \n                          section.\n                         \n\n\n\n                          While you can combine some functions in a calculation, you\n                          \n                           cannot\n                          \n                          stack numerical functions. For example,\n                          \n                           SUM(MIN())\n                          \n                          is invalid.\n                         \n\n\n\n                          Calculations you create using Beast Mode are inherited when you drill from one view to another using the same DataSet. However, calculations are not inherited when you drill to a new DataSet. For information about drill paths, see\n                          \n                           Adding Drill Path to Your Chart\n                          \n                          .\n                         \n\n\n\n                          You can make selecting filter options easier by using \"Yes\" and \"No\" rather than \"1\" and \"0\" in calculations.\n                         \n\n\n\n                          Do\n                          \n                           not\n                          \n                          mix data types of values you put in a transformed column.\n                          \n                          For example, in a\n                          \n                           CASE\n                          \n                          function, do not store \"Yes\" (string) and \"0\" (number) in the same column.\n                         \n\n\n\n                          You can double click categories, values, functions, and DataSet fields in the lists to add them to your calculation.\n                         \n\n\n\n                          As you type a column or function name, a menu appears, which you can select from to add them to your calculation. For example, enter ` to see the column list, then select the column you want.\n                         \n\n\n\n                          You can drag and drop a column name from the DataSet Fields list to your calculation.\n                         \n\n\n\n                          Any Beast Mode calculations that use processing intensive functions such as\n                          \n                           COUNT (DISTINCT)\n                          \n                          or\n                          \n                           SUM (DISTINCT)\n                          \n                          will slow down the visualization performance of cards that are built off of large DataSets. This also happens with complex case statements that are over 30 lines of code. If you have to build these functions into a large DataSet, we recommend you do it in a DataFlow to optimize visualization performance.\n                         \n\n\n\n                        For Beast Mode syntax examples, see\n                        \n                         Sample Beast Mode Calculations\n                        \n                        .\n                       \n\n                        Applying a calculation to a summary number\n                       \n\n                        If your Beast Mode calculation aggregates rows in your DataSet, it can be used in your card summary number. Calculations built using any of the following functions can be applied to your summary number:\n                       \n\n\n\n\n                           AVG\n                          \n\n\n\n\n\n                           COUNT\n                          \n\n\n\n\n\n                           COUNT (DISTINCT)\n                          \n\n\n\n\n\n                           MAX\n                          \n\n\n\n\n\n                           MIN\n                          \n\n\n\n\n\n                           SUM\n                          \n\n\n\n\n\n                           SUM (DISTINCT)\n                          \n\n\n\n\n\n                           STDDEV_POP, VAR_POP\n                          \n\n\n\n\n                        When you add such a calculation, the Beast Mode is automatically added to the list of available columns that may be used in the summary number for this chart.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           For a Beast Mode column to work as the Summary Number, it must be aggregated in some way (for example, the\n                           \n                            SUM()\n                           \n                           function) or be the result of an operation on values within functions (for example,\n                           \n                            SUM()\n                           \n                           functions). For instance,\n                           \n                            'Customers'\n                           \n                           does\n                           \n                            not\n                           \n                           work for a Summary Number, but\n                           \n                            SUM('Customers')\n                           \n                           may be used as a Summary Number.\n                          \n\n\n\n\n                        For more information about summary numbers, see\n                        \n                         Configuring Your Chart Summary Number\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043429913", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004076", "Archived Date": "", "Language": "English", "Primary Version": "Adding a Beast Mode Calculation to Your Chart", "Article Total View Count": "12,133", "": "", "Article Created Date": "10/24/2022, 9:20 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Adding a Beast Mode Calculation to Your Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Beast Mode\n              \n", "url": "/s/topic/0TO5w000000ZanAGAS"}]}