{"file_path": "../../raw_kb_v2\\article\\4571739374487\\index.html", "content": {"Title": "Community Built Connectors", "Article Body": "Intro\n                       \n\n                        Community Built Connectors enable builders outside of Domo to create, update, and support connectors within Domo. This allows all Domo users to have more options for connecting their data. The Connector IDE now supports community building, sharing, and enhancing to bring even more connectors to Domo, faster. For more information on creating custom connectors, visit the\n                        \n                         Developer portal\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                        FAQ's\n                       \n\n\n                         Where are the Community Built Connectors published?\n                        \n\n\n                        If a Connector has been published as Community Built, the code will be available to all customers in the Appstore where the code can be copied to the IDE and published in their own instance.\n                       \n\n\n                         What is the approval process for changes to Community Built Connectors?\n                        \n\n\n                        Any changes made to the community code are sent to the original Connector writer for approval.\n                       \n\n\n                         Will everyone be able to use Community Built Connectors?\n                        \n\n\n                        Any Domo user with access to use the Appstore and the grant to use Connectors will be able to copy code to the IDE to create a Connector from a Community Built Connector.\n                       \n\n\n                         If a Community Built Connector stops working, will I be able to contact Domo Support for assistance?\n                        \n\n\n                        The best resource for help will be the Connector developer themselves. If provided, the support email will be available in the Connector description. You can also make an edit and submit it back to the community or branch the Connector and apply a fix privately.", "Preview Article": "Click here to preview", "URL Name": "4571739374487", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004621", "Archived Date": "", "Language": "English", "Primary Version": "Community Built Connectors", "Article Total View Count": "4,721", "": "", "Article Created Date": "10/24/2022, 10:17 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Community Built Connectors\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Using Domo APIs\n              \n", "url": "/s/topic/0TO5w000000Zan1GAC"}, {"text": "\n\n               Developer Topics\n              \n", "url": "/s/topic/0TO5w000000ZanYGAS"}]}