{"file_path": "../../raw_kb_v2\\article\\360042933214\\index.html", "content": {"title": "\n\n\n Filtering Apps and Connectors in the Appstore\n\n\n", "article_body": "\n\nYou can apply filters to apps and connectors in the Appstore to quickly find what you're looking for.\n\n\n* You can perform a keyword search in either the\n **Home**\n tab or\n **Search**\n tab. You do this by entering the desired keyword(s) in the\n **Search Apps**\n box at the top of the screen in either tab. If you search in the\n **Home**\n tab, the\n **Search**\n tab opens and your results are shown. Keywords are matched to both app/connector names and descriptions. So if you typed \"mail\" as a keyword while in the\n **Home**\n tab, the\n **Search**\n tab would open, \"mail\" would be entered automatically as a keyword, and all apps and connectors with \"mail\" in their name and/or description would appear as search results.\n* You can quickly filter to show all apps and connectors for a specific category by clicking on any of the categories shown on the left side of the\n **Home**\n tab in the Appstore. For example, if you clicked\n **Finance**\n , the\n **Search**\n tab would open with \"Finance\" entered automatically as the keyword. Similarly, you can filter to show results for a given capability (data science, enterprise apps, writeback, or DataFlows) by clicking the desired capability on the right side of the\n **Home**\n tab.\n* In the\n **Search**\n tab, you can check the boxes for any of the filters on the left side of the screen. For many filters, you can show additional criteria by clicking\n **Show More**\n . You can filter on as many criteria as you want. Filters that you add appear under the search bar. You can quickly remove filters by clicking the \"x\" next to a filter. If you leave the\n **Search**\n tab then return, all of the filters you have applied will still be there.\n* In the details view for an app or connector, you can click any of the tags associated with the app or connector to search for other apps and connectors with that tag in their name or description. Tags are shown in the info panel on the right.\n\nIn addition to applying filters, you can also sort search results in the\n **Search**\n tab in ascending or descending order or by relevance.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042933214\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005020\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFiltering Apps and Connectors in the Appstore\n\n", "article_total_view_count": "\n\n\n 2,402\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/2/2022, 8:16 PM\n\n\n", "first_published_date": "\n\n\n 11/2/2022, 8:37 PM\n\n\n"}, "title": "filtering_apps_and_connectors_in_the_appstore", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "explore_the_appstore", "url": "/s/topic/0TO5w000000ZaoMGAS"}]}