{"file_path": "../../raw_kb_v2\\article\\4546361976087\\index.html", "content": {"Title": "Radial Progress Gauge", "Article Body": "Intro\n                        \n\n\n\n                        Gauges are simple charts that indicate progress towards meeting a target. A Radial Progress Gauge is similar to a thermometer that \"fills in\" to show how close the current value is to the goal. A Radial Progress Gauge is similar to a\n                        \n                         progress bar gauge\n                        \n                        except that it is circular. Other gauge types in Domo include\n                        \n                         single value gauges\n                        \n                        ,\n                        \n                         radial gauges\n                        \n                        ,\n                        \n                         face gauges\n                        \n                        , and\n                        \n                         comparative fill gauges\n                        \n                        .\n                       \n\n                        Powering Radial Progress Gauges\n                       \n\n                        A Radial Progress Gauge requires three columns from your DataSet—the Gauge Value that contains current values, the Target Value contains the target values if you want the gauge to contain dynamic target values, (if you do not expect the target value of the gauge to change, you can specify the target in\n                        \n                         Chart Properties\n                        \n                        ,) and the Group By containing categories that allows you to select how the data is aggregated, For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        If multiple rows are present in your DataSet, the values in all of the rows are aggregated. Be aware that this aggregates the values for the target value column as well. For example, if your spreadsheet included two rows for \"Team A\" that both had a target value of 100, these would be aggregated in your chart to yield a new target value of 200. Selecting\n                        \n                         No Aggregation\n                        \n                        for either the current value or maximum does\n                        \n                         not\n                        \n                        currently work.\n                       \n\n                        The maximum value of a Radial Progress Gauge is automatically determined based on the current value. For example, if your current value was 80, the maximum value would be set to 100. If the current value was 155, the maximum value would be set to 200.\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your Radial Progress Gauge. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Analyzer Overview\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from the category and value columns in a typical column-based spreadsheet is converted into a Radial Progress Gauge:\n                       \n\n\n\n\n                        Customizing Radial Progress Gauges\n                       \n\n                        You can customize the appearance of a Radial Progress Gauge by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Setting Options for Gauges\n                        \n                        .\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           General > Fill Color\n                          \n\n                           Set the color for the part of the gauge that will be filled by the value specified.\n                          \n\n\n\n                           General > Background Ring Style\n                          \n\n                           Sets the style for the background ring of the chart. The options are\n                           \n                            None\n                           \n                           ,\n                           \n                            Thin Center\n                           \n                           ,\n                           \n                            Outside\n                           \n                           , or\n                           \n                            Full\n                           \n                           . The default is None.\n                          \n\n\n\n                           General > Background Ring Color\n                          \n\n                           Sets the color for the background ring if being displayed.\n                          \n\n\n\n                           General > Rounded Ends\n                          \n\n                           When set, the ends of the progress chart will be rounded.\n                          \n\n\n\n                           General > Maximum Value\n                          \n\n                           The maximum value used to calculate a percentage value can either be set manually or from the data. If set here it will override the max value set in the data.\n                          \n\n\n\n                           General > Label Text\n                          \n\n                           This property will set the text for an optional label. When this property is set, it will override any label set from the data.\n                          \n\n\n\n                           General > Label Position\n                          \n\n                           Sets the position for the label if present. The options are\n                           \n                            Above\n                           \n                           or\n                           \n                            Below\n                           \n                           . The default is Above.\n                          \n\n\n\n                           General > Value Color\n                          \n\n                           Sets the color for the percentage value displayed. By default, if nothing is selected, it will use the color from the chart.\n                          \n\n\n\n                           General > No Data Message\n                          \n\n                           The message to be displayed if there is no data. This may occur if the data has been filtered out on the page.\n                          \n\n\n\n                           Hover Text Settings > Hover Text\n                          \n\n                           The text to be displayed when you hover on the chart.\n                          \n\n\n\n                           Color Range 1-4 > Minimum % Value\n                          \n\n                           Sets the minimum percentage value for the optional color range.\n                          \n\n\n\n                           Color Range 1-4 > Maximum % Value\n                          \n\n                           Sets the maximum percentage value for the optional color range.\n                          \n\n\n\n                           Color Range 1-4 > Color\n                          \n\n                           Sets the color for the gauge when the percentage value is between the minimum and maximum values.\n                          \n\n\n\n                           Full Size Settings\n                          \n\n                           Lets you specify the width and height to use when \"full\" size is selected on a page of cards. For reference, a medium card is 1x1 and a large card is 2x2.", "Preview Article": "Click here to preview", "URL Name": "4546361976087", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004659", "Archived Date": "", "Language": "English", "Primary Version": "Radial Progress Gauge", "Article Total View Count": "4,762", "": "", "Article Created Date": "10/24/2022, 10:19 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Radial Progress Gauge\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}