{"file_path": "../../raw_kb_v2\\article\\360043436573\\index.html", "content": {"title": "\n\n\n File Upload Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe File Upload Connector allows you to easily bring your important spreadsheet files into Domo and begin making decisions faster. Regardless of the file type you choose (CSV, XLS, or XLSX), there are a wide range of configuration options to meet your custom file needs.\n\n\n As of our February 2018 release, there are two versions of the File Upload connector available in Domo:\n\n The newer—and recommended—version of the connector provides an intuitive workflow to make even the most complicated Excel or CSV files usable within Domo. It lets you maintain all of the organization and configuration of your custom Excel or CSV files and still have usable data within Domo. Requiring virtually no input, this version does the heavy lifting for you.\n* The legacy version of this connector is also still available. This version requires you to configure a number of advanced settings (most of which are set for you automatically when using the new version of the connector).\n\nYou can begin the process of creating a File Upload DataSet in one of several different ways:\n\n By going into the Data Center and choosing the\n **File**\n option from the toolbar at the top of the screen.\n* By clicking the\n\nicon in the upper right corner of the\n **Dashboards**\n tab, selecting\n **Create new Card**\n , selecting\n **Visualization**\n , then clicking\n **Upload**\n .\n* By clicking\n\nin the upper right corner of the screen from anywhere in Domo, selecting\n **Card**\n , selecting\n **Visualization**\n , then clicking\n **Upload**\n .\n\nThis topic discusses the fields and menus that are specific to the File Upload connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Video - File Upload Connector**\n\nPrerequisites\n---------------\n\nIf you are connecting to an Excel file that is password-protected, you will need to know the password. Otherwise, no credentials are required to use either version of this connector.\n\n\n Using the new (\"wizard\") File Upload connector\n------------------------------------------------\n\n\n This section enumerates the options in the File Upload wizard. The components of the other pane in this page,\n **Name & Describe Your DataSet**\n , are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n \"Upload spreadsheet\" screen\n\nIn the first page of the File Upload connector wizard, you simply drag and drop an XLS, XLSX, or CSV file from your computer into the box or select the desired file from your computer. Once you've dragged or selected your file, the next pane in the wizard opens automatically.\n\n##\n \"Select tables\" screen\n\nThis screen displays a preview of the selected file and provides options for selecting and formatting the data. Options for configuring the file may appear depending on the file type (Excel or CSV) and properties (such as whether your Excel file is password-protected).\n\n##\n Options for Excel files\n\n\n####\n Data selection\n\nBy default, when the\n **Select Tables**\n screen opens for an Excel spreadsheet, all of the cells in Row 1 of your spreadsheet are considered column headers, indicated by dark blue highlighting, and the rest of the data in the spreadsheet is considered to be your selected \"body\" data, indicated by light blue highlighting. This means that if you were to create a DataSet from this data, all of the data would be imported into the DataSet, with the Row 1 cells acting as the column headers. This is also reflected in the\n **Column Headers**\n and\n **Selection**\n fields under \"Data Grid,\" in which\n **Column Headers**\n shows the coordinates for the first and last cells in the first row, and\n **Selection**\n shows the coordinates for the first and last cells in the body.\n\n\n The following screenshot shows an example of this initial selection. Note that the column header cells in the preview appear unselected (as these are considered separate from the \"body\" of the spreadsheet). Also note that the\n **Column Headers**\n fields in the bottom left read \"A1\" to \"G1\" and the\n **Selection**\n fields read \"A2\" to \"G51\" (which are the first and last selected cells in the body).\n\nIf a user then selects a different block of data by mousing over it, the\n **Selection**\n fields update to reflect this. Note that the\n **Column Headers**\n fields are\n *not*\n updated. If you want to update the selected column headers, you can do so by either...\n\n setting the coordinates manually in the\n **Column Headers**\n fields, or\n* clicking within either\n **Column Headers**\n field\n *then*\n clicking and dragging over the desired column headers in the preview.\n\nThis latter concept is very important. If you click anywhere in the\n **Column Headers**\n fields, any cells you select in the preview are considered to be column headers (and the coordinates in the\n **Column Headers**\n fields will update) whereas if you click in the\n **Selection**\n fields, all cells you select in the preview are considered to be \"body\" data (and the coordinates in the\n **Selection**\n fields will update). In other words, you can toggle the \"active\" selection method by clicking in the field that corresponds to that selection method.\n\n\n In the following screenshot, the user highlights cell \"A2\" to cell \"E10.\" By default, the\n **Selection**\n toggle is active, so these cells are considered to be body cells, and the\n **Selection**\n fields update to reflect the change.\n\nBut, if the user clicks in either\n **Column Headers**\n cell, then that toggle becomes active. The user then selects the top two rows of data in the preview, and the change is reflected in the\n **Column Headers**\n fields.\n\n\n**Note:**\n The Large File Upload Connector discards any empty rows appearing before the table in an XLSX file. So, if the XLSX file has 1 blank row prior to the table, decrease the Column Headers and Selection by 1 row.\n\n\n Consider the following example:\n\n\n To select the range A3:C6, enter Column Headers as A2:C2 and Selection as A3:C5 as there is an empty row before the table.\n\n###\n Format\n\nAs mentioned above, by default all Excel spreadsheets brought into Domo are assumed to have column headers instead of row headers or a cross-tab (pivot) layout. If this is not the case for your data, you can select the correct format in the\n **Format**\n menu. For more information about the different kinds of data layouts, see\n\nUnderstanding Chart Data\n\n.\n\n###\n Sheet selection\n\nIf your Excel file consists of more than one sheet, you can select the desired sheet in the menu just above the preview.\n\n\n####\n Generating headers\n\nIf you check the\n **Generate Headers**\n box, a row (or column, if you have selected\n **Row Headers**\n ) of headers is automatically generated with generic names such as \"\\_Column\\_1,\" \"\\_Column\\_2,\" etc.\n\n\n If your spreadsheet is missing any column or row headers, these will be generated automatically when you click\n **Preview**\n . For example, in the following screenshot, a header was missing in the fourth column, so the header \"\\_COLUMN\\_4\" was generated automatically.\n\n\n####\n\nKeep Leading Zeroes\n\n\n Select this checkbox if you want to keep leading zeros in numeric values like '0123'.\n\n\n**Note**\n : The connector will parse the values with leading zeroes as text.\n\n\n###\n Options for CSV files\n\n\n####\n Data selection\n\nAll data from a CSV file is imported into a DataSet when you build it, even if you click and drag to highlight a specific portion.\n\n###\n Generating headers\n\nBy default, the top row in your CSV sheet is considered to be the header row. You can automatically generate a new header row with generic names such as \"\\_COLUMN\\_1,\" \"\\_COLUMN\\_2,\" etc. by checking the\n **Generate headers**\n box.\n\n###\n File encoding\n\nBy default, UTF-8 encoding is used for your CSV file. If desired you can select a different encoding type in the\n **File Encoding**\n menu.\n\n###\n Delimiter\n\nBy default, a comma is used as the delimiter for your CSV file. If desired you can select a different delimiter in the\n **Delimiter**\n menu.\n\n\n Using the legacy File Upload connector\n----------------------------------------\n\n\n This section enumerates the options in\n **Details**\n and\n **Advanced**\n panes in the File Upload Connector page. The components of the other pane in this page,\n **Name & Describe Your DataSet**\n , are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n Details pane\n\nIn this pane you select the file you want to upload and the file type. If you are uploading an Excel file, you may also enter the password and sheet name, if applicable.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Select File\n  |\n Select the Excel or CSV file from your machine or network you want to upload.\n  |\n|\n Choose File Type\n  |\n Select whether the file you have selected is a CSV, XLS, or XLSX file.\n  |\n|\n File Password (Optional)\n  |\n If the Excel file you are uploading is password-protected, enter the password here.\n  |\n|\n Sheet Name (Optional)\n  |\n If the Excel file you are uploading is found on a specific sheet, enter the sheet name here. Be sure to check the sheet name for accidental spaces. If you do not enter a sheet name, the first sheet of the workbook will be used.\n  |\n\n\n###\n Advanced pane - Excel\n\nIn this pane you configure advanced options for the Excel you have uploaded.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Layout\n  |\n Select the layout of your Excel file. The following options are available:\n * **Column as Header**\n . Indicates that your Excel data uses a column-based layout (i.e. each column has a header).\n* **Row as Header**\n . Indicates that your Excel data uses a row-based layout (i.e. each row has a header).\n* **Cross Tab**\n . Indicates that your Excel data uses a cross-tab (pivot) layout.\n* **Raw**\n . Indicates that your Excel data is raw (unformatted).\n* **Advanced**\n . Use this option if you want to configure advanced layout options such as header and data start rows, footer rows to skip, date format, etc.\n |\n|\n Mode\n  |\n Select how the cell range of your Excel data will be determined. If you select\n **Auto**\n , the range is determined automatically. If you select\n **Manual**\n , you will be asked to enter the column header and data ranges manually.\n  |\n|\n Column Header Range\n  |\n Enter the range for the column headers in your Excel sheet. For example:\n\nA2:F8\n\n|\n|\n Row Header Range\n  |\n Enter the range for the row headers in your Excel sheet. For example:\n\nA2:A8\n\n|\n|\n Data Range\n  |\n Enter the range for the data (non-header) cells in your Excel sheet. For example:\n\nA3:F20\n\n|\n|\n Header Start Row (Advanced only) (optional)\n  |\n Enter the header row number. If you do not enter a number, the first row is considered the header row.\n  |\n|\n Data Start Row (Advanced only) (optional)\n  |\n Enter the starting data row number. If you do not enter a number, the first row after the header row is considered the starting row.\n  |\n|\n Footer Rows to Skip (Advanced only) (optional)\n  |\n If there are one or more rows at the bottom of the file you do not want to import, enter the number of rows to skip.\n  |\n|\n Date Format (Advanced only) (optional)\n  |\n Select the date format used in the Excel data. If you want dates to be represented as text, select\n **Show Dates as Strings**\n .\n  |\n|\n Blank Rows (Advanced only) (optional)\n  |\n Select the desired outcome if blank rows are encountered in the Excel file. If you select\n **Skip blank rows**\n , the file is processed as normal without the blank rows. If you select\n **Stop at the first blank row**\n , everything is pulled up until the first blank row.\n  |\n|\n Empty Column Headers (Advanced only) (optional)\n  |\n Select the desired outcome if empty column headers are encountered in Excel. If you select\n **Add**\n**blank columns**\n , new columns are generated with default names applied. If you select\n **Stop at the first blank column**\n , everything is pulled up until the first column with an empty header.\n  |\n\n\n###\n Advanced pane - CSV\n\nIn this pane you configure advanced options for the CSV file you have uploaded.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Delimiter\n  |\n Select the desired delimiter for parsing your CSV file.\n  |\n|\n Quote Character\n  |\n Select the desired quote character for parsing your CSV file.\n  |\n|\n Escape Character\n  |\n Select the desired escape character for parsing your CSV file.\n  |\n|\n File Encoding\n  |\n Select the desired file encoding for your CSV file.\n  |\n|\n Add Filename Column?\n  |\n Select whether or not a BATCH\\_FILE\\_NAME\\_ column should be added to the final DataSet for your CSV file.\n  |\n|\n Header Start Row (optional)\n  |\n Enter the header row number. If you do not enter a number, the first row is considered the header row.\n  |\n|\n Data Start Row (optional)\n  |\n Enter the starting data row number. If you do not enter a number, the first row after the header row is considered the starting row.\n  |\n|\n Footer Rows to Skip (optional)\n  |\n If there are one or more rows at the bottom of the file you do not want to import, enter the number of rows to skip.\n  |\n\n\n###\n Other panes\n\nFor information about the remaining sections of the connector interface, including how to configure retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Editing your configuration\n----------------------------\n\nAs with all connector DataSets, you can edit your uploaded Excel or CSV DataSet configuration in the details view for the DataSet.\n\n\n**To edit your Excel or CSV DataSet configuration,**\n\n. Open the Data Center.\n2. Use the search and filter options to locate the DataSet you want to edit.\n3. Click on the DataSet to open its details view.\n4. Click on the\n **Settings**\n tab.\n5. Make changes as desired.\n\nFAQs\n------\n\n\n#####\n What is the file size limit for this connector?\n\nThe File Upload connector can handle files up to 250 MB. If you need to import a file larger than 250 MB, consider using the\n\nExcel SFTP\n\nconnectors.\n\n####\n Why am I getting an error saying my file is not supported?\n\nThe file you are trying to upload contains features not currently supported by the connector. Try using the File Upload Legacy connector instead.\n\n####\n How can I easily update an existing File Upload DataSet?\n\nYou can update a File Upload DataSet by doing the following:\n\n. Navigate to the DataSet in the Data Center.\n2. Open the\n **Settings**\n tab for the DataSet.\n3. Upload the new version of the file using the\n **Upload**\n field.\n\nThe DataSet will be replaced with the new version of the file, and any Cards built off of the DataSet will automatically update.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436573\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003945\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFile Upload Connector\n\n", "article_total_view_count": "\n\n\n 13,658\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "file_upload_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}