{"file_path": "../../raw_kb_v2\\article\\360042933514\\index.html", "content": {"Title": "Using the Domo Campaign Markup Language", "Article Body": "Intro\n                       \n\n                        There are many advanced features of this app that allow for even greater customization of your email campaigns. You can utilize the Domo Campaigns Markup Language to not only add more Domo content such as summary numbers or titles, but you can also specify the size of a card or limit the number of rows in a table.\n                       \n\n                        When adding a distribution list to a campaign, you must specify columns that can act as filters. The filters are used as personalized data permissions (PDP) within the app. You can always make sure that recipients of your campaign are only seeing the data that is filtered to them.\n                        \n\n                        You can also add paginated Mega Tables and Pivot Tables in the email body and PDF attachments.\n                       \n\n                        Customizing Domo Content\n                       \n\n                        Although you can already insert cards and card titles natively in the app, you can also add content by using the Domo Campaign Markup Language. To add dynamic content from a card in Domo, simply add the following text to your email or attachment body:\n                       \n\n\n\n                          {{domo-content-[card id]-[content type]}}\n                         \n\n\n\n\n\n                          Replace\n                          \n                           [card id]\n                          \n                          with the ID of the card you wish to pull from.\n                         \n\n\n\n                          Replace\n                          \n                           [content type]\n                          \n                          with the part of the card you want to reference.\n                         \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Valid content types include title, summarynumber, and description.\n                          \n\n\n\n\n                        Example 1\n                       \n\n                        You want to insert the title from card 1234567, so you would insert the text below in your email or attachment body:\n                       \n\n\n\n                          {{\n                         \n                         domo-content-1234567-title\n                         \n                          }}\n                         \n\n\n\n                        Example 2\n                       \n\n                        Now, you want to insert the summary number from card 8868777. You would insert the following text:\n                       \n\n\n\n                          {{\n                         \n                         domo-content-8868777-summarynumber\n                         \n                          }}\n                         \n\n\n\n                        Changing Width, Height, or Scale\n                       \n\n                        You can apply specific customizations to your Domo content such as width, height, or scale. simply add the following text to your email or attachment body:\n                       \n\n\n\n                          {{domo-content-[card id]-chart width=[width] height=[height] scale=[scale]}}\n                         \n\n\n\n\n\n                          Replace\n                          \n                           [card id]\n                          \n                          with the ID of the card you wish to pull from.\n                         \n\n\n\n\n                           [width]\n                          \n                          and\n                          \n                           [height]\n                          \n\n\n\n\n                          specify the size of the image you want to insert into your template.\n                         \n\n\n\n\n                           [Scale]\n                          \n                          is optional and always defaults to 1.0 if it is not set.  This allows you to insert more detailed information in a smaller space as if you've zoomed the chart out.\n                         \n\n\n\n                        Different Scales\n                       \n\n                        All of the charts below are rendered at 300 width x 400 height but at different scales. At higher scales, you get more detailed content in the same size image.\n                       \n\n                        1.0                                                                                        1.5                                                                                     2.0\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Example 1\n                       \n\n                        To insert the chart from card 8868777 and render in 800 width x 600 height, add the following text:\n                       \n\n\n\n                          {{domo-content-8868777-chart width=800 height=600}}\n                         \n\n\n\n                        Example 2\n                       \n\n                        If you wanted to insert the same card as the example above but with a scale of 2.0, add the following text:\n                       \n\n\n\n                          {{domo-content-8868777-chart width=800 height=600 scale=2.0}}\n                         \n\n\n\n                        Table Cards\n                       \n\n                        To add table cards, add the following text to your email or attachment body:\n                       \n\n\n\n                          {{domo-content-[card id]-table width=[width] height=[height] scale=[scale] max-pages=[maximum number of pages] max-rows=[maximum number of rows]}}\n                         \n\n\n\n\n\n                          Replace\n                          \n                           [card id]\n                          \n                          with the ID of the table card you wish to pull from.\n                         \n\n\n\n\n                           [width]\n                          \n\n\n\n\n                          and\n                          \n\n\n\n\n                           [height]\n                          \n\n\n\n\n                          specifies the size of the image you want to insert into your template.\n                         \n\n\n\n\n                           [Scale]\n                          \n                          is optional and always defaults to 1.0.\n                         \n\n\n\n\n                           [maximum number of pages]\n                          \n                          and\n                          \n                           [maximum number of rows]\n                          \n                          are optional. Use these options to define a maximum number of pages or rows you want to include.\n                         \n\n\n\n                        Example 1\n                       \n\n                        If you want to include up to 5 pages of data, set your\n                        \n                         [maximum number of pages]\n                        \n                        attribute to 5, shown below:\n                       \n\n\n\n                          {{domo-content-8868777-chart width=800 height=600 scale=2.0 max-pages=5 max-rows=0}}\n                         \n\n\n\n                        Example 2\n                       \n\n                        If you want to include up to 100 rows of data, no matter the number of pages required (up to 200 maximum), set the\n                        \n                         [maximum number of rows]\n                        \n                        attribute to 100 and\n                        \n                         [maximum number of pages]\n                        \n                        to 0, shown below:\n                       \n\n\n\n                          {{domo-content-8868777-chart width=800 height=600 scale=2.0 max-pages=0 max-rows=100}}\n                         \n\n\n\n\n                        Limitations and Restrictions\n                       \n\n\n                         Supported components include:\n                         \n\n                           HTML tables\n                          \n\n                           Mega tables\n                          \n\n                           Pivot tables\n                          \n\n\n\n                         The maximum number of pages for Mega and Pivot Tables is 200 pages per PDF.\n                        \n\n                         When using max-pages or max-rows tags, note the following:\n                         \n\n                           If the user sets both max-pages and max-rows to zero, the system generates all pages.\n                          \n\n                           The user must only use one pagination tag and set the other to zero. If both pagination tags have values, the app displays the following error:\n                           \n\n\n\n\n                           Mega Tables and Pivot Tables must be sorted by a column set by the user. If the tables are not sorted, the app displays the following error:\n                           \n\n\n\n\n                           The number of pages may vary depending on the width, height, and scale properties.\n                          \n\n                           In preview mode only, the user can experience timeout exceptions when loading a Mega or Pivot Table with a large amount of data when the number of pages is more than 50.\n                          \n\n\n\n\n                        Distribution List Content\n                       \n\n                        The Domo Campaigns Markup Language (DCML) can also be used to insert fields from the distribution list into campaign emails or attachments.  If you want to add a field, simply add the following text to your email or attachment body:\n                       \n\n\n\n                          {{domo-distribution-[field name]}}\n                         \n\n\n\n\n\n                          Replace\n                          \n                           [\n                          \n\n                           field name]\n                          \n                          with the name of the column in the distribution list you wish to pull from.\n                         \n\n\n\n                        Example 1\n                       \n\n                        For example, if I wanted to insert the\n                        \n\n                          Name\n                         \n\n                        field from your distribution list, you would use the text below:\n                       \n\n\n\n                          {{domo-distribution-name}}\n                         \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Columns are case sensitive. (Ex: Name is different from name.)\n                           \n\n\n\n\n\n                        Commenting out References\n                       \n\n                        If you are having problems with a reference or want to comment it out for any reason, you can simply add an exclamation point\n                        \n                         (!)\n                        \n                        at the beginning of the text.\n                       \n\n\n\n                          {{!domo-distribution-name}}\n                         \n\n\n\n                        If a reference has been commented out, it will simply be removed when rendering the\n                        \n                         HTML\n                        \n                        or pdf.\n                       \n\n                        Data Filters\n                       \n\n                        Filters are used to send a subset of your data to a given recipient by creating custom filters as columns within your distribution list.  You must have at least a single filter column but can have multiple filters that will be executed together when rendering your Domo content.  Each filter is made up of 3 separate pieces: the\n                        \n\n                          column name\n                         \n\n                        , the\n                        \n\n                          operand\n                         \n\n                        , and the\n                        \n\n                          value\n                         \n\n                        .  They are all assembled to create a single filter value, like so:\n                       \n\n\n                         State is equal to Washington\n                        \n\n\n\n\n\n                        Dataset Column Name\n                       \n\n                        The\n                        \n\n                          column name\n                         \n\n                        specifies the column to which the filter is applied. Values entered here need to match the column names in the DataSet that is powering the cards referenced in your campaign.\n                       \n\n                        Example 1\n                       \n\n\n\n                          Order Date is greater than or equal to 01/01/2018 00:00:00\n                         \n\n\n\n                        Example 2\n                       \n\n                        Or you could only include the sales data for Washington:\n                       \n\n\n\n                          Name is equal to John Smith\n                         \n\n\n\n                        Multiple DataSets\n                       \n\n                        If you are referencing multiple cards in your campaign that are powered by multiple datasets, then you\n                        \n\n                          MUST\n                         \n\n                        specify which dataset the filter applies to by providing the dataset id and the column name in this format:\n                       \n\n\n\n                          [dataset id].[column]\n                         \n\n\n\n                        Example 1\n                       \n\n                        Add a filter to only include sales data for orders placed this year would look like this:\n                       \n\n\n\n                          4bded6af-0556-4f24-b943-1858b6e84880.Order Date is greater than or equal to 01/01/2018 00:00:00\n                         \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            If all of your Domo content is powered by a single DataSet, the DataSet ID is implied and is not required.\n                           \n\n\n\n\n\n                        Operands\n                       \n\n                        There are 11 different operands that can be used to create your filter:\n                       \n\n\n\n                          Is equal to\n                         \n\n\n\n                          Does not equal\n                         \n\n\n\n                          Is greater than\n                         \n\n\n\n                          Is greater than or equal to\n                         \n\n\n\n                          Is less than\n                         \n\n\n\n                          Is less than or equal to\n                         \n\n\n\n                          Is between\n                         \n\n\n\n                          Is in\n                         \n\n\n\n                          Is not in\n                         \n\n\n\n                          Is null\n                         \n\n\n\n                          Is not null\n                         \n\n\n\n                        Value\n                       \n\n                        There are two different types of values that can be specified in the filter, a normal value and a column reference.\n                       \n\n                        Normal Value\n                       \n\n                        A normal value is considered an actual value in a column to be filtered on.  For example, if you want to add a filter where the State column is equal to CA, you simply add CA as the value.\n                       \n\n\n\n                          State is equal to CA\n                         \n\n\n\n                        Column Reference\n                       \n\n                        A column reference will take the value from any column in your distribution list and add that value to your filter.  So if you want to filter by state and you already have state defined in your distribution list, you can just reference the column by surrounding the column name with %.\n                       \n\n                        Example 1\n                       \n\n                        If the first row of your distribution list contains information for John Doe and his state is CA, the filter will be set to\n                        \n\n                          State is equal to CA\n                         \n\n                        .  If the second row of your distribution list contains information for Jane Doe and her state is UT, the filter will be set to\n                        \n\n                          State is equal to UT\n                         \n\n                        , and so forth.\n                       \n\n\n                         State is equal to %State%\n                        \n\n\n                        Wildcard Filter\n                       \n\n                        If you don't want to specify any filters and wish to send unfiltered data and information in your email campaign, you must still define one filter column with the \"wildcard\" value of\n                        \n                         *\n                        \n                        in it.  This will tell campaigns that you understand that the data and information being delivered is unfiltered.\n                       \n\n                        Multiple DataSets\n                       \n\n                        If you are referencing multiple cards in your campaign that are powered by multiple datasets, then you\n                        \n\n                          MUST\n                         \n\n                        specify which dataset the wildcard filter applies to by providing the DataSet ID in this format:\n                       \n\n\n                         [dataset id]=*\n                        \n\n\n\n\n\n\n\n\n\n                             Tip\n                            \n\n                             :\n                            \n                            You can find the DataSet ID by looking at the URL any your DataSets in Domo. (Ex:\n                            \n                             https://instancename.domo.com/datasources/\n                            \n\n                             b936442-01cc-4ddc-836f-44457f123456\n                            \n                            /details/overview)\n                           \n\n\n\n\n\n                        Example 1\n                       \n\n                        If you are referencing multiple datasets and want to specify this dataset as a wildcard, your filter column would look like this:\n                       \n\n\n                         4bded6af-0556-4f24-b943-1858b6e84880=*\n                        \n\n\n                        Using HTML to Format PDF Attachments\n                       \n\n                        You can also utilize\n                        \n                         HTML\n                        \n                        to format PDF attachments. You can define the page size, orientation, and custom page breaks when the PDF is rendered.\n                       \n\n\n\n                        Page Size and Orientation\n                       \n\n                        DCML supports the @page annotation as documented in the\n                        \n                         CSS# Paged Media module\n                        \n                        .  This allows you to easily specify the size of a page as well as the orientation by simply including some CSS in your HTML definition.  For example, to render the PDF attachment in standard letter size (8.5\" x 11\") in a landscape orientation, you would include the following code to your HTML header:\n                       \n\n\n                         <html>\n                         \n                         <head>\n                         \n                         <style type=\"text/css\">\n                         \n                         @page { size: letter landscape; }\n                         \n                         </style>\n                         \n                         </head>\n                         \n                         <body>\n                         \n                         ...\n                        \n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Standard media sizes (\n                           \n                           A5, A4, A3, B5, B4, letter, legal, and ledger) and orientations (portrait and landscape) are supported.\n                          \n\n\n\n\n                        You can also specify any custom size in the @page annotation.  For example, if you want to render the PDF in 5\" x 7\", you would add the following code to your HTML header:\n                       \n\n\n                         <html>\n                         \n                         <head>\n                         \n                         <style type=\"text/css\">\n                         \n                         @page { size: 5in 7in; }\n                         \n                         </style>\n                         \n                         </head>\n                         \n                         <body>\n                         \n                         ...\n                        \n\n\n                        The CSS3 definition also supports more sophisticated and extensive formatting which is also supported by DCML.  You can find more details in the\n                        \n                         CSS3 specification\n                        \n                        .\n                       \n\n                        Page Breaks\n                       \n\n                        In order for page break annotations to work, the\n                        \n                         @media all\n                        \n                        and\n                        \n                         @media print\n                        \n                        properties must be defined somewhere in your CSS.  If you don't have a defined CSS, simply include the following code in your HTML header:\n                       \n\n\n                         <html>\n                         \n                         <head>\n                         \n                         <style type=\"text/css\">\n                         \n                         @media all {\n                         \n                         .page-break { display: none; }\n                         \n                         }\n                         \n\n                         @media print {\n                         \n                         .page-break { display: block; page-break-before: always; }\n                         \n                         }\n                         \n                         </style>\n                         \n                         </head>\n                         \n                         <body>\n                         \n                         ...\n                        \n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            DCML supports all of the CSS page break properties (\n                            \n                             page-break-before, page-break-after,\n                            \n                            and\n                            \n                             page-break-inside\n                            \n                            ) with the exception of relatively positioned inline content and positioned/floated content which will paginate just like content in the normal flow.\n                           \n\n\n\n\n\n                        To add a manual page break to any document, you can simply add the following code to your HTML:\n                       \n\n\n                         <div class=\"page-break\"></div>\n                        \n\n\n                        HTML Tags Not Rendering\n                       \n\n                        If you have a title or summary number that contain HTML formatting, the HTML will not always render correctly in the pdf attachment.  This is due to the encoding required to convert HTML to a pdf.  In order to fix this issue, add the following flag to your DCML tag:\n                       \n\n\n\n                          encoding=false\n                         \n\n\n\n                        For example,\n                       \n\n\n\n                          {{\n                         \n                         domo-content-8868777-summarynumber encoding=false\n                         \n                          }}\n                         \n\n\n\n                        This stops Domo content from being encoded and will allow the HTML formatting to be rendered correctly.", "Preview Article": "Click here to preview", "URL Name": "360042933514", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004213", "Archived Date": "", "Language": "English", "Primary Version": "Using the Domo Campaign Markup Language", "Article Total View Count": "3,295", "": "", "Article Created Date": "10/24/2022, 9:27 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Using the Domo Campaign Markup Language\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}