{"file_path": "../../raw_kb_v2\\article\\360042924634\\index.html", "content": {"Title": "Heat Map", "Article Body": "Intro\n                        \n\n\n\n                        Heat maps are a special type of chart in which both the X and Y axes contain category data. Rectangle colors vary depending on how a particular data point fits into the specified data ranges. Heat maps allow you to visualize relationships between data categories and draw attention to \"hot spots\" of activity and trends.\n                       \n\n                        Powering heat maps\n                       \n\n                        Heat maps require three data columns or rows from your data source. Two of these contain category data, and the other contains the values for each category pair. No series data is represented. Values for each category pair are represented in your map by varying shades of color, each of which corresponds to a specific range. Ranges are determined automatically based on the distribution of values in your DataSet; however, you can also specify your own ranges in\n                        \n                         Chart Properties > Ranges\n                        \n                        . Ranges are represented by a legend, which is automatically included under the chart.\n                       \n\n                        For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your heat map. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows you how data from a typical column-based spreadsheet is converted into a heat map:\n                       \n\n\n\n\n                        Customizing heat maps\n                       \n\n                        You can customize the appearance of a heat map by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n\n\n                          Video - Creating and Customizing Heat Maps\n                         \n\n\n\n\n\n\n\n\n\n                        Unique properties of heat maps include the following. You can click a thumbnail image to see a larger image.\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Theme\n                           \n\n\n\n                            Allows you to change the color theme for a heat map. For more information about setting colors, see\n                            \n                             Changing the Default Colors in Your Chart\n                            \n                            .\n                           \n\n\n                           —\n                          \n\n\n\n\n                            General > Inner Margin\n                           \n\n\n\n                            Allows you to set the amount of space, in pixels, that separates the cells in your heat map. The example shows a heat map with margins set to\n                            \n                             8\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n                            General > Balanced Distribution\n                           \n\n\n\n                            Adjusts maps and heat maps to include a balanced number of items within each range. This is helpful in spreading values across each range when your data contains extreme outliers.\n                           \n\n                            The pair of maps in the screenshots at right how\n                            \n                             Balanced Distribution\n                            \n                            works. In these heat maps, the values of most of the squares are in the range of 2 to 100. The outlier, Eastern diamondbacks for the city of Tampa, has a value of 214.\n                            \n                             Balanced Distribution\n                            \n                            has not been turned on in the top map, so a skewed version of the data is shown—Eastern diamondbacks/Tampa appears dark and all of the other provinces appear light. In the bottom map, the user has turned on\n                            \n                             Balanced Distribution\n                            \n                            , so Eastern diamondbacks/Tampa is grouped into the same range as the square with the next highest value.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n                            General > Override Maximum Value\n                           \n\n\n\n                            Lets you specify the maximum value for a map or heat map.\n                           \n\n                            By default, Domo uses the highest value in the DataSet as the maximum value. However, by setting this property you can override this value.\n                           \n\n\n                           —\n                           \n\n\n\n\n                           Diverging > Show\n                          \n\n                           When selected, the map will be shown as a diverging map with 2 sets of color ranges, one above and one below the midpoint.\n                          \n\n\n\n\n\n\n                           Diverging > Number of Ranges\n                          \n\n                           The number of ranges to be displayed either above or below the midpoint. (Maximum is 5)\n                          \n\n                           —\n                          \n\n\n\n                           Diverging > Midpoint Value Type\n                          \n\n                           The type or value to be used as the midpoint. The default value is the median value.\n                          \n\n                           —\n                          \n\n\n\n                           Diverging > Midpoint Value\n                          \n\n                           The value used as the midpoint when the value type is set to \"Manual\".\n                          \n\n                           —\n                          \n\n\n\n                           Diverging > Show Midpoint Range\n                          \n\n                           When set, a range will be displayed for the midpoint value in the legend and chart.\n                          \n\n\n\n\n\n\n                           Diverging > Midpoint Range Color\n                          \n\n                           The color to be used for the range representing the midpoint.\n                          \n\n                           —\n                          \n\n\n\n                           Diverging > Upper Color Theme\n                          \n\n                           The colors used for ranges above the midpoint.\n                          \n\n                           —\n                          \n\n\n\n                           Diverging > Lower Color Theme\n                          \n\n                           The color theme used for the colors below the midpoint.\n                          \n\n                           —\n                          \n\n\n\n\n                            Ranges > Show Zero like No-data\n                           \n\n\n\n                            Determines whether squares in a heat map with a value of 0 display in the same gray color as those squares with no data.\n                           \n\n\n                           —\n                           \n\n\n\n\n                           Ranges > Range\n                           \n                            X\n                           \n                           Maximum Value\n                          \n\n                           Lets you specify the maximum value for a given range. For more information, see the next section.\n                          \n\n                           —\n                          \n\n\n\n                           Ranges > Range\n                           \n                            X\n                           \n                           Minimum Value\n                          \n\n                           Lets you specify the minimum value for a given range. For more information, see the next section.\n                          \n\n                           —\n                          \n\n\n\n                           Ranges > Range\n                           \n                            X\n                           \n                           Color\n                          \n\n                           Lets you select the color for a given range. For more information, see the next section.\n                          \n\n                           —\n                          \n\n\n\n\n                        Setting custom ranges\n                       \n\n                        When you create a heat map, Domo determines the range values automatically. It also bases all colors off of the theme you select in\n                        \n                         Theme\n                        \n                        in\n                        \n                         Chart Properties\n                        \n                        . If you want, you can set custom ranges by specifying the minimum and maximum range values and selecting the color for each range. You can customize up to nine ranges in a heat map.\n                       \n\n                        For example, the following screenshot shows a heat map with ranges and colors determined automatically by Domo:\n                       \n\n\n\n\n                        The Card creator decides the Card would be easier to interpret if more colors were present. He also wants to set the ranges manually instead of using the automatically determined ranges. So he sets five ranges, as follows:\n                       \n\n\n\n                          Range 1 — Minimum 1 and Maximum 20, with color set to blue\n                         \n\n\n\n                          Range 2 — Minimum 21 and Maximum 40, with color set to green\n                         \n\n\n\n                          Range 3 — Minimum 41 and Maximum 60, with color set to yellow\n                         \n\n\n\n                          Range 4 — Minimum 61 and Maximum 80, with color set to orange\n                         \n\n\n\n                          Range 5 — Minimum 81 and Maximum 100, with color set to red\n                         \n\n\n\n                        The resulting heat map appears as follows:\n                       \n\n\n\n\n\n                         To set custom ranges on a heat map,\n                        \n\n\n\n\n                          Open the Analyzer for the gauge.\n                         \n\n\n\n                          In\n                          \n                           Chart Properties\n                          \n                          , click\n                          \n                           Ranges\n                          \n                          .\n                         \n\n\n\n                          Enter a minimum value in the\n                          \n                           Range 1\n                          \n\n                           Minimum Value\n                          \n                          field.\n                          \n                          This value is the minimum value for your first range.\n                         \n\n\n\n                          Enter a maximum value in the\n                          \n                           Range 1\n                          \n\n                           Maximum Value\n                          \n                          field.\n                          \n                          This value is the maximum value for your first range.\n                         \n\n\n\n                          Click the menu next to\n                          \n                           Range 1 Color\n                          \n                          and select a color for the range.\n                         \n\n\n\n                          (Optional) Continue adding new ranges as desired.", "Preview Article": "Click here to preview", "URL Name": "360042924634", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004709", "Archived Date": "", "Language": "English", "Primary Version": "Heat Map", "Article Total View Count": "5,474", "": "", "Article Created Date": "10/24/2022, 10:25 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Heat Map\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}