{"file_path": "../../raw_kb_v2\\article\\4415872970647\\index.html", "content": {"title": "\n\n\n Silent Passenger Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSilent Passenger Telematics provides the status, performance data and whereabouts of your vehicles so you can maintain a more productive operation. It unifies all your fleet data in one easy-to-manage solution, including driver and vehicle details, incident detection, etc.\n\n\n With the Domo Silent Passenger Connector, you can receive reliable data about your divers and travel log details from any asset across your fleet, from vehicles and trailers to heavy equipment and generators. You get the real-time vehicle and asset data that you need to optimize your fleet, in one platform. Get the most reliable fleet tracking experience and vehicle data for better operational decision making. To learn more about the Silent Passenger API, visit their page (\n\nhttps://api.silentpassenger.com/\n\n).\n\n\n The Silent Passenger Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Silent Passenger account in the Data Center. This topic discusses the fields and menus that are specific to the Silent Passenger Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Silent Passenger account and create a DataSet, you must have the following:\n\n The username and password associated with your Silent Passenger account.\n* The client ID for your Silent Passenger account.\n\nConnecting to Your Silent Passenger Account\n---------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the Silent Passenger Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Silent Passenger account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into your Silent Passenger account.\n  |\n|\n Password\n  |\n Enter the username you use to log into your Silent Passenger account.\n  |\n|\n Client ID\n  |\n Enter your Silent Passenger client ID.\n  |\n\nOnce you have entered valid Silent Passenger credentials, you can use the same account any time you go to create a new Silent Passenger DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Silent Passenger report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Driver details\n  |\n Retrieves all driver details\n  |\n|\n Driverlog details\n  |\n Retrieves driver log details\n  |\n\n|\n|\n Driver Detail Report\n  |\n Select the driver.\n  |\n|\n Date Selection\n  |\n Select the date format for your data.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n\n\n**Days Back**\n\n\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ********End Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ********Start Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the Silent Passenger API does this Connector use?\n\nThis Connector uses version 3 of the Silent Passenger API (\n\nhttps://api.silentpassenger.com/REST/v3\n\n).\n\n###\n Which endpoint(s) does each report call in this Connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n Driver details\n  |\n /eld/drivers\n  |\n|\n Driverlog details\n  |\n /eld/driver-logs\n  |\n\n\n####\n What kind of credentials do I need to power up this Connector?\n\nYou need the username, password, and client ID associated with your Silent Passenger account.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4415872970647\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003210\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSilent Passenger Connector\n\n", "article_total_view_count": "\n\n\n 2,357\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "silent_passenger_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}