{"file_path": "../../raw_kb_v2\\article\\360043437813\\index.html", "content": {"Title": "Exporting Visualization Cards", "Article Body": "You can export an individual Visualization Card to a\n                        \n                         .csv\n                        \n                        file, a Microsoft Excel spreadsheet file, or a Microsoft PowerPoint presentation. You can also export all of the Visualization Cards in a dashboard to PowerPoint, with one card per slide. If you export all the cards on a dashboard to PowerPoint, any non-visualization cards may not be exported, such as Notebook, Document, or Sumo Cards.\n                       \n\n                        If you have filtered card data in either the dashboard or card Details view, those Filters remain in place when the cards are exported. For more information about using Page Filters, see\n                        \n                         Adding Filters to Your Chart\n                        \n                        .\n                       \n\n\n\n                          The exception to this is Filters that have been set for the card in the\n                          \n                           Edit\n                          \n                          view. These Filters are considered implicit elements of the card. Even if you modify these Filters using Analyzer, they are retained in the exported version of the data.\n                         \n\n\n\n                        Likewise, if the data in a card is filtered due to PDP policies, those Filters are applied in the exported version.\n                       \n\n                        You can also export all the cards on a dashboard as a slideshow in Domo and then download it as a Microsoft PowerPoint presentation. This is essentially the same as using the\n                        \n                         Export as PowerPoint option\n                        \n                        discussed in this topic but requires extra steps. However, it also provides additional options not available when downloading directly to PowerPoint. For more information, see\n                        \n                         Exporting Publications\n                        \n                        .\n                       \n\n                        You can export a drill down layer of a card as well. For more information on how to export a drill down, see\n                        \n                         Exporting Data from a Drill Path\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n                              When you export a Visualization Card to a Microsoft PowerPoint presentation, it appears as is, in its card state. When you export a card to Excel or CSV, only the data from the card is pulled; graphical elements of the card only appear when exporting to Excel.\n                             \n\n\n\n                              Files cannot exceed 4MB in size for export purposes.\n                             \n\n\n\n                              When exporting to Excel, only data that is displayed in the card will be exported, up to 1M cells of data while exporting to CSV will output all rows. For Megatables, Pivot tables, and HTML tables, this is 50k rows by default and up to 100k rows by manually increasing the row limit inside of Analyzer.\n                             \n\n\n\n                              HTML tables are not limited to 1M cells.\n                             \n\n\n\n                              For Pivot tables, the limit is applied on the DataSet rows rather than the pivoted data rows.\n                             \n\n\n                             When exporting a Table Card with aggregations grouping rows together, the data will remain aggregated. To see the raw data, you must remove the aggregation in your table first, then export.\n                            \n\n                             Be aware that when you export Heat Map Tables to Excel or CSV, the exported data may appear differently than expected, as it renders to match the table view of the data,\n                             \n                              not\n                             \n                             the card view. For more information about Heat Map Tables, see\n                             \n                              Card Details View Layout - Table view\n                             \n\n                              .\n                             \n\n\n\n                              Only Pivot Tables and Mega Tables support exporting color rules.\n                             \n\n\n\n                              You can use a spreadsheet or text editor application to open a\n                              \n                               .CSV\n                              \n                              file to see the exported data.\n                             \n\n\n\n                              When you export a card, an event called \"Exported DataSet\" appears in the Activity Log in the Admin Settings. This may lead to the assumption that the user who exported the card has access to the DataSet, but this is not necessarily the case.\n                             \n\n\n\n                              If your data contains a string data type column that contains only numeric values, such as zip codes, it will be exported with a single quote added to the beginning of every value in the column to prevent Excel from enabling their auto macro functionality. (e.g. '84084)\n                             \n\n\n\n                              Both CSV and XLSX exports append a single quote on string columns displaying negative numbers. This is for security purposes, to prevent auto-macro functionality. If you remove the quotes, the cell values immediately become active macros.\n                             \n\n\n\n\n\n\n\n\n\n                          Video - Filtering and Exporting a Card\n                         \n\n\n\n\n\n\n\n\n                        Follow these steps to export a dashboard and all its cards to PowerPoint:\n                       \n\n\n\n                          (Conditional) If you want to filter data, use Page Filters to filter data on the dashboard.\n                         \n\n\n\n                          In the\n                          \n                          menu in the top right corner of the Page, select\n                          \n                           Export as PowerPoint\n                          \n                          .\n                         \n\n\n\n                        The dashboard and cards are downloaded to PowerPoint, with one card per slide.\n                       \n\n                        You can export a single Visualization Card from either the dashboard or the Details view.\n                       \n\n                        Follow these steps to export a single Visualization Card:\n                       \n\n\n\n                          (Conditional) If you want to filter data, use Page or Card Filters to filter data in the Page or Card Details view.\n                         \n\n\n\n                          Do either of the following:\n                         \n\n\n\n                            (Conditional) If you are in the Card Page, mouse over the Card that you want to export, click\n                            \n                            >\n                            \n                             Send / Export\n                            \n                            .\n                            \n                            The\n                            \n                             Export\n                            \n                            dialog opens.\n                           \n\n\n\n                            (Conditional) If you are in the Details view, click\n                            \n                            >\n                            \n                             Send / Export\n                            \n                            .\n                            \n                            The\n                            \n                             Export\n                            \n                            dialog opens.\n                           \n\n\n\n\n\n                          Select the option you want.\n                          \n                          Depending on the type, options include\n                          \n                           Email\n                          \n                          ,\n                          \n                           Print\n                          \n                          ,\n                          \n                           Excel\n                          \n                          ,\n                          \n                           CSV\n                          \n                          , or\n                          \n                           PowerPoint\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Sumo and Notebook Cards cannot currently be exported.", "Preview Article": "Click here to preview", "URL Name": "360043437813", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004053", "Archived Date": "", "Language": "English", "Primary Version": "Exporting Visualization Cards", "Article Total View Count": "5,995", "": "", "Article Created Date": "10/24/2022, 9:19 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Exporting Visualization Cards\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Consuming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamnGAC"}, {"text": "\n\n               Exporting Cards And Dashboards\n              \n", "url": "/s/topic/0TO5w000000ZanjGAC"}]}