{"file_path": "../../raw_kb_v2\\article\\360042926234\\index.html", "content": {"Title": "Viewing the Impact of Changes to DataSets", "Article Body": "Intro\n                       \n\n                        Before you make changes to DataSets, it is vital that you understand the impact those changes will have on other DataSets, DataFlows, Cards, and Alerts that are associated with that DataSet, both directly and indirectly. For example, you might have a DataSet that is used in a DataFlow, which is used to power a Card, which an Alert has been set on. Making changes to this DataSet directly impacts the DataFlow and indirectly impacts the Card and Alert further downstream. If the changes cause anything to break, everything downstream breaks also.\n                       \n\n                        Domo's Data Impact Analysis tool, available in the details view for a DataSet, helps you understand the impact of actions you take on your DataSets.\n                       \n\n                        Impact Card\n                       \n\n                        When you open the details view for a DataSet, a new card in the\n                        \n                         Overview\n                        \n                        tab shows you the number of DataSets, DataFlows, Cards, and Alerts directly and indirectly impacted by changes to that DataSet. The card displays the direct impact for each, along with the total number of impacts. So in the following example, we could deduce that changes to the DataSet would affect 99 Cards directly and only 1 indirectly (since the total is 100).\n                       \n\n\n\n\n                        Lineage View\n                       \n\n                        Clicking\n                        \n\n                          View Full Impact\n                         \n\n                        opens a new\n                        \n\n                          Lineage\n                         \n\n                        view, in which you can see the upstream and downstream impact of changes made to the DataSet. You can also see the lineage for a DataSet simply by clicking on the\n                        \n                         Lineage\n                        \n                        tab.\n                       \n\n                        Icons in the Lineage view\n                       \n\n                        Different kinds of connections in the Lineage view are indicated by different icons. These icons are as follows:\n                       \n\n\n                        - Indicates that a DataFlow was used to generate the child DataSet.\n                       \n\n\n                        - Indicates that a DataFusion was used to generate the child DataSet.\n                       \n\n\n                        - Indicates that this DataFlow has been selected (by clicking on the icon). Selecting a DataFlow opens an information panel on the left side of the screen. Clicking the arrow opens the details view for the DataFlow. If you do not have rights to view the DataFlow, you cannot see the details in this panel.\n                       \n\n\n                        -  Indicates that this DataFusion has been selected (by clicking on the icon). Selecting a DataFusion opens an information panel on the left side of the screen. Clicking the arrow opens the details view for the DataFusion.\n                       \n\n\n                        - Indicates that this DataFlow is broken.\n                       \n\n                        Other icons used in this view are as follows:\n                       \n\n\n                        - Opens the fullscreen Lineage view.\n                       \n\n\n                        - Closes the fullscreen Lineage view.\n                       \n\n\n                        - Opens the right-hand panel.\n                       \n\n\n                        - Closes the right-hand panel.\n                       \n\n                        You can also click on a DataSet (represented by the rectangles) to see information about that DataSet in the info panel.\n                       \n\n                        Info Panel\n                       \n\n                        When you click on a DataFlow or DataFusion icon in the Lineage view, an info panel opens on the left side of the screen. This panel shows the owner, the number of direct and indirect impacts on downstream elements, input and outset DataSets (for DataFlows and DataFusions), the update history, and the number of rows and columns (for DataSets). If you do not have access to a given DataSet, DataFlow, or DataFusion, you cannot view the information in the panel. For DataSets, a button appears that allows you to request access from the owner. For DataFlows and DataFusions, a simple message appears stating that you do not have access.\n                       \n\n                        List Panel\n                       \n\n                        A collapsible panel on the right allows you to see all of the individual DataSets, DataFlows, Cards, and Alerts powered by this DataSet. Click\n                        \n                        to see impacted DataSets,\n                        \n                        to see DataFlows,\n                        \n                        to see Cards, and\n                        \n                        to see Alerts.", "Preview Article": "Click here to preview", "URL Name": "360042926234", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004902", "Archived Date": "", "Language": "English", "Primary Version": "Viewing the Impact of Changes to DataSets", "Article Total View Count": "4,827", "": "", "Article Created Date": "10/24/2022, 10:34 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Viewing the Impact of Changes to DataSets\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Data Center Overview\n              \n", "url": "/s/topic/0TO5w000000ZanRGAS"}]}