{"file_path": "../../raw_kb_v2\\article\\360043438753\\index.html", "content": {"Title": "Social Performance", "Article Body": "Intro\n                       \n\n                        The Social Performance app allows you to connect your social media data directly to Domo. The Social Performance is set-up to include your Facebook, Twitter, Instagram, and YouTube data to display in the app. The app displays engagement rates, impressions, and average engagement rates to keep you updated on how your social media presence is performing. Always be in the know about your social media performance with the Social Performance app.\n                       \n\n\n\n\n                        Connecting Your Data\n                       \n\n                        Connecting your data to the Social Performance app is extremely easy and only requires you to upload two datasets to Domo.\n                       \n\n\n                         Follow these steps to connect your data to the app:\n                        \n\n\n\n                         Once you have downloaded the app from the Appstore, you'll be asked to create a page in Domo for the app to live. Once you have placed the app in a page, navigate to the app and you should see a prompt along the top of the app's page asking you to connect your company data with the Social Performance app.\n                        \n\n                         You can either choose to assign the task of uploading data to the Data Expert in your organization or upload the data yourself. Note that you'll need to have this data uploaded to Domo before you can connect it to the app.\n                        \n\n\n\n\n\n\n                         The two datasets you'll need to upload should be called \"Social Performance Trended Impressions\" and \"Social Performance Metrics\".\n                        \n\n                         The \"Social Performance Trended Impressions\" dataset should include three columns: Date (Ex: Wk1, Wk2), Impressions: (Ex: 4059, 5490), and Source (Ex: Facebook, Instagram). Look at the example below for an idea of what your data should look like.\n                        \n\n\n\n\n\n\n                         The \"Social Performance Metrics\" dataset should include five columns: Channel (Ex: Facebook, Instagram), Metric (Ex: Engagement, Impressions, Logo), Value (18504, 0), Text (Ex: link to your logo or background), and Select Text (Ex: Facebook, Sums). Look at the example below for an idea of what your data should look like.\n                        \n\n\n\n\n\n\n                         Select the connect button on either of the datasets on the app page to connect your data.\n                        \n\n                         Once you have connected both of your Social Performance datasets, refresh the page and your app should now display according to your metrics.\n                        \n\n\n\n\n\n                        Parts of the App\n                       \n\n                        Top Panel\n                       \n\n                        The Top Panel in the Social Performance app displays the last 60 days worth of data according to your connected data. The Average Engagement Rate, Total Impressions, and Total Engagements across all four of the social media apps will also be displayed in the Top Panel.\n                       \n\n\n\n\n                        App Performance\n                       \n\n                        Each of the four apps: Facebook, Twitter, Instagram, and YouTube, should be displayed in the center of the app. Each individual app should use a gauge to show the overall Engagement Rate, an eye with a bar graph for Impressions, and a circle-meter for the Engagements. The app also has hover capabilities, so if you hover over a certain metric it should react to the mouse-hover.\n                       \n\n\n\n\n                        How Do I Get This?\n                       \n\n\n\n                          To begin using the Flex Map App, locate the app in the Domo Appstore or have an admin contact your Customer Success Manager.", "Preview Article": "Click here to preview", "URL Name": "360043438753", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004160", "Archived Date": "", "Language": "English", "Primary Version": "Social Performance", "Article Total View Count": "2,380", "": "", "Article Created Date": "10/24/2022, 9:26 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Social Performance\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}