{"file_path": "../../raw_kb_v2\\article\\360043439873\\index.html", "content": {"title": "\n\n\n January 2019 Release Notes\n\n\n", "article_body": "\n\n\n New Features and Enhancements\n--------------------------------\n\nFeatures and enhancements in this release include the following:\n\n##\n Workbench 5\n\nWe are excited to announce that a brand new version of Workbench is now available for download. In addition, in February 2019, all users of Workbench 4 will be automatically migrated to Workbench 5, saving you the trouble of having to manually update your install. If you don't want to be automatically migrated, you can switch the auto-update toggle to off by going to\n **More >**\n**Settings > Updates**\n then unchecking the box reading\n **Install updates automatically**\n .\n\n\n In Workbench 5, know that every job has run successfully with the new job status charts right on the home page (shown below). As you navigate through the new UI, add, change, and check jobs all from one location so you can get in and out quickly and get back to work. And, if you run into a snag, find help articles directly in Workbench, without ever having to leave.\n\nWith Workbench 5, you'll finally have the visibility into your jobs you've always wanted.\n\n\n For more information, see\n\nWorkbench 5 Overview\n\n.\n\n##\n Page Filtering in Overview and Favorites Pages\n\nPage filters are now available in the Overview and Favorites pages, allowing all users (regardless of permission level) to customize those pages for their specific needs.\n\nFor more information about page filtering, see\n\nApplying Page-Level Filters\n\n.\n\n##\n Group Approval Support for Certified Content\n\nCertified content now supports adding Domo groups as approvers in the approval chain of any certification process. This allows Admin users to enable the feature to adjust to organizational changes, accommodate for approvers on extended leave, and eliminate a sea of certification approvals waiting on a single person. With group approval steps, certified content requires less maintenance by Admin users while enabling content to be certified faster and more efficiently.\n\nFor more information about certifying content, see\n\nCertifying Cards and DataSets\n\n.\n\n##\n Grants for Requesting Certification and Downloading Workbench\n\nTwo new user privileges have been added to our list of grants available for creating custom roles for your company's Domo users. These are...\n\n \"Request certification.\" Allows users to submit certification requests for content.\n* \"Download Workbench.\" Allows users to download Workbench from the\n **On Premise**\n page in Data Center.\n\nThese grants give you even more control over who gets to do what in your Domo instance.\n\n\n For more information about grants and how to build new custom roles, see\n\nManaging Custom Roles\n\n.\n\n##\n Easy Indexing in SQL DataFlows\n\nEasy Indexing in SQL DataFlows enables you to embed data indices directly into your DataFlows, thereby increasing the performance of your DataFlow runtimes.\n\nBe aware that existing index transforms are not automatically converted into new indices. Also note that Easy Indexing is for MySQL DataFlows only, not ETL or Redshift.\n\n\n For more information, see\n\nCreating an SQL DataFlow\n\n.\n\n##\n Improved PowerPoint Export\n\nWhen you export a card page to PowerPoint, a status bar now appears in the bottom left corner of the screen to show the completion of the export. This allows you to continue working in Domo as the export occurs without losing visibility into your export status.\n\n\n###\n JavaScript API Filtering for Domo Everywhere\n\nThe Domo Everywhere JavaScript API drastically accelerates the load time when filters are applied to multiple embedded cards. Instead of reloading the entire page and filtering each card in sequence, the page context is maintained and the cards are filtered simultaneously. This reduces flicker which can interrupt the user experience of the portal or application where the cards are embedded. Filter states can now be saved across user sessions by the end client so that the latest views are persisted by Domo for future logins.\n\n\n For more information, visit the API section of Domo's developer portal at\n\nhttps://developer.domo.com/manage-domo\n\n.\n\n\n Other Announcements\n---------------------\n\n\n###\n URL Redirects in Knowledge Base\n\nWhen referencing Knowledge Base pages in other applications such as email, you can now just use the page URLs, rather than the hard-coded URLs shown at the top of every page. These hard-coded URLs were created to prevent breaking of links used externally in email and other applications anytime a page was moved or renamed. Now, however, automatic redirects are in place for moved or renamed pages, so the hard-coded URLs are no longer necessary. Thus, the boxes at the top of each page reading \"Important: When referencing this page outside of Knowledge Base, use this link\" will be removed. Note that all existing hard-coded links will be preserved in the Knowledge Base, so if you are using any of these links externally, they will continue to work as normal.\n\n\n Getting Help\n--------------\n\nYou can view the latest release notes information in the Help Center, which you can access from Domo by clicking by clicking\n\nin the top navigation bar .\n\n\n If you have questions about Domo,\n\n search for a topic in the Help Center\n* train in Domo University at\n\nhttp://university.domo.com\n* search for training apps in the Appstore\n* get answers in the Domo Community at\n\nhttps://dojo.domo.com\n* contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n\n/support\n\n.\n* reach out to your Domo Customer Success Manager or Technical Consultant\n\nIf you have feedback, please send it from within Domo (\n\n***> Feedback****\n ). Or send an email to\n\nproduct.feedback@domo.com\n\n.\n\n\n For more information about getting help, see\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043439873\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004426\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nJanuary 2019 Release Notes\n\n", "article_total_view_count": "\n\n\n 11,579\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:09 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "january_2019_release_notes", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "release_notes", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "archived_feature_release_notes", "url": "/s/topic/0TO5w000000Zan7GAC"}]}