{"file_path": "../../raw_kb_v2\\article\\360043440653\\index.html", "content": {"Title": "February 2017 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n\n                         Buzz\n                        \n\n\n                        Share and collaborate like never before using Domo's newly revamped collaboration tool, now simply called Buzz. Share insights with anyone in your company, even those not in Domo. Collaborate with real-time data in groups or privately on any device. Make your coworkers laugh out loud with GIFs and emojis.\n                       \n\n                        The new Buzz includes all of the following new features/improvements:\n                       \n\n\n\n                          Real-time chat with people and groups.\n                         \n\n\n\n                          Two types of conversations:\n                         \n\n\n\n                            \"People\" conversations centered around users and groups in your organization.\n                           \n\n\n\n                            \"Data\" conversations centered around pages, cards, and projects.\n                           \n\n\n\n\n\n                          Ability to tag conversations as \"Favorites\" then quickly find them whenever you need them in a custom-sortable Favorites tab.\n                         \n\n\n\n                          Two primary views for finding and opening your messages:\n                         \n\n\n\n\n                             Inbox\n                            \n                            , with three category tabs (\n                            \n                             Favorites\n                            \n                            ,\n                            \n                             Data\n                            \n                            , and\n                            \n                             People\n                            \n                            ) for your conversations with recent activity.\n                           \n\n\n\n\n                             Discovery Feed\n                            \n                            , in which you can browse a listing of all conversations in your Domo.\n                           \n\n\n\n\n\n                          \"Universal Compose\" feature that allows you to start conversations on the fly.\n                         \n\n\n\n                          Ability to quote reply, add messages as \"Favorites,\" and insert reactions and emojis.\n                         \n\n\n\n                          Card and page tagging.\n                         \n\n\n\n                          \"Bots\"—third-party integrations with Buzz\n                         \n\n\n\n                          Downloadable Buzz desktop app\n                         \n\n\n\n                          Free Social users—a new security role that allows users to use only Buzz, Profiles, and Projects and Tasks.\n                         \n\n\n\n                          Ability to send support tickets using\n                          \n                           \\support\n                          \n                          .\n                         \n\n\n\n                          Lots more!\n                         \n\n\n\n                        Buzz integrates fully into Domo's enterprise Business Cloud.\n                       \n\n\n\n                          Inbox\n                         \n\n\n\n\n\n\n\n\n                          Discovery Feed\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                          Conversation Pane\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                          Details View\n                         \n\n\n\n\n\n\n\n\n\n\n                        \"Social\" User\n                       \n\n                        The \"Social\" user role is now available in Domo. Social users can access Domo for free and have unlimited access to all of Domo’s social features, including Buzz, Profiles, and Projects & Tasks. They can also view cards that have been shared with them. They cannot create cards or drill into new cards. On mobile they can see pages but not go into interactive mode on charts. On the web version, they cannot see pages at all.\n                       \n\n                        You can grant access to your Domo instance to an unlimited number of social users. Social users can be invited into your instance by other users (including other Social users).\n                       \n\n\n\n\n                        For more information, see our\n                        \n                         Security Role Reference\n                        \n                        .\n                       \n\n                        Report Scheduler\n                       \n\n                        Domo’s new Report Scheduler allows you to get those critical reports into the right hands faster and easier than ever.  With just a few clicks of the mouse, you can enable the delivery of any card or page by email at just the right time. You can use this feature to send reports to any\n                        \n                         Domo user in your instance or any non-Domo user with an authorized domain\n                        \n                        . Report recipients will see the card details for every card included in the report. Cards in the email are ordered the same way as in Domo, including collections. Recipients with a Domo account can quickly link back to the live card or page in Domo from their desktop or mobile device.\n                       \n\n\n                         You can also manage your reports. In the Report Scheduler page you can see all reports you've created\n                        \n                        and those you receive. You can subscribe and unsubscribe to any of your reports, as well as edit each report’s schedule, view the report histories, send reports immediately, delete reports, and enable or disable individual reports. You can also make Analyzer changes to a report for a page or card that affect only the report; visitors to the actual page or card will not see the filters you have applied.\n                       \n\n\n                         If you have an \"Admin\" security profile, you can manage all reports for your company. Y\n                        \n                        ou can edit individual report schedules as well as delete or enable and disable any report. You can also see a full history, including the ability to isolate successful or unsuccessful messages. Finally, if for any reason you need to suspend all Report Scheduler activity, you can disable this feature entirely. Disabling Report Scheduler does not delete or destroy any of the reports that have been scheduled; it simply suspends the sending of reports until the feature is re-enabled.\n                        \n\n\n\n\n\n                        For more information, see\n                        \n                         Scheduling Reports\n                        \n                        .\n                       \n\n\n                         CSV Upload\n                        \n\n\n                        You can use Domo's CSV Upload connector to build DataSets based on CSV data.\n                        \n                         Just like our Microsoft Excel and Google Sheets connectors, the CSV connector allows you to  add KPI cards powered by CSV data directly to a page without having to open the Data Center. If you want, you can also add CSV DataSets from the Data Center and then build cards afterward, just as you can with all of Domo's other third-party connectors.\n                        \n\n\n                        CSV files can be uploaded to Domo using any of the following methods:\n                       \n\n\n\n                          Sending them to a Domo-hosted SFTP server, either by uploading through your favorite SFTP client, using the command line, or sending directly from a service such as Adobe Analytics.\n                         \n\n\n\n                          Uploading directly from your machine or network.\n                         \n\n\n\n                          Copying and pasting the CSV content right into Domo.\n                         \n\n\n\n\n\n\n                        For more information about these and other connectors, see\n                        \n                         CSV Upload Connector\n                        \n                        .\n                       \n\n                        Ability to save page-level filters\n                       \n\n                        You can now save page-level filters to that page so they are already set anytime you visit that page. These filters are applied only to your specific Domo instance, so other users navigating to the page will not see the filters applied. This ability is especially useful for Participant-level users, as they can manipulate filters set by other users and save the updated filters to their own Domo instances.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Applying Page-Level Filters\n                        \n                        .\n                       \n\n                        Workbench Updates\n                       \n\n                        Workbench 4.5.1 has been released, and includes the following fixes and improvements:\n                       \n\n\n\n                          Ability to create SFTP connections with an SSL certificate.\n                         \n\n\n\n                          OLAP now locates all providers on your machine.\n                         \n\n\n\n                          Improved handling of custom values.\n                         \n\n\n\n                          Ability to search for Workbench 2 DataSet Jobs and migrate them into Workbench 4.\n                         \n\n\n\n                          Ability to bulk-export DataSet Jobs.\n                         \n\n\n\n                          Ability to grab a dynamic file name.\n                         \n\n\n\n                          Ability to specify comment characters for a CSV file. In addition, the CSV reader no longer requires escape characters.\n                         \n\n\n\n                          Updated connection delete behavior. If you delete an account then log in again, by default all the jobs are still there.\n                         \n\n\n\n                          Option to limit the number of concurrent jobs running.\n                         \n\n\n\n\n\n                        Sumo Available in PowerPoint Plugin\n                       \n\n                        You can now use Domo's PowerPoint plugin to download Sumo table data into PowerPoint. There are a few points to keep in mind with this functionality, which are as follows:\n                       \n\n\n\n                          The plugin downloads Sumo\n                          \n                           table data\n                          \n                          into PowerPoint, not actual Sumo\n                          \n                           cards\n                          \n                          . It does not honor or render any Sumo logic, colors, etc.\n                         \n\n\n\n                          Large Sumo tables will be divided into smaller cards in your presentation. The size of these cards depends on the number of cards per slide you select in\n                          \n                           Templates\n                          \n                          . So if you select\n                          \n                           Single Card\n                          \n                          , you will get larger cards than if you selected\n                          \n                           Dual Cards\n                          \n                          or\n                          \n                           Four Cards\n                          \n                          . The maximum number of cards you can select for any size is 10. Therefore, if you want to download as much data as possible, you should select\n                          \n                           Single Card\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n                        For more information, see\n                        \n                         Using the Domo PowerPoint Plugin\n                        \n                        .\n                       \n\n                        Customizable Home Screen for Mobile\n                       \n\n                        The Home page is the go-to location on Mobile for bookmarking the content you use most. You can now add Home tiles for any card or page, as well as find preset trending tiles. Once you've added or removed the tiles specific to you, you can reorder them to personalize your layout.\n                       \n\n                        End of Support for Image Cards\n                       \n\n                        To make the Domo experience better and simplify the number of card types, we have removed Image Cards. You can now use document cards to upload images, along with other file types such as .doc, .pdf, and so on.\n                       \n\n                        For more information about document cards, see\n                        \n                         Document Cards\n                        \n                        .\n                       \n\n                        New IP Address for Whitelisting\n                       \n\n                        Most of Domo's database connectors (MySQL, Mongo, etc.) now require that the following additional IP address be whitelisted:\n                       \n\n\n                         34.198.214.100\n                        \n\n\n                        For more information about whitelisting, see\n                        \n                         Whitelisting IP Addresses\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n                          .\n                         \n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal, by sending a Buzz message to\n                          \n                           \\support\n                          \n                          , or by emailing\n                          \n                           support@domo.com\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043440653", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004443", "Archived Date": "", "Language": "English", "Primary Version": "February 2017 Release Notes", "Article Total View Count": "4,708", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              February 2017 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}