{"file_path": "../../raw_kb_v2\\article\\360043434633\\index.html", "content": {"title": "\n\n\n Podio Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nCitrix Podio is a cloud-based collaboration service that supplies a web-based platform for organizing team communication, business processes, data, and content in project management workspaces.  To learn more about the Podio API, visit their page (\n\nhttps://developers.podio.com/\n\n).\n\n\n You connect to your Podio account in the Data Center. This topic discusses the fields and menus that are specific to the Podio connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Podio account and create a DataSet, you must have the email address you used to register for Podio as well as a Podio password. Alternatively, if you have signed into Podio using ShareFile, Google, Facebook, or Microsoft credentials, you can connect using those credentials.\n\n\n Connecting to Your Podio Account\n----------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Podio Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Podio connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Podio accounts in Domo) to open the Podio OAuth screen where you can enter your Podio email address and password. Alternatively, if you have signed into Podio using ShareFile, Google, Facebook, or Microsoft credentials, you can connect using those credentials. Once you have entered valid credentials, you can use the same account any time you go to create a new Podio DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Podio when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Podio.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Podio report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n App Market Categories Functional\n  |\n Returns functional app market categories available in the system.\n  |\n|\n App Market Categories Vertical\n  |\n Returns vertical app market categories available in the system.\n  |\n|\n App Market Own Shares\n  |\n Returns all the apps that the active user has shared.\n  |\n|\n App Stream\n  |\n Returns the stream for the selected app.\n  |\n|\n App Voting\n  |\n Returns app voting information.\n  |\n|\n Batches\n  |\n Returns the batches created by the user, sorted by descending date of creation.\n  |\n|\n Calendar Summary\n  |\n Returns the calendar summary for the authenticated user.\n  |\n|\n Contact Skills\n  |\n Returns the skills of related contacts, ordered by most frequently used.\n  |\n|\n Contacts\n  |\n Returns a list of contacts.\n  |\n|\n Email Groups\n  |\n Returns the subscription status for all email groups.\n  |\n|\n Export Items\n  |\n Returns a list of exported items.\n  |\n|\n Files\n  |\n Returns a list of files for the selected criteria.\n  |\n|\n Forms\n  |\n Returns a list of active forms on the selected app.\n  |\n|\n Global Calendar Exports\n  |\n Returns exports configured for the global calendar.\n  |\n|\n Integration\n  |\n Returns integration data for the selected app.\n  |\n|\n Items\n  |\n Returns a list of items.\n  |\n|\n Notifications\n  |\n Returns a list of notifications based on the selected filters.\n  |\n|\n Organization Contacts\n  |\n Returns the profiles of the user's contacts in the given organization.\n  |\n|\n Profile\n  |\n Returns the status of the authenticated user.\n  |\n|\n Search\n  |\n Returns data based on a search of all items, files, and tasks.\n  |\n|\n Space Members\n  |\n Returns the members of the selected space.\n  |\n|\n Task Labels\n  |\n Returns the user's task labels.\n  |\n|\n Tasks\n  |\n Returns a list of tasks for the selected filters.\n  |\n|\n Total Contacts Count\n  |\n Returns the total number of contacts for the authenticated user.\n  |\n|\n User\n  |\n Returns data for the authenticated user.\n  |\n|\n User Contacts\n  |\n Returns a list of contacts for the authenticated user.\n  |\n|\n Voting Results\n  |\n Returns the results of voting on an item.\n  |\n\n|\n|\n Organization\n  |\n Select the organization you want to retrieve data for.\n  |\n|\n Spaces\n  |\n Select the spaces you want to retrieve data for.\n  |\n|\n Application\n  |\n Select the application you want to retrieve data for.\n  |\n|\n View ID\n  |\n Select the view ID you want to retrieve data for.\n  |\n|\n Item ID\n  |\n Select the item ID you want to retrieve data for.\n  |\n|\n Query\n  |\n Enter the search term you want to retrieve data for.\n  |\n|\n Type\n  |\n Select whether to retrieve data on app or pack shares.\n  |\n|\n Subreport\n  |\n Select a subreport for the selected report type.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043434633\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003455\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nPodio Connector\n\n", "article_total_view_count": "\n\n\n 2,376\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "podio_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}