{"file_path": "../../raw_kb_v2\\article\\360043433773\\index.html", "content": {"Title": "CallTrackingMetrics Connector", "Article Body": "Intro\n                       \n\n                        CallTrackingMetrics is a SaaS company that provides call tracking tools and analysis to organizations. Use Domo's CallTrackingMetrics connector to retrieve data about calls, users, voice menus, schedules, and more. To learn more about the CallTrackingMetrics API, visit their page (\n                        \n                         https://www.calltrackingmetrics.com/developers/\n                        \n                        ).\n                       \n\n                        You connect to your CallTrackingMetrics account in the Data Center. This topic discusses the fields and menus that are specific to the CallTrackingMetrics connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your CallTrackingMetrics account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The token for the CallTrackingMetrics account\n                         \n\n\n\n                          The secret key for the CallTrackingMetrics account\n                         \n\n\n\n                        Connecting to Your CallTrackingMetrics Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the CallTrackingMetrics Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your CallTrackingMetrics account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Token\n                           \n\n\n\n                            Enter the token for the CallTrackingMetrics account.\n                           \n\n\n\n\n\n                            Secret\n                           \n\n\n\n                            Enter the secret key for the CallTrackingMetrics account.\n                           \n\n\n\n\n\n\n                         Once you have entered valid CallTrackingMetrics credentials, you can use the same account any time you go to create a new CallTrackingMetrics DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the CallTrackingMetrics report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Calls\n                               \n\n\n\n                                Returns a list of calls for the account.\n                               \n\n\n\n\n\n                                GeoRouters\n                               \n\n\n\n                                Returns a list of GeoRouters for the account.\n                               \n\n\n\n\n\n                                Numbers\n                               \n\n\n\n                                Returns a list of numbers for the account.\n                               \n\n\n\n\n\n                                Queues\n                               \n\n\n\n                                Returns a list of queues for the account.\n                               \n\n\n\n\n\n                                Receiving Numbers\n                               \n\n\n\n                                Returns a list of receiving numbers of the account.\n                               \n\n\n\n\n\n                                Schedules\n                               \n\n\n\n                                Returns a list of schedules for the account.\n                               \n\n\n\n\n\n                                Sources\n                               \n\n\n\n                                Returns a list of sources for the account.\n                               \n\n\n\n\n\n                                Users\n                               \n\n\n\n                                Returns a list of users for the account.\n                               \n\n\n\n\n\n                                Voice Menus\n                               \n\n\n\n                                Returns a list of voice menus for the account.\n                               \n\n\n\n\n\n                                Webhooks\n                               \n\n\n\n                                Returns a list of webhooks for the account.\n                               \n\n\n\n\n\n\n\n\n\n                            CallTrackingMetrics Account Details\n                           \n\n\n\n                            Select the account you want to retrieve information for.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043433773", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003538", "Archived Date": "", "Language": "English", "Primary Version": "CallTrackingMetrics Connector", "Article Total View Count": "2,369", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              CallTrackingMetrics Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}