{"file_path": "../../raw_kb_v2\\article\\360043435633\\index.html", "content": {"Title": "CargoWatch Connector", "Article Body": "Intro\n                       \n\n                        CargoWatch is a telematics application that optimizes logistics management solutions for transportation service providers who use freight transportation assets. Use Domo's Cargowatch connector to get visibility into dry assets, maximize usage, reduce operational costs, and improve delivery predictability. To learn more about CargoWatch, visit their page (\n                        \n                         https://www.orbcomm.com/en/solutions/web-applications/cargowatch\n                        \n                        ).\n                       \n\n                        You connect to your CargoWatch account in the Data Center. This topic discusses the fields and menus that are specific to the CargoWatch connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your CargoWatch account and create a DataSet, you must have a CargoWatch username and password.\n                       \n\n                        Connecting to Your CargoWatch Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the CargoWatch Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your CargoWatch account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter your CargoWatch username.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter your CargoWatch password.\n                           \n\n\n\n\n\n\n                         Once you have entered valid CargoWatch credentials, you can use the same account any time you go to create a new CargoWatch DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the CargoWatch report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Messages\n                               \n\n\n\n                                Returns all messages you've received about your cargo.\n                               \n\n\n\n\n\n                                Asset Commands\n                               \n\n\n\n                                Returns the available commands for a given Asset ID pertaining to a provided Datagate ID.\n                               \n\n\n\n\n\n                                Device Commands\n                               \n\n\n\n                                Returns the available commands for a given device pertaining to a provided Datagate ID.\n                               \n\n\n\n\n\n                                Geofence Status\n                               \n\n\n\n                                Returns a list of geofences that have changed since your \"Last Modified\" date.\n                               \n\n\n\n\n\n\n\n\n\n                            Dategate ID\n                           \n\n\n\n                            Enter your Datagate ID.\n                           \n\n\n\n\n\n                            Time\n                           \n\n\n\n                            Enter the time you want to retrieve status for.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQs\n                       \n\n                        Can I use the same account to create multiple DataSets?\n                       \n\n                        Yes.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        As often as needed.\n                       \n\n                        Are there any API limits I should be aware of?\n                       \n\n                        No.", "Preview Article": "Click here to preview", "URL Name": "360043435633", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003354", "Archived Date": "", "Language": "English", "Primary Version": "CargoWatch Connector", "Article Total View Count": "2,360", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              CargoWatch Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}