{"file_path": "../../raw_kb_v2\\article\\360043428453\\index.html", "content": {"title": "\n\n\n 3-Metric Bar Charts\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n###\n Use Case\n\n\n* The client is one division or represents one category of a larger group.\n* The client would like to emphasize their specific division and show the \"Share of Wallet\" or \"Percent of Total\" as compared to the other divisions.\n* The client would like to show the actual Metric Value of their division as compared to other divisions.\n\n\n###\n Current Situation\n\n\n* In most cases, you would have to show the \"% of Total\" as one Bar chart and the Metric Value in a separate Bar chart.\n* To emphasize your specific division, you would have to know the rank of your division and set its Series Color to a different color than all of the other bar colors.\n\n\n###\n Ideal Solution\n\n\n* The ideal solution would be a way to always follow the client’s specific division with a unique color in the Bar chart.\n* The other ideal solution would be to show the Metric Value AND the \"% of Total\" in one Bar chart in a clean view.\n\nIn this article, we show you how to accomplish this second solution by creating a 3-Metric Bar Chart. We provide an example of a client representing the Kitchen department of a department store with 4 total departments. The client needs to know how his department compares to the other departments but wants to have the Kitchen department always stand out in the visual.\n\n\n Setup Instructions\n--------------------\n\n*To set up a 3-metric Bar chart,**\n\n. Create 3 Beast Modes as follows:\n\n\n Beast Mode Name\n  |\n Description\n  |\n Beast Mode\n  |\n| --- | --- | --- |\n|\n KitchenSales\n  |\n Represents the amount of sales for the Kitchen Department ONLY.\n  |\n`SUM(CASE WHEN `Department` = ‘Kitchen’ THEN `Sales` ELSE 0 END)`\n |\n|\n NonKitchenSales\n  |\n Represents the amount of sales for all NON Kitchen Departments of the store.\n  |\n`SUM(CASE WHEN `Department` = ‘Kitchen’ THEN 0 ELSE `Sales`  END)`\n |\n|\n ShareOfDepartments\n  |\n Represents the percent of the all Sales for each individual Department.\n  |\n`(SUM(Sales) / SUM(Sales) OVER ()) * 100`\n\n* This means it shows the sum of all departments.\n\t* Multiply by 100 to show the value in percent format. |\n\n\n2. Choose the Horizontal Stacked Bar Chart as the chart type.\n\n\n Using a Stacked Bar Chart instead of a normal Bar Chart allows you to have parts of the bar represent a 0 value and other parts of the bar represent an actual value, so the series color of the bar will change based on the location of the series that you decide to use.\n3. For the Y Axis, choose \"Department.\"\n4. For the X Axis, choose \"KitchSales\" from the BeastMode created above.\n\n\n This means that the first series of all Departments EXCEPT for the Kitchen Department will be 0.\n5. For the Series, choose \"NonKitchenSales\" from the BeastMode created above.\n\n\n This means that the second series of all Departments EXCEPT for the Kitchen Department will have a value, but the Kitchen Department’s value of the second series will be 0.\n6. For the next Series, choose \"ShareOfDepartments\" from the BeastMode created above.\n\n\n This value will not appear in the chart at first; however we can access it by using data labels in a future step.\n7. For the \"ShareOfDepartments\" series, rename the column label to \"Share Of.\"\n8. Sort the \"Sum of Sales\" column in descending order.\n\nThis allows the chart to be ranked from highest sales to lowest regardless of Department.\n9. Configure Chart Properties as follows:\n\n* General\n\n\t+ Font Size – Larger\n\t\t+ Portrait View Legend Position – Hide\n\t\t+ Landscape View Legend Position – Hide\n\t* Data Label Settings\n\n\t+ Text -\n\n\n\t\t #%\\_CATEGORY\\_NUMBER Sales: $%\\_CATEGORY\\_TOTAL \\\\n%\\_SERIES\\_NAME: %\\_VALUE%\n\n\t\t- %\\_{{item}}\n\n\n\t\t\t represents values that can be extracted from the data in the chart. This is what allows you to see multiple metrics.\n\t\t\t- %\\_CATEGORY\\_NUMBER\n\n\n\t\t\t shows the rank position of the bar.\n\t\t\t- %\\_CATEGORY\\_TOTAL\n\n\n\t\t\t shows the total value of the bar.\n\t\t\t- %\\_SERIES\\_NAME\n\n\n\t\t\t shows the name of the last series from the label.\n\t\t\t- %\\_VALUE\n\n\n\t\t\t shows the value of the last series.\n\t\t\t- \\\\n\n\n\n\t\t\t creates a new line.\n\t\t+ Show One Label – True\n\n\t\t- This makes it so you only see the label one time rather than over and over for each series.\n\t\t+ Position – Inside Right\n\n\t\t- This allows you to choose where the label will be on the chart.\n\t\t+ Justification – Left\n\n\t\t- This allows your label text to be left-justified to give a cleaner look.\n\t\t+ Use Scale Abbreviation – True\n\n\t\t- This shortens the numeric values to give an easier-to-read label.\n\t\t+ Decimal Places - .0\n\n\t\t- This allows for each label value to only be 1 decimal out.\n\t* Value Scale (X)\n\n\t+ Label Format – Currency\n\n\t\t- This allows for the format of the label to be in Currency format.\n\t* Colors\n\n\t+ Series 1 – Light Green\n\n\t\t- This colors the bar that represents the Sales for the Kitchen Department Only.\n\t\t+ Series 2 – Light Gray\n\n\t\t- This colors the bars that represent all bars EXCEPT for the Kitchen Department.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428453\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004746\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\n3-Metric Bar Charts\n\n", "article_total_view_count": "\n\n\n 5,029\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:28 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "3metric_bar_charts", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}