{"file_path": "../../raw_kb_v2\\article\\360043439993\\index.html", "content": {"title": "\n\n\n Best Practices for Standardizing Visualization Cards\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe most effective KPIs (Key Performance Indicators) are those that communicate information clearly and efficiently.\n\n\n Consider developing and adopting standards for designing KPIs in Domo.\n\n\n For more information about how KPIs are represented in Domo, see\n\nUnderstanding Cards\n\n. For more information about creating Visualization cards, see\n\nVisualization Cards\n\n.\n\n\n Purpose of standards\n----------------------\n\nThe purpose of standards is to drive maximum clarity and efficiency in the communication of information.\n\n\n Aligning to a set of standards does the following:\n\n Assures maximum meaning is communicated between creator and viewer.\n* Makes scanning the product an easier and more pleasant experience for all.\n* Provides consistency in cases where a variety of practices or subjective preferences could enter.\n* Makes articulating and identifying issues with cards easier.\n\n\n**Note:**\n Specified standards cannot cover all eventualities. Therefore, the most important standard is that \"the card communicates the information as clearly and efficiently as possible.\"\n\n\n Guidelines to consider\n------------------------\n\nBecause every organization is unique, develop your own standards to use in Domo. You can consider using any of the following guidelines in your organization.\n\n##\n General\n\n\n* Use business language rather than technical terms.\n\n\n Do not use \"Count\" or \"Sum\" language.\n* Avoid abbreviations\n\n\n For example, Last 12 Months instead of L12M; Year Over Year instead of YOY; This Month instead of MTD; This Year instead of YTD\n\n\n If you use an abbreviation, define the abbreviation in the card description.\n* Date Ranges\n\n+ When dealing with daily information that is not a month over month comparison, typically include last month and this month.\n\t+ When dealing with weekly information that is not a period over period comparison, typically include at least last month and this month.\n\t+ When dealing with monthly data that is not a year-over-year comparison, typically include 12 months and this month.\n\t+ When dealing with quarterly data this is not a year-over-year comparison, typically include last 4 quarters and this quarter.\n* Number precision\n\n\n When using the auto abbreviate units format type, use 2 decimal places.\n\n\n Use the auto abbreviate units precision unless the situation calls for showing the entire number.\n\n\n###\n Card title\n\n\n* Use the title of the card to describe the chart and not the summary number.\n* Do not include date range qualifiers (This Year, Last Quarter) in the title.\n\n\n An exception could be when the chart does not have dates on an axis and the chart does not have the standard date range activated.\n* In the title, do not include units or amounts as those are handled on the chart axis labels.\n* All KPIs have an operator, at least one measurement item, and at least one dimension. In the title, include the following elements: [Operator] Measurement and Dimension(s).\n\n+ The Operator is omitted when the measurement is simply an amount or number.\n\t+ The Operator is required when the measure is calculated. For example, \"Percent of\" or \"Average\".\n\t+ The first Dimension is proceeded with \"By\".\n\t+ Subsequent Dimensions are separated with \"and\".\n\nFor example, Sales by Region; Average Deal Size by Team; Upside ACV by Account and Team\n\n###\n Terms and definitions\n\n\n|\n Term\n  |\n Definition\n  |\n| --- | --- |\n|\n Operator\n  |\n This is how the measurement item is mathematically calculated. For example, \"Number of\" \"Average of\" \"Value of\" \"Percentage of\"\n  |\n|\n Measurement Item\n  |\n This is what is being measured. It is always a noun. In a graph, it is always measured numerically. For example, \"Leads\" \"Employees\" \"Dropped Calls\"\n  |\n|\n Dimension\n  |\n This is the subset of the measurement item. KPIs can have more than one dimension.\n\nDimensions come in three types: Non-Temporal Dimensions, Time Grain Dimensions, Time Range Dimensions.\n * Non-Temporal Dimensions\n\nFor example: by Region, by Product, by Salesperson\n\nNon-Temporal Dimensions could be identified in the KPI card title.\n* Time Grain Dimensions:\n\nFor example: by Month, by Quarter, by Day\n\nTime Grain Dimensions could be identified in the KPI card title.\n* Time Range Dimensions:\n\nFor example: This Year, Last Month, Year-over-Year, This Month and Last 12 Months\n\nStandard Time Grain Dimensions can be selected in the \"Graph by\" feature. Non-standard dimensions can be created using Beast Mode.\n |\n\n\n###\n Card description\n\n\n* Describe the chart and not the summary number.\n* Do not simply restate the title.\n* Use a template.\n\n*Card Title**\n\n\n Paragraph answering various questions:\n\n\n - What does the card measure?\n\n\n - What is included or excluded?\n\n\n - What is the default time period covered? For example, This Year, This Month, This Quarter, This and Last 12 Months\n\n\n - If unclear or counter-intuitive what constitutes a favorable vs. unfavorable result?\n\n\n**Key Business Requirement (KBR)**\n\n\n List the key business requirements that the card addresses. For example, Increase Sales, Reduce Costs, Increase Customer Satisfaction or Increase Operational Excellence.\n\n\n**Strategic Importance**\n\n\n Paragraph answering the questions:\n\n\n - Why is this important to the business?\n\n\n - What actions can be taken?\n\n*Calculations**\n\n\n List the calculation formulas used in the card in the form Measurement = (A+B)/C\n\n\n**Drill Path**\n\n\n List all drill path views available in this card.\n\n\n###\n Summary number Dos\n\n\n* Select a measurement that is meaningful on its own but is related to the chart.\n* Include the date range in the summary number description when the summary number range is fixed and different from the chart default range.\n\n\n###\n Summary number Don'ts\n\n\n* Make every card have a summary number when no summary is the pertinent option.\n\n\n###\n Visualization card Dos\n\n\n* Use a sort order that makes sense.\n* Use Horizontal bar charts with lists because the labels are more readable than vertical bar charts.\n* Sort Pie charts in descending order.\n* Break stacked bar charts with multiple dimensions into separate charts.\n* Use sub-pages to group related cards.\n* Have axis labels on all axis.\n\n+ Date axis should be labeled \"Period\" to support dynamic date selection.\n\t+ Currency fields should have a currency symbol.\n\t+ Time period should be lead-in with HH:MM AM/PM format.\n\t+ Daily period format should be lead-in when available in the meantime use yyyy-MM-dd format.\n\t+ Monthly period format should use lead-in yyyy-MM\n\t+ Quarterly period format should use yyyy-Q#\n* Consider showing appropriate values by setting options in\n **Data label settings**\n in\n **Chart Properties**\n .\n* Label your data tab column headers the same as you have labeled your axis labels using the more options on chart field selections.\n* For charts with a single value use a gauge chart type.\n\n\n###\n Visualization card Don'ts\n\n\n* Create bar charts that have only a single bar in the chart.\n\n\n Use a gauge chart if there is a single value.\n* Create pie charts that have a single slice.\n\n\n Use a gauge chart if there is a single value.\n* Create stacked bar charts with more than 5 bars.\n\n\n Try creating an overall chart and split the details into multiple charts.\n* Create pie charts with more than 10 slices.\n\n\n Try aggregating categories with a Beast Mode calculation.\n* Create line Charts with more than 6 lines.\n\n\n Try using a summary card with a drill to detail or aggregating categories with a Beast Mode calculation.\n* Use dual-axis charts unless absolutely necessary.\n\n\n###\n Card links\n\n\n* Link your card to other relevant cards.\n\n\n For example, to show the same information trended, filtered for a different date range, or sliced along a different dimension.\n\n\n###\n Card drill downs\n\n\n* On table drill downs, consider eliminating all but the most pertinent fields.\n* Rename the drill down title so it makes sense.\n* Review the summary number to ensure it makes sense.\n* Apply all the card checklist items to the drill-down card.\n\nOther Best Practices Topics\n-----------------------------\n\nFor more Domo best practices, visit the following topics:\n\n Projects and Tasks Best Practices\n* Best Practices for Managing DataSets\n* Best Practices for Choosing Chart Types\n* Top 10 Dashboard Design Best Practices\n* Best Practices for Creating Visualization Cards\n* Best Practices for Designing KPIs\n\nOr, for a handy Domo best practices guide, you can download the following PDF:\n\n Best Practices for card, data, and pages\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043439993\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004481\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nBest Practices for Standardizing Visualization Cards\n\n", "article_total_view_count": "\n\n\n 12,058\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "best_practices_for_standardizing_visualization_cards", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "training", "url": "/s/topic/0TO5w000000ZamyGAC"}, {"text": "selfservice_training", "url": "/s/topic/0TO5w000000ZaoCGAS"}, {"text": "best_practices_resources", "url": "/s/topic/0TO5w000000ZaoXGAS"}]}