{"file_path": "../../raw_kb_v2\\article\\360042930834\\index.html", "content": {"title": "\n\n\n DataGov Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Data.gov\n\nis the home of the U.S. government's open data. You can use Domo's\n\nData.gov\n\nconnector to compile reports containing freely available government data. To learn more about the\n\nData.gov\n\nAPI, visit their page (\n\nhttps://www.data.gov/developers/apis/\n\n).\n\n\n The\n\nData.gov\n\nconnector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your\n\nData.gov\n\naccount in the Data Center. This topic discusses the fields and menus that are specific to the\n\nData.gov\n\nconnector user interface. General information for adding data sources, setting update schedules, and editing data source information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nBecause\n\nData.gov\n\ndata is freely available, you do not need to create an account in Domo to access it. Hence, you do not need to enter credentials in the\n\nData.gov\n\nconnector page. However, there are many report types that require you to enter a\n\nData.gov\n\nAPI key. You can obtain a free API key by going to\n\nhttps://api.data.gov/signup/\n\nand entering your first name, last name, and email address. The API key then appears on the screen. You can copy and paste this key as necessary in the Domo\n\nData.gov\n\nconnector interface.\n\n\n Creating a\n\nData.gov\n\nreport\n----------------------------------\n\nThis section enumerates the options in the\n **Details**\n pane in the\n\nData.gov\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your Data Source**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n The Details pane contains a primary menu,\n **Report**\n , along with various other menus which may or may not appear depending on the report type you select.\n\nMenu\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n\nReport\n\n|\n\nSelect a\n\nData.gov\n\nreport. The following reports are available:\n\n  |  |\n| --- | --- |\n|\n\nAgency Priority Goal\n\n|\n Returns a list of agency priority goals.\n  |\n|\n Amber Waves\n  |\n Returns a list of articles related to farming and food production.\n  |\n|\n Agency\n  |\n Returns detailed information about government agencies.\n  |\n|\n\nAgencies\n\n|\n Returns a list of names of government agencies.\n  |\n|\n ARMS\n  |\n Returns valid survey codes for ARMS (Agricultural Resource Management Survey).\n  |\n|\n App & Technologies\n  |\n Returns a list of accessible apps and assistive technologies.\n  |\n|\n Auctions\n  |\n Returns data about GSA auctions.\n  |\n|\n Authors\n  |\n Returns information about authors of government publications.\n  |\n|\n Average Wait Time Until Hearing Held\n  |\n Returns the average time (in months) from the hearing request date until a hearing is held for claims pending in the Office of Disability Adjudication and Review's hearing offices. Allows users to estimate the amount of time they may\n\nhave to wait for a hearing to be held.\n  |\n|\n Broadband Providers\n  |\n Returns information about broadband providers.\n  |\n|\n Building Systems\n  |\n Returns information about building systems such as lighting, HVAC, etc.\n  |\n|\n Business Articles\n  |\n Returns information about articles available for users of BusinessUSA.\n  |\n|\n Business Data\n  |\n Returns information about different data assets users can access on BusinessUSA.\n  |\n|\n Business Events\n  |\n Returns information about events users can view on BusinessUSA.\n  |\n|\n Business License Permits\n  |\n Returns permits, licenses, and registrations needed to run a business.\n  |\n|\n Business Program\n  |\n Returns information about programs users can access through BusinessUSA.\n  |\n|\n Business Services\n  |\n Returns information about services users can access through BusinessUSA.\n  |\n|\n Business Success Stories\n  |\n Returns information about success stories featured on BusinessUSA.\n  |\n|\n Business Tools\n  |\n Returns information about tools featured on BusinessUSA.\n  |\n|\n Charts\n  |\n Returns information about government charts, including chart names and URLs.\n  |\n|\n Content Pages\n  |\n Returns information about content pages on Data.gov.\n  |\n|\n Convenience Contact Information\n  |\n Returns convenience contact information for service providers, equipment manufacturers, schools and universities, and national and international\n\norganizations.\n  |\n|\n Content\n  |\n Returns content for fact sheets and User Voice questions.\n  |\n|\n Disability Types\n  |\n Returns a list of disabilities, including the disability type name, ID, and description.\n  |\n|\n Drug Adverse Events\n  |\n Returns information about undesirable effects of drugs reported to the FDA,\n\nincluding serious side effects, product use errors, product quality problems, and\n\ntherapeutic failures.\n  |\n|\n Drug Labeling\n  |\n Returns information about drug product labeling, such as ID, indications, recommended dosage, etc.\n  |\n|\n Drug Enforcement\n  |\n Returns information about drug product recalls.\n  |\n|\n Device Adverse Events\n  |\n Returns information about undesirable effects of medical devices reported to the\n\nFDA.\n  |\n|\n Device Enforcement\n  |\n Returns information about medical device recalls.\n  |\n|\n Data Products\n  |\n Returns information about data products on Data.gov.\n  |\n|\n Events\n  |\n Returns a list of past and upcoming disability-related events.\n  |\n|\n Foods Enforcement\n  |\n Returns information about food recalls, including reason, distribution pattern,\n\nproduct quantity, etc.\n  |\n|\n Food Dollar\n  |\n Retrieves a collection of valid food dollar data table names and numbers.\n  |\n|\n Federal Contacts\n  |\n Returns a list of federal agencies that provide accessibility-related services or information.\n  |\n|\n Hearing Office Workload Data\n  |\n Returns information about pending, receipts, dispositions, and average processing time for each hearing office in the Office of Disability Adjudication and Review (ODAR).\n  |\n|\n Hearing Office Average\n\nProcessing Time Ranking Report\n  |\n Returns ranking information for the Office of Disability Adjudication and Review (ODAR) hearing offices by the average number of days until the final disposition of the hearing request.\n  |\n|\n Indicators\n  |\n Returns performance indicators for government agencies.\n  |\n|\n Loans Grants Search\n  |\n Returns information about financial assistance programs for small businesses.\n  |\n|\n Materials\n  |\n Returns a list of names and descriptions of building materials.\n  |\n|\n Opportunities\n  |\n Returns information about grant opportunities for a given search query.\n  |\n|\n PCC Award\n  |\n Returns information about PCC (Publicity Club of Chicago) Awards for a given state, zip code, or coordinates.\n  |\n|\n Products Mobile Devices\n  |\n Returns information about mobile devices, such as brand, maker, model number, etc.\n  |\n|\n Products Manufacturer Mobile Devices\n  |\n Returns a list of manufacturers of mobile devices.\n  |\n|\n Products Details Mobile Devices\n  |\n Returns a list of accessibility features (with name and description) that are supported by a particular mobile device.\n  |\n|\n Products Features Mobile Devices\n  |\n Returns a list of accessibility features (with name and description) that may be\n\nsupported by various mobile devices.\n  |\n|\n Products Regions Mobile Devices\n  |\n Returns a list of regions where mobile devices may be available.\n  |\n|\n Products Search Mobile Devices\n  |\n Returns a list of mobile devices based on a given search query (manufacturer, brand, or model).\n  |\n|\n Publications\n  |\n Returns information about the last 100 publications posted on\n\nData.gov\n\n, ordered by descending release date.\n  |\n|\n Petitions\n  |\n Returns a list of petitions, with title, body, signature threshold, number of signatures needed, etc.\n  |\n|\n Products\n  |\n Returns a list of products, with name, purchase URL, etc.\n  |\n|\n Real Property - Total Domestic\n\nOffice and Warehouse Square\n\nFeet\n  |\n Returns total domestic office and warehouse square footage for government agencies.\n  |\n|\n Real Property - Freeze the\n\nFootprint Projects\n  |\n Returns \"Freeze the Footprint\" data for government agencies.\n  |\n|\n Recalls\n  |\n Returns information about product recalls.\n  |\n|\n Strategic Goal\n  |\n Returns strategic goals for government agencies.\n  |\n|\n Strategic Objective\n  |\n Returns strategic objectives for government agencies.\n  |\n|\n SAM Registrations\n  |\n Returns public data about SAM registrations.\n  |\n|\n Services\n  |\n Returns a list of services, with name, description, required products, etc.\n  |\n|\n States\n  |\n Returns a list of states by which convenience contacts can be grouped.\n  |\n|\n Topics\n  |\n Returns a list of topics on Data.gov.\n  |\n|\n Tags\n  |\n Returns a list of search tags on Data.gov.\n  |\n|\n USA Jobs\n  |\n Returns information about employment opportunities found on commercial job boards, mobile applications, and social media sites.\n  |\n|\n Video Programming Distributor\n  |\n Returns contact information for various video programming distributors.\n  |\n|\n Workspaces\n  |\n Returns a list of workspaces, including name and overview information.\n  |\n|\n White House Policy\n\nSnapshots\n  |\n Returns information about work the president has done since taking office and his/her plans for continuing progress.\n  |\n\n\n |\n|\n Agency Acronym\n  |\n Enter the acronym for the agency for which you want to retrieve data. Example:\n\nDHS\n\n|\n|\n Agency ID\n  |\n Enter the ID for the agency for which you want to retrieve data. Example:\n\n550\n\n|\n|\n API Key\n  |\n Enter your\n\nData.gov\n\nAPI key. For information about obtaining a\n\nData.gov\n\nAPI key, see \"Prerequisites\" above.\n  |\n|\n Brand\n  |\n Enter the brand name for which you want to retrieve data. Example:\n\nSony\n  |\n|\n Business Type\n  |\n Select the business type for which you want to retrieve data.\n  |\n|\n Category\n  |\n Select the category for which you want to retrieve data.\n  |\n|\n Content Type\n  |\n Select the content type for which you want to retrieve data.\n  |\n|\n Country\n  |\n Enter a country to retrieve information specific to that country. Example:\n\nGermany\n  |\n|\n Data Source\n  |\n Select the data source for which you want to retrieve data.\n  |\n|\n Date\n  |\n Select the date for your report. The report will return records for this date only.\n  |\n|\n Disability ID\n  |\n Enter the disability ID for which you want to retrieve data. Example:\n\n3\n  |\n|\n End Date\n  |\n Select the end date for your report. The report will return records created on or before this date. Pair with\n **Start Date**\n to include a range of dates in your report.\n  |\n|\n Entity Type\n  |\n Select the entity type for which you want to retrieve data.\n  |\n|\n Group by State\n  |\n Specify whether the list items should be broken down by state.\n  |\n|\n ID\n  |\n Enter the ID for the entity for which you want to retrieve data. Example:\n\n8\n  |\n|\n Job Title\n  |\n Enter a job title to return job announcements with the specified title. Example:\n\nTechnical Writer\n  |\n|\n Latitude\n  |\n Enter the latitude of the location for which you want to retrieve data. Example:\n\n34.876011\n  |\n|\n Longitude\n  |\n Enter the longitude of the location for which you want to retrieve data. Example:\n\n-83.400856\n  |\n|\n Max Salary\n  |\n Enter a maximum salary to return all jobs that have that salary or lower. Example:\n\n72,000\n\n. Pair with\n **Min Salary**\n to return data for the given range.\n  |\n|\n Min Salary\n  |\n Enter a minimum salary to return all jobs that have that salary or higher. Example:\n\n15,500\n\n. Pair with\n **Max Salary**\n to return data for the given range.\n  |\n|\n Name\n  |\n Enter the name of the entity for which you want to retrieve data. Example:\n\nHVAC\n  |\n|\n Organization\n  |\n Select the organization for which you want to retrieve data.\n  |\n|\n Petitions Created After\n  |\n Select a date for your report. The report will return petitions created on or after this date. If you select a date here, you should not select a date for\n **Petitions Created Before**\n .\n  |\n|\n Petitions Created Before\n  |\n Select a date for your report. The report will return petitions created on or before this date. If you select a date here, you should not select a date for\n **Petitions Created After**\n .\n  |\n|\n Product ID\n  |\n Enter the ID of the product for which you want to retrieve data. Example:\n\n716\n  |\n|\n Query\n  |\n Enter a keyword or phrase to use to filter the data in your report.  Example:\n\nbioinformatics\n  |\n|\n Radius\n  |\n Enter the radius length in whole numbers from the specified latitude-longitude coordinates. Example:\n\n2\n  |\n|\n Recall Query\n  |\n Enter a query term to filter the data in your report. This filter handles word variants. For example, if you entered the term\n\nchoke\n\n, the report would return items with the query term\n\nchoking hazard\n\n.\n  |\n|\n Region\n  |\n Enter the world region for which you want to retrieve data. You can choose from any of the following:\n\n\n* Africa\n* Asia Pacific\n* Europe\n* Latin America\n* Middle East\n* North America\n |\n|\n Registration ID\n  |\n Enter the registration ID for which you want to retrieve data. Example:\n\n1459697830000\n  |\n|\n Request By\n  |\n Specify how the report data is to be broken down.\n  |\n|\n Search Term\n  |\n Enter a search term (manufacturer, brand, or model) to filter the data in your report.\n  |\n|\n Show Closed\n  |\n Select whether closed items should be shown in your report.\n  |\n|\n Show Incomplete\n  |\n Select whether incomplete items should be shown in your report.\n  |\n|\n Start Date\n  |\n Select the start date for your report. The report will return records created on or after this date. Pair with\n **End Date**\n to include a range of dates in your report.\n  |\n|\n State Abbreviation\n  |\n Enter the two-letter abbreviation of the U.S. state for which you want to retrieve data.\n  |\n|\n Type\n  |\n Select a type to retrieve information specific to that type.\n  |\n|\n VPD Type\n  |\n Select a VPD type to retrieve information specific to that VPD type.\n  |\n|\n Zip Code\n  |\n Enter the 5-digit zip code for the location for which you want to retrieve data.\n\nExample:\n\n84765\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042930834\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003385\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDataGov Connector\n\n", "article_total_view_count": "\n\n\n 2,371\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "datagov_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}