{"file_path": "../../raw_kb_v2\\article\\1500001404182\\index.html", "content": {"title": "\n\n\n Facebook Partition Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Domo's Facebook Partition connector can combine Facebook insights with data from any other source—finance analytics, CRM software, etc.—to target campaigns with unparalleled precision. Use this connector to retrieve data about posts, page fans, account information, and more. This connector provides reports about the user account, posts, application monitoring and public page information, and also allows you to query data for any date range.\n\nTo learn more about the Facebook API, visit their page (\n\nhttps://developers.facebook.com\n\n).\n\n\n To learn about the simplified version of the Facebook connector, see\n\nFacebook Connector\n\n.\n\n\n You connect to your Facebook account in the Data Center. This topic discusses the fields and menus that are specific to the Facebook Partition connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Retrieving social media metrics, tracking content, and viewing your Facebook page performance.\n  |\n|\n**Primary Metrics**\n | * Impressions\n* Engagement\n* Comments\n* Likes\n* Shares\n* Reactions\n* Page fans\n |\n|\n**Primary Company Roles**\n | * CMO\n* Director of marketing\n* Marketing analyst\n* Social Media Analysts\n |\n|\n**Average Implementation Time**\n |\n Usually less than an hour, but could take much longer to pull the desired data.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 4\n  |\n\n\n Configuring the connector to backfill data\n---------------------------------------------\n\n##\n\nConfiguring the connector for initial run\n\nThe\n *Backfill*\n field in the connector determines how much historical data prior to the value in the\n *End date*\n field to bring into the dataset on the first run of the connector.\n\n\n Example: If the\n *End Date*\n field is set to\n **March 30\n th\n 2021**\n on the initial run of the connector, and the\n *Backfill Days*\n is set to\n **10,**\n the connector will bring in data between\n **March 20\n th\n 2021 and March 30\n th\n 2021**\n on the initial run.\n\n##\n\nConfiguring the connector for subsequent runs\n\nAfter the initial run, the connector will only request a limited amount of data from the provider on subsequent runs. You can configure the connector to update rows that have already been added to the dataset as well as new rows, or just add new rows. To configure the connector for subsequent runs, use the\n *Start Date*\n and\n *End Date*\n fields to describe the date range the connector should request data for.\n\n\n The\n *Start Date*\n determines how far back the connector should request data for, and the\n *End Date*\n determines the last day the connector requests data for.\n\n\n Example: If the\n *Start Date*\n is set to 3 days ago and the\n *End Date*\n is set to today, then\n\n On April 3\n rd\n , the connector will request data for March 31\n st\n – April 3\n rd\n .\n* On April 4\n th\n , the connector will request data for April 1\n st\n to April 4\n th\n . It will update the rows in the dataset for April 1\n st\n and April 3\n rd\n , and create a new row for April 4\n th\n .\n* On April 5\n th\n , the connector will request data from April 2\n nd\n to April 5\n th\n . It will update the rows in the dataset for April 2\n nd\n to April 4\n th\n , and create a new row for April 5\n th\n .\n\n\n Prerequisites\n---------------\n\nTo connect to your Facebook account and create a DataSet, you must have the following:\n\n Your Facebook username or your telephone number\n* Your Facebook password\n\nConnecting to Your Facebook Account\n-------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Facebook Partition Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Facebook Partition connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Facebook accounts in Domo) to open the Facebook OAuth screen where you can enter your Facebook credentials. Once you have entered valid Facebook credentials, you can use the same account any time you go to create a new Facebook Partition DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Facebook when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Facebook.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Facebook Partition report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account Information\n  |\n\nReturns information about the authenticated user, such as their name and email address.\n\n|\n|\n Complete Page Insights\n  |\n\nReturns a full list of available insights for pages selected under\n\n*Accounts**\n\n.\n\n|\n|\n Complete Page Post Insights\n  |\n\nReturns a full list of metrics for the posts on the pages selected under\n\n*Accounts**\n\n.\n\n|\n\n|\n|\n Accounts\n  |\n\nCheck all of the pages you want to pull data from.\n\n|\n|\n Application ID\n  |\n Enter the ID of the application (managed by the user) to retrieve information for.\n  |\n|\n Page IDs\n  |\n Enter a comma-separated list of page IDs.\n  |\n|\n Fields\n  |\n Select the fields that should be reported. If no fields are selected, a default list will be returned.\n\n|\n|\n Domain IDs\n  |\n Enter a comma-separated list of Domain IDs to retrieve information for.\n  |\n|\n Period\n  |\n Select the time period for which insight metrics will be shown.\n  |\n|\n Select Insight Metrics\n  |\n Select all metrics you want to retrieve information for. If you select none, information is retrieved for all of them.\n  |\n|\n Insight\n  |\n\nSelect the Application Insight to report.\n\n|\n|\n Instant Article Metric\n  |\n Select an Instant Article Metric to retrieve data for.\n  |\n|\n\nInstant Article Count\n\n|\n\nEnter the number of Instant Articles that will have insights reported.\n\n|\n|\n Skip Errors\n  |\n If you select\n **True**\n , pages that return errors are silently skipped, and all other Pages will be included in the results. If you select\n **False**\n , the DataSet fails with an error if any page returns an error.\n  |\n|\n Start Date\n  |\n Enter the start date for the report using the format\n\nyyyy-MM-dd\n\n(for example,\n\n2015-01-15\n\n).\n\n\n You can also use the keywords\n\ntoday\n\nor\n\nyesterday\n\nto return data for those days. If you want, you can specify an offset like\n\nyesterday-3\n\n. This would set the start date to 3 days in the past.\n  |\n|\n End Date\n  |\n Enter the end date for the report using the format\n\nyyyy-MM-dd\n\n(for example,\n\n2015-01-15\n\n).\n\n\n You can also use the keywords\n\ntoday\n\nor\n\nyesterday\n\nto return data for those days. If you want, you can specify an offset like\n\nyesterday-3\n\n. This would set the end date to 3 days in the past.\n  |\n|\n End Date Should Be Inclusive?\n  |\n Select\n **Yes**\n if you want data to be retrieved for all days up to and including the specified end date.\n\n\n Select\n **No**\n if you want data to be retrieved for all days up to but not including the specified end date.\n  |\n|\n Backfill\n  |\n Enter the number of days (before the previous End Date) you want to backfill for. This action will be performed\n\n\n**only**\n the first time the data source runs. On subsequent runs, the specified\n\n\n**Start Date**\n to\n\n\n**End Date**\n range is used.\n\n*Note:**\n If you need to rerun the backfill, place a \\* at the end, then save the connector and re-run. Remove the \\* and save after it has ran.\n\n|\n\n\n###\n\nOther Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the Facebook API does this connector use?\n\nThis connector uses version 7 of the Facebook API (\n\nhttps://graph.facebook.com/v7\n\n).\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Account Information\n  |\n /me\n  |\n|\n Complete Page Insights\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Complete Page Post Insights\n  |\n /\n *{post\\_id}*\n /insights\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the email address and password associated with your Facebook account.\n\n###\n How do I know my Facebook credentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n Do I need a certain kind of account to set up the connector?\n\nAny Facebook account can be used to set up the connector. However, some of the reports are designed to return data and statistics about pages. You must be an administrator of the page(s) that you want to retrieve this data for.\n\n###\n What's the difference between the Facebook and Facebook Partitions connectors?\n\nThe Facebook Partition connector supports Date partitioning and backfilling for the available reports. It also allows to query data for any date range.\n\n\n The Facebook connector's reports are limited to deal directly with pages and it is limited to return information about the last 30 days.\n\n###\n How frequently will my data update?\n\nMost information about pages is updated every 24 hours. A small number of insight metrics are updated roughly every 15 minutes. It is recommended that DataSets usually be configured to run every 24 hours.\n\n###\n Why are the dates in Facebook's Insights UI and the dates in Domo sometimes different?\n\nOften people validate their DataSets by comparing the results of the connector to the statistics they can see in Facebook's Insights UI. When they are doing so, the dates are generally off by 1 day. For example, if the Facebook UI shows 1000 views for a page on March 3, the connector will report 1000 views with a date timestamp of March 4. This is because the API returns data for a time period that ends at the timestamp specified. In this example, there were 1000 views during the day that ended at Midnight on March 4, in other words, March 3. The Insights UI takes this into account and reports the 1000 views as having happened on March 3.\n\n###\n Are there any API limits I should be aware of?\n\nFacebook limits the number of calls that can be made each hour for each user and page. As long as you don't run the DataSet too often, the connector manages this for you.\n\n\n Troubleshooting\n-----------------\n\n\n* Review the configuration to make sure that all required items have been selected.\n* Review the connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the time frame that you are trying to pull.\n* Be aware that when comparing page statistics in your Facebook Partition DataSet to those found in Facebook’s Insights UI, the dates are generally off by 1 day. For example, if the Facebook UI shows 1000 views for a page on March 3, the connector will report 1000 views with a date timestamp of March 4. This is because the API returns data for a time period that\n *ends*\n at the timestamp specified. In this example, there were 1000 views during the day that ended at midnight on March 4—in other words, March 3. The Insights UI takes this into account, and reports the 1000 views as having happened on March 3.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500001404182\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003256\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFacebook Partition Connector\n\n", "article_total_view_count": "\n\n\n 2,352\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "facebook_partition_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}