{"file_path": "../../raw_kb_v2\\article\\360043427973\\index.html", "content": {"title": "\n\n\n Calendar\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn Domo, a calendar is a basic chart type that shows a number of items or a summation of values for specific days over a specified time period. You can choose to display calendar data for an entire year, for a month, or for a single day.\n\n\n A calendar requires two columns or rows of data from your DataSet—one contains the dates and the other contains the number of category items corresponding to each date. You can also include an optional values column. The background color for a date determines how many items are associated with the date, or, if a values column is present, the amount for each date. If there are multiple instances of a certain date, the amounts for the date are summed. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n By default, Domo uses the\n **Auto**\n view to display your calendar, which depends on the breadth of data in the DataSet. If the data in your DataSet spans multiple months, the calendar automatically shows data in the\n **Year**\n view. If the data in the DataSet spans a few days or weeks within the same month, the calendar automatically shows data in the\n **Month**\n view. You can change this default auto view behavior in\n **Chart Properties**\n . For example, if your DataSet contained data for a year, you could tell Domo to show data for a single month by selecting\n **View > Month**\n in\n **Chart Properties**\n . Or, if your DataSet contained data for multiple years, you could indicate the desired year in\n **Chart Properties**\n . You can also show the data in a\n **Week**\n view and can indicate the day that starts the week (such as Monday). For more information about the options available in\n **Chart Properties**\n , see\n\nCustomizing calendars\n\n.\n\n*Important:**\n For your calendar to work properly, you\n *must*\n set the date grain to\n **Day**\n . Otherwise the chart does not display the correct data. For more information about setting date grains, see\n\nAdding Filters to Your Chart\n\n.\n\n\n**Video - Building a Calendar Card**\n\nPowering a calendar\n---------------------\n\nIn the Analyzer, you choose the columns containing the data for your calendar. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how the data from a typical column-based spreadsheet is converted into a calendar.\n\nCustomizing calendars\n-----------------------\n\nYou can customize the appearance of a calendar by editing its\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of calendars include the following. You can click a thumbnail image to see a larger image.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Theme > Theme\n  |\n Determines the color theme for the calendar.\n  |\n |\n|\n General > View\n  |\n Determines whether the calendar displays data for an entire\n **Year**\n , for a\n **Month**\n , for a\n **Week**\n , for a single\n **Day**\n ,\n **Last Year Rolling**\n , or\n **Next Year Rolling**\n . If you select\n **Auto**\n (which is the default), the calendar determines the view based on the breadth of data in the DataSet. For example, if your DataSet contains data for more than one month, the year view displays automatically so all represented months can be shown.\n  |\n —\n  |\n|\n General > Dates From\n  |\n Determines whether the dates that appear in the calendar are to be determined automatically based on your DataSet (which is the default) or you plan to specify them manually using the\n **Year**\n ,\n **Selected Year**\n ,\n **Month**\n , and\n **Day**\n properties. For example, if the series of dates in your DataSet started with \"01-06-2014\" and you chose the \"Day\" view, then by default Domo would show the data for \"01-06-2014\" because it was the first value in the DataSet. If you wanted to show a different date, you could do so by selecting\n **User Specified**\n here and then specifying the date using the\n **Year**\n ,\n **Selected Year**\n ,\n **Month**\n , and\n **Day**\n properties.\n  |\n\n*Year View**\n\n*Month View**\n\n*Week View**\n\n*Day View**\n\n\n |\n|\n General > Year\n  |\n Determines the year to be used when\n **User Specified**\n is selected for the\n **Dates From**\n property. Options include\n **Current**\n (which is the default),\n **Previous**\n ,\n **Next**\n , and\n **Specified**\n . If you select\n **Specified**\n , you enter the specified year in the\n **Selected Year**\n field. This option is useful if your DataSet contains data for more than one year.\n  |\n —\n  |\n|\n General > Selected Year\n  |\n Lets you specify the year for your data when you have selected\n **Dates From > User Specified**\n and\n **Year > Specified**\n . This option is useful if your DataSet contains data for more than one year.\n  |\n —\n  |\n|\n General > Month\n  |\n Lets you specify the month for your data when you have selected\n **Dates From > User Specified**\n . The default is\n **Current**\n .\n  |\n —\n  |\n|\n General > Day\n  |\n Lets you specify the day of the month for your data when you have selected\n **Dates From > User Specified**\n . The default is\n **Current**\n .\n  |\n —\n  |\n|\n General > First Day of Week\n  |\n Lets you specify the first day of the week in your calendar. The default is\n **Sunday**\n .\n  |\n —\n  |\n\nExporting an MS Outlook calendar for use in Domo\n--------------------------------------------------\n\nYou can export a calendar from Microsoft Outlook as an Excel spreadsheet file for use in creating a calendar in Domo. This is a useful way of getting your scheduled meetings and appointments into Domo.\n\n\n**To export a Microsoft Outlook calendar into Domo,**\n\n. Open Microsoft Outlook 2010.\n2. Select\n **File > Options**\n .\n3. Click\n **Advanced**\n to display the\n **Advanced**\n tab.\n4. Click\n **Export**\n .\n5. Select\n **Export**\n to a file, then click\n **Next**\n .\n6. Select\n **Comma Separated Values**\n , then click\n **Next**\n .\n7. Select\n **Calendar**\n , then click\n **Next**\n .\n8. Click\n **Finish**\n to export the calendar to a Microsoft Excel spreadsheet.\n9. If you are prompted to set the date range, enter the desired date range, then click\n **OK**\n .\n10. In Domo, power a calendar chart using the Microsoft Excel spreadsheet file.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043427973\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004752\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCalendar\n\n", "article_total_view_count": "\n\n\n 5,469\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:29 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "calendar", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}