{"file_path": "../../raw_kb_v2\\article\\360042924714\\index.html", "content": {"Title": "Shape Gauge", "Article Body": "Intro\n                        \n\n\n\n                        A shape gauge uses any of 45 different images to indicate a current value. By using different images to indicate different ranges, you can convey to users whether the current value is positive, neutral, or negative. The classic example of this kind of gauge in Domo is the face gauge, which shows a smiling red face for positive range values, a neutral orange face for middling values, and an angry red face for negative values.\n                       \n\n\n\n\n                        In addition to faces, all of the following shapes are available for you to use in shape gauges:\n                       \n\n\n\n                          Different shapes such as squares, circles, triangles, pentagons, and octagons\n                         \n\n\n\n                          Thumbs up/thumbs down\n                         \n\n\n\n                          Airplanes taking off/landing\n                         \n\n\n\n                          Lightning bolts\n                         \n\n\n\n                          Batteries that are empty, half-full, and full\n                         \n\n\n\n                          And dozens more\n                         \n\n\n\n                        In addition, you can vary shapes by customizing their colors, giving you even more options to choose from.\n                        \n\n\n\n\n\n\n                        You can have up to 10 ranges in a shape gauge.\n                       \n\n                        Other gauge types in Domo include\n                        \n                         Single Value gauges\n                        \n                        ,\n                        \n                         Filled gauges\n                        \n                        ,\n                        \n                         Progress Bar gauges\n                        \n                        ,\n                        \n                         Radial gauges\n                        \n                        , and\n                        \n                         Comparative Fill gauges\n                        \n                        .\n                       \n\n                        Powering shape gauges\n                       \n\n                        A shape gauge requires only one column or row of data from your DataSet, which should contain value data. The value data is aggregated based on what you select in the\n                        \n                         Calculation\n                        \n                        menu (which you access by clicking on the column name next to \"Gauge Values\"). For example, if you select\n                        \n                         Sum\n                        \n                        , the values in the column are summed and this total value is used for the gauge. If you select\n                        \n                         No aggregation\n                        \n                        , the first value in the DataSet is used. For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your shape gauge. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         KPI Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from the category and value columns in a typical column-based spreadsheet is converted into a shape gauge:\n                        \n\n\n\n\n\n                        Customizing shape gauges\n                       \n\n                        You can customize the appearance of a shape gauge by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Setting Properties for Gauges\n                        \n                        . Unique properties of shape gauges include the following:\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            General > No Data Handling\n                           \n\n\n\n                            Determines what happens when no data is sent to the gauge. You can choose to have a message display (which is the default), set the value of the gauge to 0, or show a blank gauge.\n                           \n\n\n\n\n\n                            Range 1-10 > Minimum Value\n                           \n\n\n\n                            Lets you specify the minimum value for the selected range.\n                           \n\n\n\n\n\n                            Range 1-10 > Maximum Value\n                           \n\n\n\n                            Lets you specify the maximum value for the selected range.\n                           \n\n\n\n\n\n                            Range 1-10 > Color\n                           \n\n\n\n                            Lets you specify the color for the selected range.\n                           \n\n\n\n\n\n                            Range 1-10 > Symbol\n                           \n\n\n\n                            Lets you specify the image for the selected range.\n                           \n\n\n\n\n\n                            Out of Range > Color\n                           \n\n\n\n                            Lets you specify the color used when the current value does not fall within any of the ranges you have configured.\n                           \n\n\n\n\n\n                            Out of Range > Symbol\n                           \n\n\n\n                            Lets you specify the symbol used when the current value does not fall within any of the ranges you have configured.", "Preview Article": "Click here to preview", "URL Name": "360042924714", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004699", "Archived Date": "", "Language": "English", "Primary Version": "Shape Gauge", "Article Total View Count": "4,818", "": "", "Article Created Date": "10/24/2022, 10:25 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Shape Gauge\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}