{"file_path": "../../raw_kb_v2\\article\\360043427473\\index.html", "content": {"Title": "Troubleshooting Domo", "Article Body": "Intro\n                       \n\n                        This article contains information for troubleshooting Domo in the following topics:\n                       \n\n\n\n                          Forgotten password\n                         \n\n\n\n                          Expired password\n                         \n\n\n\n                          Changing the password for a connector account\n                         \n\n\n\n                          Map area with data not displaying\n                         \n\n\n\n                          Missing access to a Domo feature\n                         \n\n\n\n                          Problems with Internet Explorer\n                         \n\n\n\n                          Sorting errors\n                         \n\n\n\n                          Spreadsheet error after renaming\n                         \n\n\n\n                          Truncated text in spreadsheets\n                         \n\n\n\n                          Unable to sync value scale and data label values\n                         \n\n\n\n                          Unable to view a specific card or dashboard\n                         \n\n\n\n\n\n                        Forgotten Password\n                       \n\n                        If you forget your password to login to Domo, you can change it from the signing dialog, as long as you know the email address you use to login. For more information, see\n                        \n                         Changing Your Password\n                        \n                        .\n                       \n\n                        If you cannot remember your login email address, ask someone who can login to tell you what email address displays for you in your user profile.\n                       \n\n\n\n                        Expired Password\n                       \n\n                        If your password has expired or is expiring, you can reset it. To learn how, see\n                        \n                         Changing Your Password\n                        \n                        .\n                       \n\n\n\n                        Changing the Password for a Connector Account\n                       \n\n                        For connectors that require you to enter account credentials manually (as opposed to using OAuth), you can edit the password for the account in the\n                        \n\n                          Accounts\n                         \n\n                        section of the Data Center.\n                       \n\n\n\n                          From the navigation header, select\n                          \n                           Data.\n                          \n\n\n\n\n                          In the left navigation menu, select\n                          \n\n\n                            Accounts\n                           \n\n                          .\n                         \n\n\n\n                          Hover over the entry you want to edit, then select\n                          \n\n                            Edit\n                           \n\n                          .\n                         \n\n\n\n                          Edit the credentials in the appropriate fields.\n                         \n\n\n\n                          Select\n                          \n\n                            Save Changes\n                           \n\n                          .\n                         \n\n\n\n                        For more information, see\n                        \n                         Managing User Accounts for Connectors.\n                        \n\n\n\n\n                        Map Area with Data Not Displaying\n                       \n\n                        When data does not display for an area of a map, that area appears grayed out and the legend indicates there is no data. In the example below, California indicates no data.\n                       \n\n\n\n\n                        If there is data for the area, then the map may not be properly connected to the data, due to an incorrect name or code. To fix this, change the name or code for that area of the map. Refer to the list of supported names and codes for the map you are using. For more information on supported names and codes, see our articles on\n                        \n                         Continental and Regional Maps\n                        \n                        and\n                        \n                         U.S. State and County Maps\n                        \n                        .\n                       \n\n                        You can do one of the following:\n                       \n\n\n\n                          Change the value in the DataSet.\n                         \n\n\n\n                          Use a Beast Mode calculation to rename the value (in a new, transformed column), then set the area column name (state, country, and so on) to use the transformed column.\n                          \n\n                          For example, to transform a \"broken\" area, you could use the\n                          \n                           CASE\n                          \n                          function, as in the the following example of a calculation named \"RenState\" that renames mispellings of \"Californai\" in the\n                          \n                           State\n                          \n                          column to \"California\" in the\n                          \n                           RenState\n                          \n                          column.\n                          \n\n\n                           CASE `State`\n                           \n                           when 'Californai' then 'California'\n                           \n                           else `State`\n                           \n                           end\n                          \n\n\n                          For more information about Beast Mode, see\n                          \n                           Adding a Beast Mode Calculation to Your Chart\n                          \n                          .\n                         \n\n\n\n\n\n                        Missing Access to a Domo Feature\n                       \n\n                        The most likely reason for this is that you do not have sufficient rights to access the feature you want. The default security roles in Domo are Admin, Privileged, Editor, Participant, and Social. Each security role has specific grants to certain features. Users with Participant and Social roles generally have view-only access. Users with an Admin role have access to all features, cards, and dashboards in their company instance.\n                        \n\n                        For a list of grants in Domo and the associated access levels, see\n                        \n                         Default Security Role Reference\n                        \n                        . You can also create custom roles in which you specify the privileges available to users with that role. For more information, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n\n                        Problems with Internet Explorer\n                       \n\n                        This is a known issue with Internet Explorer. Large Sumo and Table Cards are especially affected and may have slower load times.\n                        \n                        To resolve this issue, we recommend switching to another browser such as Mozilla Firefox or Google Chrome. If this is not feasible, you can try reducing the number of columns or rows in your Sumo Cards and Tables.\n                       \n\n\n\n                        Sorting Errors\n                       \n\n                        Unable to sort in Pie or Donut graph\n                       \n\n                        By default you cannot use the\n                        \n\n                          Sorting\n                         \n\n                        menu to change the order in which slices appear in Pie and Donut graphs. However, if you check the\n                        \n\n                          Unsorted Data\n                         \n\n                        box in\n                        \n\n                          Chart Properties\n                         \n\n                        , you can use\n                        \n\n                          Sorting\n                         \n\n                        to change the sort order.\n                       \n\n                        For more information about Pie and Donut graphs, see\n                        \n                         Sorting the Data in Your Chart\n                        \n                        .\n                       \n\n                        Unable to sort in Funnel Bars/Folded Funnel graph\n                       \n\n                        Because Funnel Bars and Folded Funnel graphs are intended to show data dropping off through a series of stages, the data is automatically sorted from highest to lowest value. You cannot change the sorting in these graph types. However, you can change the sorting in standard Funnel graphs.\n                       \n\n                        For more information about Funnel graphs, see\n                        \n                         Sorting the Data in Your Chart\n                        \n                        .\n                       \n\n\n\n                        Spreadsheet Error After Renaming\n                       \n\n                        When updating a spreadsheet, Domo uses the name of the spreadsheet and the worksheet to update data. For more information, see\n                        \n                         Updating or Refreshing the DataSet for a Visualization Card\n                        \n                        .\n                       \n\n                        If you have rename worksheet, Domo may be unable to update the data from the spreadsheet. You can revert to the old name of the worksheet, and then update the spreadsheet.\n                       \n\n\n\n                        Truncated Text in Spreadsheets\n                       \n\n                        Domo has a 1024-character limit. Any additional characters are truncated. You can get around this by splitting the text between two columns to make sure it stays within the limit. You must do this in your own data before bringing it into Domo.\n                        \n                        You can contact\n                        \n                         Domo Support\n                        \n                        to request a character-limit increase. Multiples of 1024 are preferred. Note that anything over 8100 characters can have a significant effect on performance when loading cards.\n                       \n\n\n\n                        Unable to Sync Value Scale and Data Label Values\n                       \n\n                        When editing a chart, you can ensure that the values on your value scale and those in your data labels are in sync using one of the following options:\n                       \n\n\n\n                          Set number formatting using the\n                          \n\n                            Format\n                           \n\n                          menu (by selecting\n                          \n\n                            More Options\n                           \n\n                          under the value menu).\n                          \n                          While this option syncs the numbers on the value scale and in your hover labels, it has the following drawbacks:\n                         \n\n\n\n                            Only the hover labels are affected; the permanent data labels (which you apply by selecting\n                            \n\n                              Chart Properties > Data Label Settings > Show > Always\n                             \n\n                            ) are not affected.\n                           \n\n\n\n                            There are no advanced formatting options as there are in the\n                            \n\n                              Chart Properties\n                             \n\n                            .\n                           \n\n\n\n                            The\n                            \n\n                              Format\n                             \n\n                            menu items are overridden by formatting changes in\n                            \n\n                              Chart Properties\n                             \n\n                            .\n                            \n                            Because of this override, Domo recommends that you use\n                            \n\n                              Chart Properties\n                             \n\n                            to specify formatting where possible.\n                           \n\n\n\n\n\n                          Set formatting in\n                          \n\n                            Chart Properties > Data Label Settings\n                           \n\n                          by checking the\n                          \n\n                            Use scale format\n                           \n\n                          and the\n                          \n\n                            Use scale abbreviation\n                           \n\n                          boxes. Also, ensure that\n                          \n\n                            Show > Always\n                           \n\n                          is selected.\n                         \n\n\n\n                        For more information, see\n                        \n                         Formatting Data Label and Hover Text in Your Chart\n                        \n                        .\n                       \n\n\n\n                        Unable to View a Specific Card or Dashboard\n                       \n\n                        If a card or dashboard has not been shared with you, you cannot see it. Ask someone who has access to the card or dashboard to share it with you. Content that is shared with you appears on your\n                        \n\n                          Shared\n                         \n\n                        page. For more information, see\n                        \n                         Sharing and Removing Access to Cards and Dashboards\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043427473", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004377", "Archived Date": "", "Language": "English", "Primary Version": "Troubleshooting Domo", "Article Total View Count": "5,773", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Troubleshooting Domo\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Support Resources\n              \n", "url": "/s/topic/0TO5w000000ZaoIGAS"}]}