{"file_path": "../../raw_kb_v2\\article\\1500011338561\\index.html", "content": {"title": "\n\n\n Twitter V2 Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Domo Twitter V2 Connector integrates Domo with Twitter to extract data from the Twitter API. It provides access to read Twitter data, including user tweets, user mentioned tweets and many other Twitter entities, and returns data based on the provided Twitter user name. Once your Twitter data is in Domo, you can use your data to measure your social media ROI with visualizations in intuitive dashboards and apps. Get the most out of your marketing budget by measuring your social media engagement during different time periods, detect cross-platform engagement trends, and better understand your target audience. You can also track your top posts across social media platforms, rate and filter your top posts, and identify other patterns to help you create engaging content. To learn more about the Twitter API, visit their site (\n\nhttps://dev.twitter.com/rest/public\n\n).\n\n\n You connect to your Twitter account in the Data Center. This topic discusses the fields and menus that are specific to the Twitter V2 connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Twitter account and create a DataSet, you must have your Twitter API key and API secret.\n\n\n Connecting to Your Twitter Account\n------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Twitter V2 Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Twitter account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n API Key\n  |\n Enter your Twitter API key.\n  |\n|\n API Secret\n  |\n Enter your Twitter API secret.\n  |\n\n\n Once you have entered valid Twitter credentials, you can use the same account any time you go to create a new Twitter V2 DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Twitter V2 report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Search Recent Tweets\n  |\n Returns Tweets from the last seven days that match the search query.\n  |\n|\n Tweets Lookup By Id\n  |\n Returns a variety of information about the Tweet specified by the requested ID or list of IDs.\n  |\n|\n User Tweets\n  |\n Returns Tweets composed by a single user, specified by the requested user ID.\n  |\n|\n User Mention Tweets\n  |\n Returns Tweets mentioning a single user specified by the requested user ID.\n  |\n|\n Users By Name\n  |\n Returns a variety of information about one or more users specified by their usernames.\n  |\n|\n User Lookup Following\n  |\n Returns a list of users the specified user ID is following.\n  |\n|\n User Lookup Followers\n  |\n Returns a list of users following the specified user ID.\n  |\n\n\n |\n|\n Search Query\n  |\n Enter the query you want to search the tweets for.\n  |\n|\n Fields\n  |\n Select the fields you want to fetch the tweets for.\n  |\n|\n Tweet Fields\n  |\n Select the tweet fields you want to fetch the tweets for.\n  |\n|\n Tweet IDs\n  |\n Enter the list of comma separated Tweet ids you want to fetch the tweets for.\n  |\n|\n Include Referenced Tweet ID\n  |\n Select this checkbox if you want to include Referenced Tweets Id.\n  |\n|\n User Name\n  |\n Enter the username you want to fetch the tweets for.\n  |\n|\n Filter By Date\n  |\n Select this checkbox if you want to filter the data by date.\n  |\n|\n User Fields\n  |\n Select user fields.\n  |\n|\n Expansions\n  |\n Select expansions.\n  |\n|\n Media Fields\n  |\n Select media fields.\n  |\n|\n Place Fields\n  |\n Select place fields.\n  |\n|\n Poll Fields\n  |\n Select poll fields.\n  |\n|\n Tweet Fields\n  |\n Select tweet fields.\n  |\n|\n Start Time\n  |\n Select the date format for your data.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n\n\n**Days Back**\n\n\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ********End Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ********Start Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Time Period\n  |\n Specify the time period that you would like to receive data for.\n  |\n|\n Starting Day of the Week\n  |\n Select the day you would like your week to start with.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500011338561\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003224\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nTwitter V2 Connector\n\n", "article_total_view_count": "\n\n\n 4,699\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "twitter_v2_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}