{"file_path": "../../raw_kb_v2\\article\\360058714813\\index.html", "content": {"title": "\n\n\n Microsoft Reports Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMicrosoft Reports connector provides an ease of access to your Microsoft email data in your organization. You can get several details about your Microsoft email data into Domo easily and securely. To do this, you must first create an app in Microsoft Azure. You must have an Admin account or an Admin approval to connect to your Microsoft account. Use Domo's Microsoft Report connector to get data about the email and user activities from your Microsoft account into Domo.\n\n\n You connect to your Microsoft Reports account in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft Reports connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Microsoft account and create a DataSet, you must have the following:\n\n An installed Microsoft Azure app.\n* The client ID for your Azure app.\n* The client secret for your Azure app. This is generated when you create your Azure app.\n\n\n#####\n**To find the Client ID, do the following:**\n\n\n1. Go to\n\nhttps://portal.azure.com\n\nand sign in using your Microsoft credentials.\n2. Select\n ****Azure Active Directory > App registrations****\n .\n3. Find your app and click on it.\n4. Locate the \"Application ID\" from the web app (this is the client ID).\n\n\n#####\n**To generate a new Client Secret, do the following:**\n\n\n1. Go to\n\nhttps://portal.azure.com\n\nand sign in using your Microsoft credentials.\n2. Select\n ****Azure Active Directory > App registrations****\n .\n3. Find your app and click on it.\n4. Open\n ****Certificates and secrets****\n .\n5. Create the client secret.\n\n\n###\n Creating an Azure App for Enterprise OAuth\n\nTo create a Microsoft Azure app, do the following:\n\n\n 1. Log into\n\nhttps://portal.azure.com\n\n.\n\n\n 2. Click on\n ****App registrations****\n .\n\n3. Click\n ****New registration****\n .\n\n\n 4. Enter the application name and select the supported account type as below. Enter the Redirect URI for Web as\n\nhttps://oauth.domo.com/api/data/v1/oauth/providers/microsoft-reports/exchange\n\n.\n\n5. Click\n ****Register****\n .\n\n\n 6. Once the application is registered, click on\n **Certificates & Secrets**\n . Certificates can be used as secrets to prove the application’s identity when requesting a token. Also, can be referred to as public keys.\n\n7. Click on\n **+ New Client Secret**\n button.\n\n8. Specify the client secret description and the expiry period for your client secret, and click\n ****Add****\n .\n\n9. Copy the value and paste it into the\n ****Client Secret****\n field in the Connector credentials section in Domo.\n\n\n 10. Now, click\n **API Permissions**\n .\n\n11. Click\n **+Add Permissions**\n button.\n\n12. After adding the permissions, the configured permissions will be listed as below.\n\nConnecting to Your Microsoft Account\n--------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the\n\nMicrosoft Report\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your\n\nMicrosoft\n\naccount via Azure. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Client ID\n  |\n Enter the client ID for your installed Azure web app. For more information about finding this, see\n\nPrerequisites\n\nabove.\n  |\n|\n Client Secret\n  |\n Enter the client secret that was generated when you created your app. For more information about finding this, see\n\nPrerequisites\n\nabove.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to create a new\n\nMicrosoft Report\n\nDataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Get Email Activity User Detail\n  |\n This report returns details about email activity the users have performed.\n  |\n|\n Get Email Activity Counts\n  |\n This report enables you to understand the trends of email activities (like how many were sent, read, and received) in your organization.\n  |\n|\n Get Email Activity Exchange\n  |\n This report returns the number of emails sent today and yesterday in your organization.\n  |\n|\n Get Email Activity Metrics\n  |\n This report enables you to understand the trends of email activity (like how many were sent, and received) and on the number of unique users who are performing email activities like send, read, and receive.\n  |\n|\n Get Email Activity User Counts\n  |\n This report enables you to understand trends on the number of unique users who are performing email activities like send, read, and receive.\n  |\n\n|\n|\n Period\n  |\n Select the length of time over which the report is aggregated. The supported values for Period are: D7, D30, D90, and D180. These values follow the format Dn where n represents the number of days over which the report is aggregated.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360058714813\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003876\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft Reports Connector\n\n", "article_total_view_count": "\n\n\n 4,752\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "microsoft_reports_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}