{"file_path": "../../raw_kb_v2\\article\\360042935074\\index.html", "content": {"Title": "Understanding Business-in-a-Box", "Article Body": "Domo's \"Business-in-a-Box\" feature provides pre-installed best practice dashboards that allow you to quickly bring the power of Domo to your whole company. These dashboards are based on Domo’s research of best practices and are organized by department and key topics for each department. With Business-in-a-Box, you can see best practice industry applications of Domo for departments that may interest you. You can also quickly navigate to dashboards for any department in your company to see metrics for that department.\n                       \n\n                        For example, the \"IT\" department tab in Business-in-a-Box provides access to such dashboards as \"Network Monitoring,\" \"System Security,\" \"Cloud Operations,\" etc., as shown here:\n                       \n\n\n\n\n                        Each pre-installed dashboard contains cards powered by sample data to give you a quick understanding of how the cards provide answers for these key topics. The following screenshot shows an example of a dashboard with cards powered by sample data:\n                       \n\n\n\n\n                        You can then make these cards your own by powering them up with your own live data, as explained in\n                        \n                         Powering Up Business-in-a-Box Dashboards\n                        \n                        .\n                       \n\n                        In addition to giving you the ability to power up pre-installed best practice dashboards, Business-in-a-Box also allows you to link existing Domo dashboards (card pages) to your department tabs as well as install new dashboards from the Appstore. When you do this, the new dashboard appears in the specified department tab, allowing quick access from the tab. In the following example, the \"Investor Relations\" dashboard was added to the \"Marketing\" tab from the Appstore:\n                        \n\n\n\n\n\n\n                          Video - Business-in-a-Box", "Preview Article": "Click here to preview", "URL Name": "360042935074", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004307", "Archived Date": "", "Language": "English", "Primary Version": "Understanding Business-in-a-Box", "Article Total View Count": "4,763", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Understanding Business-in-a-Box\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Business In A Box\n              \n", "url": "/s/topic/0TO5w000000ZanBGAS"}]}