{"file_path": "../../raw_kb_v2\\article\\360043873654\\index.html", "content": {"title": "\n\n\n AWS Data Exchange Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAWS Data Exchange makes it easy to find, subscribe to, and use third-party data in the cloud. You can access datasets from qualified data providers that include category-leading brands such as Reuters, who curate data from over 2.2 million unique news stories per year in multiple languages; Change Healthcare, who process and anonymize more than 14 billion healthcare transactions and $1 trillion in claims annually; and Dun & Bradstreet, who maintain a database of more than 330 million global business records. Use Domo's Data Exchange Connector to import data into Domo from your Amazon S3 bucket. With the powerful datasets from AWS combined with the ability to visualize and create business solutions in Domo, you can create high-value solutions by combining your own data with external datasets. This connector includes only the AWS Data Exchange datasets that you've subscribed to and approved.\n\n\n To learn more about the AWS API, visit their page (\n\nhttps://aws.amazon.com/api-gateway/\n\n).\n\n\n You connect to your AWS account in the Data Center. This topic discusses the fields and menus that are specific to the AWS Data Exchange connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your AWS account and create a DataSet, you must have the following:\n\n Your AWS access key. You can find this in the\n **Security Credentials**\n section of the AWS Console. Alternatively, if you are using IAM, you can find it under\n **Users**\n .\n* Your AWS secret key, which was provided when you created your access key. You can generate a new secret key in the AWS Console.\n* The name of the AWS S3 Bucket you want to retrieve files from.\n\n\n###\n Creating a user with the proper permissions\n\nYou must create a user with the proper permissions in the IAM Amazon Console before you can connect to S3 data in Domo.\n\n\n**To configure your user in the IAM Amazon Console,**\n\n. Add a new user, setting options as follows:\n\n1. In the\n\t **Details**\n\t pane, check the box for\n\t **Programmatic Access**\n\t under\n\t **Select AWS access type**\n\t .\n\t2. In the\n\t **Permissions**\n\t pane, select\n\t **Attach existing policies directly**\n\t , then check the box for either\n\t **AmazonS3FullAccess**\n\t or\n\t **AmazonS3ReadOnlyAccess**\n\t .\n\n\n\t Customer-managed policies\n\t *do not work*\n\t .\n\t3. In the\n\t **Review**\n\t pane, click\n\t **Create User**\n\t .\n2. After you create your user, copy the access and secret keys to use in the\n **Credentials**\n pane in Domo.\n\nConnecting to your AWS account\n--------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the AWS Data Exchange Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your AWS account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter your AWS access key. For information about finding your access key, see\n\nPrerequisites\n\n, above.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. For information about finding your secret key, see\n\nPrerequisites\n\n, above.\n  |\n|\n Bucket\n  |\n Enter the Amazon S3 Bucket you want to pull files from.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to create a new AWS Data Exchange DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains various menus for locating and configuring the file you want to pull into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n List Datasets\n  |\n Select the dataset you want to pull into Domo.\n  |\n|\n List Dataset Revisions\n  |\n Select the desired dataset revision.\n  |\n|\n List Revision Assets\n  |\n Select the desired revision asset.\n  |\n|\n Key\n  |\n Enter the name of the Amazon S3 bucket object.\n  |\n|\n What Type of File Do You Want to Import?\n  |\n Select the desired file type, either\n **CSV**\n ,\n **TSV**\n , or\n **TXT**\n .\n  |\n|\n Select the Delimiting Character\n  |\n Select the delimiter used in the CSV file you want to retrieve. If your delimiter is not listed, select\n **Other**\n .\n  |\n|\n Specify Your Delimiter\n  |\n Enter the character used to delimit your CSV text.\n  |\n|\n Quote Character\n  |\n Select a quote character to parse the CSV file you want to retrieve. A double quote (\") is the CSV standard. If your quote character is not listed, select\n **Other**\n .\n  |\n|\n Custom Quote Character\n  |\n Enter the desired CSV quote character.\n  |\n|\n Escape Character\n  |\n Select an escape character to parse the CSV file you want to retrieve. A backslash (\\) is the CSV standard.\n  |\n|\n Custom Escape Character\n  |\n Enter the desired CSV escape character.\n  |\n\n\n###\n\nOther Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Ensure that the file is present in the S3 bucket and that the correct file type is specified in the connector settings.\n* NULL columns\n *must*\n be removed before the connector can successfully retrieve data.\n* If you run into a \"Failed to Import Successfully\" error when trying to import a CSV file, you can often get around this by changing the option in the\n **Quote Character**\n menu to\n **No Quote Character**\n .\n\nFAQ\n-----\n\n\n#####\n How frequently will my data update?\n\nAs often as needed.\n\n####\n Are there any API limits that I need to be aware of?\n\nNo.\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need your AWS credentials: access key, secret key and the bucket name.\n\n####\n Where can I find my access key and secret key?\n\nYou can find the access key in the\n **Security Credentials**\n section of the AWS Console. Alternatively, if you are using IAM, you can find it under\n **Users**\n . Your AWS secret key is provided when you create your access key. You can generate a new secret key in the AWS Console.\n\n####\n Does this connector list all of the available AWS Data Exchange datasets from the Amazon Marketplace?\n\nNo, only the ones to which you are subscribed and approved.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043873654\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003913\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAWS Data Exchange Connector\n\n", "article_total_view_count": "\n\n\n 4,753\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "aws_data_exchange_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}