{"file_path": "../../raw_kb_v2\\article\\360042934674\\index.html", "content": {"Title": "Profile Page Layout", "Article Body": "Intro\n                       \n\n                        The Profile page is like a user's personal home page in Domo. You can view information in any user's Profile view (and may also be able to edit it, depending on your\n                        \n                         security role\n                        \n                        ).\n                       \n\n                        In a user's Profile view, you can do all of the following:\n                       \n\n\n\n                          See the user's personal information such as workplace role, department, contact information, and location.\n                         \n\n\n\n                          Follow the user.\n                         \n\n\n\n                          See where the user falls in your organizational hierarchy.\n                         \n\n\n\n                          See the user's stats in the company and in Domo, such as number of followers, number of likes in Buzz, etc.\n                         \n\n\n\n                          See the user's status (what they're working on).\n                         \n\n\n\n                          See the user's Domo Score.\n                         \n\n\n\n                          See the user's conversations, comments, photos, tasks, and status updates that have been \"liked.\"\n                         \n\n\n\n                          See Buzz conversations the user has participated in.\n                         \n\n\n\n                          See what cards the user has viewed most recently or most frequently.\n                         \n\n\n\n                          See which DataSets a user owns.\n                         \n\n\n\n                          See what alerts the user is following.\n                         \n\n\n\n                          See what cards the user has added as Favorites.\n                         \n\n\n\n                          See the user's tasks and projects.\n                         \n\n\n\n                          View and manage personal photos.\n                         \n\n\n\n                          Award badges to a user.\n                         \n\n\n\n                          See what groups the user belongs to.\n                         \n\n\n\n                          Connect to social networks such as Facebook and Twitter.\n                         \n\n\n\n                        The Profile view is divided into a number of panes from top to bottom. The page provides hyperlinks that allow you to quickly access all of the panes in the page. This topic discusses each pane from top to bottom in turn.\n                       \n\n\n                         Video - Domo Interface - Profile\n                        \n\n\n\n\n\n\n                        Profile header\n                       \n\n                        This is the \"main\" portion of the Profile view, the area first seen by viewers. Here you can view a user's personal information and see their user stats. You can also edit your own profile picture, enter status updates, and view/edit who you report(s) to.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           If a locked icon displays next to the item, this means that you are unable to edit it.\n                           \n\n\n                           This is because the field is used as a Trusted Attribute. For more information on Trusted Attributes, see\n                           \n                            Admin Settings Overview\n                           \n                           .\n                          \n\n\n\n\n                        Depending on your permissions, you may also be able to edit this information in other users' Profile pages. For more information about permissions, see\n                        \n                         Managing Roles\n                        \n                        .\n                       \n\n                        The following screenshot points out the most important components in this pane:\n                       \n\n\n\n\n                        You can learn about each component in the following table:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Previous Profile button\n                           \n\n\n\n                            Lets you navigate to the previous Profile page alphabetically in your organization.\n                           \n\n\n\n\n\n                            Profile picture\n                           \n\n\n\n                            The picture that represents you or this user throughout Domo. You can change your picture by clicking on it and uploading a new picture. Depending on your permissions, you may also be able to add or edit other users' profile pictures. For more information, see\n                            \n                             Adding or Changing Your Profile Picture\n                            \n                            .\n                           \n\n\n\n\n\n                            Status update\n                           \n\n\n\n                            Lets you enter a status update in your own Profile page (or in that of another user, depending on your permissions), similar to that found in Facebook. When you enter a status update, you are telling other users in your company what you're working on. You can choose to attach a status update to a task in the Projects & Tasks page. You can view a log of all of a user's status updates in the\n                            \n                             Status Updates\n                            \n                            tab, located farther down in the Profile page. You can also like a user's status by clicking the\n                            \n                            icon located on the right side of the status update field. For more information, see\n                            \n                             Entering Status Updates\n                            \n                            .\n                           \n\n\n\n\n\n                            Personal info\n                           \n\n\n\n                            Displays this user's name, position, department, employee number, tenure, and LFL (the number of organizational levels down the user is from the head of the organization). You can edit your name, position, department, and tenure by clicking and making the desired changes in your own Profile page.\n                           \n\n\n\n\n\n\n\n                                Note:\n                               \n                               If a locked icon displays next to the item, this means that you are unable to edit it.\n                               \n\n\n                               This is because the field is used as an Attribute. For more information about Attributes, see our\n                               \n                                Attributes\n                               \n                               article.\n                              \n\n\n\n\n\n                            You can edit your employee number only in the Admin Settings. If you have an \"Admin\" security role or a custom role with the \"Edit Users\" privilege enabled, you can also edit this information for other users. For more information about editing personal information, see\n                            \n                             Managing Roles\n                            \n                            .\n                           \n\n\n\n\n\n                            Reports diagram\n                           \n\n\n\n                            Shows who this user reports to, who the user's peers are (that is, those users who report to the same individual as this user), and who reports to the user. You can change who you report to and who reports to you by clicking in the appropriate area and selecting the desired user from the pop-up list. Depending on your permissions, you may also be able to specify this information for other users. Peers are determined automatically based on who you report to. If there are more peers or reports than fit in their respective areas, you can click the arrows on either side to see the additional peers or reports.\n                           \n\n                            The Reports diagram also contains a button labeled\n                            \n                             View Full Org\n                            \n                            . Clicking this button opens the Org Explorer, which shows the org chart for your company.\n                           \n\n                            For more information, see\n                            \n                             Viewing and Entering Peers in Your Company Org Chart\n                            \n                            .\n                           \n\n\n\n\n\n                            Background image\n                           \n\n\n\n                            The background image that appears behind the profile header. You can change your background image by clicking the\n                            \n                             Change Background\n                            \n                            button in the top right corner of your Profile page and uploading the desired image. For more information, see\n                            \n                             Changing Your Profile Background Image\n                            \n                            .\n                           \n\n\n\n\n\n                            Next Profile button\n                           \n\n\n\n                            Lets you navigate to the next Profile page alphabetically in your organization.\n                           \n\n\n\n\n\n                            Location\n                           \n\n\n\n                            Shows the company location in which this user works. You can change this location in your own Profile page by clicking and editing. Depending on your permissions, you may also be able to add or edit this information for other users.\n                           \n\n\n\n\n\n                            Communication toolbar\n                           \n\n\n\n                            Displays options for contacting this user. Clicking\n                            \n                            or\n                            \n                            displays the user's landline number and cell phone number, respectively. You can change either of these numbers in your own Profile page by clicking and editing. Depending on your permissions, you may also be able to edit this information for other users. Clicking\n                            \n                            opens your email client with the user's email address automatically appearing in the\n                            \n                             To\n                            \n                            field. Clicking\n                            \n                            opens a dialog in which you can privately message this user directly through Buzz. For more information about sending a private Buzz message in this way, see\n                            \n                             Chatting in Buzz\n                            \n                            .\n                           \n\n\n\n\n\n                            Follow button\n                           \n\n\n\n                            Allows you to follow this user in Buzz. For more information, see\n                            \n                             Following a User in Buzz\n                            \n                            .\n                           \n\n\n\n\n\n                            Domo Score\n                           \n\n\n\n                            Displays this user's Domo Score along with the individual scores used to calculate the total score, such as number of followers, number of likes, etc. You can mouse over any individual score to see how your score compares with this user's. The \"Profile Complete\" percentage is determined by your completion of five distinct tasks such as adding a profile picture, adding a card as a Favorite, etc. You can see which of these tasks you have completed by mousing over the \"Profile Complete\" region in the profile header. For more information about the Domo Score, see\n                            \n                             Viewing a User's Domo Score\n                            \n                            .\n                           \n\n\n\n\n\n                            Latest earned badge\n                           \n\n\n\n                            The last achievement badge this user earned. You can click\n                            \n                             See All\n                            \n                            to jump directly to the\n                            \n                             Badges\n                            \n                            pane, which shows all of the badges this user has earned and lets you bestow new badges. You can also award a badge to this user directly from the profile header, by clicking the + and selecting the desired badge. This button only appears if you have been authorized to give badges. For more information about badges, see\n                            \n                             Viewing and Awarding Badges\n                            \n                            .\n                           \n\n\n\n\n\n                            Social media indicators\n                           \n\n\n\n                            Shows social media networks this user has connected to in his or her Profile page. Connected networks appear with a blue background. You can click on the icon for a network to open a dialog in which you can write and send this user a Buzz message reminding them to connect this social network. For information about connecting networks, see\n                            \n                             Connecting to Social Networks in Your Profile Page\n                            \n                            .\n                           \n\n\n\n\n\n                        Activities pane\n                       \n\n                        This pane contains a row of tabs, each of which provides a glimpse of what a user has been doing in Domo. The tabs in this pane are as follows:\n                       \n\n\n\n\n\n                            Tab\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Status Updates\n                           \n\n\n\n                            Shows this user's status updates, arranged chronologically from newest to oldest.\n                           \n\n\n\n\n\n                            Conversations\n                           \n\n\n\n                            Shows Buzz conversations this user has been involved in.\n                           \n\n\n\n\n\n                            Owned Cards\n                           \n\n\n\n                            Shows cards for which this user has been assigned as the owner.\n                           \n\n\n\n\n\n                            Owned DataSets\n                           \n\n\n\n                            Shows DataSets that this user owns.\n                           \n\n\n\n\n\n                            Viewing\n                           \n\n\n\n                            Shows cards this user has viewed most recently/frequently.\n                           \n\n\n\n\n\n                            Alerts\n                           \n\n\n\n                            Shows alerts this user is following.\n                           \n\n\n\n\n\n                            Favorites\n                           \n\n\n\n                            Shows cards this user has added as Favorites.\n                           \n\n\n\n\n\n                        Each of these tabs is described in more detail below.\n                       \n\n                        Viewing\n                       \n\n                        In this tab, you can see thumbnails all of the cards that this user has been viewing either most recently or most frequently. If you click a thumbnail, a preview of the card opens, with a link to the Details view for the card. If you click a rectangular card, the Details view for the card opens directly.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing a User's Viewed Cards\n                        \n                        .\n                       \n\n                        Favorites\n                       \n\n                        In this tab, you can view thumbnails of all the cards this user has set as Favorites. You can click on any thumbnail to open the Details view for the card.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing a User's Favorite Cards\n                        \n                        .\n                       \n\n                        Alerts\n                       \n\n                        In this tab, you can view all of the alerts that this user is following. You can click the upper portion of an alert to open an information panel in which you can edit the alert, set notifications, and see the history. You can click the lower portion to open the Details view for the card. You can also configure notifications by clicking\n                        \n                         Notify Me\n                        \n                        .\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing a User's Followed Alerts\n                        \n                        .\n                       \n\n                        Conversations\n                       \n\n                        In this tab, you can see all of the people this user has been having Buzz conversations with, along with the conversations. The tab is divided into two sections. The section on the left shows bubbles for all of the users this user has been talking to. Bubble size is determined by the number of conversations a user has been involved in. The section on the right contains a miniature version of Buzz that updates to reflect new conversations this user is engaging in.\n                       \n\n\n\n\n                        By default, the feed shows all of the conversations for this user. However, you can filter the feed to show only conversations in which a particular user was involved. To do this, you select the bubble for that user. The user's bubble moves to the center of the left-side section to indicate that the feed is filtered to show that user's conversations.\n                       \n\n                        For more information, see\n                        \n                         Viewing a User's Conversation Activity\n                        \n                        .\n                       \n\n                        Likes\n                       \n\n                        In this tab, you can see all of this user's \"liked\" Buzz conversations (that is, initial posts in Buzz), Buzz comments, photos, status updates, and tasks.\n                       \n\n\n\n\n                        This tab contains a number of subtabs, as follows:\n                       \n\n\n\n\n\n                            Subtab\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            All\n                           \n\n\n\n                            Shows all of the user's Buzz conversations and comments, tasks, photos, and statuses that have received \"likes.\"\n                           \n\n\n\n\n\n                            Conversations\n                           \n\n\n\n                            Shows all initial Buzz discussion posts from this user that have received \"likes.\"\n                           \n\n\n\n\n\n                            Comments\n                           \n\n\n\n                            Shows all Buzz comments from this user that have received \"likes.\"\n                           \n\n\n\n\n\n                            Tasks\n                           \n\n\n\n                            Shows all of this user's tasks that have received \"likes.\" For more information about projects and tasks, see\n                            \n                             Projects and Tasks\n                            \n                            .\n                           \n\n\n\n\n\n                            Photos\n                           \n\n\n\n                            Shows all of this user's personal photos that have received \"likes.\" For more information about personal photos, see\n                            \n                             Managing Your Personal Photos\n                            \n                            .\n                           \n\n\n\n\n\n                            Statuses\n                           \n\n\n\n                            Shows all of this user's statuses that have received \"likes.\" For more information about status updates, see\n                            \n                             Entering Status Updates\n                            \n                            .\n                           \n\n\n\n\n\n                        Each \"liked\" item appears in its own card. For any item, you can mouse over the \"thumbs up\" icon to see which users have liked the item; you can also click it to like it yourself.\n                       \n\n                        Owned Cards\n                       \n\n                        In this tab, you can see all of the cards for which this user has been assigned as the owner. You can click any card to bring up the Details view for the card.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing a User's Owned Cards\n                        \n                        .\n                       \n\n                        Owned DataSets\n                       \n\n                        In this tab, you can see all of the DataSets that this user owns, along with the number of cards being powered by each DataSet and the number of columns and rows in each one. You can click any DataSet to bring up the Details view for the DataSet.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing a User's Owned DataSets\n                        \n                        .\n                       \n\n                        Status Updates\n                       \n\n                        In this tab, you can see all of a user's status updates, arranged by date from newest to oldest.\n                       \n\n\n\n\n                        You can \"like\" a user's status by clicking the\n                        \n                        icon. For more information about status updates, see\n                        \n                         Entering Status Updates\n                        \n                        .\n                       \n\n                        Tasks & Projects pane\n                       \n\n                        In this pane you can view tasks for all projects for which this user has been assigned as a team member.\n                       \n\n\n\n\n                        For each project, all lists from the\n                        \n                         Projects & Tasks\n                        \n                        page are presented. When you click on a list, all the tasks within that list are shown, together with all assigned users. You can \"like\" a task by clicking the\n                        \n                        icon. This pane also includes a live \"work log\" containing updates for all of this user's projects. For example, when a task is created in a project, a notification appears in the work log.\n                       \n\n                        For more information about tasks and projects, see\n                        \n                         Projects and Tasks\n                        \n                        .\n                       \n\n                        Photos pane\n                       \n\n                        In this pane you can upload any personal photos you want others in your organization to be able to see. Photos in your personal photo store are different from profile pictures in that they do not represent you throughout Domo as profile pictures do. Personal photos help to tell others about yourself and are found only in your Profile page.\n                       \n\n\n\n\n                        For more information about uploading and managing photos, see\n                        \n                         Managing Your Personal Photos\n                        \n                        .\n                       \n\n                        Groups pane\n                       \n\n                        In this pane you can see all of the Domo user groups to which this user belongs. You can mouse over a group name to see all of the members of that group. For more information about groups, see\n                        \n                         Managing Users and Groups\n                        \n                        .\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing a User's Member Groups\n                        \n                        .\n                       \n\n                        Badges pane\n                       \n\n                        In this pane you can see badges awarded to this user. If you click a badge, a window appears with details about the badge.\n                       \n\n                        You can also award a badge to the user by clicking\n                        \n                         Give a Badge\n                        \n                        and selecting the desired badge from the list. This button appears only if you have been authorized to give badges in the Major Domo Center. For more information, see\n                        \n                         Creating Badges for Achievements\n                        \n                        .\n                       \n\n\n\n\n                        Social Networks pane\n                       \n\n                        In your own Profile page, from this pane you can connect your profile to any of several social networks, such as Facebook, Twitter, LinkedIn, and Instagram. When you connect to a social network, a live feed from that network appears. The content of the feed depends on the social network. For example, a Facebook feed shows your activity on Facebook, a LinkedIn feed shows your LinkedIn resume, and so on. In other users' Profile pages, you can view the feeds from any social networks they have connected to. Feeds may also provide options such as marking posts as Favorites, \"retweeting,\" and so on.\n                       \n\n                        For more information, see\n                        \n                         Connecting to Social Networks in Your Profile Page\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042934674", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004379", "Archived Date": "", "Language": "English", "Primary Version": "Profile Page Layout", "Article Total View Count": "4,956", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Profile Page Layout\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}