{"file_path": "../../raw_kb_v2\\article\\000005148\\index.html", "content": {"Title": "Admin Settings: Content", "Article Body": "Intro\n                       \n\n                        This article describes the various pages in the\n                        \n                         Content\n                        \n                        section of the Admin Settings. To learn more about the Admin Settings, see our\n                        \n                         Admin Settings Overview\n                        \n                        article.\n                        \n                        You can navigate this article by selecting a page from the following list:\n                       \n\n\n\n                          Cards\n                         \n\n\n\n                          Dashboards\n                         \n\n\n\n                          Scheduled Reports\n                         \n\n\n\n\n\n                        Cards\n                       \n\n                        When you select\n                        \n                         Cards\n                        \n                        in the\n                        \n                         Content\n                        \n                        menu, a list of all cards in your instance displays. You can filter the cards in this list, as well as make individual or bulk changes to cards, such as adding or removing user/group access or duplicating cards.\n                       \n\n                        The following screenshot shows the most important components of the\n                        \n                         Cards\n                        \n                        view:\n                       \n\n\n\n\n                        You can learn more about these components in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n                            Card listing\n                           \n\n\n\n                            The list of all of the cards that have been added to this Domo instance. If you click a row for a Card, a details panel opens. This panel shows a preview of the card, details such as owner and DataSet name, and a list of users with access. In this panel you can click the DataSet name to jump to the Details view for the DataSet, or you can select the name of a user to open a details panel for that user.\n                           \n\n                            When you select a card's title the\n                            \n                             Edit\n                            \n                            button becomes available.\n                           \n\n\n\n\n                           Select/Deselect\n                          \n\n                           Allow you to select or deselect all Cards in the listing. If any filters are applied, only the Cards that pass the filters are selected. Selecting Cards causes the\n                           \n                            Edit\n                           \n                           button to become available.\n                          \n\n\n\n\n                            Column filters\n                           \n\n\n\n                            Allow you to filter the Cards listing. You can apply filters by clicking the\n                            \n                            icon for a column and selecting the items you want to appear in the list. You can filter multiple columns at once. For example, if you wanted to show only document Cards owned by \"Alicia Steele,\" you would select\n                            \n                             Doc Card\n                            \n                            for the\n                            \n                             Type\n                            \n                            column and do a search for \"Alicia Steele\" in the\n                            \n                             Owner\n                            \n                            column.\n                           \n\n                            Filters you add appear highlighted in blue at the top of the window, next to the\n                            \n                             Select\n                            \n                            and\n                            \n                             Deselect\n                            \n                            options. You can quickly remove a filter by clicking the \"x\" next to it.\n                           \n\n                            Columns with filters applied are indicated using the\n                            \n                            icon. You can click this icon to edit the filters for that column.\n                           \n\n\n\n\n\n                            Edit button\n                           \n\n\n\n                            Allows you to select any of a number of options for working with Cards you have selected in the Card listing. All options are available for individual or multiple Cards. The available options are as follows:\n                           \n\n\n\n\n\n                                Option\n                               \n\n\n\n                                Description\n                               \n\n\n\n                                Link to More Info\n                               \n\n\n\n\n\n\n\n                                Change Card Owner\n                               \n\n\n\n                                Allows you to change the Card owner for all selected Cards.\n                               \n\n\n\n\n                                 Changing a Card Owner\n                                \n\n\n\n\n\n\n                                Add Users & Groups\n                               \n\n\n\n                                Allows you to grant access to all selected Cards to the users and groups you choose.\n                               \n\n\n\n\n                                 Controlling Access to Cards and Pages\n                                \n\n\n\n\n\n\n                                Remove Users & Groups\n                               \n\n\n\n                                Allows you to remove access to all selected Cards from the users and groups you choose.\n                               \n\n\n\n\n                                 Controlling Access to Cards and Pages\n                                \n\n\n\n\n\n\n                                Duplicate Cards\n                               \n\n\n\n                                Allows you to duplicate Cards (i.e. \"save as\") to the Pages you choose.\n                               \n\n\n\n\n                                 Duplicating Cards\n                                \n\n\n\n\n\n\n                                Add to Pages\n                               \n\n\n\n                                Allows you to add copies of the selected Cards to the Pages you choose.\n                               \n\n\n\n\n                                 Moving or Copying Cards to Other Pages\n                                \n\n\n\n\n\n\n                                Remove from Pages\n                               \n\n\n\n                                Allows you to remove the selected Cards from the Pages you choose.\n                               \n\n\n\n\n                                 Removing Cards from a Page\n                                \n\n\n\n\n\n\n                                Lock Cards\n                               \n\n\n\n                                Allows you to lock the selected Cards.\n                               \n\n\n\n\n                                 Locking or Unlocking Page Content\n                                \n\n\n\n\n\n\n                                Unlock Cards\n                               \n\n\n\n                                Allows you to unlock the selected Cards.\n                               \n\n\n\n\n                                 Locking or Unlocking Page Content\n                                \n\n\n\n\n\n\n                                Delete Cards\n                               \n\n\n\n                                Allows you to delete the selected Cards from Domo.\n                               \n\n\n\n\n                                 Deleting Cards from Domo\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n                        Dashboards\n                       \n\n                        When you select\n                        \n                         Pages\n                        \n                        in the sub-tab menu, a listing of all Pages in your instance appears. You can filter the Pages in this list, as well as make individual or bulk changes to Pages, such as adding or removing user/group access, moving Pages in the hierarchy, etc.\n                       \n\n                        The following screenshot shows the most important components of the\n                        \n                         Pages\n                        \n                        view:\n                       \n\n\n\n\n                        You can learn more about these components in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n                            Page listing\n                           \n\n\n\n                            The list of all of the Pages that have been added to this Domo instance. If you click a row for a Page, a details panel opens. This panel lists all Cards on the Page, along with all people and groups with access to the Page. In this panel you can click a user's name to open their Profile Page or a group name to open the information screen for this group in the Admin Settings.\n                           \n\n                            When you select a Page (by clicking its checkbox), the\n                            \n                             Edit\n                            \n                            button becomes available.\n                           \n\n\n\n\n                           Select/Deselect\n                          \n\n                           Allow you to select or deselect all Pages in the listing. If any filters are applied, only the Pages that pass the filters are selected. Selecting Pages causes the\n                           \n                            Edit\n                           \n                           button to become available.\n                          \n\n\n\n\n                            Column filters\n                           \n\n\n\n                            Allow you to filter the Pages listing. You can apply filters by clicking the\n                            \n                            icon for a column and selecting the items you want to appear in the list. You can filter multiple columns at once. For example, if you wanted to show Pages owned by \"Alicia Steele\" with more than 10 Cards, you would do a search for \"Alicia Steele\" in the\n                            \n                             Owner\n                            \n                            column and set the filter in the\n                            \n                             Cards\n                            \n                            column to return values greater than 10.\n                           \n\n                            Filters you add appear highlighted in blue at the top of the window, next to the\n                            \n                             Select\n                            \n                            and\n                            \n                             Deselect\n                            \n                            options. You can quickly remove a filter by clicking the \"x\" next to it.\n                           \n\n                            Columns with filters applied are indicated using the\n                            \n                            icon. You can click this icon to edit the filters for that column.\n                           \n\n\n\n\n                           Edit button\n                          \n\n\n                            Allows you to select any of a number of options for working with Pages you have selected in the Card listing. All options are available for individual or multiple Pages. The available options are as follows:\n                           \n\n\n\n\n                               Option\n                              \n\n                               Description\n                              \n\n                               Link to More Info\n                              \n\n\n\n\n\n                               Change Page Owner\n                              \n\n                               Allows you to change the owner for all selected Pages.\n                              \n\n\n                                Changing the Page owner\n                               \n\n\n\n\n                               Add Users & Groups\n                              \n\n                               Allows you to grant access to all selected Pages to the users and groups you choose.\n                              \n\n\n                                Controlling Access to Cards and Pages\n                               \n\n\n\n\n                               Remove Users & Groups\n                              \n\n                               Allows you to remove access to all selected Cards from the users and groups you choose.\n                              \n\n\n                                Controlling Access to Cards and Pages\n                               \n\n\n\n\n                               Move Page\n                              \n\n                               Allows you to move all selected Pages anywhere in the Page hierarchy. For example, you could move a subpage to the top level in the hierarchy or vice-versa. Various options are available for setting the permissions on moved Pages.\n                              \n\n\n                                Managing Pages\n                               \n\n\n\n\n                               Lock Page\n                              \n\n                               Allows you to lock the selected Pages.\n                              \n\n\n                                Locking or Unlocking Page Content\n                               \n\n\n\n\n                               Unlock Page\n                              \n\n                               Allows you to unlock the selected Pages.\n                              \n\n\n                                Locking or Unlocking Page Content\n                               \n\n\n\n\n                               Delete Page\n                              \n\n                               Allows you to delete the selected Pages from Domo. This option does\n                               \n                                not\n                               \n                               delete Cards from deleted Pages; they can still be accessed in the Admin Settings in\n                               \n                                Content > Cards\n                               \n                               .\n                              \n\n\n                                Deleting Pages or subPages\n                               \n\n\n\n\n\n\n\n\n\n\n\n                        Scheduled Reports\n                       \n\n                        When you select\n                        \n                         Scheduled Reports\n                        \n                        in the sub-tab menu, two panels appear on the right. In the left panel, you can choose a report to view information on, see the history of all sent reports (successful as well as unsuccessful), and enable/disable the report scheduler for your entire Domo.\n                       \n\n                        In\n                        \n                         Scheduled Reports\n                        \n\n                         > Reports\n                        \n                        , you can choose a specific report in your Domo and see schedule information and learn whether it is expired, disabled, etc. You can also edit the report data or its schedule, enable/disable it, or delete it.\n                       \n\n\n\n\n                        In\n                        \n                         Scheduled Reports > History\n                        \n                        , you can view the history of all reports in your Domo that have been sent.\n                       \n\n\n\n\n                        In\n                        \n                         Scheduled Reports > Settings\n                        \n                        , you can access the \"master switch\" to turn Scheduled Reports on or off for your entire company.\n                       \n\n\n\n\n                        For more information about all of the options available in this tab, see\n                        \n                         Scheduling Reports\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "000005148", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005148", "Archived Date": "", "Language": "English", "Primary Version": "Admin Settings: Content", "Article Total View Count": "709", "": "", "Article Created Date": "3/8/2023, 4:18 AM", "First Published Date": "3/28/2023, 1:37 AM"}, "title": "\n              Admin Settings: Content\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Admin Settings Overview\n              \n", "url": "/s/topic/0TO5w000000Zan4GAC"}]}