{"file_path": "../../raw_kb_v2\\article\\360043436513\\index.html", "content": {"title": "\n\n\n CSV Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nA character-separated values (CSV) file stores tabular data in plain text form. The Domo CSV Advanced connector allows you to access CSV files that you have uploaded to an SFTP server. You can also import files via HTTPS calls.\n\n*Note:**\n Due to security concerns, Domo no longer permits uploading data using FTP. If necessary, please update your server settings to support SFTP instead of FTP.\n\nYou connect to CSV files in the Data Center. This topic discusses the fields and menus that are specific to the CSV Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Use this connector to access CSV files from an SFTP server.\n  |\n|\n**Primary Metrics**\n |\n N/A\n  |\n|\n**Primary Company Roles**\n |\n Analysts\n  |\n|\n**Average Implementation Time**\n |\n 1 hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 4\n  |\n\nBest Practices\n----------------\n\nIf you are using SFTP, make sure your credentials are ready and verified via your SSH key. The accepted formats for the key are either DES or RSA. If you are using HTTPS, you only need to verify that your resource is protected.\n\n\n Prerequisites\n---------------\n\nIf you plan to access CSV files by connecting to an SFTP server, you must have a username and password to authenticate to that server. If you plan to access CSV files over HTTPS, credentials are required only if the resource is protected.\n\n\n You need the username and password associated with your CSV file. You also your SSH key and the passphrase for your ssh key.\n\n\n**Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys (in PEM format) generated by OpenSSL.**\n\n\n Connecting to CSV Files\n-------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n ,\n **Details**\n , and\n **Advanced**\n panes in the CSV Advanced Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\nIn this pane you may need to enter a username and password, depending on what protocol you are using to access CSV data and whether the data is protected. If you plan to access CSV files by connecting to an SFTP server, you must enter the credentials for that server here (username, password, and host name). If you plan to access files over HTTPS, you only need to enter credentials if the resource is protected. You must also whitelist the IP addresses from the following article on the server:\n\nWhitelisting IP Addresses for Connectors\n\n.\n\n\n In either case, once you click\n **Next**\n , this CSV account is saved and you can use the same account any time you go to create a new CSV Advanced DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n You may also have the option to import the CSV file from a URL. If this is the case, you need the URL and potentially a username and password, depending on whether the source requires them.\n\n##\n Details Pane\n\nIn this pane you choose a protocol (HTTP request or SFTP file transfer) then fill in the details for that protocol. This pane includes the following fields and menus:\n\n*Note:**\n Due to security concerns, Domo no longer permits uploading data using FTP. If necessary, please update your server settings to support SFTP instead of FTP.\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Protocol\n  |\n Select a protocol for accessing the CSV file.\n\n\n Use SFTP to access a CSV file located on an SFTP server.\n\n\n Use HTTP Request to access a CSV file using an HTTP GET request. The request is triggered by the use of a unique URL parameter defined by the service providing the CSV file.\n  |\n|\n URL\n  |\n Enter the URL for the CSV file.\n\nIf using the File Transfer protocol, enter the URL to the folder containing the CSV file. For example: s\n\nftp://hostname/home/test\n\n. You'll also have to include the port in the URL if the SFTP server is not configured to run on the standard port 22. The 1234 port specific URL would look like s\n\nftp://hostname:1234/home/test\n\n*Note:**\n Due to security concerns, Domo no longer permits uploading data using FTP. If necessary, please update your server settings to support SFTP instead of FTP.\n\nIf using the HTTP Request protocol, enter the full URL for the CSV file. You must provide the URL as well as the fully qualified path, including the filename. For example:\n\nhttp://www.ferc.gov/docs-filing/eqr/...v/contract.txt\n\nIf you are using the SFTP protocol, you can request a file for a specific date. You need to name your file using the format\n\nfile\\_[yyyyMMdd]\\_suffix.csv\n\n. You can also select the most recent file using the format\n\nfilenameprefix\\_[latest]\n\n.\n  |\n|\n File Location Method\n  |\n Select whether you want to select a specific file from the specified directory or search for a file name.\n  |\n|\n File Name\n  |\n Enter the name of the file to search for.\n  |\n|\n Directory File\n  |\n Select a file from the specified directory. You can select a CSV or GZ file to parse or a ZIP file to unzip.\n  |\n|\n File Type\n  |\n Select the file type for the file you want to access.\n  |\n|\n HTTP Headers\n  |\n Enter additional headers for your HTTP/HTTPS CSV URL, if necessary. Use the format\n\nheader Name1 = 'headerValue1'\n\nand\n\nheaderName2 = 'headerValue2'\n\n.\n  |\n|\n HTTP Body\n  |\n Enter additional request body for your HTTPS CSV URL, if necessary.\n  |\n|\n Convert Double type to Decimal\n  |\n Select this checkbox to convert Double to Decimal.\n  |\n\n\n###\n Advanced Pane\n\nIn this pane you select the delimiter for your CSV file.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Delimiter Character\n  |\n Select the delimiter character used to separate columns in your CSV file.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Verify that your credentials are correct.\n* If you cannot connect using SFTP, check your firewall settings.\n\nFAQ\n-----\n\n\n#####\n How frequently will my data update?\n\nData will update every hour.\n\n####\n Are there any API limits that I need to be aware of?\n\nNo.\n\n####\n Can I use the same CSV Advanced account for multiple datasets?\n\nYes.\n\n####\n What do I do if I cannot connect using SFTP?\n\nIf you cannot connect using SFTP, check your firewall settings.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436513\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003952\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCSV Advanced Connector\n\n", "article_total_view_count": "\n\n\n 5,458\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "csv_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}