{"file_path": "../../raw_kb_v2\\article\\1500002835162\\index.html", "content": {"title": "\n\n\n ElasticSearch Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nElasticsearch is the distributed search and analytics engine at the heart of the Elastic Stack. With this connector visualize your ElasticSearch data in Domo for additional insights. Use Domo's Elasticsearch connector to return search hits that match the query defined in the request. Get real-time dashboards of your data, available from any device. To learn more about the Elasticsearch API, visit their page (\n\nhttps://www.elastic.co/guide/en/elas...est-apis.htmlL\n\n).\n\n\n You connect to your Elasticsearch account in the Data Center. This topic discusses the fields and menus that are specific to the Elasticsearch connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Elasticsearch account and create a DataSet, you must have the following:\n\n Your Elasticsearch host name\n* The username and password associated with your Elasticsearch account\n\nConnecting to Your\n\nElasticsearch\n\nAccount\n------------------------------------------------\n\n\n This section enumerates the options in the\n\n\n**Credentials**\n\n\n and\n\n\n**Details**\n\n\n panes in the\n\n\n Elasticsearch\n\n\n Connector page.\n\nThe components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\n\n This pane contains fields for entering credentials to connect to your\n\n\n Elasticsearch\n\n\n account. The following table describes what is needed for each field\n\n:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Host\n  |\n Enter your Elasticsearch\n\n\n hostname.\n  |\n|\n Username\n  |\n Enter the username associated with your Elasticsearch\n\n\n account.\n  |\n|\n Password\n  |\n Enter the password associated with your Elasticsearch\n\n\n account.\n  |\n\n\n Once you have entered valid\n\n\n Elasticsearch\n\n\n credentials, you can use the same account any time you go to create a new\n\n\n Elasticsearch\n\n\n DataSet.\n\nYou can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the\n\nElasticsearch\n\nreport you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Aggregations\n  |\n Returns aggregations that match the query defined in the request.\n  |\n|\n Search\n  |\n Returns search hits that match the query defined in the request.\n  |\n|\n Search With Pagination\n  |\n Returns search hits that match the query defined in the request. Use this report to retrieve more than 10000 results.\n  |\n|\n Search With Pagination Using PIT\n  |\n Returns aggregations that match the query defined in the request. Use this report to retrieve more than 10000 results.\n  |\n\n|\n|\n Field\n  |\n Enter the field name to sort the data on. By default '\\_id' will be used if not provided. Provide a custom field in the 'Query' text box, if it is a custom field name.\n\n\n**Note:**\n If 'QUERY' doesn't contain the sort array support, the sort array will get added with the FIELD value.\n\n\n |\n|\n Query\n  |\n Query in the Lucene query string syntax.\n  |\n|\n Index\n  |\n Comma-separated list or wildcard expression of index names used to limit the request.\n  |\n|\n Use Advanced Sublist To Flatten options\n  |\n Select 'Yes' if you want to use the advanced Sublist To Flatten option. If you select 'Yes,' the primitive arrays will be expanded in a single cell.\n  |\n|\n Sublists To Flatten\n  |\n Enter the comma separated lists that you would like to flatten in your data.\n  |\n|\n Delimiter For Primitive Arrays\n  |\n Select the delimiting character to separate the primitive array values in a cell\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500002835162\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003242\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nElasticSearch Connector\n\n", "article_total_view_count": "\n\n\n 4,775\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "elasticsearch_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}