{"file_path": "../../raw_kb_v2\\article\\7579340458903\\index.html", "content": {"Title": "March 2022 Release Notes", "Article Body": "New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Workbench DomoStats Report\n                       \n\n                        With the Workbench DomoStats report, Admins will now be able to monitor job statuses, last run times, and which machines are running which jobs to ensure a healthy Workbench pipeline. You will also be able to see which Workbench jobs are powering which DataSets in Domo so you can contact the responsible job owners if there are any issues on a DataSet in Domo. Workbench owners will be able to see schedules and run times across their Workbench machine in order to set up and utilize their machine resources efficiently.\n                       \n\n                        For more information, see\n                        \n                         DomoStats Connector\n                        \n                        .\n                       \n\n                        Smart Text in Notebook Cards\n                       \n\n                        With Smart Text in Notebook Cards, you are able to improve management and executive team data literacy and confidence in Domo by being able to quickly understand the data they are using/reviewing. Items such as: which DataSets are used, when the DataSet was last updated, and what Filters are being applied to the Cards on your Dashboard.\n                       \n\n                        For more information, see\n                        \n                         Adding a Notebook Card\n                        \n                        .\n                       \n\n                        Smart Text in Card text\n                       \n\n                        With Smart Text in Card text, you are able to have the Card titles and descriptions update as you interact with a Dashboard. The titles and descriptions quickly update with text such as what filters and dates are being applied to the Cards on your Dashboard.\n                       \n\n                        For more information, see\n                        \n                         Using Smart Text\n                        \n                        .\n                       \n\n                        Filter Views in Dashboard Embed\n                       \n\n                        With Filter Views in Dashboard Embed, Publishers can now use Domo Everywhere to distribute Dashboards to other customer accounts with curated Filter Views. Thus allowing Subscribers to just consume the saved filters and get a head start on the most valuable insights right from the start.\n                       \n\n                        For more information, see\n                        \n                         Page Filters in Dashboard Embed\n                        \n                        .\n                       \n\n                        Page Export in Dashboard Embed\n                       \n\n                        With Page Export in Dashboard Embed, you can now export an entire embedded Dashboard either as a PowerPoint or PDF.\n                       \n\n                        For more information, see\n                        \n                         Exporting Embedded Content\n                        \n                        .\n                       \n\n                        DDX Bricks\n                       \n\n                        With DDX Bricks you can make apps in minutes using your Domo data with Javascript, HTML, and CSS. You can show your data and brand in stunning new ways. DDX Bricks are optimized for both web and mobile views. This is the easiest and fastest way to build and share data visualization apps.\n                       \n\n\n                         Easier because:\n                        \n\n\n\n                         It works on install.\n                        \n\n                         It includes sample code and data. If you like working with examples you will love DDX Bricks.\n                        \n\n                         You can modify what you want.\n                         \n\n\n                           No Code: Choose new data.\n                          \n\n                           Low Code: Change parameters.\n                          \n\n                           Code Example: Change working code to get your look.\n                          \n\n\n\n\n\n                         Faster because:\n                        \n\n\n\n                         Development with a built-in editor.\n                        \n\n                         An immediate run option.\n                        \n\n                         Instant publish on save.\n                        \n\n                         Leveraging any web visualization library.\n                        \n\n\n                        For more information, see\n                        \n                         DDX Bricks\n                        \n                        .\n                       \n\n                        Drag-and-Drop Apps\n                       \n\n                        Drag-and-Drop Apps bring the power of the Appstore to your Dashboard. You can now add DDX Bricks right from your Dashboard editor, so you no longer have to go back and forth from the Appstore to your Dashboard - you are able to stay in context with the rest of your Dashboard content while adding Cards from the Appstore.\n                       \n\n                        For more information, see\n                        \n                         Drag-and-Drop Apps\n                        \n                        .\n                       \n\n                        Preview Page Breaks in Dashboards\n                       \n\n                        With Page Breaks in Dashboards, you can now see when your content is getting too large to export. This enables you to adjust the content sizing on the fly, while you are creating your Dashboard or preparing it for export.\n                       \n\n                        For more information, see\n                        \n                         Exporting Dashboards to PDF or PowerPoint\n                        \n                        .\n                       \n\n                        Edit the Mobile Layout and Hide Cards\n                       \n\n                        With the new Edit the Mobile Layout, now you can hide, show, and rearrange the layout of your Cards to optimize the experience on your mobile device. This gives you the tools to set up your Dashboards with the most relevant information on mobile. The result is a mobile experience that is easier to use and guarantees the mobile users are always getting the most relevant Cards from a Dashboard.\n                       \n\n                        For more information, see\n                        \n                         Edit the Mobile Layout\n                        \n                        .\n                       \n\n                        Dropdown Selector Card\n                       \n\n                        With Dropdown Selector Cards, you can pick from a large list while requiring little space. This new chart type integrates seamlessly with Page Filters. These are ideal for use on mobile as they take up less space on the Dashboard.\n                       \n\n                        For more information, see\n                        \n                         Dropdown Selector Card\n                        \n                        .\n                       \n\n                        Radial Progress Gauge\n                       \n\n                        Radial Progress Gauges are a new circular radial gauge. They have no x-axis and display data in the y-axis as a percentage of a Target Value which is, in general, the maximum value in that axis. Gauge charts provide a great visualization for Dashboards with limited space available.\n                       \n\n                        For more information, see\n                        \n                         Radial Progress Gauge\n                        \n                        .\n                       \n\n                        Multi Radial Progress Gauge\n                       \n\n                        Multi Radial Progress Gauges are a new circular radial gauge. They have no x-axis and display data in the y-axis as a percentage of a Target Value which is, in general, the maximum value in that axis. Gauge charts provide a great visualization for Dashboards with limited space available.\n                       \n\n                        For more information, see\n                        \n                         Multi Radial Progress Gauge\n                        \n                        .\n                       \n\n                        Waffle Gauge\n                       \n\n                        The Waffle Gauge provides a new, simple, and intuitive way to visualize data. It includes many customizable settings to tell a more intuitive story.\n                       \n\n                        For more information, see\n                        \n                         Waffle Gauge\n                        \n                        .\n                       \n\n                        Beta features\n                       \n\n                        If you are interested in joining the Beta for a specific feature, please reach out to your Domo Customer Success Manager, Technical Consultant, or Account Executive.\n                       \n\n                        If you do not have contact information for your CSM, TC, or AE, contact Technical Support by email at\n                        \n                         support@domo.com\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n\n                            Depending on the feature, you may be required to complete training before you can use the feature.\n                           \n\n\n\n\n\n                        Community-Built Connectors (Beta)\n                       \n\n                        Community Built Connectors enable a Community of Connector builders to build, update, and support Connectors in Domo using the Connector IDE. This opens a resource-rich community for everyone to have more options for connecting their data.\n                       \n\n                        For more information, see\n                        \n                         Community-Built Connectors (Beta)\n                        \n                        .\n                       \n\n                        Multi-Cloud Data Fabric (Beta)\n                       \n\n                        The Multi-Cloud Data Fabric provides a native integration with cross-cloud systems to unlock data products at the speed your business needs them.\n                       \n\n\n                         Why Multi-Cloud?\n                        \n\n\n\n                         IT alone cannot realize the full potential of data in Snowflake. A broad and inclusive approach with all LOBs is required, and not all valuable data is in Snowflake and/or controlled by IT yet.\n                        \n\n                         Increased stress on, and demands from, data teams. Business users demand access to data products in a timely manner, increasing pressure to deliver.​\n                        \n\n                         Rigidity and friction in data processes. Rigid processes and tooling prevent the building of databases in a speedy and flexible manner. Taking too much time and too much effort.\n                        \n\n\n                        Multi-Cloud can help with these needs and more.\n                       \n\n                        For more information, see\n                        \n                         Multi-Cloud Data Fabric\n                        \n                        .\n                       \n\n                        Domo for Office Add-Ins (Beta)\n                       \n\n                        Domo for Office Add-Ins allow for a direct connection to Domo within Word, Excel, PowerPoint, and Outlook so that you can import live and always up-to-date Domo visualizations and Datasets directly into Office documents.This enables you to utilize the Domo platform right in the Microsoft Office Suite, enables greater adoption rates, and opens a world of possibility for success with Domo.\n                       \n\n                        But we’ve done much, much more than just provide the ability to quickly insert a Card into an email, we mean it when we say that you can even manage your Domo DataSets and Cards, as well as create new Projects and Tasks, send Buzz messages, and even import data into Domo—all from within the Microsoft Office Suite. These add-ins are supported on Windows, Mac, and Office Online platforms.\n                       \n\n                        For more information, see\n                        \n                         Domo for Office Add-Ins (Beta)\n                        \n                        .\n                       \n\n                        New Grants\n                       \n\n                        Grants that have been added for use in custom roles in this release include the following:\n                       \n\n                        Receive Domo System Messages\n                       \n\n                        Receive Domo system messages about maintenance and feature updates. Ensure at least one Admin receives these messages.\n                       \n\n                        Getting help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by selecting the Help Center in the top navigation bar.\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://domo.com/university/\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n                         More > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "7579340458903", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004919", "Archived Date": "", "Language": "English", "Primary Version": "March 2022 Release Notes", "Article Total View Count": "2,512", "": "", "Article Created Date": "11/1/2022, 7:01 PM", "First Published Date": "11/1/2022, 7:19 PM"}, "title": "\n              March 2022 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}