{"file_path": "../../raw_kb_v2\\article\\000005073\\index.html", "content": {"Title": "Flex Map v2 Implementation Guide", "Article Body": "Intro\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           This guide helps you implement the Flex Map v2 app. This guide does not help you implement the\n                           \n                            Flex Map v1\n                           \n                           app. To implement the Flex Map v1 app, see the\n                           \n                            Flex Map v1 Implementation Guide\n                           \n                           .\n                          \n\n\n\n\n\n\n                        Flex Map v2 is a premium app you can use to map locations and territories and get geographical insights into your data. You can also discover relationships between locations and important locations.\n                        \n\n                        This guide describes how to implement the Flex Map v2 app in the following topics:\n                       \n\n\n\n                          Prerequisites\n                         \n\n\n\n                          Configuring required DataSets\n                         \n\n\n\n                          Configuring Domo user groups\n                         \n\n\n\n                          Connecting your data to the app\n                         \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        Before you can use Flex Map v2, you need to create the following groups in your Domo instance:\n                       \n\n\n                         _FlexMap_Admins\n                        \n\n                         _FlexMap_ViewOnly\n                        \n\n\n\n\n                        Configuring Required DataSets\n                       \n\n                        Before you can configure the app, you need to create two DataSets to power the four main parts of its functionality:\n                       \n\n\n                         Pin Layers\n                        \n\n                         Heatmaps\n                        \n\n                         Map Layers\n                        \n\n                         Uploading custom KML or GEOJSON layer files to display\n                        \n\n                       The details for the two DataSets are as follows:\n                       \n\n                         Locations Data — This is the main locations DataSet. Rows of locations data are mapped by latitude and longitude.\n                        \n\n                         Heatmap Data — This is the main Heatmap DataSet. Rows of data by region display as numerical or categorical heat maps.\n                        \n\n                       Prepare each DataSet as detailed below.\n                       \n                        Locations Data\n                       \n\n                        The app requires the following fields for the Locations DataSet.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           The required fields are case sensitive, so make sure to add these columns to your data with the names as shown.\n                          \n\n\n\n\n\n\n\n\n                            Column Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Location Id\n                           \n\n\n\n                            A unique number/letter combination for a location.\n                           \n\n\n\n\n\n                            Latitude\n                           \n\n\n\n                            The latitude of a location.\n                           \n\n\n\n\n\n                            Longitude\n                           \n\n\n\n                            The longitude of a location.\n                           \n\n\n\n\n\n                            Location Name\n                           \n\n\n\n                            The name of the location.\n                            \n                            This value should be a 1:1 relation with the Location Id for the location. You can have multiple rows for a single location and the app groups the data for the location together by the ID and name.\n                           \n\n\n\n\n\n                            Address\n                           \n\n\n\n                            The address of a location.\n                           \n\n\n\n\n\n                            SearchCache\n                           \n\n\n\n                            A comma separated list of terms you want the app to use to find the location when searching using the main search bar of the app.\n                           \n\n\n\n\n\n\n                             Additional Columns\n                            \n\n\n\n\n                            Any additional columns for data and metrics for the locations you want to display with the mapped pins.\n                           \n\n                            Possible values include: Region, other address data, other metrics\n                           \n\n\n\n\n\n                        Heatmap Data\n                       \n\n                        Use this data to map metrics to regions for the Heatmaps in the app. The most important columns from this data are RegionCode and RegionType.\n                       \n\n                        The app uses statistical regions to create the Heatmaps, so you need to map your metric data to the region types that the app needs.\n                       \n\n                        For example, if you are in the USA and you have metric data based on zip code, you need to map your zip codes to CBSA codes in order for the map to use your data. You can easily find data to map your data to these codes online.\n                       \n\n                        The app supports the following region codes/types: CBSA for the USA, CMA for Canada, SA3 for Australia, and NUTS 2 for Europe. Reach out to your Account Executive (AE) or Customer Success Manager (CSM) if you need regions beyond what is available.\n                       \n\n                        The app requires the following fields for the Heatmap DataSet.\n                        \n                        The three required fields are case sensitive, so add them to your data with the names as shown:\n                       \n\n\n\n\n\n                            Column Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            RegionCode\n                           \n\n\n\n                            The code for the area that corresponds to the value in the RegionType column.\n                           \n\n                            Example: RegionCode: 30030; RegionType: CBSA\n                           \n\n\n\n\n\n                            RegionName\n                           \n\n\n\n                            (Optional) The name of the region, if applicable.\n                           \n\n\n\n\n\n                            RegionType\n                           \n\n\n\n                            The value corresponds to the value in the RegionCode.\n                           \n\n                            Possible values include: CBSA, CMA, NUTS 2, and SA3.\n                           \n\n\n\n\n\n\n                             Your Metric Columns\n                            \n\n\n\n\n                            Any columns with the metrics that you want to use to build your heat maps. You can add as many as you want, but at least one is required for heat map functionality.\n                           \n\n\n\n\n\n\n                             Additional Metadata Columns\n                            \n\n\n\n\n                            Optional columns with metadata about the regions you want to map that use Domo Page filters to filter through the data.\n                           \n\n\n\n\n\n\n\n                        Configuring Domo User Groups\n                       \n\n                        Flex Map v2 supports three different user levels—Admin, Standard, and View-only.\n                        \n                        To have admin or view-only privileges within the app, users must be added to a Domo Group. Standard users aren't added to a group and receive the standard app privileges and functionality. The following list describes the differences between the three user levels:\n                       \n\n\n                         Admin users can share items they create in the app with members of Domo Groups, and configure a default map and a default center.\n                        \n\n                         Standard users can create their own items and see things that admin users share with them, but can't share items or set defaults.\n                        \n\n                         View-only users can't create anything in the app. They can only view items that admin users share with them.\n                        \n\n\n                        To add admin and view-only users, a Domo admin must navigate to the Domo admin portal and create two Domo Groups: _FlexMap_Admins and _FlexMap_ViewOnly.\n                       \n\n                        Add a user to either group to give them admin or view-only privileges, or do not add the user to either group to give them standard user privileges.\n                       \n\n\n\n                        Connecting Your Data to the App\n                       \n\n                        After you configure the required DataSets and user groups, you can deploy the app and connect your data.\n                       \n\n\n                         If you have access to the app card inside the\n                         \n                          Asset Library\n                         \n                         , deploy the app to a dashboard in Domo and follow the numbered steps below.\n                        \n\n                         If the app card has been deployed for you with sample data, navigate to the app, then follow the numbered steps below.\n                        \n\n                       Follow these steps to connect your data to the app:\n                       \n\n                         Hover over the top right corner of the app until\n                         \n\n                          Card options\n                         \n                         displays floating over the other map controls.\n                         \n\n\n\n\n\n\n                         Select\n                         \n\n                          Card options\n                         \n                         >\n                         \n                          Edit Card\n                         \n                         . The card editor opens.\n                        \n\n                         (Optional) Check the box for\n                         \n                          Fullpage\n                         \n                         if you want to see the full page of the app as you edit.\n                         \n\n\n\n\n                         At the bottom of the card editor screen, locate the data\n                         \n                          Mapping\n                         \n                         area. (If it is not visible, select\n                         \n\n                          Expand\n                         \n                         to view it.) There are two tabs in this area:\n                         \n\n                          DataSets\n                         \n                         and\n                         \n\n                          Collections\n                         \n                         . You can select the hamburger menu to view the mapping navigation drawer.\n                         \n\n\n\n\n\n\n\n                         In the\n                         \n\n                          DataSets\n                         \n                         tab (default), select the DataSet list at the top of the tab and choose\n                         \n                          locations\n                         \n                         .\n                         \n\n\n\n\n                         Under\n                         \n                          Select DataSet\n                         \n                         , click the button to open the\n                         \n                          Select and DataSet\n                         \n                         modal.\n                        \n\n                         In the modal, search for and select the prepared Locations DataSet.\n                         \n\n\n\n\n                         When you find and select your DataSet, select\n                         \n                          Choose DataSet\n                         \n                         to close the modal.\n                        \n\n                         Repeat steps 5–8 for the\n                         \n                          heatmap\n                         \n                         DataSet.\n                        \n\n                         Go to the\n                         \n\n                          Collections\n                         \n                         tab and toggle the switch to\n                         \n                          Automatically create un-configured collections with app defaults\n                         \n                         .\n                         \n\n\n\n\n                         Select\n                         \n                          Save and Finish\n                         \n                         at the top of the card editor to save your configuration.\n                        \n\n\n                        After configuring your Flex Map v2 app, you can learn about navigating it in the\n                        \n                         Flex Map v2 User Guide\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "000005073", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005073", "Archived Date": "", "Language": "English", "Primary Version": "Flex Map v2 Implementation Guide", "Article Total View Count": "2,522", "": "", "Article Created Date": "11/22/2022, 3:59 AM", "First Published Date": "12/5/2022, 12:59 PM"}, "title": "\n              Flex Map v2 Implementation Guide\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}