{"file_path": "../../raw_kb_v2\\article\\360043440793\\index.html", "content": {"Title": "April 2019 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Domo Stories enhancements\n                       \n\n                        Domo Stories Dashboards are now enhanced with Drill Paths, summary metrics, and background colors for even more control over the presentation of your data.\n                       \n\n                        Drill in Place\n                       \n\n                        Drill Paths are now available from Pages, so you don't have to leave your Dashboard to drill into a Card. Deep-dive on a single Card while maintaining the context of the other Cards on a Page, or apply Dashboard filters to change the view as you drill.\n                       \n\n                        To enable Drill Paths on Dashboards, select\n                        \n                         Edit Content > Change interaction\n                        \n                        for the Card, then choose the\n                        \n                         Drill in place\n                        \n                        radio button. You must be in\n                        \n                         Edit Dashboard\n                        \n                        mode for these options to be available.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n                        Dashboard background colors\n                       \n\n                        Customize your Dashboards with background colors to match any branding or theme. Choose colors from a palette or use hexadecimal values to personalize.\n                        \n\n\n\n\n\n\n\n\n                        For more information, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n                        Summary metric view\n                       \n\n                        The new summary metric view allows you to toggle charts on and off using the\n                        \n                         Display settings\n                        \n                        option in Domo Stories. This creates a formatted Summary Number so you can leverage existing content in the context that works best for your Domo Story.\n                       \n\n                        For more information, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n                        Improved DataSet picker\n                       \n\n                        Use the new DataSet picker to search for DataSets with any filter criteria, like tags, certification state, row count, Card count, last execution time, execution status, and more. You can also sort your results for easier discovery.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Powering a KPI Card with Data\n                        \n                        .\n                       \n\n                        Enhanced Dashboard Filters\n                       \n\n                        Enhanced Dashboard Filters bring more clarity and context to Page filtering. Instead of choosing a DataSet to filter on, you can choose your filter columns from a list of all available columns used in Cards on the Page. Summary text on each Page appears whenever filters are applied, so you quickly see which filters are applied. Plus, Beast Mode calculations shared on a DataSet will now appear in the Dashboard Filter list.\n                        \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Applying Page-Level Filters\n                        \n                        .\n                       \n\n                        Enhanced Analyzer Card Filters\n                       \n\n                        Configure filters for Cards faster than ever before with enhanced Analyzer filters. With the new filtering improvements, you can:\n                       \n\n\n\n                          Filter on values containing specific words without having to create Beast Mode LIKE functions.\n                         \n\n\n\n                          Change the date type for a column without having to open a DataFlow.\n                         \n\n\n\n                          Choose specific dates and numbers to filter on rather than indicating a range.\n                          \n\n\n\n\n\n\n\n\n                        For more information, see\n                        \n                         Adding Filters to Your Chart\n                        \n                        .\n                       \n\n                        New and updated Connectors\n                       \n\n                        Connect to all your data with our collection of over 1,000 connectors. We’ve added several new connectors, including new bi-directional connectors, and we’ve made updates to some existing ones.\n                       \n\n                        New Connectors\n                       \n\n\n\n                          Particle\n                         \n\n\n\n                          Instagram Business\n                         \n\n\n\n                          Salesforce with upsert\n                         \n\n\n\n                          USGS Wildfire\n                         \n\n\n\n                          Snapchat Ads\n                         \n\n\n\n                          SEVENROOMS\n                         \n\n\n\n                        Documentation coming soon!\n                       \n\n                        Writeback (Bi-directional) Connectors\n                       \n\n                        New Writeback Connectors allow you to push Domo DataSets to third-party applications instead of pulling data from those applications into Domo. Available applications include Dropbox, Google Cloud Storage, Amazon S3, and many more. To have Writeback Connectors implemented for your Domo instance, please reach out to your account representative.\n                       \n\n                        For a full list of available Writeback Connectors and comprehensive documentation for each, please visit\n                        \n                         Writeback Connectors\n                        \n                        .\n                       \n\n                        Updated Connectors\n                       \n\n\n\n\n                           CallRail\n                          \n\n\n\n\n\n                           Anaplan\n                          \n\n\n\n\n\n                           LinkedIn\n                          \n\n\n\n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking by clicking\n                        \n                        in the top navigation bar .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n                          \n                           /support\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043440793", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004920", "Archived Date": "", "Language": "English", "Primary Version": "April 2019 Release Notes", "Article Total View Count": "4,741", "": "", "Article Created Date": "11/1/2022, 7:01 PM", "First Published Date": "11/1/2022, 7:19 PM"}, "title": "\n              April 2019 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}