{"file_path": "../../raw_kb_v2\\article\\360042935214\\index.html", "content": {"Title": "March 2018 Release Notes", "Article Body": "New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Business in a Box\n                       \n\n                        Quickly bring the power of Domo to your whole company with \",\" pre-installed dashboards for every department. These dashboards are based on Domo’s research of best practices and are organized by department and key topics for each department. You can quickly navigate to dashboards for any department in your company to see metrics for that department.\n                        \n\n\n\n\n\n\n                        Each pre-installed dashboard contains cards powered by sample data to give you a quick understanding of how the cards provide answers for these key topics.\n                        \n\n\n\n\n\n\n                        You can then make these cards your own by powering them up with your own live data, as explained in\n                        \n                         Powering Up Business in a Box Dashboards\n                        \n                        .\n                       \n\n                        In addition to giving you the ability to power up pre-installed best practice dashboards, also allows you to link existing Domo dashboards to your department tabs as well as install new dashboards from the Appstore. When you do this, the new dashboard appears in the specified department tab, allowing quick access from the tab. In the following example, the \"Investor Relations\" dashboard was added to the \"Marketing\" tab from the Appstore:\n                       \n\n\n\n\n                        Welcome to . Bringing the power of Domo to your whole company has never been easier.\n                       \n\n                        For more information, see\n                        \n                         Understanding Business in a Box\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n\n                          > Help Center\n                         \n\n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to \\support.\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042935214", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004433", "Archived Date": "", "Language": "English", "Primary Version": "March 2018 Release Notes", "Article Total View Count": "4,660", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              March 2018 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}