{"file_path": "../../raw_kb_v2\\article\\360043440713\\index.html", "content": {"Title": "October 2017 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Domo Everywhere: Public Embed\n                       \n\n                        With the new Domo Everywhere: Public Embed feature, Domo card creators can publish their visualizations on public websites and social platforms. This opens the door for many companies who want to scale their data on other websites for others to self-serve themselves by answering business questions and getting access to data they never had before. You can also show off your data insights on blogs and social sites. Who doesn’t love interesting and beautiful content? With Domo Everywhere: Public Embed, data will never look so cool to so many people, whether on their mobile device or on the web.\n                       \n\n\n\n\n                        If for security reasons you do not\n                        \n\n                        want this functionality available to your employees, you can turn it off by going into\n                        \n                         Admin Settings > Company Settings > Company Overview\n                        \n                        then unchecking the box for \"Publicly embed cards.\"\n                       \n\n\n\n\n                        For paying customers, there is a 30-day trial when using this feature.\n                       \n\n                        Also be aware of the following when using this feature:\n                       \n\n\n\n                          Titles, drilldown, summary number, and the chart picker are all available when embedding cards publicly; however, filters are not yet available.\n                         \n\n\n\n                          For security reasons, the end-of-card table view is not available with this feature.\n                         \n\n\n\n                          Currently, KPI cards and custom apps can be publicly embedded. Other types of cards (notebook, document, etc.) also cannot be publicly embedded.\n                         \n\n\n\n                        For more information, see\n                        \n                         Sharing Cards Outside of Domo\n                        \n                        .\n                       \n\n                        Domo Everywhere Screen in Admin Settings\n                       \n\n                        In the Admin Settings, as an Admin-level user you can also keep track of all cards in your instance that have been publicly embedded. You do this in the new\n                        \n                         Domo Everywhere\n                        \n                        screen. In this screen you can view all of the following:\n                       \n\n\n\n                          The names of all publicly embedded cards\n                         \n\n\n\n                          The card owners\n                         \n\n\n\n                          The users who embedded the cards\n                         \n\n\n\n                          The embed links\n                         \n\n\n\n                          The link access, either public or disabled\n                         \n\n\n\n                          The number of public views\n                         \n\n\n\n                          The creation date of the embed links\n                         \n\n\n\n                        This screen also includes an options menu from which you can update the link access for one or more links as well as change card owners.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Admin Settings Layout\n                        \n                        .\n                       \n\n                        User-Level Languages\n                       \n\n                        Domo has just released a User Language setting that enables users to use Domo in their preferred language. This brings yet another level of personalization to the already highly-customizable platform.\n                        \n\n                        With the addition of the User Language setting, new and existing users can easily work within Domo in the language that they feel the most comfortable. With this feature, managers and team leaders can improve their teams' overall operational efficiency and get even more value out of using Domo.\n                        \n\n                        Domo is launching the User Language feature with full support for five written languages: English, French, German, Japanese and Simplified Chinese. The Domo platform is prepared to scale to any number of languages to support Domo's steady international expansion.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Configuring Languages in Domo\n                        \n                        .\n                       \n\n                        Connectors Details Pages in Appstore\n                       \n\n                        Each connector now includes an Appstore details page that shows you the version number, release notes, details on what is needed to authenticate, a rating on how difficult it is to configure, a list of the reports with a description of what each one contains, common questions with answers, and any related apps, Quickstarts, or other connectors. There is even a place for you to input reviews of a connector and share information about your experience with others. This interface gives you the ability to self-serve connectors like never before and start feeling good about your data in Domo from the moment you connect.\n                        \n\n                        Using this new feature is as easy as using the Appstore. Log in to Domo, open the Appstore and search for a connector. Once you find the one you want, as soon as you click on the results in your search you will see all the new details for the connector.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Appstore Layout - Connectors Tab\n                        \n                        .\n                       \n\n                        Alert Sharing with Social Users\n                       \n\n                        Sharing alerts helps you create business alignment by providing a common understanding on critical data conditions. With no added cost to the business, you can now share any alert with team members who don't yet have a license in Domo to get everyone on the same page.\n                       \n\n                        By adding someone to an alert, Domo will now automatically create a free social user license and notify that person whenever the alert is triggered.\n                       \n\n\n\n\n                        When an alert is triggered, you need enough context to make decisions.  A new Alert view for free social users helps everyone get the information needed to take action.\n                       \n\n\n\n\n                        Smart Alerts\n                       \n\n                        With smart alerts, you can now be notified when outliers appear in your data, without having to constantly change your alert criteria. These alerts can provide a greater understanding of the possible risks in your business.\n                       \n\n                        All of the following statistical alerts are now available:\n                       \n\n\n\n                          Sum\n                         \n\n\n\n                          Average\n                         \n\n\n\n                          Minimum\n                         \n\n\n\n                          Maximum\n                         \n\n\n\n                          Standard deviation\n                         \n\n\n\n                          Variance\n                         \n\n\n\n                          Kurtosis\n                         \n\n\n\n                          Skewness\n                         \n\n\n\n                        You can apply any of these options to any category or series item on the card and then specify a condition and value as usual. For example, if you wanted an alert to trigger whenever the variance of the \"West Region\" category increased by 5%, you would select\n                        \n                         Variance of\n                        \n\n                         > West Region\n                        \n                        in the\n                        \n                         Metric\n                        \n                        menu and\n                        \n                         Increases by (+%)\n                        \n                        in the\n                        \n                         Meets this condition\n                        \n                        menu, then enter\n                        \n                         5\n                        \n                        in the\n                        \n                         For this value\n                        \n                        menu.\n                       \n\n\n\n\n                        For more information about creating alerts, see\n                        \n                         Creating a Custom Alert for a KPI Card\n                        \n                        .\n                       \n\n                        File Upload Connector\n                       \n\n                        Use the File Upload connector to pull both Excel and CSV spreadsheet data into Domo and begin making decisions faster. This connector combines all of the functionality of our existing Excel and CSV connectors into a single simple-to-use interface.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         File Upload Connector\n                        \n                        .\n                       \n\n                        Help Results in Search\n                       \n\n                        With the new Global Search Help results feature, you can quickly find relevant help articles in one central location. Simply enter a keyword for a feature or topic you want to know more about, and if any Knowledge Base articles have been written on that topic, they will pop up in your results, under the \"Help Center\" category. From there, all you have to do is click on the desired result, and the article will open directly in Knowledge Base.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Searching in Domo\n                        \n                        .\n                       \n\n                        Send Emails to Buzz\n                       \n\n                        With the new Send Email to Buzz capability, you can now easily move slow-moving, long email threads to Buzz and take advantage of the clear context visibility and speed to collaborate that Buzz provides. You don't have to wait for responses in a slow-moving email chain anymore. Now you can forward any email thread to Buzz and have all the collaborators, context, and attachments be used to kickstart a real time conversation. They simply obtain a unique email address for themselves from Buzz and use it as they Reply To or Forward any email thread from their inbox.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Importing an Email Thread into Buzz\n                        \n                        .\n                       \n\n                        Improved Appstore Power-Up Experience\n                       \n\n                        The deploy process for apps in the Appstore has been updated to provide a quicker and more pleasing experience. New improvements include the following:\n                       \n\n\n\n                          New options available after you set up an app with sample data:\n                          \n                           Assign to Data Specialist\n                          \n                          and\n                          \n                           Do It Yourself\n                          \n                          . If you choose\n                          \n                           Assign to Data Specialist\n                          \n                          , you can select a user in your company's Domo and send them an email to inform them about the new assignment.\n                          \n\n\n\n\n\n\n                          Progress gauges for the deployment. Two new graphics show you how close you are to getting your data connected.\n                          \n\n\n\n\n\n\n                          Simplified process for powering up Card Builder apps. One pane lists all of the columns in your selected DataSet and another shows the columns necessary to power the app. You simply drag columns from the DataSet pane onto the matching columns in the app pane. That's all there is to it. If data types do not match between columns, those columns cannot be matched.\n                          \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Deploying Apps from the Appstore\n                        \n                        .\n                       \n\n                        New Self-Service Connectors\n                       \n\n\n\n                          This month we have polished and released another 103 connectors that are now available to all customers in their Domo account. These connectors are self-service, so you no longer need to contact support to get help powering them up. A partial list of these connectors is as follows:\n                         \n\n\n\n\n\n                          Dr. Chrono\n                         \n\n\n\n                          Tout\n                         \n\n\n\n                          Simply Measured\n                         \n\n\n\n                          Sprinklr\n                         \n\n\n\n                          Reddit\n                         \n\n\n\n                          Huffington Post Pollster\n                         \n\n\n\n                          Jive\n                         \n\n\n\n                          Box Governance\n                         \n\n\n\n                          Informix SSH\n                         \n\n\n\n                          Github\n                         \n\n\n\n                          Hipchat\n                         \n\n\n\n                          Cybase SSH\n                         \n\n\n\n                          Oracle SSH\n                         \n\n\n\n                          Mist\n                         \n\n\n\n                          Openfire\n                         \n\n\n\n                          Changepoint\n                         \n\n\n\n                          10k'\n                         \n\n\n\n\n\n                            Sugar CRM OAuth\n                           \n\n\n\n\n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal, by sending a Buzz message to\n                          \n                           \\support\n                          \n                          , or by emailing\n                          \n                           support@domo.com\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043440713", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004438", "Archived Date": "", "Language": "English", "Primary Version": "October 2017 Release Notes", "Article Total View Count": "2,395", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              October 2017 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}