{"file_path": "../../raw_kb_v2\\article\\000005176\\index.html", "content": {"title": "\n\n\n BigQuery Workload Identity Federation Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nQuerying massive datasets can be time consuming and expensive without the right hardware and infrastructure. Google Big Query solves this problem by enabling super-fast, SQL-like queries against append-only tables, using the processing power of Google's infrastructure. Data first needed to be loaded into BigQuery from where it could be effectively queried by data vendors.\n\n\n Workload Identity Federation allows for more secure connection as the input only contains external credentials metadata without any sensitive information. The external credential metadata can be used on external environment to generate temporary/short-live token for required operations. For more details, refer to\n\n\n Workload Identity Federation\n\n\n .\n\n\n This topic discusses the fields and menus that are specific to the BigQuery Workload Identity Federation Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nPrerequisites\n---------------\n\nTo configure this connector, you will need the following:\n\n **WORKLOAD IDENTITY FEDERATION CLIENT LIBRARY CONFIG JSON KEY**\n as a JSON Configuration file.\n* A Project ID for a GCP project.\n\n\n Follow the steps below to obtain the credentials:\n 1. Create a project in the Google Developers Console if you do not have an existing project in GCP.\n2. Enable the Big Query APIs in your GCP instance.\n3. Create a Workload Identity Pool and Provider.\n4. Create a service account and associate it with the pool or with an existing service account with the pool.\n5. Download the JSON configuration file to use with the connector.\n\nThe following steps explain in detail how to create your project and obtain the needed credentials.\n\n##\n Step 1: Creating a Project in the Google Developers Console\n\n\n**Note:**\n If you already have a project you’d like to use, you can skip this step.\n\nTo create a project in the Google Developers Console, do the following:\n\n. Go to\n\nhttps://console.developers.google.com\n\n.\n2. Click the dropdown arrow next to\n **My Project**\n .\n3. Click\n **New Project**\n and provide a name for the new project and the Parent organization or folder for the new project.\n4. Click\n **Create**\n .\n\n\n###\n Step 2: Enabling the BigQuery API\n\nTo enable the BigQuery API for your project, do the following:\n\n. Click the burger menu and select the\n **API & Services**\n menu.\n2. Select\n **Library**\n and then search for the BigQuery API.\n3. Click the\n **BigQuery API**\n**Enable**\n\n\n###\n Step 3: Creating a Workload Identity Pool and Provider\n\n\n Follow the steps given below to create a Workload Identity Pool and Provider:\n 1. Click the burger menu in the console and select\n **IAM & Admin**\n .\n2. Select the\n **Workload Identity Federation**\n option.\n3. Click\n **create pool**\n .\n4. Enter a name for the pool in Step-1 and ensure that the\n **enable pool**\n is selected.\n5. In step 2, you will be prompted to select a provider. Select\n **AWS**\n .\n6. Under the\n **provider details**\n tab, enter the name of the Provider and ID, for example,\n **Domo AWS**\n .\n7. You will need to provide Domo’s AWS account id in the\n **AWS Account ID box**\n .\n\n\n Based on where your Domo instance is located, use one of the account ids listed below:\n\n\n**US: 339405024189\n\n\n AU: 010251424122\n\n\n EMEA (IE): 687132894031\n\n\n JP: 622384692065\n\n\n CA: 710710207408**\n8. Contact Domo Support if you are unsure which id to use.\n9. You can optionally configure additional provider attributes in Step-3.\n\n\n###\n Step 4: Grant a Service Account access to the Workload Pool\n\n\n1. On the burger menu, navigate to\n **IAM**\n and select\n **Workload identity federation**\n list and then select the recently created pool.\n2. Select\n **Grant Access**\n located at the top of the window.\n3. On the right-side pane, you will be prompted to select which service account you want to give access to.\n4. Select the appropriate service account from the\n **Select Service Account**\n dropdown.\n5. Click\n **Save**\n .\n6. Under\n **Configure your application**\n , select the provider you created with Domo’s AWS account id.\n7. Click the\n **Download Config**\n button to download the JSON configuration file.\n\n\n This file will be used to power up the connector.\n\nConfiguring the Connection\n----------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the BigQuery Workload Identity Federation Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Domo developer account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n WORKLOAD IDENTITY FEDERATION CLIENT LIBRARY CONFIG JSON KEY\n  |\n Configuration of external credentials JSON file containing external authentication metadata. This file is obtained from Step-4 in the instructions above.\n  |\n|\n Project ID\n  |\n Project id of the project in GCP that has access to BigQuery and the workload pool.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to set up a new Domo-BigQuery Workload Identity Federation connection. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Run the following reports based on the requirements:\n\n\n|  |  |\n| --- | --- |\n|\n Query\n  |\n Runs a BigQuery SQL query and returns results if it is successful.\n  |\n|\n Table Data\n  |\n Retrieves table data.\n  |\n|\n Table Information\n  |\n Returns the specified table resource by table ID. This method does not return the data in the table, it only returns the table resource, which describes the structure of this table.\n  |\n\n|\n|\n SQL Dialect\n  |\n Select SQL Dialect that you want to use. Defaults to Standard SQL.\n  |\n|\n Query\n  |\n Enter the query text.\n  |\n|\n Query Parameters\n  |\n Enter the query parameter value, it is the initial value for query parameter. The last run date is optional by default it is '02/01/1700' if is not provided. For example: !{lastvalue:\\_id}!=1,!{lastrundate:start\\_date}!=02/01/1944.\n  |\n|\n Allow Large Results\n  |\n If enabled, allows arbitrarily large results to be written to the temporary destination table and delete it when the job is finished. Dataset name is required to create the temporary table.\n  |\n|\n Dataset\\_Names\n  |\n Select the dataset names from the available list of datasets.\n  |\n|\n Table Names\n  |\n Select table names from available list of tables.\n  |\n|\n Processing Location\n  |\n Enter a location where your query will run. Queries that run in a specific location may only reference data in that location.\n  |\n|\n Max Results\n  |\n Max Results is the number of results returned per page of data. By default, Max Results is 10,000 results per page. If your dataset throws an out of memory error, decrease Max Results.\n  |\n|\n Use Google BigQuery Schema\n  |\n Select this checkbox to use the schema received from Google BigQuery.<br> This is useful when a column's datatype may be perceived incorrectly to Domo: e.g. your table has '123' in a String column.\n  |\n\nOther Panes\n-------------\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 000005176\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005176\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nBigQuery Workload Identity Federation Connector\n\n", "article_total_view_count": "\n\n\n 624\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 4/4/2023, 5:29 AM\n\n\n", "first_published_date": "\n\n\n 4/4/2023, 5:30 AM\n\n\n"}, "title": "bigquery_workload_identity_federation_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}