{"file_path": "../../raw_kb_v2\\article\\360043432213\\index.html", "content": {"title": "\n\n\n Infusionsoft/Infusionsoft Enterprise Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nInfusionsoft offers an e-mail marketing and sales platform for small businesses, including products to streamline the customer lifecycle, customer relationship management, marketing automation, lead capture, and e-commerce. To learn more about the Infusionsoft API, visit their page (\n\nhttps://developer.infusionsoft.com/\n\n).\n\n\n The Infusionsoft and Infusionsoft Enterprise connectors are exactly the same, except that the Enterprise version asks you for a client ID and a client secret in addition to the usual email address and password. This provides an extra layer of security.\n\n\n You connect to your Infusionsoft account in the Data Center. This topic discusses the fields and menus that are specific to the Infusionsoft connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Infusionsoft account and create a DataSet, you must have the following:\n\n The email address you used to register with Infusionsoft\n* Your Infusionsoft password\n* An Infusionsoft client ID and client secret (Enterprise version only)\n\nRefer to\n\nthis article\n\nto learn how to find your client ID and client secret.\n\n\n Connecting to Your Infusionsoft Account\n-----------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Infusionsoft Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nBoth versions of the Infusionsoft connector (standard as well as Enterprise) use OAuth to connect. In the Enterprise version of the connector, you are also asked to enter your client ID and client secret. (These fields do not appear in the standard version of the connector.) For information about finding these credentials, go here:\n\nhttps://developer.infusionsoft.com/g...ed-oauth-keys/\n\nOnce you have entered your client ID and client secret (Enterprise version only), click\n **Connect**\n (or select\n **Add Account**\n if you have existing Infusionsoft accounts in Domo) to open the Infusionsoft OAuth screen where you can enter your Infusionsoft email address and password. Once you have entered valid Infusionsoft credentials, you can use the same account any time you go to create a new Infusionsoft DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Infusionsoft when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Infusionsoft.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Infusionsoft report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Affiliate - Clawbacks\n  |\n Retrieves all clawed back commissions for a particular affiliate.\n  |\n|\n Affiliate - Commissions\n  |\n Retrieves all commissions for a specific affiliate within a date range.\n  |\n|\n Affiliate - Payments\n  |\n Retrieves all payments for a specific affiliate within a date range.\n  |\n|\n Affiliate - Redirect Links\n  |\n Retrieves a list of the redirect links for the specified Affiliate.\n  |\n|\n Affiliate Summary\n  |\n Retrieves a summary of statistics for a list of affiliates.\n  |\n|\n Affiliate - Running Totals\n  |\n Retrieves the current balances for Amount Earned, Clawbacks, and Running Balance.\n  |\n|\n Affiliate Program - All Programs\n  |\n Retrieves a list of all Affiliate Programs in the application.\n  |\n|\n Affiliate Program - Affiliate's Programs\n  |\n Retrieves a list of all of the Affiliate Programs for the specified affiliate.\n  |\n|\n Affiliate Program - Program's Affiliates\n  |\n Retrieves a list of all of the affiliates with their contact data for the specified program. This includes all of the custom fields defined for the contact and affiliate records that are retrieved.\n  |\n|\n Affiliate Program - Resources\n  |\n Retrieves a list of resources that associated with the specified Affiliate Program.\n  |\n|\n Contacts - By Email Address\n  |\n Retrieves all contacts with the given email address. Searches the \"Email,\" \"Email 2,\" and \"Email 3\" fields.\n  |\n|\n Contacts - By ID\n  |\n Retrieves all contacts with the given ID.\n  |\n|\n Contacts - By Tags\n  |\n Retrieves all contacts with the given tag.\n  |\n|\n Data - Record by ID\n  |\n Retrieves the requested fields from a specified record.\n  |\n|\n Data - Query a Data Table\n  |\n Performs a query across the given table based on the provided query data.\n  |\n|\n Discount - Category\n  |\n Returns the options and values of the specified category discount ID.\n  |\n|\n Discount - Category Assignments\n  |\n Retrieves the options and values of the category assignment for category discount passed.\n  |\n|\n Discount - Order's Discount\n  |\n Retrieves an order's total discount.\n  |\n|\n Discount - Product Total\n  |\n Retrieves a product's total discount.\n  |\n|\n Discount - Shipping\n  |\n Retrieves a shipping discount.\n  |\n|\n Discount - Subscription's Free Trial\n  |\n Retrieves a subscription's free trial information.\n  |\n|\n Get File\n  |\n Retrieves the file data for the specified file ID.\n  |\n|\n Invoice - Amount Due\n  |\n Retrieves the outstanding amount for an invoice.\n  |\n|\n Invoice - Available Payment Options\n  |\n Retrieves all payment types available within the requested Infusionsoft account.\n  |\n|\n Invoice - Payments\n  |\n Retrieves invoice payments.\n  |\n|\n Invoice - Available Shipping Options\n  |\n Retrieves all shipping options available in the specified Infusionsoft account.\n  |\n|\n Product - Inventory\n  |\n Retrieves the inventory data for a specified product.\n  |\n|\n Search - Available Fields\n  |\n Retrieves a report's available fields.\n  |\n|\n Search - Saved Search\n  |\n Retrieves a complete report from a saved search.\n  |\n|\n Search - Saved Search New\n  |\n Retrieves a partial report from a saved search.\n  |\n|\n Shipping - Available Shipping Options\n  |\n Retrieves available shipping options.\n  |\n|\n Shipping - Flate Rate Shipping Options\n  |\n Retrieves flat rate shipping options.\n  |\n|\n Shipping - Order Quantity Shipping Options\n  |\n Retrieves order quantity shipping options.\n  |\n|\n Shipping - Order Shipping Options\n  |\n Retrieves order shipping options.\n  |\n|\n Shipping - Order Shipping Ranges\n  |\n Retrieves range information for order shipping.\n  |\n|\n Shipping - Product Shipping Options\n  |\n Retrieves product shipping options.\n  |\n|\n Shipping - UPS Shipping Options\n  |\n Retrieves UPS shipping options.\n  |\n|\n Shipping - Weight-Based Shipping Options\n  |\n Retrieves weight-based shipping options.\n  |\n|\n Webform IDs\n  |\n Retrieves a list of webforms created within Infusionsoft.\n  |\n\n|\n|\n Affiliate ID(s)\n  |\n Select the affiliate program(s) you want to retrieve information for.\n  |\n|\n Program ID\n  |\n Select the program you want to retrieve information for.\n  |\n|\n Email\n  |\n Enter the email address you want to retrieve information for.\n  |\n|\n Selected Fields\n  |\n Select all fields you want returned in your report.\n  |\n|\n Contact ID\n  |\n Enter the ID of the contact you want to retrieve information for.\n  |\n|\n Tags\n  |\n Select all tags you want to retrieve data for.\n  |\n|\n Table\n  |\n Select the table you want to retrieve data for.\n  |\n|\n Record ID\n  |\n Enter the record ID you want to retrieve data for.\n  |\n|\n Fields\n  |\n Enter fields you want returned in your report.\n  |\n|\n Query\n  |\n Enter a search query. This should be a comma-separated list of key-value pairs. (For example,\n\n'GroupId':'12,30','City':'Ogden'\n\nwould query for the\n\ngroupId\n\nin 12 or 30 AND a city of Ogden). The key is the field to search on, and the value is the data to look for.\n\n%\n\nis the wild card operator. All searches are case-insensitive. If you would like to query for an empty (null) field, use\n\n~null~\n\nin your query parameter, e.g.\n\n'FirstName':'~null~'\n\n.\n\n\n You can also query on date fields. Here are some examples:\n * 'LastUpdated':'2016-01-20%'\n\nwould find data updated on a day.\n* 'LastUpdated':'2016%'\n\nwould find data updated on year.\n* 'LastUpdated':'~>=~2015-12-15'\n\nwould find data updated on greater than date \"2015-12-15.\"\n* 'LastUpdated':'~>=~2015-12-15 08:15:00'\n\nwould find data updated on greater than the provided date and time.\n* 'LastUpdated':'~>=~LastSuccessfulRun'\n\ncan be used for finding all data updated after last successful run.\n |\n|\n Category Discount ID\n  |\n Enter the ID of the category discount you want to retrieve information for.\n  |\n|\n Discount ID\n  |\n Enter the ID of the discount you want to retrieve information for.\n  |\n|\n Product Discount ID\n  |\n Enter the ID of the product discount you want to retrieve information for.\n  |\n|\n Shipping Discount ID\n  |\n Enter the ID of the shipping discount you want to retrieve information for.\n  |\n|\n Trial ID\n  |\n Enter the ID of the trial you want to retrieve information for.\n  |\n|\n Filter Saved Searches\n  |\n Enter the name of the saved search you want to retrieve. Enter\n\n\\*\n\nto retrieve all saved searches.\n  |\n|\n Saved Search\n  |\n Select the saved search you want to retrieve.\n  |\n|\n Option ID\n  |\n Enter the ID of the option you want to retrieve information for.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How do I know my Infusionsoft account credentials are secure?\n\nBoth versions of the Infusionsoft connector use Oauth, which authenticates the account without Domo ever having access to your Infusionsoft account credentials.\n\n####\n How often can the data be updated?\n\nAs often as needed.\n\n####\n Are there any API limits I should be aware of?\n\nNo.\n\n####\n Can I use the same Infusionsoft account for multiple DataSets?\n\nYes.\n\n####\n When I click\n **Add Account**\n , why am I getting automatically validated without having to enter credentials?\n\nIf you are already logged into Infusionsoft when you connect to Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Infusionsoft.\n\n####\n My DataSet is taking a long time to run. What's going on?\n\nThe Infusionsoft API often returns particular errors. Domo's Infusionsoft connector waits for a certain amount of time then retries if it receives one of these errors.\n\n If the Infusionsoft API returns \"[DatabaseError] Query took too long and was cancelled,\" we will retry with a rolling backoff 5 times starting with 5 seconds, then 10 seconds, 30 seconds, 1 minute, up until 5 minutes. By then it will usually fail with \"This saved search is blocked temporarily.\"\n* If Infusionsoft API returns \"[DatabaseError] Too many consecutive failures. This saved search is blocked temporarily,\" we will retry every 20 minutes up to 10 times.\n\n\n#####\n What can I do if my DataSets are running slowly?\n\nInfusionsoft allows only a certain number of requests per day. To avoid rate limit errors, the DataSets are throttled to not exceed that number. If you want your DataSets to run more quickly, use the Infusionsoft Enterprise connector to avoid being in the same throttling pool as other Domo customers.\n\n####\n What values should I use when registering an application (Enterprise version only)?\n\nAll of the fields are optional except for the name of your application, for which you can choose whatever name you feel is appropriate. For extra security, you may want to enter the Register Callback URL:\n\nhttps://oauth.domo.com/api/data/v1/o...prise/exchange\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043432213\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003685\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nInfusionsoft/Infusionsoft Enterprise Connector\n\n", "article_total_view_count": "\n\n\n 2,380\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "infusionsoftinfusionsoft_enterprise_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}