{"file_path": "../../raw_kb_v2\\article\\360056826634\\index.html", "content": {"title": "\n\n\n National Resources Conservation Service Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe National Water and Climate Center maintains a large database of soil, water, and climate data known as AWDB (air and water database). Use Domo's National Resources Conservation Service Connector to pull data from National Resources Conservation Center API for USA States.\n\n\n You create a National Resources Conservation Service DataSet in the Data Center.\n\n\n The National Resources Conservation Service connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n ****Cloud App****\n in the toolbar at the top of the window.\n\n\n This topic discusses the fields and menus that are specific to the National Resources Conservation Service connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nNone.\n\n\n Creating a National Resources Conservation Service DataSet\n------------------------------------------------------------\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the National Resources Conservation Service report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Central Tendency Data\n  |\n Returns the 30-year central tendency (average or median) value(s) for the current normals period. The method takes a Duration in order to retrieve DAILY, MONTHLY, SEMIMONTHLY, or ANNUAL central tendencies.\n  |\n|\n Central Tendency Peak Data\n  |\n Returns the peak 30-year central tendency (average or median) value(s) for the current normals period. The method takes a Duration in order to retrieve DAILY, MONTHLY, SEMIMONTHLY, or ANNUAL central tendencies.\n  |\n|\n Data\n  |\n Returns an array of Data objects that contain the data values for each station requested. The data will be returned in the same order as the stations requested.\n  |\n|\n Data Inserted Or Updated Since\n  |\n Returns data (any duration but HOURLY) for one or more stations, for a single element, for a range of dates, but only returns data that has been inserted or modified since some date that the user specifies.\n  |\n|\n Elements\n  |\n Returns list of Element objects (one for each element defined in the AWDB database).\n  |\n|\n Forecast Periods\n  |\n Returns a list of all forecast periods defined in the AWDB database.\n  |\n|\n Forecast Points\n  |\n Returns one or more forecast points using search criteria such as station ids, state codes, network codes, etc. Any of the parameters that take a list can be null if you don’t want to search by that criteria. If any of the parameters that take a list have more than one item, the search will return forecast points that match any of those items.\n  |\n|\n Height Depths\n  |\n Returns a list of all possible height/depths that are defined in AWDB (returned as a list of HeightDepth objects). Each HeightDepth object consists of a value (positive for a height, and negative for a depth).\n  |\n|\n Hourly Data\n  |\n Returns an array of HourlyData objects that contain the data values for each station requested.\n  |\n|\n Instantaneous Data\n  |\n Returns instantaneous SNOTEL or SCAN data for one or more stations for a single element for a range of dates.\n  |\n|\n Peak Data\n  |\n Returns the annual peak data value for each water year requested, for one or more stations, for a single element. The peak data value is the highest value in each water year (if there are multiple values that equal the highest value, the last one is returned).\n  |\n|\n Reservoir Metadata Multiple\n  |\n Retrieves metadata for several reservoir stations in a single call.\n  |\n|\n Station Metadata Multiple\n  |\n Returns a list of StationMetadata objects that contain the station metadata for each station requested. The metadata will be returned in the same order as the stations requested.\n  |\n|\n Stations\n  |\n Returns a list of strings that are the stationTriplets for the stations which match the search criteria passed in.\n  |\n|\n Station Elements\n  |\n Returns a list of all elements that a station has (or had) data or normals for a specified begin and end date.\n  |\n|\n Units\n  |\n Returns a list of all units defined in the AWDB database. Each item in the returned list will be a unit object that contains the unit code and the name (plural name) of the unit.\n  |\n\n|\n|\n Select State\n  |\n Select the state for which you want to fetch the data.\n  |\n|\n Network Codes\n  |\n The network code of the data to retrieve.\n  |\n|\n Element Codes\n  |\n The element code of the data to retrieve.\n  |\n|\n Duration\n  |\n The time span to retrieve the data for.\n  |\n|\n Ordinal\n  |\n Enter the number that indicates whether the element is from the primary sensor(1), the secondary sensor(2), and so on.\n  |\n|\n Get Flags\n  |\n Choose whether you want to retrieve the flags by selecting either of the True or False values. If true, flags associated with the report will be retrieved and returned, otherwise the flags won’t be returned.\n  |\n|\n Height Depth Value\n  |\n Enter the height/depth for the element of the data to retrieve, or null if the element doesn’t have a height/depth. Use default value 0 (Zero) for passing null.\n  |\n|\n Central Tendency Type\n  |\n Select the type of central tendency values to retrieve. This can be AVERAGE, MEDIAN or NORMAL; where NORMAL will be the default type for the given station and element.\n  |\n|\n Begin Day\n  |\n The first day of the first month for which the central tendencies to be retrieved (1-31).\n  |\n|\n Begin Month\n  |\n The first month of central tendencies to retrieve.\n  |\n|\n End Day\n  |\n The last day of the last month for which the central tendencies to be retrieved (1-31).\n  |\n|\n End Month\n  |\n The last month of central tendencies to retrieve.\n  |\n|\n Begin Year\n  |\n The first water year for which to get the peak data value.\n  |\n|\n End Year\n  |\n The last water year for which to get the peak data value.\n  |\n|\n Filter\n  |\n Filter determines which subset of data to retrieve. This can be ALL to get all values, FIRST OF DAY to get only the first value of each day, or MIDNIGHT ONLY to get only the midnight value of each day requested.\n  |\n|\n Unit System\n  |\n Select the unit code that indicates the units of the calculated forecast values and the period average.\n  |\n|\n Insert or Update  Begin Date\n  |\n Select the date selection format to begin the data insert or update.\n  |\n|\n Date (Date Selection)\n  |\n Select the date selection format.\n  |\n|\n Single Date - Specific Date\n  |\n Select a specific date for which you want fetch the data using the date picker.\n  |\n|\n Single Date - Relative Date\n  |\n Select or enter the number of days for which you would like to receive data back from the current date (which you specify in\n ****Days Back****\n ). For example, enter 0 for today, 1 for yesterday, or 7 for 7 days ago.\n  |\n|\n Date Range\n  |\n Select the start date and end date between which you want the data to be fetched.\n  |\n|\n Start Date\n  |\n Specify whether the start date in your date range is a specific or relative date. Select\n **Specific Date**\n if you want to fetch data for a particular day using the date picker. Select\n ****Relative****\n if you always want the report to retrieve data for a given number of days back from the current date (which you specify in\n ****Days Back****\n ). If you choose\n ****Relative****\n here, you should also choose\n ****Relative****\n for\n ****End Date****\n and specify a value for\n ****Days Back****\n .\n\n\n For example, if you enter 10 for\n ****Days Back****\n in Start Date and 5 for\n ****Days Back****\n in End Date and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n  |\n|\n End Date - Specific Date\n  |\n Specify whether the end date in your date range is a specific or relative date. Select\n **Specific Date**\n if you want to fetch data for a particular day using the date picker. Select\n ****Relative****\n if you always want the report to retrieve data for a given number of days back from the current date (which you specify in\n ****Days Back****\n ). If you choose\n ****Relative****\n here, you should also choose\n ****Relative****\n for\n ****End Date****\n and specify a value for\n ****Days Back****\n .\n\n\n For example, if you enter 10 for\n ****Days Back****\n in Start Date and 5 for\n ****Days Back****\n in End Date and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n  |\n|\n Time Period\n  |\n Select the time period for which you would like to receive data.\n  |\n|\n Starting Day of the Week\n  |\n Select whether you want the week to begin by Sunday or Monday while fetching the data.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360056826634\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003291\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nNational Resources Conservation Service Connector\n\n", "article_total_view_count": "\n\n\n 4,635\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "national_resources_conservation_service_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}