{"file_path": "../../raw_kb_v2\\article\\360043428293\\index.html", "content": {"Title": "Combining DataSets Using DataFusion", "Article Body": "Intro\n                       \n\n                        Domo includes two different methods of combining data using DataFusions—\"Add Columns\" and \"Add Rows.\" \"Add Columns\" combines two or more DataSets by matching similar columns. With this method, only the matching columns have to have the same header or data type. \"Add Rows\" combines DataSets by combining the rows from those DataSets. With this method, all columns must have the same header.\n                       \n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            If any DataSets in a DataFusion are out of date, the DataFusion itself will show as being out of date. When DataSets with PDP policies are used as input (parent) DataSets in a DataFusion, those policies are incorporated in the output DataSets as well. You cannot apply policies to output DataSets from DataFusions; you must apply them to the input (parent) DataSets. For more information, see\n                            \n                             PDP and DataFusions/\n                            \n\n                             DataFlows\n                            \n                            .\n                           \n\n\n\n\n\n\n\n                          Video - Combining DataSets Using DataFusion\n                         \n\n\n\n\n\n\n\n\n\n                        Combining DataSets using the Combine Columns method\n                       \n\n                        In this method, you select two or more DataSets, each of which contains at least one column that matches a column or data type in one of the others. You then combine all of the DataSets into a single DataSet by matching similar columns. This method is equivalent to using a JOIN in SQL.\n                       \n\n                        In the following example, a user uploads and combines two DataSets using this method. The user matches the \"Order #\" and \"Order Number\" columns, and the second DataSet appears to the right of the first.\n                       \n\n\n\n\n                        The user could go a step further and add a third DataSet that provides company information.\n                       \n\n\n\n\n                        The user then excludes the duplicate \"Order Number\" and \"Company\" columns. The final fused DataSet appears as follows:\n                       \n\n\n\n\n\n                         To combine DataSets using the Add Columns method,\n                        \n\n\n\n\n                          In Domo, click\n                          \n\n                            Data\n                           \n\n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Click\n                          \n                           Blend\n                          \n                          in the\n                          \n                           Magic Transform\n                          \n                          toolbar at the top of the window.\n                         \n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open the DataFusion editor from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Data > Blend\n                             \n                             .\n                            \n\n\n\n\n\n\n                          (Optional) Change the default title for the DataSet.\n                          \n                          The title is used to find or select the DataSet when powering up a card.\n                         \n\n\n\n                          Add the \"master\" or first DataSet you want by doing the following:\n                         \n\n\n\n                            Click\n                            \n                             Select DataSet\n                            \n                            .\n                           \n\n\n\n                            Select the DataSet from the list.\n                            \n                            You can filter the DataSets that appear in the list by selecting the DataSet in the\n                            \n                             All Types\n                            \n                            menu and/or entering the name of the DataSet in the\n                            \n                             Search\n                            \n                            field.\n                            \n                            A list of the column names in your DataSet appears.\n                           \n\n\n\n\n\n                          Add a secondary DataSet by doing the following:\n                         \n\n\n\n                            Click\n                            \n                             Select DataSet\n                            \n                            .\n                           \n\n\n\n                            Select the DataSet from the list.\n                            \n                            You can filter the DataSets that appear in the list by selecting the DataSet in the\n                            \n                             All Types\n                            \n                            menu or the owner in the\n                            \n                             All Users\n                            \n                            menu and/or entering the name of the DataSet in the\n                            \n                             Search\n                            \n                            field.\n                            \n                            A list of the column names in your DataSet appears.\n                           \n\n\n\n\n\n                          (Optional) Add additional DataSets to combine.\n                         \n\n\n\n                          (Optional) Remove selected DataSets by clicking the\n                          \n                           X\n                          \n                          icon.\n                         \n\n\n\n                          Specify settings to combine DataSets.\n                         \n\n\n\n                            Determine which columns from your DataSets contain the same values and/or data types.\n                            \n                            You can refer to the lists of column names for each DataSet for help.\n                           \n\n\n\n                            For each DataSet combination you want, select the columns you want to match.\n                           \n\n\n\n                              Click the first\n                              \n                               Select a Field\n                              \n                              menu, select the master DataSet, then select a column.\n                             \n\n\n\n                              Click the second\n                              \n                               Select a Field\n                              \n                              menu, select the secondary DataSet, then select the column with values or data type matching those/that of the first column you selected.\n                             \n\n\n\n                              Select the include option you want from the\n                              \n                              menu.\n                             \n\n\n\n\n\n                                  Option\n                                 \n\n\n\n                                  Description\n                                 \n\n\n\n\n\n\n\n\n\n                                  Left Outer Join\n                                 \n\n\n\n                                  Includes all the rows in the first selected DataSet and adds rows with the specified matching value field from the second selected DataSet.\n                                 \n\n\n\n\n\n\n\n                                  Inner Join\n                                 \n\n\n\n                                  Includes rows from both DataSets with the specified matching value field.\n                                 \n\n\n\n\n\n\n\n\n\n                            (Conditional) If you added more than one secondary DataSet, repeat steps for matching columns for each additional pair of\n                            \n                             Select a Field\n                            \n                            menus that appear.\n                           \n\n\n\n\n\n                          Click\n                          \n                           Click to load preview\n                          \n                          to see a preview of the DataSet.\n                          \n                          The option is available when matching columns are selected correctly for all of the selected DataSets.\n                         \n\n\n\n                          (Optional) Set options for columns by clicking the arrow to the right of any column in the preview.\n                         \n\n\n\n\n\n                              Option\n                             \n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n                              Rename Column\n                             \n\n\n\n                              Lets you rename this column. You can only rename columns before saving the DataFusion. After you save, this option is no longer available.\n                             \n\n\n\n\n\n                              Ignore Column\n                             \n\n\n\n                              Excludes this column from the combined DataSet.\n                             \n\n\n\n\n\n\n\n                          Click\n                          \n                           Save\n                          \n                          to save the combined DataSet.\n                         \n\n\n\n                        The new DataSet is added to the\n                        \n                         DataSets\n                        \n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n                        Combining DataSets using the Add Rows method\n                       \n\n                        In this method, you select two or more DataSets in which all of the column headings are the same. Domo then combines the rows from each DataSet into a single DataSet. This method is equivalent to using a UNION ALL in SQL.\n                       \n\n                        In the following example, a user uploads and combines two DataSets using this method. The second DataSet is appended directly below the first.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             All DataSets you combine using this method\n                             \n                              must\n                             \n                             have the same column headings and column order. Also, data types must match between matching columns. For example, if a column from one DataSet is formatted as\n                             \n                              DATE\n                             \n                             , then that same column in all other DataSets must also be formatted as\n                             \n                              DATE\n                             \n                             . Possible data types are as follows:\n                            \n\n\n\n\n                              LONG stores numbers as numeric values, including decimal, fractional, and whole numbers.\n                             \n\n\n\n                              DOUBLE stores double-precision floating point number values.\n                             \n\n\n\n                              STRING stores alphanumeric characters as text.\n                             \n\n\n\n                              DATETIME stores year, month, day, hour, minute, and second values.\n                             \n\n\n\n                              DATE stores year, month, and day values.\n                             \n\n\n\n                              TIME stores hour, minute, and second values.\n                             \n\n\n\n\n\n\n\n\n                         To combine DataSets using the Combine Rows method,\n                        \n\n\n\n\n                          Click\n                          \n\n                           > Data Center\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Blend\n                          \n                          in the\n                          \n                           Magic Transform\n                          \n                          toolbar at the top of the window.\n                         \n\n\n\n                          (Optional) Change the default title for the DataSet.\n                          \n                          The title is used to find or select the DataSet when powering up a card.\n                         \n\n\n\n                          Add the first DataSet by doing the following:\n                         \n\n\n\n                            Click\n                            \n                             Select DataSet\n                            \n                            .\n                           \n\n\n\n                            Select the DataSet from the list.\n                            \n                            You can filter the DataSets that appear in the list by selecting the DataSet in the\n                            \n                             All Types\n                            \n                            menu or the owner in the\n                            \n                             All Users\n                            \n                            menu and/or entering the name of the DataSet in the\n                            \n                             Search\n                            \n                            field.\n                            \n                            A list of the column names in your DataSet appears.\n                           \n\n\n\n\n\n                          Add a second DataSet by clicking\n                          \n                           Select\n                          \n\n                           DataSet\n                          \n                          and selecting your DataSet from the list, as before.\n                         \n\n\n\n\n\n\n\n                              Note:\n                             \n                             All DataSets you add using this method\n                             \n                              must\n                             \n                             have the same column headings or you will be unable to preview and save the fusion.\n                            \n\n\n\n\n\n\n                          (Optional) Add additional DataSets to combine.\n                         \n\n\n\n                          Click\n                          \n                           Combine Rows\n                          \n                          .\n                          \n                          If you successfully selected two DataSets with the same column headings, a link reading\n                          \n                           Click to load preview\n                          \n                          appears below.\n                         \n\n\n\n                          Click\n                          \n                           Click to load preview\n                          \n                          to see a preview of the DataSet.\n                         \n\n\n\n                          (Optional) Set options for columns by clicking the arrow to the right of any column in the preview.\n                         \n\n\n\n\n\n                              Option\n                             \n\n\n\n                              Description\n                             \n\n\n\n\n\n                              Ignore Column\n                             \n\n\n\n                              Excludes this column from the combined DataSet.\n                             \n\n\n\n\n\n\n\n                          Click\n                          \n                           Save\n                          \n                          to save the combined DataSet.\n                         \n\n\n\n                        The new DataSet is added to the\n                        \n                         DataSets\n                        \n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Data Center Layout\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043428293", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004562", "Archived Date": "", "Language": "English", "Primary Version": "Combining DataSets Using DataFusion", "Article Total View Count": "13,962", "": "", "Article Created Date": "10/24/2022, 10:14 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Combining DataSets Using DataFusion\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               DataFusion\n              \n", "url": "/s/topic/0TO5w000000ZanVGAS"}]}