{"file_path": "../../raw_kb_v2\\article\\360042929134\\index.html", "content": {"Title": "Treasure Data Connector", "Article Body": "Intro\n                       \n\n\n\n\n\n                            Treasure Data is a cloud data management platform that lets users in your organization connect and access live data. To learn more about the Treasure Data API, visit their page (\n                            \n                             https://support.treasuredata.com/hc/en-us/articles/360001260527-REST-APIs-in-Treasure-Data\n                            \n                            ).\n                            \n\n\n\n\n\n\n\n                        You connect to your Treasure Data account in the Data Center. This topic discusses the fields and menus that are specific to the Treasure Data connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        This connector can retrieve data from standard DataSets within Treasure Data by submitting jobs to Treasure Data and then importing the results. In some cases, you may actually be using Treasure Data's more advanced DataTank service. To connect to Treasure Data's DataTank, please use Domo's\n                        \n                         PostgreSQL\n                        \n                        database connector. To configure it, you will need to contact Treasure Data to get the necessary information, including the IP address and port of the DataTank server as well as login credentials.\n                       \n\n                        For assistance, please contact Treasure Data.\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Treasure Data account and create a DataSet, you must have a Treasure Data API key. For information about obtaining an API key, visit the following page:\n                        \n                         https://support.treasuredata.com/hc/en-us/articles/360000763288-Get-API-Keys\n                        \n\n\n                        Connecting to Your Treasure Data Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Treasure Data Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Treasure Data account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Treasure Data API key.\n                          \n\n\n\n                           Domain name\n                          \n\n\n                            Here is the list of domains:\n                           \n\n\n\n                              treasuredata.com\n                             \n\n\n\n                              treasuredata.co.jp\n                             \n\n\n\n                              ybi.idcfcloud.net\n                             \n\n\n\n\n\n\n\n\n                         Once you have entered valid Treasure Data credentials, you can use the same account any time you go to create a new Treasure Data DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Treasure Data report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Execute Job\n                              \n\n                               Retrieves a job based on a provided database name, SQL query, and job type. This report may take a long time to run if the result set is large.\n                              \n\n\n\n                               Job Details\n                              \n\n                               Retrieves details about a given job or all jobs.\n                              \n\n\n\n                               Job Results\n                              \n\n                               Retrieves the results of a specific job submitted in the past.\n                              \n\n\n\n                               Job Status\n                              \n\n                               Retrieves the status for a given job or all jobs.\n                              \n\n\n\n                               List Databases\n                              \n\n                               Retrieves a list of all databases in your account.\n                              \n\n\n\n                               List Jobs\n                              \n\n                               Retrieves a list of all jobs in your account.\n                              \n\n\n\n                               List Tables\n                              \n\n                               Retrieves a list of all tables in your account.\n                              \n\n\n\n\n\n\n\n                           Database\n                          \n\n                           Select the database containing the job you want to retrieve.\n                          \n\n\n\n                           SQL Query\n                          \n\n                           Enter the SQL query for the job you want to retrieve.\n                          \n\n\n\n                           Job Type\n                          \n\n                           Select the job type for the job you want to retrieve.\n                          \n\n\n\n                           Job ID\n                          \n\n                           Enter the ID of the job you want to pull data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        What kind of credentials do I need to power up this connector?\n                       \n\n                        You need the domain and API key associated with your Treasure Data account.\n                       \n\n                        Where can I find my API key?\n                       \n\n                        Visit\n                        \n                         Get API Keys\n                        \n                        to learn how to obtain the API key.\n                       \n\n                        What are the available domains?\n                       \n\n                        Here is the list of domains:\n                       \n\n\n\n                          api.treasuredata.com\n                         \n\n\n\n                          api.treasuredata.co.jp\n                         \n\n\n\n                          api.ybi.idcfcloud.net\n                         \n\n\n\n                        How often can the data be updated?\n                       \n\n                        Datasets should be set to update no more than once every 15 minutes.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        No", "Preview Article": "Click here to preview", "URL Name": "360042929134", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003550", "Archived Date": "", "Language": "English", "Primary Version": "Treasure Data Connector", "Article Total View Count": "4,767", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Treasure Data Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}