{"file_path": "../../raw_kb_v2\\article\\360043427673\\index.html", "content": {"Title": "Scheduling a Magic ETL DataFlow", "Article Body": "Intro\n                       \n\n                        Customize a schedule for your DataFlow runtime. With DataFlow schedules, you can continue kicking off your DataFlow when an input has updated or set a specific time at an hourly, daily, weekly, or monthly cadence. You can specify what time zone the DataSet trigger times are in as well as running on specific days of the week or month.\n                       \n\n\n\n                        Schedule Types\n                       \n\n\n\n\n                           Manually\n                          \n\n                           The DataFlow will not update without someone selecting the run option manually.\n                          \n\n\n\n                           On a schedule\n                          \n\n                           Set exactly when the DataFlow runs by selecting both the time and frequency (hourly, daily, weekly, monthly.)\n                          \n\n\n\n                           Only when DataSets are updated\n                          \n\n                           The DataFlow will run as soon as the chosen DataSet input has updated.\n                          \n\n\n\n\n                        How to Schedule a DataFlow\n                       \n\n\n                         To schedule a DataFlow from the details view,\n                        \n\n\n\n\n                          Navigate to the Data Center and find and select the DataFlow you want to schedule.\n                         \n\n\n\n                          Click on the\n                          \n                           Settings\n                          \n                          tab.\n                          \n\n\n\n\n\n\n\n\n                          Choose the type of schedule you would like.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n                            \n\n\n\n\n\n\n                          Click Apply\n                         \n\n\n\n\n                         To schedule a DataFlow from the edit view,\n                        \n\n\n\n\n                          Find and select the DataFlow you want to schedule.\n                         \n\n\n\n                          Click\n                          \n                           Edit\n                          \n                          to edit the DataFlow.\n                         \n\n\n\n                          Click the\n                          \n                          icon.\n                          \n\n\n\n\n\n\n\n\n                          Choose the type of schedule you would like.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n                            \n\n\n\n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          and\n                          \n                           Save\n                          \n                          the DataFlow.\n                         \n\n\n\n                        FAQs\n                       \n\n                        If you have multiple inputs set to trigger a DataFlow, does it run when any of the input DataSets are updated or when all of them are updated?\n                       \n\n                        Currently, if you have multiple DataSets set to trigger a DataFlow, it will run when any of those input DataSets update. If all of the inputs need to be updated before the DataFlow runs, we recommend staggering the input DataSet update times. Then, only set the input with the latest update time to trigger the DataFlow. This will ensure all the inputs have been updated before the DataFlow runs.", "Preview Article": "Click here to preview", "URL Name": "360043427673", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004577", "Archived Date": "", "Language": "English", "Primary Version": "Scheduling a Magic ETL DataFlow", "Article Total View Count": "5,119", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Scheduling a Magic ETL DataFlow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}