{"file_path": "../../raw_kb_v2\\article\\360043429773\\index.html", "content": {"title": "\n\n\n Syncing Value Scales in a Dual-Scale Chart\n\n\n", "article_body": "\n\nBy default, when you create a chart with two value scales\n\n\n (such as a grouped bar with line or stacked bar with line chart), those scales automatically correspond to the data they are measuring,\n *not*\n to each other. This behavior is represented in the following example chart, which is used to show the correlation between the amount of snowfall and the number of traffic accidents in a certain city over a period of five months. The value scale on the left corresponds to the line, which represents the snowfall, and ranges from 0 to 25 in increments of 5. The value scale on the right corresponds to the bars, representing the number of accidents, and ranges from 0 to 100 in increments of 20.\n\nBecause the scales are not synced in this example, it is time-consuming to match up the line and bars with their respective scales. You can make dual-scale charts easier to read and comprehend by syncing the scales so that the same set of numbers is used for both the lines and bars.\n\n\n The following example shows how the chart in the preceding example would look if the scales were synced:\n\nWhen the scales in the chart are synced, the data is easier to read since you don't need to spend time trying to figure out which scales correspond to the line and bars.\n\n\n**To sync value scales in a dual-scale chart,**\n\n. Open the Analyzer for the chart you want to edit.\n2. In\n **Chart Properties**\n , click\n **General**\n .\n3. Check\n **Sync Value Scales**\n .\n\nAfter value scales in a chart have been synced, you can hide the second scale so only one scale appears for the chart. The following example shows how the chart in the preceding example would look with the second scale hidden.\n\n*To hide the second value scale in a dual-scale chart,**\n\n. Open the Analyzer for the chart you want to edit.\n2. In\n **Chart Properties**\n , click\n **General**\n .\n3. Check\n **Hide Second Scale.**\n\n\n This option only works if the scales are synced; otherwise nothing happens.\n\nFor more information, see\n\nChart Properties\n\n.\n\n*Video - Changing the Value Scale in Cards**\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429773\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005030\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSyncing Value Scales in a Dual-Scale Chart\n\n", "article_total_view_count": "\n\n\n 2,707\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/2/2022, 9:00 PM\n\n\n", "first_published_date": "\n\n\n 11/2/2022, 9:04 PM\n\n\n"}, "title": "syncing_value_scales_in_a_dualscale_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_properties", "url": "/s/topic/0TO5w000000ZaodGAC"}]}