{"file_path": "../../raw_kb_v2\\article\\360043433813\\index.html", "content": {"Title": "DomoStats Connector", "Article Body": "Intro\n                       \n\n                        The DomoStats Connector gives you the freedom to explore how your team is using Domo. Dive in to your team's activities, Projects and Tasks, DataSets, Buzz conversations, and more to find insights and shape your company’s Domo experience.\n                       \n\n                        You must have an Admin security role to access the DomoStats Connector or to connect to the DomoStats apps. However, once the DataSets have been created or the app has been deployed, they can be shared with anyone in your organization.\n                       \n\n                        You import DomoStats DataSets in the\n                        \n                         Data Center\n                        \n                        . This topic discusses the fields and menus that are specific to the DomoStats Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        To pull in DomoStats DataSets using this Connector, you must have Admin security access. No credentials are required for connecting.\n                       \n\n                        Connecting to DomoStats DataSets\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Details\n                         \n                         pane in the DomoStats Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most Connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a single\n                        \n\n                          Report\n                         \n\n                        menu from which you select your desired DomoStats DataSet.\n                       \n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Accounts\n                          \n\n                           Returns information about the Accounts that are in the instance.\n                          \n\n\n\n                           Accounts with Permissions\n                          \n\n                           Returns information about the Accounts that are in the instance and what users have access to them.\n                          \n\n\n\n                           Activity Log\n                          \n\n\n                            Returns information about team member activities within Domo such as logins, card creation, card viewing, DataSet creation, etc.\n                           \n\n                            See\n                            \n                             Activity Log\n                            \n\n                             DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           AutoML Training Jobs\n                          \n\n\n                            Included with data science package.\n                           \n\n\n\n\n                           Beast Modes used in Cards\n                          \n\n\n                            Returns information about which Beast Modes are currently in use in cards.\n                           \n\n\n\n\n                           Buzz\n                          \n\n                           Returns information about Buzz usage within Domo such as conversation participants, number of messages posted, etc.\n                          \n\n\n\n                           Card Datasource\n                          \n\n                           Returns the DataSets that power a card.\n                          \n\n\n\n                           Card Pages\n                          \n\n\n                            Returns the dashboards where a card displays.\n                           \n\n\n\n\n                           Card Permissions\n                          \n\n\n                            Returns information about card permissions.\n                            \n\n                            See\n                            \n                             Card Permissions DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           DataFlow Input DataSources\n                          \n\n\n                            Returns the IDs of inputs to DataFlows.\n                           \n\n\n\n\n                           DataFlow Output DataSources\n                          \n\n\n                            Returns the IDs of outputs from DataFlows.\n                           \n\n\n\n\n                           DataFlows\n                          \n\n\n                            Returns information about DataFlows within your Domo instance, such as DataFlow name, type, status, last updated date, etc.\n                           \n\n\n\n                            See\n                            \n                             DataFlows DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           DataFlows History\n                          \n\n\n                            Returns DataFlow run history information for your Domo instance, such as DataFlow name, run start and end time, whether runs were successful, etc.\n                           \n\n                            See\n                            \n                             DataFlows History DataSet\n                            \n                            below.\n                           \n\n\n\n\n                             Note:\n                            \n                            This report may have up to a 24-hour window without data. For example, if your report ran at 1 a.m. on 10/10, the report may not pull anything more recent than 1 a.m. on 10/09.\n                           \n\n\n\n\n                           DataSet Access\n                          \n\n                           Returns which users or groups have access to which DataSets and what permission level they have.\n                          \n\n\n\n                           DataSet Tags\n                          \n\n                           Returns which tags are assigned to which DataSets.\n                          \n\n\n\n                           DataSets\n                          \n\n\n                            Returns information about DataSets within your Domo instance, such as DataSet name, owner, connector, last run date, etc.\n                           \n\n                            See\n                            \n                             DataSets DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           DataSets Execution Error\n                          \n\n\n                            Returns DataSets with errors.\n                           \n\n\n\n\n                           DataSets History\n                          \n\n\n                            Returns DataSet run history information for your Domo instance, such as DataSet name, run start and end time, whether runs were successful, etc.\n                           \n\n                            See\n                            \n                             DataSets History DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           ML Inference Jobs\n                          \n\n                           Included with data science package.\n                          \n\n\n\n                           Mobile Activity\n                          \n\n                           Returns a user ID, the user's mobile device, and their session start date and time.\n                          \n\n\n\n\n                            OKR Key Results (included with Domo Goals)\n                           \n\n\n\n\n                             Returns information about the key results/metrics that have been created in Domo Goals.\n                            \n\n\n\n                             See\n                            \n\n                             OKR Key Results DataSet\n                            \n                            below.\n                           \n\n\n\n\n\n                            OKR Objectives (included with Domo Goals)\n                           \n\n\n\n\n                             Returns information about the objectives/goals that have been created in Domo Goals.\n                            \n\n\n\n                             See\n                            \n\n\n                              OKR Objectives DataSet\n                             \n                             below.\n                            \n\n\n\n\n\n                           Pages\n                          \n\n                           Returns information regarding Pages.\n                          \n\n\n\n                           Pages with Multiple Owners\n                          \n\n                           Returns information of each owner of a Page broken out per row.\n                          \n\n\n\n                           People\n                          \n\n\n                            Returns information about users in your Domo instance, such as user name, security role, contact information, last login date, etc.\n                           \n\n                            See\n                            \n                             People DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           Project Stages\n                          \n\n\n                            Returns information about project stages in your Domo instance.\n                           \n\n                            See\n                            \n                             Project Stages DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           Projects\n                          \n\n\n                            Returns information about projects in your Domo instance, such as project name, owner, associated tasks, etc.\n                           \n\n                            See\n                            \n                             Projects DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           Publish\n                          \n\n                           Included with Domo Everywhere.\n                          \n\n\n\n                           Publish Event Logs\n                          \n\n\n                            Included with Domo Everywhere.\n                           \n\n\n\n\n                           Task Owners\n                          \n\n\n                            Returns information about task owners in your Domo instance.\n                           \n\n                            See\n                            \n                             Task Owners DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           Tasks\n                          \n\n\n                            Returns information about tasks in your Domo instance, such as task name, parent project, assignees, etc.\n                           \n\n                            See\n                            \n                             Tasks DataSet\n                            \n                            below.\n                           \n\n\n\n\n                           User Activity\n                          \n\n                           Returns User Activity, similar to the Activity Log in the Admin section.\n                          \n\n\n\n                           Variables\n                          \n\n                           Returns information about existing Variables in your instance.\n                          \n\n\n\n                           Variables used in Beast Modes\n                          \n\n                           Returns information about which Variables are currently in use in a Beast Mode.\n                          \n\n\n\n                           Workbench\n                          \n\n\n                            Returns information about Workbench job statuses, last run times, which machines are running the jobs, what DataSets are powered by the jobs, and schedule type.\n                           \n\n                            See\n                            \n                             Workbench DataSet\n                            \n                            below.\n                           \n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n                          Locating DomoStats DataSets\n                         \n\n                          After a DataSet is created, you can locate the DataSet through filters and tagging. This helps keep DataSets organized and accessible.\n                         \n\n\n\n                          1. In the navigation header, select\n                          \n                           Data\n                          \n                          .\n                         \n\n                          2. Select\n                          \n                           DataSets\n                          \n                          from the\n                          \n                          navigation rail.\n                          \n\n\n\n\n                           3. In the\n                           \n                            Search\n                           \n                           bar, type the name of your DataSet. You\n                          \n\n                           can also locate DataSets using filters.\n                          \n\n\n\n                           3. In the\n                           \n                            Search\n                           \n                           bar, select\n                           \n                            Add Filter\n                           \n                           .\n                          \n\n\n                          4. Choose\n                          \n                           Type\n                          \n                          and enter\n                          \n                           DomoStats\n                          \n                          .\n                         \n\n                          A list of DomoStats DataSets will generate. Choose your DataSet from the list.\n                         \n\n\n\n                          Tagging a DomoStats DataSet\n                         \n\n                          Locating and organizing your DataSets is made possible by tagging. Tagging groups the DataSets in collections that can be found using the\n                          \n                           Tag\n                          \n                          filter.\n                         \n\n\n\n                          1. Locate the DataSet in Domo. (See the previous section, Locating DomoStats DataSets, for a step-by-step guide.)\n                         \n\n                          2. Select\n                          \n                           + Add Tag\n                          \n                          under the DataSet's name.\n                         \n\n\n\n\n                          3. Choose from the list of available tags, or create a new tag using the search feature.\n                         \n\n\n\n\n                          4. Select\n                          \n                           +\n                          \n                          next to\n                          \n                           Create new tag.\n                          \n\n\n                          5. Select\n                          \n                           Save.\n                          \n\n\n\n                          The DataSet is now tagged and can be found using the Tags filter.\n                         \n\n\n\n\n                          DataSet Fields\n                         \n\n\n\n                        This section gives field-by-field descriptions for certain DomoStats reports DataSets.\n                       \n\n\n\n                        Activity Log DataSet\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Object_Name\n                          \n\n                           The name of the object that received an action.\n                          \n\n\n\n                           User_ID\n                          \n\n                           The ID of the person or thing that performed an action.\n                          \n\n\n\n                           Source_ID\n                          \n\n\n                            The ID of the type. For a simplified example, let's say a user added a card to a page. You would get these two actions on an event, and both would be returned on the DataSet.\n                           \n\n\n                             \"User updated page.\" This returns the following in the DataSet:\n                             \n\n                               UserId: user_id\n                              \n\n                               Type: USER\n                              \n\n                               Source_Id: userId\n                              \n\n                               action: updated\n                              \n\n                               object_type: page\n                              \n\n                               object_id: page_id\n                              \n\n\n\n                             \"Card added to page.\" This returns the following in the DataSet:\n                             \n\n                               UserId: user_id\n                              \n\n                               Type: CARD\n                              \n\n                               Source_Id: card_id\n                              \n\n                               action: added_to\n                              \n\n                               object_type: page\n                              \n\n                               object_id: page_id\n                              \n\n\n\n\n\n\n\n                           Name\n                          \n\n                           The name of the object that performed an action.\n                          \n\n\n\n                           Action\n                          \n\n                           The event that took place. The following actions may be logged here:\n                           \n\n\n\n                               LOGGEDIN\n                              \n\n                               Logged when someone successfully logs in from the login page using their password. Mobile logins are recorded when a person logs out of the app and back into the app. If a person opens and closes the app, that is not counted toward logins.\n                              \n\n\n\n                               LOGGEDIN_SSO\n                              \n\n                               Logged when someone successfully logs in from the login page using SSO.\n                              \n\n\n\n                               LOGGEDIN_TWO_FACTOR\n                              \n\n                               Logged when a two-factor code is successfully used to login.\n                              \n\n\n\n                               PAGE VIEW\n                              \n\n                               Counted each time a page renders.\n                              \n\n\n\n                               CARD VIEW\n                              \n\n\n                                Counted only if a user clicks into the Details view for a Card.\n                               \n\n\n\n\n\n\n\n\n                           Object Type\n                          \n\n                           Clarifies what the object is.\n                          \n\n\n\n                           Object ID\n                          \n\n                           The ID of the object.\n                          \n\n\n\n                           Type\n                          \n\n                           The type of person or thing that performed an action.\n                          \n\n\n\n                           Event Time\n                          \n\n                           The time at which the event occurred. The audit endpoint records/returns it in UTC, but the connector converts it to the user's time zone.\n                          \n\n\n\n\n\n\n                        Card Permissions DataSet\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           cardId\n                          \n\n                           The ID of the card to check permissions for.\n                          \n\n\n\n                           entity type\n                          \n\n                           The entity (user or group) for whom permissions exist.\n                          \n\n\n\n                           entityId\n                          \n\n                           The user or group ID of the entity for whom permissions exist.\n                          \n\n\n\n                           permission mask\n                          \n\n\n                            A numerical representation of the set of permissions granted to a user or group.\n                           \n\n\n\n\n                           Permission\n                          \n\n\n                            A permission mask followed by a visual breakdown of the permissions granted to a user or group.\n                            \n\n                            R = Read\n                            \n                            W = Write\n                           \n\n                            D = Delete\n                            \n                            S = Share\n                           \n\n                            A = Admin\n                           \n\n\n\n\n\n\n\n                        DataFlows DataSet\n                       \n\n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Current Version\n                          \n\n                           Returns the version number of the DataFlow.\n                          \n\n\n\n                           ID\n                          \n\n                           Returns the DataFlow ID number.\n                          \n\n\n\n                           Description\n                          \n\n                           Returns the description for the DataFlow if one has been specified.\n                          \n\n\n\n                           Type\n                          \n\n                           The type of DataFlow.\n                          \n\n\n\n                           Status\n                          \n\n                           The status for the DataFlow. The following statuses may appear here:\n                           \n\n\n\n                               Success\n                              \n\n                               The DataFlow was executed successfully.\n                              \n\n\n\n                               Not Runnable/Rejected\n                              \n\n                               There is a problem with the DataFlow definition; please view the DataFlow details.\n                              \n\n\n\n                               Canceled\n                              \n\n                               A user manually canceled the execution of the DataFlow.\n                              \n\n\n\n                               Enabled\n                              \n\n                               The DataFlow has been built but not yet run.\n                              \n\n\n\n                               Failed\n                              \n\n                               There was an internal problem executing the DataFlow.\n                              \n\n\n\n                               Running\n                              \n\n                               The DataFlow is currently being executed.\n                              \n\n\n\n                               Success\n                              \n\n\n                                Executed successfully.\n                               \n\n\n\n\n\n\n\n\n                           Owner ID\n                          \n\n                           Returns the user ID of the DataFlow owner. This ID is the same as the User ID in the DomoStats People DataSet.\n                          \n\n\n\n                           Display Name\n                          \n\n                           Returns the current name of the DataFlow.\n                          \n\n\n\n                           Last Executed Date\n                          \n\n                           Returns a timestamp for the time of the last execution.\n                          \n\n\n\n                           Last Updated Date\n                          \n\n                           Returns a timestamp for the time when the DataFlow was last updated.\n                          \n\n\n\n                           Last Updated By\n                          \n\n                           Returns the user ID of the last person to edit the DataFlow.\n                          \n\n\n\n\n\n\n                        DataFlows History DataSet\n                       \n\n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           ID\n                          \n\n                           An ID for a specific run of the DataFlow.\n                          \n\n\n\n                           DataFlow ID\n                          \n\n                           The ID number for the DataFlow.\n                          \n\n\n\n                           Display Name\n                          \n\n                           The name of the DataFlow.\n                          \n\n\n\n                           Type\n                          \n\n                           Returns the DataFlow type, either ETL, MYSQL, or REDSHIFT.\n                          \n\n\n\n                           Status\n                          \n\n                           Returns the status for the DataFlow run, either CANCELLED, FAILED, REJECTED, or SUCCESS.\n                          \n\n\n\n                           Execution Type\n                          \n\n                           Returns the type of execution, either DATA_UPDATE, MANUAL, RETRY, or SCHEDULED.\n                          \n\n\n\n                           Start Time\n                          \n\n                           A timestamp for the time the DataFlow started executing.\n                          \n\n\n\n                           End Time\n                          \n\n                           A timestamp for the time the DataFlow stopped executing.\n                          \n\n\n\n\n\n\n                        DataSets DataSet\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Status\n                          \n\n                           The status for the DataSet. The following statuses may appear here:\n                           \n\n\n\n                               Error\n                              \n\n                               Error during the import.\n                              \n\n\n\n                               Idle\n                              \n\n                               A stream has been created but the DataSet has not yet been executed.\n                              \n\n\n\n                               Success\n                              \n\n                               The import completed successfully.\n                              \n\n\n\n                               Active (or blank)\n                              \n\n                               The import is in process.\n                              \n\n\n\n                               Invalid\n                              \n\n\n                                There may be another execution still running and this has been deactivated until the previous one is complete.\n                               \n\n\n\n\n\n\n\n\n                           ID\n                          \n\n                           The unique identifying value for the DataSet.\n                          \n\n\n\n                           Owner_User_ID\n                          \n\n                           The unique identifying value for the person who owns the DataSet.  A DataSet owner is either the person who created the DataSet or the person whom ownership was assigned to.\n                          \n\n\n\n                           Created_Date\n                          \n\n                           The date on which the DataSet was run for the first time.\n                          \n\n\n\n                           Last_Run_Date\n                          \n\n                           The date on which the DataSet last successfully completed a run.\n                          \n\n\n\n                           Name\n                          \n\n                           The current name given to the DataSet.\n                          \n\n\n\n                           Schedule\n                          \n\n                           The schedule option that has been configured for this DataSet. The following options may appear here:\n                           \n\n\n\n                               Manual\n                              \n\n                               The schedule has been set so that it only updates when you manually go in and run the DataSet.\n                              \n\n\n\n                               Day\n                              \n\n                               The DataSet is set to run once per day.\n                              \n\n\n\n                               Minute\n                              \n\n                               The DataSet is set to run within the given minute interval.\n                              \n\n\n\n                               Hour\n                              \n\n                               The DataSet is set to run once per hour.\n                              \n\n\n\n                               Blank\n                              \n\n\n                                The DataSet has been created but no schedule has been set.\n                               \n\n\n\n\n\n\n\n\n                           Import_Type\n                          \n\n                           The source for the DataSet. Could be a Connector, DataFlow, API, etc.\n                          \n\n\n\n                           Source_Type\n                          \n\n                           UNDER CONSTRUCTION\n                          \n\n\n\n\n\n\n                        DataSets History DataSet\n                       \n\n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Stream ID\n                          \n\n                           A Domo-specific ID to map to the stream.\n                          \n\n\n\n                           Execution ID\n                          \n\n                           The ID for a specific run of the DataSet.\n                          \n\n\n\n                           Datasource ID\n                          \n\n                           A Domo-specific datasource ID\n                          \n\n\n\n                           Status\n                          \n\n                           The status for the DataSet history item. The following statuses may appear here:\n                           \n\n\n\n                               Success\n                              \n\n                               Data was imported successfully.\n                              \n\n\n\n                               Error\n                              \n\n                               Error during the import.\n                              \n\n\n\n                               Invalid\n                              \n\n\n                                There may be another execution still running and this has been deactivated until the previous one is complete.\n                               \n\n\n\n\n\n\n\n\n\n\n                           Execution Type\n                          \n\n                           The type of execution. The following execution types may appear here:\n                           \n\n\n\n                               Manually\n                              \n\n                               The import was executed manually.\n                              \n\n\n\n                               Automated\n                              \n\n                               The import was executed on a schedule.\n                              \n\n\n\n                               Retry\n                              \n\n                               The import failed and Domo automatically tried to execute it again.\n                              \n\n\n\n                               Replay\n                              \n\n                               A previously imported DataSet was rerun.\n                              \n\n\n\n                               Batch\n                              \n\n                               Data was imported in batches.\n                              \n\n\n\n                               Extended\n                              \n\n\n                                The data import continued into the next scheduled run.\n                               \n\n\n\n\n\n\n\n\n                           Start Time\n                          \n\n                           The time the DataSet started running.\n                          \n\n\n\n                           End Time\n                          \n\n                           The time the DataSet finished running, went into an error state, or became invalid.\n                          \n\n\n\n\n\n                         OKR Objectives DataSet\n                        \n\n\n                        The fields\n                        \n                         in this section use \"Objectives\" and \"Key Results\".\n                        \n\n                         Your organization may refer to them as goals, metrics, or something else depending on your Goals Admin Settings. For more information about using the DomoStats Connector with Goals, see\n                         \n                          Accessing Goals Data\n                         \n                         .\n                        \n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           ID\n                          \n\n\n                            The unique identifier of the objective.\n                           \n\n\n\n\n                           Name\n                          \n\n\n                            The name of the objective.\n                           \n\n\n\n\n                           Description\n                          \n\n\n                            The description of the objective.\n                           \n\n\n\n\n                           State\n                          \n\n\n\n                             The current state of the objective. Possible states are listed below:\n                            \n\n\n\n\n\n                             OPEN: The objective's expiration date has not elapsed and the objective has not been marked complete.\n                            \n\n\n\n\n\n                             EXPIRED: The objective's expiration date has elapsed.\n                            \n\n\n\n\n\n                             CLOSED: The objective has been marked complete.\n                            \n\n\n\n\n\n                           Owner ID\n                          \n\n\n                            The ID of the individual user or group that owns the objective. When multiple individuals or groups own an objective, the ID of the first owner is populated in this field.\n                           \n\n\n\n\n                           Owner Type\n                          \n\n\n\n                             Indicates whether or not the objective owner is an individual user or group.\n                            \n\n                             Possible types are listed below:\n                            \n\n\n\n\n\n                             USER: A Domo user\n                            \n\n\n\n\n\n                             GROUP: A Domo group\n                            \n\n\n\n\n\n                           Type\n                          \n\n\n\n                             The type of objective. Possible values are:\n                            \n\n\n\n                             PERSONAL\n                            \n\n\n\n                             TEAM\n                            \n\n\n\n                             COMPANY\n                            \n\n\n\n\n\n                           Team ID\n                          \n\n\n\n                             The ID of the Domo group that is assigned to the objective.\n                            \n\n\n\n                             (For Team-type objectives)\n                            \n\n\n\n\n\n                           Parent ID\n                          \n\n\n                            The ID of the parent objective, if applicable.\n                           \n\n\n\n\n\n                            Parent IDs\n                           \n\n\n\n                            The IDs of the parent objectives if the objective has multiple parents, if applicable.\n                           \n\n\n\n\n\n                            Multiple Parents\n                           \n\n\n\n                            Indicates whether or not the objective has multiple parents.\n                           \n\n\n\n\n\n                            Period ID\n                           \n\n\n\n                            The ID of the period that the objective is active (based on Start and expiration date).\n                           \n\n\n\n\n\n                            Period IDs\n                           \n\n\n\n\n                             The IDs of periods\n                             \n                              if\n                             \n                             an objective is active for multiple periods.\n                            \n\n\n\n\n\n\n                            Company ID\n                           \n\n\n\n\n                             The ID of the organization that is assigned to the objective.\n                            \n\n\n\n                             (For Company-Type objectives)\n                            \n\n\n\n\n\n\n                            Company IDs\n                           \n\n\n\n                            The ID of each Company-type objective\n                            \n                             if\n                            \n                            linked to multiple Company-type objectives.\n                           \n\n\n\n\n\n                            Self Assessment\n                           \n\n\n\n                            The optional self assessment submitted when marking an objective complete.\n                           \n\n\n\n\n\n                            Confidence\n                           \n\n\n\n\n                             A numerical value based on the objective status. Values with their associated status are listed below:\n                            \n\n\n\n\n\n                             1: ON TRACK\n                            \n\n\n\n                             0.5: NEEDS ATTENTION\n                            \n\n\n\n                             0: AT RISK\n                            \n\n\n\n\n\n\n                            Likes\n                           \n\n\n\n                            The number of likes the objective has received.\n                           \n\n\n\n\n\n                            Dislikes\n                           \n\n\n\n                            The number of dislikes the objective has received.\n                           \n\n\n\n\n\n                            Subscriptions\n                           \n\n\n\n                            The number of users who have subscribed to the objective.\n                           \n\n\n\n\n\n                            Company Objective\n                           \n\n\n\n                            Indicates if the objective is a Company-type objective.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            The start date of the objective.\n                           \n\n\n\n\n\n                            Expire Date\n                           \n\n\n                           The end date of the objective.\n                          \n\n\n\n\n                            Impact Start Date\n                           \n\n\n\n\n                             (DEPRECATED)\n                            \n                            The date when the impact of the achieved objective is expected to begin.\n                           \n\n\n\n\n\n                            Impact End Date\n                           \n\n\n\n\n                             (DEPRECATED)\n                            \n                            The date when the impact of the achieved objective is expected to end\n                           \n\n\n\n\n\n                            Tags\n                           \n\n\n\n\n                             A list of tags associated with the objective. This list is separated by commas.\n                            \n\n\n\n\n\n\n                            Tag Categories\n                           \n\n\n\n\n                             A list of tag categories associated with items in the Tags field. This list is separated by commas.\n                            \n\n\n\n\n\n\n                            Created Date\n                           \n\n\n\n                            The date the objective was created.\n                           \n\n\n\n\n\n                            Creator ID\n                           \n\n\n\n                            The ID of the user who created the objective.\n                           \n\n\n\n\n\n                            Modified Date\n                           \n\n\n\n                            The date/time the objective was last modified. If the objective has not been modified, this will be the date and time the objective was originally created.\n                           \n\n\n\n\n\n                            Modifier ID\n                           \n\n\n\n                            The ID of the user who modified the objective. If the objective has not been modified, this will be the ID of the user who created the objective.\n                           \n\n\n\n\n\n                            Owners\n                           \n\n\n\n\n                             A comma-separated list of the ID and Type of the user or group that owns the objective.\n                            \n\n\n\n                             For example, if user ID 12345678 owns the objective, the field will contain the value 12345678:USER.\n                            \n\n\n\n                             If group 54231564 owns the objective then the field will contain the value 54231564:GROUP.\n                            \n\n\n\n\n\n\n                            Assigned Team IDs\n                           \n\n\n\n                            A comma-separated list of the Domo group IDs that the objective has been assigned to.\n                           \n\n\n\n\n\n\n                             _BATCH_ID_\n                            \n\n\n\n\n                            An incremental batch number representing each DataSet update.\n                           \n\n\n\n\n\n\n                             _BATCH_LAST_RUN_\n                            \n\n\n\n\n                            The date and time that the DataSet was last run.\n                           \n\n\n\n\n\n\n\n                        OKR Key Results DataSet\n                       \n\n                        The fields\n                        \n                         in this section use \"Objectives\" and \"Key Results\".\n                        \n\n                         Your organization may refer to them as goals, metrics, or something else depending on your Goals Admin Settings. For more information about using the DomoStats Connector with Goals, see\n                         \n                          Accessing Goals Data\n                         \n                         .\n                        \n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           ID\n                          \n\n\n                            The unique identifier of the key result.\n                           \n\n\n\n\n                           Name\n                          \n\n\n                            The name of the key result.\n                           \n\n\n\n\n                           Description\n                          \n\n                           The description of the key result.\n                          \n\n\n\n                           State\n                          \n\n\n\n                             The current state of the key result. Possible states are listed below:\n                            \n\n\n\n\n\n                             OPEN: The key result's expiration date has not elapsed and the key result has not been marked complete.\n                            \n\n\n\n\n\n                             EXPIRED: The key result's expiration date has elapsed.\n                            \n\n\n\n\n\n                             CLOSED: The objective that the key result belongs to has been marked complete.\n                            \n\n\n\n\n\n                           Owner ID\n                          \n\n\n                            The ID of the individual user or group that owns the key result. When multiple individuals or groups own a key result, the ID of the first owner is populated in this field.\n                           \n\n\n\n\n                           Owner Type\n                          \n\n\n\n                             Indicates whether or not the key result owner is an individual user or group. Possible types are listed below:\n                            \n\n\n\n\n\n                             USER: A Domo user\n                            \n\n\n\n                             GROUP: A Domo group\n                            \n\n\n\n\n\n                           Objective ID\n                          \n\n\n                            The ID of the objective that the key result belongs to.\n                           \n\n\n\n\n                           Card ID\n                          \n\n\n                            The ID of the card that the key result is linked to (for automatic/card-based key results).\n                           \n\n\n\n\n                           Alert ID\n                          \n\n\n                            A unique ID generated for each key result that is linked to a card.\n                           \n\n\n\n\n                           Completion\n                          \n\n\n\n                             A percentage representing the progress of the key result as measured by the relationship of the actual value to the target value.\n                            \n\n\n\n\n\n                             The completion is calculated in the following ways:\n                            \n\n\n\n\n\n                             Automatic, card-based key results: Progress is driven based on values in the card relative to a target.\n                            \n\n\n\n\n\n                             Manual/percent completion-based key results: Value is determined based on the percent completion specified in the key result slider bar.\n                            \n\n\n\n\n\n                             Manual/choose your own value key results: Progress is determined based on the actual value of the key result divided by the target of the key result.\n                            \n\n\n\n\n\n                             Projects and Tasks-based key results: Progress is determined by how many projects/tasks have been completed completed in the Projects and Tasks feature.\n                            \n\n\n\n\n\n                           Pacing\n                          \n\n\n                            When enabled, this field shows the completion of the key result as a percentage compared to the percentage of time that the key result has been open (time between start and end date).\n                           \n\n\n\n\n                           Start Value\n                          \n\n\n                            The initial value of the key result.\n                           \n\n\n\n\n                           Current Value\n                          \n\n\n                            The current value of the key result.\n                           \n\n\n\n\n                           Target Value\n                          \n\n\n                            The target value of the key result\n                           \n\n\n\n\n                           Weight\n                          \n\n                           (NOT USED)\n                          \n\n\n\n                           Fixed Weight\n                          \n\n                           (NOT USED)\n                          \n\n\n\n                           Manual Type\n                          \n\n\n\n                             For manually-managed key results, this field indicates the type of the key result.\n                            \n\n\n\n\n\n                             Possible values are listed below:\n                            \n\n\n\n\n\n                             VALUE: Key result measured with a single value.\n                            \n\n\n\n                             SCALE: Key result measured using a percent completion scale.\n                            \n\n\n\n                             PROJECT_AND_TASK: Key result associated to a Domo project.\n                            \n\n\n\n\n\n                           Unit Type\n                          \n\n\n\n                             The data type of the key result's value and target. Possible values include:\n                            \n\n\n\n\n\n                             NUMERICAL\n                            \n\n\n\n                             PERCENT\n                            \n\n\n\n\n\n                           Project ID\n                          \n\n\n                            The ID of the project that is linked to the key result (only applicable to Projects and Tasks-based key results).\n                           \n\n\n\n\n                           Likes\n                          \n\n\n                            The number of likes the key result has received.\n                           \n\n\n\n\n                           Dislikes\n                          \n\n\n                            The number of dislikes the key result has received.\n                           \n\n\n\n\n                           Start Date\n                          \n\n\n                            The start date of the key result.\n                           \n\n\n\n\n                           Expire Date\n                          \n\n\n                            The end date of the key result.\n                           \n\n\n\n\n                           Cure Period\n                          \n\n\n                            Indicates when changes to the key result will no longer be tracked.\n                           \n\n\n\n\n                           Tags\n                          \n\n\n                            A comma-separated list of tags associated with objective.\n                           \n\n\n\n\n                           Tag Categories\n                          \n\n\n                            A comma-separated list of tags associated with objective.\n                           \n\n\n\n\n                           Created Date\n                          \n\n\n                            The date the objective was created.\n                           \n\n\n\n\n                           Creator ID\n                          \n\n\n                            The ID of the user who created the objective.\n                           \n\n\n\n\n                           Modified Date\n                          \n\n\n                            The date/time the objective was last modified. If the objective has not been modified, this will be the date and time the objective was originally created.\n                           \n\n\n\n\n                           Modifier ID\n                          \n\n\n                            The ID of the user who modified the key result. If the objective has not been modified, this will be the ID of the user who created the it.\n                           \n\n\n\n\n                           Owners\n                          \n\n\n\n                             A comma-separated list of the ID and Type of the user or group that owns the key result.\n                            \n\n\n\n                             For example, if user ID 12345678 owns the objective, the field will contain the value 12345678:USER.\n                            \n\n\n\n                             If group 54231564 owns the key result, the field will contain the value 54231564:GROUP.\n                            \n\n\n\n\n\n\n                            _BATCH_ID_\n                           \n\n\n\n                            An incremental batch number representing each DataSet update.\n                           \n\n\n\n\n\n                            _BATCH_LAST_RUN_\n                           \n\n\n\n                            The date and time that the DataSet was last run.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        People DataSet\n                       \n\n                        If any of the \"personal information\" fields (name, email, location, etc.) return blank in this DataSet, you can fill in the missing information in the user's Profile page or their page in\n                        \n                         Admin Settings > People\n                        \n                        . For more information, see\n                        \n                         Specifying Your Personal Profile Information\n                        \n                        .\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Department\n                          \n\n                           The user's department within your organization.\n                          \n\n\n\n                           Display Name\n                          \n\n                           The name used to represent the user within Domo.\n                          \n\n\n\n                           Role\n                          \n\n                           The user's role within your organization.\n                          \n\n\n\n                           Title\n                          \n\n                           The user's title within your organization.\n                          \n\n\n\n                           Email\n                          \n\n                           The user's email address.\n                          \n\n\n\n                           Alternate Email\n                          \n\n                           The user's alternate email address.\n                          \n\n\n\n                           Phone Number\n                          \n\n                           The user's personal phone number.\n                          \n\n\n\n                           Desk Phone Number\n                          \n\n                           The user's desk phone number.\n                          \n\n\n\n                           Employee Number\n                          \n\n                           The user's employee number within your organization.\n                          \n\n\n\n                           Location\n                          \n\n                           The company location the user has been assigned to.\n                          \n\n\n\n                           Locale\n                          \n\n                           UNDER CONSTRUCTION\n                          \n\n\n\n                           Timezone\n                          \n\n                           The user's time zone.\n                          \n\n\n\n                           Role ID\n                          \n\n                           A Domo-generated ID for a specific role.\n                          \n\n\n\n                           User ID\n                          \n\n                           A Domo-generated user ID for each person.\n                          \n\n\n\n                           Last Login\n                          \n\n                           A timestamp for the last time this user logged in. Login is measured by any regular, SSO, or mobile login. To count as a login for mobile, a person must actually log out of the instance and log back in. Opening and closing the app does not count as a login.\n                          \n\n\n\n                           Password Created\n                          \n\n                           A timestamp for when a user's password was created. This gets updated when the password is updated.\n                          \n\n\n\n                           Account Locked\n                          \n\n                           Returns a \"True\" value if the account is locked.\n                          \n\n\n\n                           Profile Picture\n                          \n\n                           Returns a \"True\" value if a profile picture has been added in the user's Profile page or on his/her page in\n                           \n                            Admin Settings > Governance > People\n                           \n                           .\n                          \n\n\n\n                           Org Chart\n                          \n\n                           Returns a \"True\" value if the user has been added as a report on their company org chart in the Profile page.\n                          \n\n\n\n                           Two Factor Enabled\n                          \n\n                           Returns a \"True\" value if the company has enabled two-factor authentication as an option in\n                           \n                            Admin Settings > Authentication > Authentication\n                           \n                           and the user has chosen to have two-factor enabled in their Settings menu (available via clicking the Gear menu under their profile picture).\n                          \n\n\n\n                           Created Date\n                          \n\n                           A timestamp for the date the user was added to the system.\n                          \n\n\n\n                           Last Updated Date\n                          \n\n                           A timestamp for the date the user's information was last updated.\n                          \n\n\n\n\n\n\n                        Project Stages DataSet\n                       \n\n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Priority\n                          \n\n                           Defines the order in which the lists or stages are shown. Smaller numbers are on the left.\n                          \n\n\n\n                           Project_id\n                          \n\n                           ID number for the project.\n                          \n\n\n\n                           Project_name\n                          \n\n                           Name of the project.\n                          \n\n\n\n                           List_name\n                          \n\n                           Name of the list.\n                          \n\n\n\n                           List_type\n                          \n\n                           Type of the list.\n                          \n\n\n\n                           Project_list_id\n                          \n\n                           ID number of the list.\n                          \n\n\n\n                           Created\n                          \n\n                           Person who created the project.\n                          \n\n\n\n                           Updated\n                          \n\n                           The time when the list was last edited (e.g. moved, renamed, etc.).\n                          \n\n\n\n                           Active\n                          \n\n                           Returns \"True\" if the list or stage hasn't been archived.\n                          \n\n\n\n\n\n\n                        Projects DataSet\n                       \n\n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Created_by_user\n                          \n\n                           The person who created the project.\n                          \n\n\n\n                           Project_id\n                          \n\n                           The ID number for the project.\n                          \n\n\n\n                           Created\n                          \n\n                           Project creation date and time.\n                          \n\n\n\n                           DueDate\n                          \n\n                           Due date for the project.\n                          \n\n\n\n                           Created_by\n                          \n\n                           User ID of the person who created the project.\n                          \n\n\n\n                           Project_name\n                          \n\n                           Name of the project.\n                          \n\n\n\n                           Description\n                          \n\n                           Description for the project, if one has been specified.\n                          \n\n\n\n                           Active\n                          \n\n                           Returns \"True\" if the project is currently viewable.\n                          \n\n\n\n                           Deleted\n                          \n\n                           Returns \"True\" if the project has been deleted.\n                          \n\n\n\n\n\n\n                        Task Owners DataSet\n                       \n\n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           ProjectTaskName\n                          \n\n                           Name of the task.\n                          \n\n\n\n                           ProjectName\n                          \n\n                           Name of the parent project for the task.\n                          \n\n\n\n                           ProjectListId\n                          \n\n                           ID number of the list in which the task is found.\n                          \n\n\n\n                           ProjectListName\n                          \n\n                           Name of the list in which the task is found.\n                          \n\n\n\n                           ProjectListType\n                          \n\n                           Type of list in which the task is found.\n                          \n\n\n\n                           ProjectTaskID\n                          \n\n                           ID number for the task.\n                          \n\n\n\n                           ProjectID\n                          \n\n                           ID number for the parent project of the task.\n                          \n\n\n\n                           Created\n                          \n\n                           Date and time the task was created.\n                          \n\n\n\n                           AssignedBy\n                          \n\n                           ID number of the person who assigned the task.\n                          \n\n\n\n                           AssignedByName\n                          \n\n                           Name of the person who assigned the task.\n                          \n\n\n\n                           AssignedTo\n                          \n\n                           ID number of the person the task has been assigned to.\n                          \n\n\n\n                           AssignedToName\n                          \n\n                           Name of the person the task has been assigned to.\n                          \n\n\n\n\n\n\n                        Tasks DataSet\n                       \n\n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           DueDate\n                          \n\n                           Due date for the task.\n                          \n\n\n\n                           Project_id\n                          \n\n                           ID number for the parent project for the task.\n                          \n\n\n\n                           ProjectListId\n                          \n\n                           ID number of the list the task is found in.\n                          \n\n\n\n                           ProjectListName\n                          \n\n                           Name of the list the task is found in.\n                          \n\n\n\n                           ProjectListType\n                          \n\n                           Type of the list the task is found in.\n                          \n\n\n\n                           ProjectTaskId\n                          \n\n                           ID number for the task.\n                          \n\n\n\n                           ProjectTaskName\n                          \n\n                           Name of the task.\n                          \n\n\n\n                           Created\n                          \n\n                           Date and time the task was created.\n                          \n\n\n\n                           Updated\n                          \n\n                           Date and time the task was last updated.\n                          \n\n\n\n                           ProjectName\n                          \n\n                           Name of the parent project for the task.\n                          \n\n\n\n                           CreatedBy\n                          \n\n                           User ID of the person who created the task.\n                          \n\n\n\n                           CreatedByName\n                          \n\n                           Name of the person who created the task.\n                          \n\n\n\n                           Owner\n                          \n\n                           The ID number for the task owner. The task owner is the creator by default, but can be changed to anyone in the instance.\n                          \n\n\n\n                           OwnerName\n                          \n\n                           The name of the person who created the task. In the case that the original owner reassigned ownership, then it is the name of the new owner.\n                          \n\n\n\n                           Priority\n                          \n\n                           The order in which the task shows up on the task board. Lower priority numbers are above higher priority numbers.\n                          \n\n\n\n                           Active\n                          \n\n                           Returns \"True\" if the task hasn't been archived.\n                          \n\n\n\n                           Description\n                          \n\n                           The description of the task, if one has been specified.\n                          \n\n\n\n                           Contributors\n                          \n\n                           Individuals assigned to work on the task.\n                          \n\n\n\n\n\n\n                        Workbench DataSet\n                       \n\n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n\n                             Workbench Agent\n                            \n\n\n\n\n\n                             The name of the machine running the Workbench job.\n                            \n\n\n\n\n\n\n\n                             Owner ID\n                            \n\n\n\n\n\n                             The ID number of the owner of the job.\n                            \n\n\n\n\n\n\n\n                             DataSet ID\n                            \n\n\n\n\n\n                             ID for the DataSet.\n                            \n\n\n\n\n\n\n\n                             DataSet Name\n                            \n\n\n\n\n\n                             Name of the DataSet.\n                            \n\n\n\n\n\n\n\n                             Job Name\n                            \n\n\n\n\n\n                             Name of the job.\n                            \n\n\n\n\n\n\n\n                             Job Status\n                            \n\n\n\n\n\n                             Status of the job (success, fail, etc.)\n                            \n\n\n\n\n\n\n\n                             Created Date\n                            \n\n\n\n\n\n                             Date the job was created.\n                            \n\n\n\n\n\n\n\n                             Last Run\n                            \n\n\n\n\n\n                             When the job ran last.\n                            \n\n\n\n\n\n\n\n                             Next Run\n                            \n\n\n\n\n\n                             When the job will run again.\n                            \n\n\n\n\n\n\n\n                             Last Successful Run\n                            \n\n\n\n\n\n                             When the job ran last successfully.\n                            \n\n\n\n\n\n\n\n                             Update Method\n                            \n\n\n\n\n\n                             How it updates the DataSet (Append, Replace, etc.)\n                            \n\n\n\n\n\n\n\n                             Rows Updated\n                            \n\n\n\n\n\n                             The number of rows that were updated.\n                            \n\n\n\n\n\n\n\n                             Schedule Type\n                            \n\n\n\n\n\n                             Shows the schedule type (Manual Schedule, Custom Schedule, etc.)", "Preview Article": "Click here to preview", "URL Name": "360043433813", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003534", "Archived Date": "", "Language": "English", "Primary Version": "DomoStats Connector", "Article Total View Count": "5,791", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              DomoStats Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}