{"file_path": "../../raw_kb_v2\\article\\360044289573\\index.html", "content": {"Title": "Supported Functions in Magic ETL", "Article Body": "Intro\n                       \n\n                        You can use this reference guide to learn about supported functions in the Add Formula and Group By tiles in Magic ETL.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            There are significant behavioral differences in Magic ETL. Read the\n                            \n\n                              Behavior Changes and Feature Updates in Magic ETL\n                             \n\n                            article before converting mission-critical Magic ETL DataFlows.\n                            \n                             Failure to do so may risk an unintended change to your DataFlow’s behavior.\n                            \n\n\n\n\n\n\n                        Supported Functions\n                       \n\n                        The following sections give examples of the available functions that can be used inside of Magic ETL. However, for a complete list you will need to refer to the Functions list inside of the Formula Editor as seen here:\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           While the Formula Editor looks similar to the Beast Mode editor, they are not the same. You can copy any Beast Mode you have made into the Formula Editor and it will work, but not all of the functions allowed in the Formula Editor will work inside of a Beast Mode. This is due to the increased processing power available to DataFlows versus Analyzer.\n                          \n\n\n\n\n                        Aggregate Functions\n                       \n\n\n\n\n\n\n                             Function Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            APPROXIMATE COUNT (DISTINCT)\n                           \n\n\n\n                            Returns the approximate count of a number of unique values in a column.\n                           \n\n\n\n                            APPROXIMATE_COUNT_DISTINCT(X)\n                           \n\n\n\n\n\n                            CORR\n                           \n\n\n\n                            Returns the correlation coefficient of independent variable x and dependent variable y. It is computed for non-null pairs of values only.\n                            \n\n                            For non-null data, it is equivalent to: COVAR_POP(y, x) / (STDDEV_POP(x) * STDDEV_POP(y)).\n                            \n\n                            It is an aggregate function.\n                            \n\n                            VAR_POP() returns NULL if there were no matching rows.\n                           \n\n\n\n                            CORR(x,y)\n                           \n\n\n\n\n\n                            COUNT\n                           \n\n\n\n                            Returns a count of the number of non-NULL values of expr. The result is an integer value. It is an aggregate function.\n                           \n\n                            COUNT(*) counts the total number of rows.\n                           \n\n                            COUNT() returns 0 if there were no matching rows.\n                           \n\n\n\n                            COUNT(expr)\n                           \n\n\n\n\n\n                            COVAR_POP\n                           \n\n\n\n                            Returns the population covariance of independent variable x and dependent variable y. It is computed for non-null pairs of values only.\n                            \n\n                            For non-null data, it is equivalent to: (SUM(x*y) - SUM(x) * SUM(y) / COUNT(*)) / COUNT(*).\n                            \n\n                            It is an aggregate function.\n                            \n\n                            VAR_POP() returns NULL if there were no matching rows.\n                           \n\n\n\n                            COVAR_POP(x,y)\n                           \n\n\n\n\n\n                            COVAR_SAMP\n                           \n\n\n\n                            Returns the sample covariance of independent variable x and dependent variable y; the denominator is the sample size minus one. It is computed for non-null pairs of values only.\n                            \n\n                            For non-null data, it is equivalent to: (SUM(x*y) - SUM(x) * SUM(y) / COUNT(*)) / (COUNT(*) - 1).\n                            \n\n                            It is an aggregate function.\n                            \n\n                            VAR_POP() returns NULL if there were no matching rows.\n                           \n\n\n\n                            COVAR_SAMP(x,y)\n                           \n\n\n\n\n\n                            FIRST_NON_NULL_VALUE\n                           \n\n\n\n                            Returns the first non-null value in expr, or NULL if no non-NULL values were found. It is an aggregate function.\n                           \n\n\n\n                            FIRST_NON_NULL_VALUE(expr)\n                           \n\n\n\n\n\n                            FIRST_VALUE\n                           \n\n\n\n                            Returns the first value in expr, including NULL. It is an aggregate function.\n                           \n\n\n\n                            FIRST_VALUE(expr)\n                           \n\n\n\n\n\n                            LAST_NON_NULL_VALUE\n                           \n\n\n\n                            Returns the last non-null value in expr, or NULL if no non-NULL values were found. It is an aggregate function.\n                           \n\n\n\n                            LAST_NON_NULL_VALUE(expr)\n                           \n\n\n\n\n\n                            LAST_VALUE\n                           \n\n\n\n                            Returns the last value in expr, including NULL. It is an aggregate function.\n                           \n\n\n\n                            LAST_VALUE(expr)\n                           \n\n\n\n\n\n                            MAX\n                           \n\n\n\n                            Returns the largest, or maximum, value of expr. MAX() can also take a string argument in which case it returns the maximum string value.\n                           \n\n\n\n                            It is an aggregate function.\n                           \n\n\n\n                            MAX() returns NULL if there were no matching rows.\n                           \n\n\n\n                            MAX(expr)\n                           \n\n\n\n\n\n                            MEDIAN\n                           \n\n\n\n                            Returns the estimated median value of expr. It is an aggregate function.\n                           \n\n\n\n                            MEDIAN(expr)\n                           \n\n\n\n\n\n                            MIN\n                           \n\n\n\n                            Returns the smallest, or minimum, value of expr. MIN() can also take a string argument in which case it returns the minimum string value.\n                           \n\n\n\n                            It is an aggregate function.\n                           \n\n\n\n                            MIN() returns NULL if there were no matching rows.\n                           \n\n\n\n                            MIN(expr)\n                           \n\n\n\n\n\n                            PERCENTILE\n                           \n\n\n\n                            Returns the ntile percentile of expr. It is an aggregate function.\n                           \n\n\n\n                            PERCENTILE(expr, ntile)\n                           \n\n\n\n\n\n                            STD\n                           \n\n\n\n                            STD() is a synonym for STDDEV_SAMP().\n                           \n\n\n\n                            STD(expr)\n                           \n\n\n\n\n\n                            STDDEV\n                           \n\n\n\n                            STDDEV() is a synonym for STDDEV_SAMP().\n                           \n\n\n\n                            STDDEV(expr)\n                           \n\n\n\n\n\n                            STDDEV_POP\n                           \n\n\n\n                            Returns the population standard deviation of expr (the square root of VAR_POP()).\n                           \n\n                            It is an aggregate function.\n                           \n\n                            STDDEV_POP() returns NULL if there were no matching rows.\n                           \n\n\n\n                            STDDEV_POP(expr)\n                           \n\n\n\n\n\n                            STDDEV_SAMP\n                           \n\n\n\n                            Returns the sample standard deviation of expr (the square root of VAR_SAMP()).\n                           \n\n                            It is an aggregate function.\n                           \n\n                            STDDEV_POP() returns NULL if there were no matching rows.\n                           \n\n\n\n                            STDDEV_SAMP(expr)\n                           \n\n\n\n\n\n                            SUM\n                           \n\n\n\n                            Returns the sum of expr. If the return set has no rows, SUM() returns NULL.\n                           \n\n                            It is an aggregate function.\n                           \n\n\n\n                            SUM(expr)\n                           \n\n\n\n\n\n                            VAR_POP\n                           \n\n\n\n                            Returns the population standard variance of expr. It considers rows as the whole population, not as a sample, so it has the number of rows as the denominator.\n                           \n\n                            Variance is calculated by working out the mean for the set for each number, subtracting the mean and squaring the result, and finally calculating the average of the resulting differences\n                           \n\n                            It is an aggregate function.\n                           \n\n                            VAR_POP() returns NULL if there were no matching rows.\n                           \n\n\n\n                            VAR_POP(expr)\n                           \n\n\n\n\n\n                            VAR_SAMP\n                           \n\n\n\n                            Returns the sample standard variance of expr. The denominator is the number of rows minus one.\n                           \n\n                            Variance is calculated by working out the mean for the set for each number, subtracting the mean and squaring the result, and finally calculating the average of the resulting differences.\n                           \n\n                            It is an aggregate function.\n                           \n\n                            VAR_POP() returns NULL if there were no matching rows.\n                           \n\n\n\n                            VAR_SAMP(expr)\n                           \n\n\n\n\n\n                            VARIANCE\n                           \n\n\n\n                            VARIANCE() is a synonym for VAR_SAMP().\n                           \n\n\n\n                            VARIANCE(expr)\n                           \n\n\n\n\n\n                            VARIANCE_POP\n                           \n\n\n\n                            VARIANCE_POP() is a synonym for VAR_POP().\n                           \n\n\n\n                            VARIANCE_POP(expr)\n                           \n\n\n\n\n\n                            VARIANCE_SAMP\n                           \n\n\n\n                            VARIANCE_SAMP() is a synonym for VAR_SAMP().\n                           \n\n\n\n                            VARIANCE_SAMP(expr)\n                           \n\n\n\n\n\n\n\n                        Numeric Functions\n                       \n\n\n\n\n\n\n                             Function Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            ABS\n                           \n\n\n\n                            Returns the absolute (non-negative) value of X. If X is not a number, it is converted to a numeric type.\n                           \n\n\n\n                            ABS(X)\n                           \n\n\n\n\n\n                            ACOS\n                           \n\n\n\n                            Returns the arc cosine of X, that is, the value whose cosine is X. Returns NaN if X is not in the range -1 to 1.\n                           \n\n\n\n                            ACOS(X)\n                           \n\n\n\n\n\n                            ASIN\n                           \n\n\n\n                            Returns the arc sine of X, that is, the value whose sine is X. Returns NaN if X is not in the range -1 to 1.\n                           \n\n\n\n                            ASIN(X)\n                           \n\n\n\n\n\n                            ATAN\n                           \n\n\n\n                            Returns the arc tangent of X, that is, the value whose tangent is X.\n                           \n\n\n\n                            ATAN(X)\n                           \n\n\n\n\n\n                            ATAN2\n                           \n\n\n\n                            Returns the arc tangent of the two variables X and Y. It is similar to calculating the arc tangent of Y / X, except that the signs of both arguments are used to determine the quadrant of the result.\n                           \n\n\n\n                            ATAN2(Y,X)\n                           \n\n\n\n\n\n                            AVG\n                           \n\n\n\n                            Returns the average value of expr. NULL values are ignored. It is an aggregate function.\n                           \n\n                            AVG() returns NULL if there were no matching rows.\n                           \n\n\n\n                            AVG(expr)\n                           \n\n\n\n\n\n                            CBRT\n                           \n\n\n\n                            Returns the cube root of X. If X is negative, NaN is returned.\n                           \n\n\n\n                            CBRT(X)\n                           \n\n\n\n\n\n                            CEIL\n                           \n\n\n\n                            Returns the smallest integer value not less than X. Alias for CEILING().\n                           \n\n\n\n                            CEIL(X)\n                           \n\n\n\n\n\n                            CEILING\n                           \n\n\n\n                            Returns the smallest integer value not less than X.\n                           \n\n\n\n                            CEILING(X)\n                           \n\n\n\n\n\n                            CONV\n                           \n\n\n\n                            Converts numbers between different number bases. Returns a string representation of the number N, converted from base from_base to base to_base.\n                           \n\n\n\n                            CONV(N,from_base,to_base)\n                           \n\n\n\n\n\n                            CONVERT_UNIT\n                           \n\n\n\n                            Converts expr from from_unit to to_unit. expr will be converted to type DOUBLE if it is not already, and the result always has type DOUBLE.\n                           \n\n                            from_unit and to_unit are strings describing conmensurable units in English, e.g. ''cubic feet'' and ''liters'', or ''mph'' and ''m/s''. Unit strings follow these rules:\n                           \n\n                            1. Most SI (Metric) and Imperial units are supported. Imperial units are defined in terms of their SI counterparts. Imperial units of length, area, and mass/weight are mostly agreed upon internationally; the ton is an exception. Units of volume, like the gallon, also differ between the UK and the USA. When such differences arise, USA customary values (e.g. the short ton; 2000 avoirdupois pounds) are used.\n                           \n\n                            2. Units may be written out in full, and optionally pluralized. Metric units may have metric prefixes, and computing units may have metric or binary prefixes. Examples: ''feet'', ''year'', ''kilowatt'', ''megabyte'', ''mebibyte''\n                           \n\n                            3. Units may be abbreviated. Metric and binary prefixes on abbreviated units must also be abbreviated. Abbreviated units are case-sensitive. Examples: ''mi'' (miles), ''KiBps'' (kibibytes per second), ''uPa'' (micropascals)\n                           \n\n                            4. Units may be exponentiated using the caret ''^'' or by ending a unit's name with a number. Exponents may be negative to indicate inversion of the unit. Units may also be prefixed with ''cu''/''cubic'' or ''sq''/''square'', followed by a space '' '' or hyphen ''-'', which are equivalent to the exponents ''3'' and ''2'', respectively. Examples: ''sq ft'' (square feet), ''m3'' (cubic meters), ''s^-1'' (inverse seconds; hertz)\n                           \n\n                            5. Units may be divided using the forward slash ''/'' character or the word '' per ''. Examples: ''miles per hour'', ''metres/second/second'' (meters per second squared; acceleration)\n                           \n\n                            6. Units may be multiplied using the asterisk ''*'' or by being combined with a hyphen ''-'' or space. The asterisk follows normal multiplication order of operations, while the hyphen or space form have the highest precedence, as though the combined units were a single unit name. Examples: ''N*m'' (newton meters; joules), ''half-gal'' (half gallons), ''kilogram-meters/second2'' (kilogram meters per second squared; newtons)\n                           \n\n                            7. Parentheses may be used to affect the order of operations of exponentiation, multiplication, and division. Examples: ''(m/s)^2'' (meters squared per second squared; acceleration of area)\n                           \n\n                            8. Units whose names or abbreviations consist of more than one word can be written with an underscore ''_'' separator or simply without the space. Examples: ''fluid_ounce'', ''floz'' (fluid ounce), ''poundforce'', ''astronomical_unit''\n                           \n\n                            Units must be conmensurable to be converted; they must have the same dimensions. There are five supported dimensional values: Time, length, mass, electric current, and information. Units may have a positive, negative, or zero number of dimensions in any of these values. Some units have zero dimensions in all categories; these units are raw quantities like ''dozen'' or ''half''. ''meters / second'' has one positive length dimension, and one negative time dimension; it is a unit of velocity. The ''gallon'' has three positive length dimensions; it is a unit of volume. These can be converted to ''miles / hour'' and ''cubic inches'', respectively, because they have the same dimensions. Attempting to convert between units that have different dimensions, like from ''seconds'' to ''miles'', results in an error.\n                           \n\n                            Note that due to the nature of DOUBLE arithmetic, results may appear inexact. The ROUND() function may be used to correct results in these cases.\n                           \n\n\n\n                            CONVERT_UNIT(expr,from_unit,to_unit)\n                           \n\n\n\n\n\n                            COS\n                           \n\n\n\n                            Returns the cosine of X, where X is given in radians.\n                           \n\n\n\n                            COS(X)\n                           \n\n\n\n\n\n                            COSH\n                           \n\n\n\n                            Returns the hyperbolic cosine of X.\n                           \n\n\n\n                            COSH(X)\n                           \n\n\n\n\n\n                            COT\n                           \n\n\n\n                            Returns the cotangent of X.\n                           \n\n\n\n                            COT(X)\n                           \n\n\n\n\n\n                            CRC32\n                           \n\n\n\n                            Computes a cyclic redundancy check value and returns a 32-bit unsigned value. The result is NULL if the argument is NULL. The argument is expected to be a string and (if possible) is treated as one if it is not.\n                           \n\n\n\n                            CRC32(expr)\n                           \n\n\n\n\n\n                            DECIMAL\n                           \n\n\n\n                            Returns the value of expr converted to a fixed-precision DECIMAL type.\n                           \n\n\n\n                            DECIMAL(expr), CAST(expr AS DECIMAL)\n                           \n\n\n\n\n\n                            DEGREES\n                           \n\n\n\n                            Returns the argument X, converted from radians to degrees.\n                           \n\n                            This is the converse of the RADIANS() function.\n                           \n\n\n\n                            DEGREES(X)\n                           \n\n\n\n\n\n                            DISTANCE\n                           \n\n\n\n                            Returns the kilometer distance between two points on the WGS-84 model of Earth, given as degrees longitude and latitude. Vincenty's formulae are used to calculate the distance.\n                           \n\n\n\n                            DISTANCE(lat0, lon0, lat1, lon1)\n                           \n\n\n\n\n\n                            DISTANCEV\n                           \n\n\n\n                            DISTANCEV() is a synonym for DISTANCE(). Both use the slower but more accurate Vincenty method.\n                           \n\n\n\n                            DISTANCEV(lat0, lon0, lat1, lon1)\n                           \n\n\n\n\n\n                            DOUBLE\n                           \n\n\n\n                            Returns the value of expr converted to a floating-point DOUBLE type.\n                           \n\n\n\n                            DOUBLE(expr), CAST(expr AS DOUBLE)\n                           \n\n\n\n\n\n                            E\n                           \n\n\n\n                            Returns the value of e (Euler's number) as a double-precision floating point.\n                           \n\n\n\n                            E()\n                           \n\n\n\n\n\n                            EXP\n                           \n\n\n\n                            Returns the value of e (the base of natural logarithms) raised to the power of X. The inverse of this function is LOG() (using a single argument only) or LN().\n                           \n\n                            If X is NULL, this function returns NULL.\n                           \n\n\n\n                            EXP(X)\n                           \n\n\n\n\n\n                            FINITE\n                           \n\n\n\n                            Returns TRUE if expr is a finite number, NULL if it is NULL, or FALSE if it is NaN, Infinity, or -Infinity.\n                           \n\n\n\n                            FINITE(expr)\n                           \n\n\n\n\n\n                            FLOOR\n                           \n\n\n\n                            Returns the largest integer value not greater than X.\n                           \n\n\n\n                            FLOOR(X)\n                           \n\n\n\n\n\n                            INFINITY\n                           \n\n\n\n                            Returns the floating point representation of infinity.\n                           \n\n\n\n                            INF(), INFINITY()\n                           \n\n\n\n\n\n                            LN\n                           \n\n\n\n                            Returns the natural logarithm of X; that is, the base-e logarithm of X. If X is less than or equal to 0, or NULL, then NULL is returned.\n                           \n\n                            The inverse of this function is EXP().\n                           \n\n\n\n                            LN(X)\n                           \n\n\n\n\n\n                            LOG\n                           \n\n\n\n                            If called with one parameter, this function returns the natural logarithm of X. If X is less than or equal to 0, then NULL is returned.\n                           \n\n                            If called with two parameters, it returns the logarithm of X to the base B. If B is <= 1 or X <= 0, the function returns NULL.\n                           \n\n                            If any argument is NULL, the function returns NULL.\n                           \n\n                            The inverse of this function (when called with a single argument) is the EXP() function.\n                           \n\n\n\n                            LOG(X), LOG(B,X)\n                           \n\n\n\n\n\n                            LOG10\n                           \n\n\n\n                            Returns the base-10 logarithm of X.\n                           \n\n\n\n                            LOG10(X)\n                           \n\n\n\n\n\n                            LOG2\n                           \n\n\n\n                            Returns the base-2 logarithm of X.\n                           \n\n\n\n                            LOG2(X)\n                           \n\n\n\n\n\n                            LONG\n                           \n\n\n\n                            Returns the value of expr converted to a LONG type integer.\n                           \n\n\n\n                            LONG(expr), CAST(expr AS LONG)\n                           \n\n\n\n\n\n                            LONG_MAX\n                           \n\n\n\n                            Returns the value -(2^63) as an integer. This is the smallest value that the type LONG can represent.\n                           \n\n\n\n                            LONG_MAX()\n                           \n\n\n\n\n\n                            LONG_MIN\n                           \n\n\n\n                            Returns the value 2^63 - 1 as an integer. This is the largest value that the type LONG can represent.\n                           \n\n\n\n                            LONG_MIN()\n                           \n\n\n\n\n\n                            MOD\n                           \n\n\n\n                            Modulo operation. Returns the remainder of N divided by M.\n                           \n\n\n\n                            MOD(N,M), N % M\n                           \n\n\n\n\n\n                            NAN\n                           \n\n\n\n                            Returns the floating point representation of NaN (not-a-number).\n                           \n\n\n\n                            NAN()\n                           \n\n\n\n\n\n                            NEGATIVE_INFINITY\n                           \n\n\n\n                            Returns the floating point representation of negative infinity.\n                           \n\n\n\n                            NEGINF(), NEGATIVE_INFINITY()\n                           \n\n\n\n\n\n                            PI\n                           \n\n\n\n                            Returns the value of π (pi) as a double-precision floating point.\n                           \n\n\n\n                            PI()\n                           \n\n\n\n\n\n                            POW\n                           \n\n\n\n                            Returns the value of X raised to the power of Y.\n                           \n\n\n\n                            POW(X,Y)\n                           \n\n\n\n\n\n                            POWER\n                           \n\n\n\n                            This is a synonym for POW(), which returns the value of X raised to the power of Y.\n                           \n\n\n\n                            POWER(X,Y)\n                           \n\n\n\n\n\n                            RADIANS\n                           \n\n\n\n                            Returns the argument X, converted from degrees to radians. Note that π radians equals 180 degrees.\n                           \n\n                            This is the converse of the DEGREES() function.\n                           \n\n\n\n                            RADIANS(X)\n                           \n\n\n\n\n\n                            RAND\n                           \n\n\n\n                            Returns a random DOUBLE precision floating point value v in the range 0 <= v < 1.0. If a constant integer argument N is specified, it is used as the seed value, which produces a repeatable sequence of column values.\n                           \n\n\n\n                            RAND(), RAND(N)\n                           \n\n\n\n\n\n                            ROUND\n                           \n\n\n\n                            Rounds the argument X to D decimal places. D defaults to 0 if not specified.\n                           \n\n\n\n                            ROUND(X), ROUND(X,D)\n                           \n\n\n\n\n\n                            RPAD\n                           \n\n\n\n                            Returns the string str, right-padded with the string padstr to a length of len characters. If str is longer than len, the return value is shortened to len characters.\n                           \n\n\n\n                            RPAD(str, len, padstr)\n                           \n\n\n\n\n\n                            RTRIM\n                           \n\n\n\n                            Returns the string str with trailing space characters removed.\n                           \n\n\n\n                            RTRIM(str)\n                           \n\n\n\n\n\n                            SIGN\n                           \n\n\n\n                            Returns the sign of the argument as -1, 0, or 1, depending on whether X is negative, zero, or positive.\n                           \n\n\n\n                            SIGN(X)\n                           \n\n\n\n\n\n                            SIN\n                           \n\n\n\n                            Returns the sine of X, where X is given in radians.\n                           \n\n\n\n                            SIN(X)\n                           \n\n\n\n\n\n                            SINH\n                           \n\n\n\n                            Returns the hyperbolic sine of X.\n                           \n\n\n\n                            SINH(X)\n                           \n\n\n\n\n\n                            SQRT\n                           \n\n\n\n                            Returns the square root of X. If X is negative, NaN is returned.\n                           \n\n\n\n                            SQRT(X)\n                           \n\n\n\n\n\n                            TAN\n                           \n\n\n\n                            Returns the tangent of X, where X is given in radians.\n                           \n\n\n\n                            TAN(X)\n                           \n\n\n\n\n\n                            TANH\n                           \n\n\n\n                            Returns the hyperbolic tangent of X.\n                           \n\n\n\n                            TANH(X)\n                           \n\n\n\n\n\n                            TRUNCATE\n                           \n\n\n\n                            Returns the number X, truncated to D decimal places. If D is 0, the result has no decimal point or fractional part.\n                           \n\n\n\n                            TRUNCATE(X,D)\n                           \n\n\n\n\n\n                            WIDTH_BUCKET\n                           \n\n\n\n                            Divides the range [min, max) into equal-width buckets and returns the number of the bucket into which expr falls. Buckets are numbered from 1 to N, where N is the number of buckets. Values that fall outside the range are put in overflow buckets with numbers 0 and N + 1.\n                           \n\n                            Be aware that bucket ranges are inclusive of their minimum bound and exclusive of their maximum bound. So WIDTH_BUCKET(100, 0, 100, 4) = 5, the overflow bucket. Also note that min may be less than max, in which case bucket minimums are larger than bucket maximums. So WIDTH_BUCKET(100, 100, 0, 4) = 1, the first bucket.\n                           \n\n\n\n                            WIDTH_BUCKET(expr, min, max, bucket_count)\n                           \n\n\n\n\n\n\n\n                        Statistical Functions\n                       \n\n\n\n\n\n\n                             Function Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            ANOVAF\n                           \n\n\n\n                            Returns the F-value of a one-way Analysis of Variance of the samples. At least two samples must be provided, and each sample must have at least two non-null values. Note that a one-way ANOVA on two samples is equivalent to the Student's t-test (see the TTEST function).\n                           \n\n                            See also: ANOVAP()\n                           \n\n\n\n                            ANOVAF(sample1,sample2[,sample3[,...,sampleN]])\n                           \n\n\n\n\n\n                            ANOVAP\n                           \n\n\n\n                            Returns the p-value of a one-way Analysis of Variance of the samples. At least two samples must be provided, and each sample must have at least two non-null values. Note that a one-way ANOVA on two samples is equivalent to the Student's t-test (see the TTEST function).\n                           \n\n                            See also: ANOVAF()\n                           \n\n\n\n                            ANOVAP(sample1,sample2[,sample3[,...,sampleN]])\n                           \n\n\n\n\n\n                            TTEST\n                           \n\n\n\n                            Returns the p-value result of a Student's t-test. Arguments sample1 and sample2 are two numeric columns with at least 2 non-null values each. The tails argument is either 1 or 2, indicating a one- or two-tailed test. The type argument is a number 1 through 3. Type 1 is a paired sample test; for this type of test, values in both sample1 and sample2 must be non-null or be ignored. Type 2 is for two samples with the assumption of equal variance. Type 3 is for two samples without the assumption of equal variance.\n                           \n\n\n\n                            TTEST(sample1,sample2,tails,type)\n                           \n\n\n\n\n\n\n\n                        Financial Functions\n                       \n\n\n\n\n\n\n                             Function Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            FV\n                           \n\n\n\n                            Calculates the future value of an investment based on these arguments:\n                           \n\n                            rate (required): The interest rate per period, expressed as a ratio (e.g. 1% is 0.01).\n                           \n\n                            nper (required): The total number of periods.\n                           \n\n                            pmt (required): The payment made each period. Can be zero.\n                           \n\n                            pv (optional): The present value; how much the investment is worth right now.\n                           \n\n                            type (optional): 0/FALSE or 1/TRUE, with 0 indicating that payments are made at the end of each period, and 1 indicating they are paid at the beginning. If not specified, 0 is used.\n                           \n\n                            NOTE: Unlike spreadsheet syntax, interest rates cannot be expressed as a percent. They must be expressed as a ratio (usually between 0 and 1).\n                           \n\n                            See also: PV(), PMT(), RATE(), and NPER().\n                           \n\n\n\n                            FV(rate,nper,pmt[,pv[,type]])\n                           \n\n\n\n\n\n                            IRR\n                           \n\n\n\n                            Calculates the per-period Internal Rate of Return for a set of periodic transactions. ''guess'' is a best guess of the rate of return. It is optional and the default is 0.1, meaning 10%. It is usually not necessary to specify this value.\n                           \n\n                            IRR is an aggregate function.\n                           \n\n\n\n                            IRR(values[,guess])\n                           \n\n\n\n\n\n                            NPV\n                           \n\n\n\n                            Calculates the Net Present Value for a set of periodic transactions. NPV is an aggregate function.\n                           \n\n\n\n                            NPV(rate,values)\n                           \n\n\n\n\n\n                            PMT\n                           \n\n\n\n                            Calculates the number of periods for an investment based on constant interest rate, payments, and period duration. Arguments:\n                           \n\n                            rate (required): The interest rate per period, expressed as a ratio (e.g. 1% is 0.01).\n                           \n\n                            pv (required): The present value of the loan; the \"principal\".\n                           \n\n                            fv (optional): The future value; the balance at the end of the entire annuity. If omitted, it is assumed to be 0 (e.g. a loan paid in full).\n                           \n\n                            type (optional): 0/FALSE or 1/TRUE, with 0 indicating that payments are made at the end of each period, and 1 indicating they are paid at the beginning. If not specified, 0 is used.\n                           \n\n                            NOTE: Unlike spreadsheet syntax, interest rates cannot be expressed as a percent. They must be expressed as a ratio (usually between 0 and 1).\n                           \n\n                            See also: FV(), PV(), PMT(), and RATE().\n                           \n\n\n\n                            PMT(rate,nper,pv[,fv[,type]])\n                           \n\n\n\n\n\n                            PV\n                           \n\n\n\n                            Calculates the present value of an investment based on these arguments:\n                           \n\n                            rate (required): The interest rate per period, expressed as a ratio (e.g. 1% is 0.01).\n                           \n\n                            nper (required): The total number of periods.\n                           \n\n                            pmt (required): The payment made each period. Can be zero.\n                           \n\n                            fv (optional): The future value; the balance at the end of the entire annuity. If omitted, it is assumed to be 0 (e.g. a loan paid in full).\n                           \n\n                            type (optional): 0/FALSE or 1/TRUE, with 0 indicating that payments are made at the end of each period, and 1 indicating they are paid at the beginning. If not specified, 0 is used.\n                           \n\n                            NOTE: Unlike spreadsheet syntax, interest rates cannot be expressed as a percent. They must be expressed as a ratio (usually between 0 and 1).\n                           \n\n                            See also: FV(), PMT(), RATE(), and NPER().\n                           \n\n\n\n                            PV(rate,nper,pmt[,fv[,type]])\n                           \n\n\n\n\n\n                            RATE\n                           \n\n\n\n                            Attempts to calculate the per-period interest rate of an investment. Not all arguments will have solutions; the result will be NaN if a solution cannot be found. You can also experiment with setting the guess if you believe there is a solution and it is not being returned. Note that the current implementation will not calculate negative interest rates. Arguments:\n                           \n\n                            nper (required): The total number of periods.\n                           \n\n                            pmt (required): The payment made each period. Can be zero.\n                           \n\n                            pv (required): The present value of the loan; the \"principal\".\n                           \n\n                            fv (optional): The future value; the balance at the end of the entire annuity. If omitted, it is assumed to be 0 (e.g. a loan paid in full).\n                           \n\n                            type (optional): 0/FALSE or 1/TRUE, with 0 indicating that payments are made at the end of each period, and 1 indicating they are paid at the beginning. If not specified, 0 is used.\n                           \n\n                            guess (optional): A best guess of the interest rate.\n                           \n\n                            See also: FV(), PV(), PMT(), and NPER().\n                           \n\n\n\n                            RATE(rate,nper,pv[,fv[,type[,guess]]])\n                           \n\n\n\n\n\n                            XIRR\n                           \n\n\n\n                            Calculates the Internal Rate of Return for a set of transactions that is not necessarily periodic. ''values'' is a set of transaction amounts which must contain at least one negative and one positive value. NULL or zero values in this column are ignored. ''dates'' is a list of transaction dates whose time components, if present, are ignored. ''guess'' is a best guess of the rate of return. It is optional and the default is 0.1, meaning 10%. It is usually not necessary to specify this value.\n                           \n\n                            XIRR is an aggregate function.\n                           \n\n\n\n                            XIRR(values,dates[,guess])\n                           \n\n\n\n\n\n                            XNPV\n                           \n\n\n\n                            Calculates the Net Present Value for a set of transactions that is not necessarily periodic. ''rate'' is the annualized Internal Rate of Return for the values. ''values'' is a set of transaction amounts which must contain at least one negative and one positive value. NULL or zero values in this column are ignored. ''dates'' is a list of transaction dates whose time components, if present, are ignored.\n                           \n\n                            XNPV is an aggregate function.\n                           \n\n\n\n                            XNPV(rate,values,dates)\n                           \n\n\n\n\n\n\n\n                        Logical Functions\n                       \n\n\n\n\n\n\n                             Function Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            ALL_TRUE\n                           \n\n\n\n                            Returns TRUE if all arguments evaluate to TRUE, otherwise returns FALSE. Can be invoked with one or more arguments.\n                           \n\n\n\n                            ALL_TRUE(cond1,cond2,...)\n                           \n\n\n\n\n\n                            ANY_TRUE\n                           \n\n\n\n                            Returns TRUE if any arguments evaluate to TRUE, otherwise returns FALSE. Can be invoked with one or more arguments.\n                           \n\n\n\n                            ANY_TRUE(cond1,cond2,...)\n                           \n\n\n\n\n\n                            BOOLEAN\n                           \n\n\n\n                            Returns the value of expr converted to BOOLEAN type (TRUE, FALSE, or NULL).\n                           \n\n\n\n                            BOOLEAN(expr), CAST(expr AS BOOLEAN)\n                           \n\n\n\n\n\n                            COALESCE\n                           \n\n\n\n                            Returns the first non-NULL value in the list, or NULL if there are no non-NULL values. At least one parameter must be passed.\n                           \n\n\n\n                            COALESCE(value,...)\n                           \n\n\n\n\n\n                            ERROR\n                           \n\n\n\n                            When evaluated, produces an error with the given error string. Depending on the transformation settings, this may halt execution entirely.\n                           \n\n\n\n                            ERROR(error_string)\n                           \n\n\n\n\n\n                            IF\n                           \n\n\n\n                            If test is TRUE, returns exprTrue. Otherwise, returns exprFalse.\n                           \n\n                            The return type is the type that best matches both exprTrue and exprFalse. For example, if exprTrue has type LONG and exprFalse has type DOUBLE, the return type will be DOUBLE, even if test is TRUE.\n                           \n\n\n\n                            IF(test,exprTrue,exprFalse)\n                           \n\n\n\n\n\n                            IFERROR\n                           \n\n\n\n                            If the evaluation of expr1 does not produce an error, IFERROR() returns expr1; otherwise it returns expr2. Note IFERROR() will only handle errors produced at runtime. If expr1 is produces an error before even being evaluated, e.g. if it attempts to convert between inconvertible types, IFERROR() will still produce that error.\n                           \n\n\n\n                            IFERROR(expr1,expr2)\n                           \n\n\n\n\n\n                            IFNULL\n                           \n\n\n\n                            If expr1 is not NULL, IFNULL() returns expr1; otherwise it returns expr2.\n                           \n\n\n\n                            IFNULL(expr1,expr2)\n                           \n\n\n\n\n\n                            NULLIF\n                           \n\n\n\n                            Returns NULL if expr1 = expr2 is true, otherwise returns expr1. This is the same as CASE WHEN expr1 = expr2 THEN NULL ELSE expr1 END.\n                           \n\n\n\n                            NULLIF(expr1,expr2)\n                           \n\n\n\n\n\n\n\n                        String Functions\n                       \n\n\n\n\n\n\n                             Function\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            CHAR_LENGTH\n                           \n\n\n\n                            Returns the length of the given string argument, measured in characters. A multi-byte character counts as a single character. This means that for a string containing five two-byte characters, LENGTH(), whereas CHAR_LENGTH() returns 5. If the argument is NULL, it returns NULL.\n                           \n\n                            If the argument is not a string value, it is converted into a string.\n                           \n\n\n\n                            CHAR_LENGTH(str)\n                           \n\n\n\n\n\n                            CONCAT\n                           \n\n\n\n                            Returns the string that results from concatenating the arguments. May have one or more arguments. All arguments are converted to strings.\n                           \n\n                            CONCAT() returns NULL if any argument is NULL.\n                           \n\n\n\n                            CONCAT(str1,str2,...)\n                           \n\n\n\n\n\n                            DYNACAST\n                           \n\n\n\n                            Returns the value of expr converted to the same type as type_expr. type_expr is not evaluated; it is only used to determine the type to which expr should be converted. In most cases, type_expr be a column reference.\n                           \n\n\n\n                            DYNACAST(expr, type_expr)\n                           \n\n\n\n\n\n                            GROUP_CONCAT\n                           \n\n\n\n                            Returns the string that results from concatenating the arguments, separated by the separator, for the whole group. May have one or more arguments, plus the optional separator. If not set, the separator is the comma character '',''. All arguments are converted to strings.\n                           \n\n                            It is an aggregate function.\n                           \n\n                            GROUP_CONCAT() returns null if there were no matching rows.\n                           \n\n\n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               The GROUP_CONCAT function does not support “ORDER BY” or \"DISTINCT\" as part of the expression in Magic ETL v2.\n                              \n\n\n\n\n\n\n                            GROUP_CONCAT(str1,str2,...[SEPARATOR sep])\n                           \n\n\n\n\n\n                            INITCAP\n                           \n\n\n\n                            Returns str with the start of every word in uppercase and all other characters in lowercase.\n                           \n\n\n\n                            INITCAP(str)\n                           \n\n\n\n\n\n                            INSTR\n                           \n\n\n\n                            Returns the position of the first occurrence of substring substr in string str.\n                           \n\n                            If any argument is NULL, returns NULL.\n                           \n\n\n\n                            INSTR(str,substr)\n                           \n\n\n\n\n\n                            LCASE\n                           \n\n\n\n                            LCASE() is a synonym for LOWER().\n                           \n\n\n\n                            LCASE(str)\n                           \n\n\n\n\n\n                            LEFT\n                           \n\n\n\n                            Returns the leftmost len characters from the string str, or NULL if any argument is NULL.\n                           \n\n\n\n                            LEFT(str,len)\n                           \n\n\n\n\n\n                            LENGTH\n                           \n\n\n\n                            Returns the length of the string str, measured in bytes using the UTF-8 encoding. A multi-byte character counts as multiple bytes. This means that for a string containing five two-byte characters, LENGTH() returns 10, whereas CHAR_LENGTH() returns 5.\n                           \n\n                            If str is not a string value, it is converted into a string. If str is NULL, the function returns NULL.\n                           \n\n\n\n                            LENGTH(str)\n                           \n\n\n\n\n\n                            LISTAGG\n                           \n\n\n\n                            LISTAGG() is a simplified version of GROUP_CONCAT(). The first argument is required, and is the string to be concatenated. The second argument is optional, and is the separator string. If not set, the separator is the empty string.\n                           \n\n\n\n                            LISTAGG(str1[,sep])\n                           \n\n\n\n\n\n                            LOWER\n                           \n\n\n\n                            Returns the string str with all characters changed to lowercase.\n                           \n\n\n\n                            LOWER(str)\n                           \n\n\n\n\n\n                            LPAD\n                           \n\n\n\n                            Returns the string str, left-padded with the string padstr to a length of len characters. If str is longer than len, the return value is shortened to len characters.\n                           \n\n\n\n                            LPAD(str, len, padstr)\n                           \n\n\n\n\n\n                            LTRIM\n                           \n\n\n\n                            Returns the string str with leading space characters removed.\n                           \n\n\n\n                            LTRIM(str)\n                           \n\n\n\n\n\n                            REGEXP_LIKE\n                           \n\n\n\n                            Performs a pattern match of a string expression str against a pattern pat. The pattern can be an extended regular expression. The optional flags argument is a string that may contain any or all the following characters specifying how to perform matching:\n                           \n\n                            c: Case-sensitive matching.\n                           \n\n                            i: Case-insensitive matching.\n                           \n\n                            m: Multiple-line mode.\n                           \n\n                            n: The . character matches line terminators.\n                           \n\n\n\n                            REGEXP_LIKE(str,pat[,flags])\n                           \n\n\n\n\n\n                            REGEXP_REPLACE\n                           \n\n\n\n                            Replaces occurrences in the string str that match the regular str specified by the pattern pat with the replacement string repl, and returns the resulting string. If str, pat, or repl is NULL, the return value is NULL. The optional flags argument behaves as it does in REGEXP_LIKE().\n                           \n\n\n\n                            REGEXP_REPLACE(str,pat,repl[,flags])\n                           \n\n\n\n\n\n                            REPLACE\n                           \n\n\n\n                            Returns the string str with all occurrences of the string from_str replaced by the string to_str. REPLACE() performs a case-sensitive match when searching for from_str.\n                           \n\n\n\n                            REPLACE(str,from_str,to_str)\n                           \n\n\n\n\n\n                            RIGHT\n                           \n\n\n\n                            Returns the rightmost len characters from the string str, or NULL if any argument is NULL.\n                           \n\n\n\n                            RIGHT(str,len)\n                           \n\n\n\n\n\n                            SPLIT_PART\n                           \n\n\n\n                            Returns the Nth substring of str split by sep. If N is zero or smaller, returns null. If there are fewer than N substrings after str has been split by the given separator, returns empty string.\n                           \n\n                            Example:\n                           \n\n                            SPLIT_PART('a~|bc~cb|d|e', '|~', 2) = \"bc~cb\"\n                           \n\n\n\n                            SPLIT_PART(str,sep,N)\n                           \n\n\n\n\n\n                            STR_CLEAN\n                           \n\n\n\n                            Replaces NULL values in str with the empty string, and removes all non-whitespace control characters. These are a subset of the operations performed by STR_NORMALIZE().\n                           \n\n\n\n                            STR_CLEAN(str)\n                           \n\n\n\n\n\n                            STR_CONTAINS\n                           \n\n\n\n                            Returns TRUE if the string str contains the string search, FALSE if it does not, or NULL if either argument is NULL.\n                           \n\n\n\n                            STR_CONTAINS(str, search)\n                           \n\n\n\n\n\n                            STR_DIGITS\n                           \n\n\n\n                            Returns a new string consisting of only the digit characters in str in the order they appear. Converse of STR_REMOVE_DIGITS().\n                           \n\n\n\n                            STR_DIGITS(str)\n                           \n\n\n\n\n\n                            STR_ENDS_WITH\n                           \n\n\n\n                            Returns TRUE if the string str ends with the string search, FALSE if it does not, or NULL if either argument is NULL.\n                           \n\n\n\n                            STR_ENDS_WITH(str, search)\n                           \n\n\n\n\n\n                            STR_NORMALIZE\n                           \n\n\n\n                            Normalizes str by performing the following operations:\n                           \n\n                            1. NULL values in str are replaced with the empty string.\n                           \n\n                            2. Leading and trailing whitespace characters are removed.\n                           \n\n                            3. All other sequences of one or more whitespace characters are replaced with a single space ('' '').\n                           \n\n                            4. All non-whitespace control characters are removed.\n                           \n\n                            This is the more thorough version of STR_CLEAN().\n                           \n\n\n\n                            STR_NORMALIZE(str)\n                           \n\n\n\n\n\n                            STR_REMOVE_DIGITS\n                           \n\n\n\n                            Returns str with all digit characters removed. Converse of STR_DIGITS().\n                           \n\n\n\n                            STR_REMOVE_DIGITS(str)\n                           \n\n\n\n\n\n                            STR_STARTS_WITH\n                           \n\n\n\n                            Returns TRUE if the string str starts with the string search, FALSE if it does not, or NULL if either argument is NULL.\n                           \n\n\n\n                            STR_STARTS_WITH(str, search)\n                           \n\n\n\n\n\n                            STRING\n                           \n\n\n\n                            Returns the value of expr converted to a STRING. Locale, timezone, and date-format settings all affect this behavior.\n                           \n\n\n\n                            STRING(expr), CAST(expr AS STRING)\n                           \n\n\n\n\n\n                            SUBSTRING\n                           \n\n\n\n                            The forms without a len argument return a substring from string str starting at position pos.\n                           \n\n                            The forms with a len argument return a substring len characters long from string str, starting at position pos.\n                           \n\n                            It is also possible to use a negative value for pos. In this case, the beginning of the substring is pos characters from the end of the string, rather than the beginning. A negative value may be used for pos in any of the forms of this function.\n                           \n\n                            By default, the position of the first character in the string from which the substring is to be extracted is reckoned as 1. If any argument is NULL, returns NULL.\n                           \n\n\n\n                            SUBSTRING(str,pos), SUBSTRING(str FROM pos), SUBSTRING(str,pos,len), SUBSTRING(str FROM pos FOR len)\n                           \n\n\n\n\n\n                            UCASE\n                           \n\n\n\n                            UCASE() is a synonym for UPPER().\n                           \n\n\n\n                            UCASE(str)\n                           \n\n\n\n\n\n                            UPPER\n                           \n\n\n\n                            Returns the string str with all characters changed to uppercase.\n                           \n\n\n\n                            UPPER(str)\n                           \n\n\n\n\n\n\n\n                        Date and Time Functions\n                       \n\n\n\n\n\n\n                             Function\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            ADDDATE\n                           \n\n\n\n                            When invoked with the INTERVAL form of the second argument, ADDDATE() is a synonym for DATE_ADD(). The related function SUBDATE() is a synonym for DATE_SUB(). For information on the INTERVAL unit argument, see the description for DATE_ADD().\n                           \n\n\n\n                            When invoked with the days form of the second argument, Magic ETL treats it as an integer number of days to be added to expr.\n                           \n\n\n\n                            ADDDATE(date,INTERVAL expr unit), ADDDATE(expr,days)\n                           \n\n\n\n\n\n                            ADDTIME\n                           \n\n\n\n                            ADDTIME() adds expr2 to expr1 and returns the result. expr1 is a time or datetime expression, and expr2 is a time expression.\n                           \n\n\n\n                            ADDTIME(expr1,expr2)\n                           \n\n\n\n\n\n                            CONVERT_TZ\n                           \n\n\n\n                            CONVERT_TZ() converts the datetime value dt to a new moment in time such that the original value''s wall-clock time when rendered in from_tz matches the new value''s wall-clock time when rendered in to_tz.\n                           \n\n\n\n                            CONVERT_TZ(dt,from_tz,to_tz)\n                           \n\n\n\n\n\n                            CURDATE\n                           \n\n\n\n                            Returns the current date. For long-running executions, this is the date that the execution began.\n                           \n\n\n\n                            CURDATE()\n                           \n\n\n\n\n\n                            CURDATETIME\n                           \n\n\n\n                            CURDATETIME() is a synonym for CURRENT_TIMESTAMP().\n                           \n\n\n\n                            CURDATETIME()\n                           \n\n\n\n\n\n                            CURRENT_DATE\n                           \n\n\n\n                            Synonym for CURDATE().\n                           \n\n\n\n                            CURRENT_DATE()\n                           \n\n\n\n\n\n                            CURRENT_TIME\n                           \n\n\n\n                            Synonym for CURTIME().\n                           \n\n\n\n                            CURRENT_TIME()\n                           \n\n\n\n\n\n                            CURRENT_TIMESTAMP\n                           \n\n\n\n                            Returns the current timestamp (date & time). For long-running executions, this is the timestamp of the beginning of the execution.\n                           \n\n\n\n                            CURRENT_TIMESTAMP()\n                           \n\n\n\n\n\n                            CURTIME\n                           \n\n\n\n                            Returns the current time as a duration since the start of the current day. For long-running executions, this is the time that the execution began.\n                           \n\n\n\n                            CURTIME()\n                           \n\n\n\n\n\n                            DATE\n                           \n\n\n\n                            Converts expr to a calendar date consisting of a year, month, and day.\n                           \n\n\n\n                            DATE(expr), CAST(expr AS DATE)\n                           \n\n\n\n\n\n                            DATEDIFF\n                           \n\n\n\n                            Returns the number of days between two dates from datetime values.\n                           \n\n\n\n                            DATEDIFF(CURRENT_DATE(), `lastmoddate`)\n                           \n\n\n\n\n\n                            DATE_ADD\n                           \n\n\n\n                            Performs date arithmetic. The date argument specifies the starting date or datetime value. expr is an expression specifying the interval value to be added or subtracted from the starting date. expr may start with a \"-\" for negative intervals. unit is a keyword indicating the units in which the expression should be interpreted. Permitted units are YEAR, QUARTER, MONTH, WEEK, DAY, HOUR, MINUTE, SECOND, and MILLISECOND.\n                           \n\n                            See also DATE_SUB().\n                           \n\n\n\n                            DATE_ADD(date,INTERVAL expr unit)\n                           \n\n\n\n\n\n                            DATE_FORMAT\n                           \n\n\n\n                            Formats the date value according to the format string.\n                           \n\n                            The language used for the names is controlled by the Locale setting.\n                           \n\n                            The options that can be used by DATE_FORMAT(), as well as its inverse STR_TO_DATE() and the FROM_UNIXTIME() function, are: %a: Short weekday name in current locale.\n                           \n\n                            %b: Short form month name in current locale.\n                           \n\n                            %c: Month with 1 or 2 digits.\n                           \n\n                            %d: Day with 2 digits.\n                           \n\n                            %e: Day with 1 or 2 digits.\n                           \n\n                            %f: Sub seconds 6 digits.\n                           \n\n                            %H: Hour with 2 digits between 00-23.\n                           \n\n                            %h: Hour with 2 digits between 01-12.\n                           \n\n                            %I: Hour with 2 digits between 01-12.\n                           \n\n                            %i: Minute with 2 digits.\n                           \n\n                            %j: Day of the year (001-366)\n                           \n\n                            %k: Hour with 1 digits between 0-23.\n                           \n\n                            %l: Hour with 1 digits between 1-12.\n                           \n\n                            %M: Full month name in current locale.\n                           \n\n                            %m: Month with 2 digits.\n                           \n\n                            %r: Time in 12 hour format, followed by AM/PM. Short for ''%I:%i:%S %p''.\n                           \n\n                            %S: Seconds with 2 digits.\n                           \n\n                            %s: Seconds with 2 digits.\n                           \n\n                            %T: Time in 24 hour format. Short for ''%H:%i:%S''.\n                           \n\n                            %U: Week number (00-53), when first day of the week is Sunday.\n                           \n\n                            %u: Week number (00-53), when first day of the week is Monday.\n                           \n\n                            %V: Week number (01-53), when first day of the week is Sunday. Used with %X.\n                           \n\n                            %v: Week number (01-53), when first day of the week is Monday. Used with %x.\n                           \n\n                            %W: Full weekday name in current locale.\n                           \n\n                            %w: Day of the week. 0 = Sunday, 6 = Saturday.\n                           \n\n                            %X: Year with 4 digits when first day of the week is Sunday. Used with %V.\n                           \n\n                            %x: Year with 4 digits when first day of the week is Monday. Used with %v.\n                           \n\n                            %Y: Year with 4 digits.\n                           \n\n                            %y: Year with 2 digits.\n                           \n\n                            %#: For str_to_date(), skip all numbers.\n                           \n\n                            %.: For str_to_date(), skip all punctation characters.\n                           \n\n                            %@: For str_to_date(), skip all alpha characters.\n                           \n\n                            %%: A literal % character.\n                           \n\n\n\n                            DATE_FORMAT(date, format)\n                           \n\n\n\n\n\n                            DATE_SUB\n                           \n\n\n\n                            Performs date arithmetic. The date argument specifies the starting date or datetime value. expr is an expression specifying the interval value to be added or subtracted from the starting date. expr is a string; it may start with a \"-\" for negative intervals. unit is a keyword indicating the units in which the expression should be interpreted. See DATE_ADD() for a complete list of permitted units.\n                           \n\n\n\n                            DATE_SUB(date,INTERVAL expr unit)\n                           \n\n\n\n\n\n                            DATE_TRUNC\n                           \n\n\n\n                            DATE_TRUNC() is almost a synonym for TIMESTAMP_TRUNC(), but its argument order is flipped for compatibility reasons. See TIMESTAMP_TRUNC() for the description.\n                           \n\n\n\n                            DATE_TRUNC(precision, date)\n                           \n\n\n\n\n\n                            DATE_WORKING_DIFF\n                           \n\n\n\n                            Returns the number of days between the dates expr1 and expr2, excluding weekends (Saturdays and Sundays). The result is negative if expr1 is after expr2.\n                           \n\n\n\n                            DATE_WORKING_DIFF(expr1,expr2)\n                           \n\n\n\n\n\n                            DATEDIFF\n                           \n\n\n\n                            DATEDIFF() returns (expr1 – expr2) expressed as a value in days from one date to the other. expr1 and expr2 are date or date-and-time expressions. Only the date parts of the values are used in the calculation.\n                           \n\n\n\n                            DATEDIFF(expr1,expr2)\n                           \n\n\n\n\n\n                            DATETIME\n                           \n\n\n\n                            Returns the value of expr converted to a DATETIME type, consisting of a year, month, day, hour, minute, second, and millisecond.\n                           \n\n\n\n                            DATETIME(expr), CAST(expr AS DATETIME)\n                           \n\n\n\n\n\n                            DAY\n                           \n\n\n\n                            DAY() is a synonym for DAYOFMONTH().\n                           \n\n\n\n                            DAY(date)\n                           \n\n\n\n\n\n                            DAYNAME\n                           \n\n\n\n                            Returns the name of the weekday for date. The language used for the name is controlled by the Locale setting.\n                           \n\n\n\n                            DAYNAME(date)\n                           \n\n\n\n\n\n                            DAYOFMONTH\n                           \n\n\n\n                            Returns the day of the month for date, in the range 1 to 31.\n                           \n\n\n\n                            DAYOFMONTH(date)\n                           \n\n\n\n\n\n                            DAYOFWEEK\n                           \n\n\n\n                            Returns the day of the week index for the date (1 = Sunday, 2 = Monday, ..., 7 = Saturday). These index values correspond to the ODBC standard.\n                           \n\n                            This contrasts with WEEKDAY() which follows a different index numbering (0 = Monday, 1 = Tuesday, ... 6 = Sunday).\n                           \n\n\n\n                            DAYOFWEEK(date)\n                           \n\n\n\n\n\n                            DAYOFYEAR\n                           \n\n\n\n                            Returns the day of the year for date, in the range 1 to 366.\n                           \n\n\n\n                            DAYOFYEAR(date)\n                           \n\n\n\n\n\n                            DURATION\n                           \n\n\n\n                            Returns the value of expr converted to a DURATION, consisting of hours, minutes, seconds, and milliseconds.\n                           \n\n\n\n                            DURATION(expr), CAST(expr AS DURATION)\n                           \n\n\n\n\n\n                            FROM_DAYS\n                           \n\n\n\n                            Given a day number N, returns a DATE value. The day count is based on the number of days from the start of the standard calendar.\n                           \n\n                            The function is not designed for use with dates before the advent of the Gregorian calendar in October 1582. Results will not be reliable since it doesn''t account for the lost days when the calendar changed from the Julian calendar.\n                           \n\n                            This is the converse of the TO_DAYS() function.\n                           \n\n\n\n                            FROM_DAYS(N)\n                           \n\n\n\n\n\n                            FROM_UNIXTIME\n                           \n\n\n\n                            Given a day number N, returns a DATE value. The day count is based on the number of days from the start of the standard calendar.\n                           \n\n                            The function is not designed for use with dates before the advent of the Gregorian calendar in October 1582. Results will not be reliable since it doesn''t account for the lost days when the calendar changed from the Julian calendar.\n                           \n\n                            This is the converse of the TO_DAYS() function.\n                           \n\n\n\n                            FROM_DAYS(N)\n                           \n\n\n\n\n\n                            HOUR\n                           \n\n\n\n                            Returns the hour for time. The range of the return value is 0 to 23.\n                           \n\n\n\n                            HOUR(time)\n                           \n\n\n\n\n\n                            LAST_DAY\n                           \n\n\n\n                            Takes a date or datetime value and returns the corresponding value for the last day of the month.\n                           \n\n\n\n                            LAST_DAY(date)\n                           \n\n\n\n\n\n                            MICROSECOND\n                           \n\n\n\n                            Returns the microseconds from the datetime expression expr as a number in the range from 0 to 999999.\n                           \n\n\n\n                            MICROSECOND(expr)\n                           \n\n\n\n\n\n                            MILLISECOND\n                           \n\n\n\n                            Returns the milliseconds from the datetime expression expr as a number in the range from 0 to 999.\n                           \n\n\n\n                            MILLISECOND(expr)\n                           \n\n\n\n\n\n                            MINUTE\n                           \n\n\n\n                            Returns the minute of the datetime argument, in the range 0 to 59.\n                           \n\n\n\n                            MINUTE(time)\n                           \n\n\n\n\n\n                            MONTH\n                           \n\n\n\n                            Returns the month for date in the range 1 to 12 for January to December.\n                           \n\n\n\n                            MONTH(date)\n                           \n\n\n\n\n\n                            MONTHNAME\n                           \n\n\n\n                            Returns the full name of the month for date. The language used for the name is controlled by the Locale setting.\n                           \n\n\n\n                            MONTHNAME(date)\n                           \n\n\n\n\n\n                            NOW\n                           \n\n\n\n                            Synonym for CURRENT_TIMESTAMP().\n                           \n\n\n\n                            NOW()\n                           \n\n\n\n\n\n                            PERIOD_ADD\n                           \n\n\n\n                            Adds N months to period P. P is an integer in the format YYMM or YYYYMM. If P contains a two-digit year, values from 00 to 69 are converted to from 2000 to 2069, while values from 70 are converted to 1970 upwards.\n                           \n\n                            Returns an integer value in the format YYYYMM.\n                           \n\n\n\n                            PERIOD_ADD(P,N)\n                           \n\n\n\n\n\n                            PERIOD_DIFF\n                           \n\n\n\n                            Returns the number of months between periods P1 and P2. P1 and P2 can be in the format YYMM or YYYYMM, and are integer values.\n                           \n\n                            If P1 or P2 contains a two-digit year, values from 00 to 69 are converted to from 2000 to 2069, while values from 70 are converted to 1970 upwards.\n                           \n\n\n\n                            PERIOD_DIFF(P1,P2)\n                           \n\n\n\n\n\n                            QUARTER\n                           \n\n\n\n                            Returns the quarter of the year for date, in the range 1 to 4. Returns NULL if the given value is NULL.\n                           \n\n\n\n                            QUARTER(date)\n                           \n\n\n\n\n\n                            SEC_TO_TIME\n                           \n\n\n\n                            Returns the seconds argument, converted to hours, minutes, and seconds, as a TIME value.\n                           \n\n\n\n                            SEC_TO_TIME(seconds)\n                           \n\n\n\n\n\n                            SECOND\n                           \n\n\n\n                            Returns the second for a given time in the range 0 to 59.\n                           \n\n\n\n                            SECOND(time)\n                           \n\n\n\n\n\n                            STR_TO_DATE\n                           \n\n\n\n                            This is the inverse of the DATE_FORMAT() function. It takes a string str and a format string format. STR_TO_DATE() returns a DATETIME value.\n                           \n\n                            The format that can be used by STR_TO_DATE() is described in the description of DATE_FORMAT().\n                           \n\n\n\n                            STR_TO_DATE(str,format)\n                           \n\n\n\n\n\n                            SUBDATE\n                           \n\n\n\n                            When invoked with the INTERVAL form of the second argument, SUBDATE() is a synonym for DATE_SUB(). See DATE_ADD() for a complete list of permitted units.\n                           \n\n                            The second form allows the use of an integer value for days. In such cases, it is interpreted as the number of days to be subtracted from the date or datetime expression expr.\n                           \n\n\n\n                            SUBDATE(date,INTERVAL expr unit), SUBDATE(expr,days)\n                           \n\n\n\n\n\n                            SUBTIME\n                           \n\n\n\n                            SUBTIME() returns expr1 - expr2 expressed as a value of the same type as expr1. expr1 is a time or datetime expression, and expr2 is a time expression.\n                           \n\n\n\n                            SUBTIME(expr1,expr2)\n                           \n\n\n\n\n\n                            SYSDATE\n                           \n\n\n\n                            Synonym for CURRENT_TIMESTAMP().\n                           \n\n\n\n                            SYSDATE()\n                           \n\n\n\n\n\n                            TIME\n                           \n\n\n\n                            Converts expr to a duration (TIME-type) consisting of hours, minutes, seconds, and milliseconds.\n                           \n\n\n\n                            TIME(expr)\n                           \n\n\n\n\n\n                            TIME_FORMAT\n                           \n\n\n\n                            This is used like the DATE_FORMAT() function, but the format string may contain format specifiers only for hours, minutes, and seconds. Other specifiers produce a NULL value or 0.\n                           \n\n\n\n                            TIME_FORMAT(time,format)\n                           \n\n\n\n\n\n                            TIME_TO_SEC\n                           \n\n\n\n                            Returns the time argument, converted to seconds.\n                           \n\n\n\n                            TIME_TO_SEC(time)\n                           \n\n\n\n\n\n                            TIMEDIFF\n                           \n\n\n\n                            TIMEDIFF() returns expr1 - expr2 expressed as a time value. expr1 and expr2 are time or date-and-time expressions, but both must be of the same type.\n                           \n\n\n\n                            TIMEDIFF(expr1,expr2)\n                           \n\n\n\n\n\n                            TIMESTAMP\n                           \n\n\n\n                            Converts expr to a timestamp (DATETIME-type) consisting of year, month, day, hour, minute, second, and millisecond.\n                           \n\n\n\n                            TIMESTAMP(expr)\n                           \n\n\n\n\n\n                            TIMESTAMP_TRUNC\n                           \n\n\n\n                            Truncates timestamp to the given precision, or to the day if no precision is specified. The result is of type DATE if timestamp is a DATE, otherwise it has type DATETIME. The value of precision is a constant string matching one of the following:\n                           \n\n                            Millennium: MILLENNIUM\n                           \n\n                            Century: CENTURY\n                           \n\n                            Year: YEAR\n                           \n\n                            ISO Year: ISOYEAR\n                           \n\n                            Quarter: QUARTER\n                           \n\n                            Month: MONTH\n                           \n\n                            Same weekday as first day of year: YEARWEEK\n                           \n\n                            Same weekday as first day of ISO year: ISOWEEK\n                           \n\n                            Same weekday as first day of month: MONTHWEEK\n                           \n\n                            First day of week according to current Locale setting: WEEK\n                           \n\n                            Day (the default): DAY\n                           \n\n                            Hour: HOUR\n                           \n\n                            Minute: MINUTE\n                           \n\n                            Second: SECOND\n                           \n\n                            Millisecond: MILLISECOND\n                           \n\n                            Microsecond: MICROSECOND\n                           \n\n\n\n                            TIMESTAMP_TRUNC\n                           \n\n                            TRUNC(timestamp[,precision])\n                           \n\n\n\n\n\n                            TO_DAYS\n                           \n\n\n\n                            Given a date date, returns the number of days since the start of the current calendar.\n                           \n\n\n\n                            The function is not designed for use with dates before the advent of the Gregorian calendar in October 1582. Results will not be reliable since it doesn''t account for the lost days when the calendar changed from the Julian calendar.\n                           \n\n\n\n                            This is the converse of the FROM_DAYS() function.\n                           \n\n\n\n                            TO_DAYS(date)\n                           \n\n\n\n\n\n                            TODAY\n                           \n\n\n\n                            TODAY() is a synonym for CURDATE().\n                           \n\n\n\n                            TODAY()\n                           \n\n\n\n\n\n                            TRIM\n                           \n\n\n\n                            Returns the string str with all remstr prefixes or suffixes removed. If none of the specifiers BOTH, LEADING, or TRAILING is given, BOTH is assumed. remstr is optional and, if not specified, spaces are removed.\n                           \n\n\n\n                            TRIM([{BOTH | LEADING | TRAILING} [remstr] FROM] str), TRIM([remstr FROM] str)\n                           \n\n\n\n\n\n                            TRUNC\n                           \n\n\n\n                            TRUNC() is a synonym for TIMESTAMP_TRUNC(). It is not to be confused with TRUNCATE(), which operates on numeric values.\n                           \n\n\n\n                            TRUNC(timestamp[,precision])\n                           \n\n\n\n\n\n                            UNIX_TIMESTAMP\n                           \n\n\n\n                            If called with no argument, returns a Unix timestamp (seconds since ''1970-01-01 00:00:00'' UTC) as an unsigned integer. If UNIX_TIMESTAMP() is called with a date argument, it returns the value of the argument as seconds since ''1970-01-01 00:00:00'' UTC. date may be a DATE, a DATETIME, or a date string. The server interprets date as a value in the current time zone and converts it to an internal value in UTC. Clients can set their time zone in Magic action settings, DataFlow settings, or customer settings.\n                           \n\n                            The inverse function of UNIX_TIMESTAMP() is FROM_UNIXTIME().\n                           \n\n\n\n                            UNIX_TIMESTAMP(), UNIX_TIMESTAMP(date)\n                           \n\n\n\n\n\n                            WEEK\n                           \n\n\n\n                            This function returns the week number for date. The two-argument form of WEEK() allows you to specify whether the week starts on Sunday or Monday and whether the return value should be in the range from 0 to 53 or from 1 to 53. If the mode argument is omitted, the value of the default_week_format system variable is used. Modes are as follows:\n                           \n\n                            0: First day is Sunday, range is 0-53, first week has a Sunday in this year.\n                           \n\n                            1: First day is Monday, range is 0-53, first week has more than 3 days this year.\n                           \n\n                            2: First day is Sunday, range is 1-53, first week has a Sunday in this year.\n                           \n\n                            3: First day is Monday, range is 1-53, first week has more than 3 days this year.\n                           \n\n                            4: First day is Sunday, range is 0-53, first week has more than 3 days this year.\n                           \n\n                            5: First day is Monday, range is 0-53, first week has a Monday in this year.\n                           \n\n                            6: First day is Sunday, range is 1-53, first week has more than 3 days this year.\n                           \n\n                            7: First day is Monday, range is 1-53, first week has a Monday in this year.\n                           \n\n\n\n                            WEEK(date[,mode])\n                           \n\n\n\n\n\n                            WEEKDAY\n                           \n\n\n\n                            Returns the weekday index for date (0 = Monday, 1 = Tuesday, ... 6 = Sunday).\n                           \n\n                            This contrasts with DAYOFWEEK() which follows the ODBC standard (1 = Sunday, 2 = Monday, ..., 7 = Saturday).\n                           \n\n\n\n                            WEEKDAY(date)\n                           \n\n\n\n\n\n                            WEEKOFYEAR\n                           \n\n\n\n                            WEEKOFYEAR() is a synonym for WEEK().\n                           \n\n\n\n                            WEEKOFYEAR(date[,mode])\n                           \n\n\n\n\n\n                            YEAR\n                           \n\n\n\n                            Returns the year for the given date, in the range 0 to 9999.\n                           \n\n\n\n                            YEAR(date)\n                           \n\n\n\n\n\n                            YEARWEEK\n                           \n\n\n\n                            Returns year and week for a date. The mode argument works exactly like the mode argument to WEEK(). The year in the result may be different from the year in the date argument for the first and the last week of the year.\n                           \n\n\n\n                            YEARWEEK(date), YEARWEEK(date,mode)\n                           \n\n\n\n\n\n                            LOCALE\n                           \n\n\n\n                            For debugging purposes. Returns the Locale setting for this context. This setting controls the behavior of functions like DAYNAME().\n                           \n\n\n\n                            @@LOCALE\n                           \n\n\n\n\n\n                            SYSTEM_LOCALE\n                           \n\n\n\n                            For debugging purposes. Returns the Locale setting for the DataFlow or, if not set, the customer. This setting controls the behavior of functions like DAYNAME(). This setting might be overridden by an action- or statement-level control (see @@LOCALE).\n                           \n\n\n\n                            @@SYSTEM_LOCALE\n                           \n\n\n\n\n\n                            SYSTEM_TZ\n                           \n\n\n\n                            For debugging purposes. Returns the time zone setting for the DataFlow or, if not set, the customer. This setting controls the behavior of many date- and time-related functions, like STR_TO_DATE(). This setting might be overridden by an action- or statement-level control (see @@TZ).\n                           \n\n\n\n                            @@SYSTEM_TZ\n                           \n\n\n\n\n\n                            TZ\n                           \n\n\n\n                            For debugging purposes. Returns the time zone setting for this context. This setting controls the behavior of many date- and time-related functions, like STR_TO_DATE().\n                           \n\n\n\n                            @@TZ\n                           \n\n\n\n\n\n\n\n                        System Functions\n                       \n\n\n\n\n\n\n                             Function Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n                            DX_ACTION_ID\n                           \n\n\n\n                            The system ID of the action executing the statement. This is different from @@DX_ACTION_NAME.\n                           \n\n\n\n                            @@DX_ACTION_ID\n                           \n\n\n\n\n\n                            DX_ACTION_NAME\n                           \n\n\n\n                            The user-provided name of the action executing the statement. This is different from @@DX_ACTION_ID.\n                           \n\n\n\n                            @@DX_ACTION_NAME\n                           \n\n\n\n\n\n                            DX_DATAFLOW_ID\n                           \n\n\n\n                            The numeric ID of the DataFlow executing the statement, or NULL if the statement is not being executed by a saved DataFlow. This is different from @@DX_DATAFLOW_NAME.\n                           \n\n\n\n                            @@DX_DATAFLOW_ID\n                           \n\n\n\n\n\n                            DX_DATAFLOW_NAME\n                           \n\n\n\n                            The user-provided name of the DataFlow executing the statement, or NULL if the statement is not being executed by a DataFlow. This is different from @@DX_DATAFLOW_ID.\n                           \n\n\n\n                            @@DX_DATAFLOW_NAME\n                           \n\n\n\n\n\n                            DX_ENGINE\n                           \n\n\n\n                            The execution engine, e.g. MAGIC.\n                           \n\n\n\n                            @@DX_ENGINE\n                           \n\n\n\n\n\n                            DX_EXECUTION_ID\n                           \n\n\n\n                            The numeric ID of the current DataFlow execution, or null if the statement is not being executed as part of a DataFlow execution. Note that these IDs are not sequential for a given DataFlow, but are guaranteed to be larger than the IDs of executions started earlier.\n                           \n\n\n\n                            @@DX_EXECUTION_ID\n                           \n\n\n\n\n\n                            DX_IS_PREVIEW\n                           \n\n\n\n                            TRUE if the statement is being executed as part of a DataFlow preview, otherwise FALSE.\n                           \n\n\n\n                            @@DX_IS_PREVIEW", "Preview Article": "Click here to preview", "URL Name": "360044289573", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004583", "Archived Date": "", "Language": "English", "Primary Version": "Supported Functions in Magic ETL", "Article Total View Count": "9,224", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Supported Functions in Magic ETL\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}