{"file_path": "../../raw_kb_v2\\article\\360042925994\\index.html", "content": {"Title": "Creating an Alert for a DataSet", "Article Body": "Intro\n                       \n\n                        With DataSet Alerts, you can build flexible and powerful Alerts right on a DataSet. You can be Alerted based on\n                        \n                         any\n                        \n                        change or addition to your data. Unlike traditional Alerts, these can be built on multiple trigger rules. And the Alert message can include complex calculations and even data from other DataSets, making the custom message more customizable and more useful.\n                       \n\n                        For example, let's say user Barry is a sales manager for his company. He wants to know the exact moment that a new deal closes, along with any pertinent information about the deal, such as the salesperson who closed the deal, the name of the customer, the amount of the deal, the number of consulting hours purchased, and so on. Before DataSet Alerts, Barry could only set Alerts on the Card level. These Alerts would indicate that a predefined threshold had been surpassed but could not relay any other data from the DataSet. But now, with DataSet Alerts, Barry can set an Alert on the DataSet level. The Alert message can include\n                        \n                         any\n                        \n                        information from the DataSet, including all of the data Barry wanted.\n                       \n\n                        Barry's Alert message as created in Domo looks as follows:\n                       \n\n\n                         [Sales Rep], on the [Sales Team] team, closed a deal with [Account Name] for [Deal Amount]. This deal includes [# of Users] users and [# of Consulting Hours Purchased] consulting hours (at a rate of [Consulting Rate] per hour). The competitor for this deal was [Competitor Name]. This opportunity was created on [Opportunity Start Date] from a [Lead Type].\n                        \n\n\n                        Thereafter, when a deal closes, the Alert message that is sent out is populated with the data from the indicated columns. This message might appear as follows:\n                       \n\n                        \"Darcy McKay, on the Corporate team, closed a deal with Kablinko Toys for $23,560. This deal includes 12 users and 8 consulting hours (at a rate of $225 per hour). The competitor for this deal was Red Puffin Electronics. This opportunity was created on 08-12-2017 from a Marketing-generated Lead.\"\n                       \n\n                        You manage DataSet Alerts in the Alert Center, just as with Card Alerts. There you can edit rules and messages, change your notification settings, see the Alert history, share Alerts with other users, and subscribe to other DataSet Alerts. For more information about the Alert Center, see\n                        \n                         Alert Center Layout\n                        \n                        .\n                       \n\n\n\n                          Video - Using DataSet Alerts\n                         \n\n\n\n\n\n\n\n\n\n                        Creating a DataSet Alert\n                       \n\n                        You create DataSet Alerts in the Data Center, in the\n                        \n                         details view for the DataSet\n                        \n                        . Click on\n                        \n                         Alerts\n                        \n                        in the details view tab bar to open the\n                        \n                         Alerts\n                        \n                        tab. This tab shows cards for all Alerts that have been created on this DataSet. You can click any Alert to open a panel in which you can edit the Alert, see its history, share it, and so on. In this tab you can also click\n                        \n                         New Alert\n                        \n                        to open the 3-step Alert wizard, where you can configure your new Alert. The steps in the wizard are as follows:\n                       \n\n\n\n\n                           Rule.\n                          \n                          Here you specify the conditions that trigger your Alert. You can also specify how often Domo checks to see if the Alert conditions have been met.\n                         \n\n\n\n\n                           Message\n                          \n                          . Here you can customize the message for the Alert using a variety of different macros to indicate available metrics.\n                         \n\n\n\n\n                           Share\n                          \n                          . Here you specify the users, groups, and Buzz conversations that receive notifications when the Alert is triggered.\n                         \n\n\n\n                        All of these steps are described in more detail in continuation.\n                       \n\n                        Setting Up Your Alert Rule\n                       \n\n                        In Step 1 of the wizard, you specify the conditions that cause your Alert to trigger. You can also set the frequency at which Domo checks to see if the Alert has triggered.\n                       \n\n                        If PDP policies have been set on this DataSet, you can specify how PDP is applied to Alerts in Step 1 of the wizard. For more information, see\n                        \n                         PDP and Alerts\n                        \n                        .\n                       \n\n                        Specifying the Alert Conditions\n                       \n\n                        There are two types of DataSet Alerts: individual row Alerts and column aggregation Alerts. You select the type of Alert you want in the\n                        \n                         Metric\n                        \n                        menu in the\n                        \n                         Rule\n                        \n                        section of the Alert wizard.\n                        \n\n\n\n\n                        Individual row Alerts\n                       \n\n                        You can create Alerts that trigger when changes are made to individual rows in your DataSet. These changes include rows being added, changed, or deleted from the DataSet. For example, you might have an Alert set to trigger when a row for a new customer account is added to your sales DataSet.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The following DataSet types do not support row Alerts:\n                            \n\n\n\n\n\n                               Fusions\n                              \n\n\n\n\n\n                               Views\n                              \n\n\n\n\n\n                               Appends\n                              \n\n\n\n\n\n                               Upserts\n                              \n\n\n\n\n\n                               Federated DataSets\n                              \n\n\n\n\n\n                               DataSets with more than 1M rows.\n                              \n\n\n\n\n\n\n\n\n                        When you choose an individual row option, two additional configuration options appear. The first of these,\n                        \n                         Add Filter\n                        \n                        , is optional. Here, you can set your Alert to trigger\n                        \n                         only\n                        \n                        when specific rows are added, changed, or deleted. To do this, you choose the desired column in the\n                        \n                         Metric\n                        \n                        menu, select an operator in the\n                        \n                         Meets this condition\n                        \n                        menu, then enter or select the desired value in the\n                        \n                         For this value\n                        \n                        field. So for example, if user Fiona only wants to receive Alerts when the \"Marketing\" department is impacted, she would select\n                        \n                         Department\n                        \n                        in the first menu and\n                        \n                         Is equal to\n                        \n\n                         (=)\n                        \n                        in the second menu, then check the box for \"Marketing\" in the blank field.\n                        \n\n                        You can add additional filters by clicking\n                        \n                         Add Filter\n                        \n                        .\n                       \n\n\n\n\n                        By adding multiple filters, you can build complex Alert rules for your DataSets. For example, let's say I have a DataSet that includes rows for customer deals in the pipeline. I want to receive an Alert\n                        \n                         only\n                        \n                        when these three criteria are met:\n                       \n\n\n\n                          I have won the deal (indicated by the \"isWon\" column being set to \"True\").\n                         \n\n\n\n                          The deal was previously open (indicated by the \"isClosed\" column being previously set to \"False\").\n                         \n\n\n\n                          The deal is now closed (indicated by the \"isClosed\" column being now set to \"True\").\n                         \n\n\n\n                        I could build a single rule incorporating all three of these criteria. by creating three separate filters, as follows:\n                       \n\n\n\n\n\n                        The second option asks you to select one or more columns that identify a row in this DataSet as unique. In the previous example, I specified \"AccountID\" as this column because the account ID is unique for every row. Unlike the filters option, this is required to proceed.\n                       \n\n                        Column aggregation Alerts\n                        \n\n\n\n                        Column aggregation Alerts occur when the aggregation for a column meets a specified threshold, just as with Card Alerts. For example, you might have an Alert set to trigger when the sum of the \"Total Budget\" column for your DataSet falls below a certain value.\n                       \n\n                        To build a column aggregation Alert, you first choose a column in the\n                        \n                         Metric\n                        \n                        menu, followed by the desired aggregation. Different aggregation types are available depending on the data type of the selected column.\n                       \n\n                        Available aggregations for string columns are as follows:\n                       \n\n\n\n\n                           Unique Count\n                          \n                          . The number of unique values in the column (i.e. if a value appears more than once, it is only counted once).\n                         \n\n\n\n\n                           Null Count\n                          \n                          . The number of NULL values in the column.\n                         \n\n\n\n\n                           Non-null Count\n                          \n                          . The number of non-NULL values in the column.\n                         \n\n\n\n\n                           Total Count\n                          \n                          . The total number of values in the column, including all null and non-unique values.\n                         \n\n\n\n\n                           Minimum String Length\n                          \n                          . The length in characters of the shortest string in the column.\n                         \n\n\n\n\n                           Maximum String Length.\n                          \n                          The length in characters of the longest string in the column.\n                         \n\n\n\n\n                           Average String Length\n                          \n                          . The average length of characters of all of the strings in the column.\n                         \n\n\n\n                        Available aggregations for value and date columns are as follows:\n                       \n\n\n\n\n                           Unique Count\n                          \n                          . The number of unique values in this column (i.e. if a value appears more than once, it is only counted once).\n                         \n\n\n\n\n                           Null Count\n                          \n                          . The number of NULL values in the column.\n                         \n\n\n\n\n                           Non-null Count\n                          \n                          . The number of non-NULL values in the column.\n                         \n\n\n\n\n                           Total Count\n                          \n                          . The total number of values in the column, including all null and non-unique values.\n                         \n\n\n\n\n                           Minimum\n                          \n                          . The smallest value or earliest date in the column.\n                         \n\n\n\n\n                           Maximum\n                          \n                          . The largest value or latest date in the column.\n                         \n\n\n\n\n                           Average\n                          \n                          . The average value in the column.\n                         \n\n\n\n\n                           Sum\n                          \n                          . The sum of all of the values in the column.\n                         \n\n\n\n\n                           Standard Deviation\n                          \n                          . The standard deviation of the values in the column.\n                         \n\n\n\n\n                           Median\n                          \n                          . The median value in the column.\n                         \n\n\n\n\n                           Lower Quartile\n                          \n                          . The lower quartile for the column.\n                         \n\n\n\n\n                           Upper Quartile\n                          \n                          . The upper quartile for the column.\n                         \n\n\n\n                        Once you choose the column and aggregation, you can build the conditional statement for the Alert. A conditional statement connects the selected metric to the value or percentage and determines when your Alert is sent. You choose the condition in the\n                        \n                         Meets this condition\n                        \n                        menu and enter the value in the\n                        \n                         For this value\n                        \n                        field. Domo provides a variety of conditions to choose from, including greater than, less than, and equal statements and combinations of these. You can also specify a particular degree of change using the\n                        \n                         changes by\n                        \n                        ,\n                        \n                         increases by\n                        \n                        , and\n                        \n                         decreases by\n                        \n                        condition statements.\n                       \n\n                        For example, if you wanted to create an Alert set to trigger when the total value of the \"Budget\" column fell below $10,000, you would do the following:\n                       \n\n\n\n                          Select \"Budget\" in the\n                          \n                           Metric\n                          \n                          menu, then choose\n                          \n                           Sum\n                          \n                          as the aggregation type.\n                         \n\n\n\n                          Select\n                          \n                           is less than (<)\n                          \n                          in the\n                          \n                           Meets this condition\n                          \n                          menu.\n                         \n\n\n\n                          Enter\n                          \n                           10000\n                          \n                          in the\n                          \n                           For this value\n                          \n                          field.\n                         \n\n\n\n                        Specifying the Alert Frequency\n                       \n\n                        Also in step 1 of the Alert wizard, you can specify how often Domo checks to see if the Alert is in a triggered state. You do this by clicking the arrow at the bottom right of the configuration options and selecting the desired option.\n                        \n\n\n\n\n                        Options include\n                        \n                         Every time the data updates\n                        \n                        ,\n                        \n                         Hourly\n                        \n                        ,\n                        \n                         Daily\n                        \n                        ,\n                        \n                         Weekly\n                        \n                        , and\n                        \n                         Monthly\n                        \n                        .\n                       \n\n\n\n                          If you select\n                          \n                           Every time the data updates\n                          \n                          , Domo checks the Alert any time the data in the card is refreshed.\n                         \n\n\n\n                          If you select\n                          \n                           Hourly\n                          \n                          or\n                          \n                           Daily\n                          \n                          , you can choose whether to include weekends in your evaluation. You can also set the specific time of day when you choose\n                          \n                           Daily\n                          \n                          .\n                         \n\n\n\n                          If you select\n                          \n                           Weekly\n                          \n                          , you can select the specific day of the week along with the time of day.\n                         \n\n\n\n                          If you select\n                          \n                           Monthly\n                          \n                          , you can select a specific date or the first/last day of the month, along with the time of day.\n                         \n\n\n\n                        Depending on the Alert condition you've selected, a checkbox may also appear reading\n                        \n                         Keep sending notifications while in a triggered state\n                        \n                        . When this box is checked, instead of sending out a single Notification as soon as the Alert enters a triggered state (which is the default functionality), Domo sends out Notifications based on the selected frequency\n                        \n                         until the Alert conditions are no longer met\n                        \n                        . For example, let's say user Gus creates the Alert rule \"Summary Number is less than 500,\" selects\n                        \n                         Weekly\n                        \n                        as the frequency, then checks this box. As soon as the Summary Number surpasses 500, a Notification is sent. Then, as long as the Summary Number remains above 500, new Notifications are sent on the specified weekday at the specified time. If the number drops below 500, Notifications will stop being sent. If, on the other hand, Gus doesn't check this box, only an initial Notification is sent when the Alert is triggered.\n                       \n\n                        The\n                        \n                         Keep sending notifications while in a triggered state\n                        \n                        checkbox appears only for threshold-based Alerts, as opposed to those one-time Alerts that trigger when a certain degree of change is met. For example, for an \"Is greater than\" Alert (e.g. an Alert that triggers when its value surpasses 1000), this box would be available because the Alert still applies as long as the value remains above the threshold. But for a \"Changes by\" Alert, the box is not available because once the given value is reached, only a single Notification needs be sent—the Alert's work is then done.\n                       \n\n                        Customizing Your Alert Message\n                       \n\n                        In Step 2 of the wizard, you can customize the Notification message that is sent whenever the Alert is triggered. You can choose from a wide variety of macros to include in the message. Macros are used to reference different variables related to your Alert, such as Alert name, Alert owner, current or previous value of the rule column, the time the Alert was last triggered at, and so on. With individual row Alerts, you can configure the message header, body, and footer separately.\n                       \n\n\n\n\n\n                        You can see a list of macros by clicking the\n                        \n                         Metric\n                        \n                        button. Where available, the list shows you the name of the corresponding variable in your Alert so you know if you are pulling over the right information.\n                        \n\n\n\n\n\n                        If you edit the custom message then decide you want to revert it back to the default, you can do so by clicking\n                        \n                         Restore Default\n                        \n                        .\n                       \n\n                        Attaching an action\n                       \n\n                        Alert Actions drive powerful action for your business by triggering events such as Webhook integration with third-party systems and Projects & Tasks integrations in Domo. You can attach an action to an Alert by clicking the\n                        \n                         Attach Action\n                        \n                        button below the message preview pane, choosing the action type (either a Webhook or Task), then configuring the action.\n                       \n\n                        Webhook actions\n                       \n\n                        By attaching Webhook actions to Alerts, you can cause events to be triggered in third-party systems when your Alert threshold is attained. For example, as a CFO,  you might create a Webhook that causes a celebratory message to be posted to your company Facebook page when your stock value reaches a certain price.\n                       \n\n                        To create a Webhook action, all you need to do is input the Webhook URL, choose the HTTP API method (POST, DELETE, PATCH, GET, and PUT are available), then enter a secret authorization key if required. You cannot edit the Webhook body aside from the customized Alert message, which was discussed previously.\n                       \n\n                        After you have configured your action, you can test it by clicking\n                        \n                         Send Test\n                        \n                        .\n                       \n\n\n                         To configure a Webhook action,\n                        \n\n\n\n                         Click the\n                         \n                          Attach Action\n                         \n                         button, which is located under the\n                         \n                          Message\n                         \n                         pane in the Alert Wizard.\n                         \n\n\n\n\n\n\n                          Select\n                          \n                           Domo Webhook\n                          \n                          .\n                         \n\n\n\n                          Enter the URL for the desired Webhook.\n                         \n\n\n\n                          Select the desired HTTP method in the\n                          \n                           Method\n                          \n                          menu (\n                          \n                           POST\n                          \n                          is the default).\n                         \n\n\n\n                          (Conditional) Enter an authorization key in the\n                          \n                           Secret\n                          \n                          field if necessary to authenticate.\n                         \n\n\n\n                          (Conditional) If you didn't customize your Alert message previously, you can do this by clicking the arrow next to\n                          \n                           Webhook body\n                          \n                          , scrolling down to the bottom of the body content, then clicking the pencil to open the message editor. For more information about the options here, see\n                          \n                           Customizing your Alert message\n                          \n                          .\n                         \n\n\n\n                          (Optional) Click\n                          \n                           Send Test\n                          \n                          if you want to test your configuration.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to move onto the next step in the wizard.\n                         \n\n\n\n                        Task creation action\n                       \n\n                        You can cause a Task to be created when an Alert is triggered. You can choose the Project in which the new Task will be added, edit the customized Alert message if you haven't already, and select an owner for the new Task. As soon as the Alert threshold is reached, this new Task will be added to Domo and assigned to the owner you have selected. For more information about Projects and Tasks, see\n                        \n                         Projects and Tasks\n                        \n                        .\n                       \n\n\n                         To configure a Task action,\n                        \n\n\n\n                         Click the\n                         \n                          Attach Action\n                         \n                         button, which is located under the\n                         \n                          Message\n                         \n                         pane in the Alert Wizard.\n                         \n\n\n\n\n\n                          Select\n                          \n                           Task\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Project\n                          \n                          menu, select the Project where this Task should live.\n                          \n                          If the desired parent Project doesn't exist yet, you will need to create it. For more information, see\n                          \n                           Creating a Project\n                          \n                          .\n                         \n\n\n\n                          (Conditional) If you didn't customize your Alert message previously, you can do this here by updating the fields in the\n                          \n                           Task name\n                          \n                          area as necessary. For more information about the options here, see\n                          \n                           Customizing your Alert message\n                          \n                          .\n                         \n\n\n\n                          Select the desired Task owner in the\n                          \n                           Owner\n                          \n                          menu.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to move onto the next step in the wizard.\n                         \n\n\n\n                        Sharing the Alert\n                       \n\n                        In Step 3 of the wizard, you can share Alerts with other users and/or groups in your Domo so they receive notifications every time that Alert triggers. You can also write a custom message to let users know what is happening as well as delete users and groups who should no longer be able to see the Alert. You can delete users and groups only if you have an \"Admin\" default security profile or a custom role with \"Manage All Groups\" enabled. For more information about default security profiles, see\n                        \n                         Default Security Role Reference\n                        \n                        . For more information about custom roles, see\n                        \n                         Managing Roles\n                        \n                        .\n                       \n\n                        You can also share Alerts in Buzz conversations, in which case all users following the conversation receive Notifications. You can search for conversations then select those conversations you want the Alert to be shared in. This search searches keywords from conversation names only; it does\n                        \n\n                          not\n                         \n\n                        search conversation content.\n                       \n\n                        Alerts are sent to the email address and telephone number specified in the user profile. For more information, see\n                        \n                         Profile Page\n                        \n                        .\n                       \n\n                        For information about configuring Notifications, see\n                        \n                         Configuring Notification and Alert Settings\n                        \n                        .\n                       \n\n                        When you share Alerts with other users in your Domo, they automatically gain access to the cards those Alerts are tied to if they do not already have it.\n                       \n\n\n\n                          Video - Sharing Alerts\n                         \n\n\n\n\n\n\n\n\n\n\n                         To share an Alert with users and/or groups,\n                        \n\n\n\n\n                          In the\n                          \n                           Share this Alert\n                          \n                          step of the Alert creation wizard, add a person or group to share with by clicking in the\n                          \n                           Enter users, groups, or emails\n                          \n                          field and selecting the desired user, group, or email.\n                          \n\n                          When you select a user or group, that user or group's name appears in the field. You can share with multiple users and/or groups by selecting all of their names and adding them to the field.\n                         \n\n\n\n                          (Optional) Write a message in the \"I thought you might find this interesting\" field to let users know what is happening.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        The Alert is shared with the selected users. If you wrote a Notification message, that message is sent to the users you shared with.\n                       \n\n\n                         To remove users or groups from the shared list for this Alert,\n                        \n\n\n\n\n                          In the Details view for the card with the Alert, click the\n                          \n                          icon to show the Alerts for this card.\n                         \n\n\n\n                          Click the\n                          \n                           Share\n                          \n                          button for the Alert you want to remove users from.\n                         \n\n\n\n                          Expand the section at the bottom of the dialog by clicking the message reading \"Already shared with [person].\"\n                          \n                          This displays rows for all users and/or groups the Alert is being shared with.\n                         \n\n\n\n                          Remove a user or group from the shared list by clicking the \"x\" for that user or group.\n                         \n\n\n\n                        The user or group is removed from the shared list and no longer receives Notifications when this Alert is triggered.\n                       \n\n\n                         To share an Alert in a Buzz channel,\n                        \n\n\n\n\n                          In the\n                          \n                           Share this Alert\n                          \n                          step of the Alert creation wizard, click the\n                          \n                           Buzz\n                          \n                          tab.\n                         \n\n\n\n                          (Optional) Use the\n                          \n                           Filter Buzz channels and chats\n                          \n                          field to search for conversations you want to share this Alert in.\n                         \n\n\n\n                          Check the boxes for all conversations you want to share the Alert in.\n                         \n\n\n\n                          Click\n                          \n                           Share\n                          \n                          .\n                         \n\n\n\n                        The Alert is shared in the selected conversations. Any users following those conversations will now receive notifications any time the Alert is triggered.\n                       \n\n                        Saving your Alert\n                       \n\n                        After you've selected the desired Alert components and entered a value, click\n                        \n                         Save\n                        \n                        .\n                       \n\n                        Your new Alert now appears in the\n                        \n                         Alert Center\n                        \n                        . You can do any of the following with this Alert:\n                       \n\n\n\n                          Open it for editing.\n                         \n\n\n\n                          \"Unsubscribe\" from it so you do\n                          \n                           not\n                          \n                          receive Notifications when it is triggered. By default, when you create an Alert, you are set to follow it.\n                         \n\n\n\n                          See how many times it has been triggered.\n                         \n\n\n\n                          Delete it.\n                         \n\n\n\n                          Set instant, daily, or weekly notifications on the Alert.\n                         \n\n\n\n                          See a listing of Alert events.\n                         \n\n\n\n                          See a list of followers.\n                         \n\n\n\n                        Editing an Alert\n                       \n\n                        You can open an Alert for editing by doing any of the following:\n                       \n\n\n\n                          Select\n                          \n                           Alerts\n                          \n                          in the app toolbar at the top of the screen, locate the Alert you want to edit, click in the top portion of the Alert card, then click\n                          \n                           E\n                          \n\n                           dit\n                          \n                          .\n                         \n\n\n\n                          Open the details view for the Alert in the Data Center then click the\n                          \n                           Alerts\n                          \n                          tab.", "Preview Article": "Click here to preview", "URL Name": "360042925994", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004353", "Archived Date": "", "Language": "English", "Primary Version": "Creating an Alert for a DataSet", "Article Total View Count": "6,073", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Creating an Alert for a DataSet\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Notifications And Alerts\n              \n", "url": "/s/topic/0TO5w000000ZanxGAC"}]}