{"file_path": "../../raw_kb_v2\\article\\4434784751767\\index.html", "content": {"Title": "Optimizing Data Performance", "Article Body": "Intro\n                       \n\n                        This article provides general guidelines to optimize data performance in Cards, DataFlows and Beast Modes.\n                       \n\n                        These should be used as general guidelines and may not apply to all use cases. Please test any changes prior to implementing them in a production scenario.\n                       \n\n                        Caching\n                       \n\n                        To take advantage of caching in Domo, try to keep your DataSet updates to the minimum required.\n                       \n\n                        Beast Modes\n                       \n\n                        Complex Beast Modes are calculated against every row of a DataSet and as such can contribute to poor query performance. Beast Modes calculated against text fields are often the most query intensive. Large or nested CASE statements can also significantly impact your performance.\n                       \n\n                        Recommendations:\n                       \n\n\n                         Build your Beast Modes on numeric or date fields instead of text/string fields.\n                        \n\n                         Consider converting Beast Modes to calculations in a DataFlow. This will avoid the need to compute the formula when querying to display a Card, for example.\n                        \n\n                         Avoid large CASE statements calculated on string fields.\n                        \n\n                         Avoid using LIKE for text matching on lengthy text fields.\n                        \n\n\n                        Targeted DataSets\n                       \n\n                        For each DataSet, ask these questions:\n                       \n\n\n                         Are all rows necessary for the Cards built from it?\n                        \n\n                         How much historical data is truly necessary for your most common use?\n                        \n\n\n                        In general, reducing rows in a DataSet can help improve performance. Consider running larger DataSets through a DataFlow to reduce row counts and provide DataSets for your most common use cases. Alternatively, consider aggregating data when possible.\n                       \n\n                        Distinct\n                       \n\n                        COUNT DISTINCT can be an expensive operation. Instead, try these alternatives:\n                       \n\n\n                         Consider approximating the value with APPROXIMATE_COUNT_DISTINCT.\n                        \n\n                         Use fewer DISTINCT keywords in your formula.\n                        \n\n                         Consider reducing your row counts prior to performing a COUNT DISTINCT.\n                        \n\n\n                        Summary Numbers\n                       \n\n                        Cards include Summary Numbers by default. If you don't need a summary number on your Card, consider removing it as it can impact performance.\n                       \n\n                        Dashboard Size\n                       \n\n                        Evaluate the number of Cards on each Dashboard to determine if any can be moved to separate Dashboards. Dashboards with many Cards can take longer to load than those with fewer Cards.", "Preview Article": "Click here to preview", "URL Name": "4434784751767", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004887", "Archived Date": "", "Language": "English", "Primary Version": "Optimizing Data Performance", "Article Total View Count": "4,952", "": "", "Article Created Date": "10/24/2022, 10:34 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Optimizing Data Performance\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Data Center Overview\n              \n", "url": "/s/topic/0TO5w000000ZanRGAS"}]}