{"file_path": "../../raw_kb_v2\\article\\360043430613\\index.html", "content": {"Title": "Certifying Cards and DataSets", "Article Body": "Intro\n                       \n\n                        The more people you bring into Domo, the more people you have in your company making good business decisions. But how can you be sure that the content you're all looking at is the same? How do you know if you brought in the right data? Using the content certification feature, you can certify your content so your users know which content has been approved, just by looking at the Card or DataSet.\n                       \n\n                        Two types of content certification are available in Domo—\"Company\" and \"Department.\" Company certification represents pieces of content that have passed the most stringent certification review and that your entire company should be aware of. Department certification represents content that may not universally apply to the entire company but have been certified by a specific department that trusts their information. Company- and department-certified content is indicated using different badges.\n                       \n\n                        You can request certification for any Card or DataSet by choosing\n                        \n                         Request certification\n                        \n                        for that piece of content. If you are not the owner, the request will be sent on to the owner, who can then decide whether to start or deny the approval process. Once the owner chooses what certification process to submit the piece of content through, the request goes to each specified approver (or all of the members of a specified group) in the certification process that the owner chose. Approvers have the responsibility of approving or rejecting certification requests. They can also send requests back in the approval chain if changes are required.\n                       \n\n                        When groups of users are specified as approvers in the chain, if any user in the group gives his/her approval, that approval counts for the whole group and the process moves on to the next approver.\n                       \n\n                        Different badges on a piece of content indicate the certification tier (company or department) as well as whether the content is certified or pending certified.\n                       \n\n\n\n                         indicates that the content was certified through a department certification process.\n                        \n\n\n                         indicates that certification has been requested, that the content is pending department certification, or that the content’s department certified status has expired.\n                        \n\n\n                         indicates that the content is certified through the company certification process.\n                        \n\n\n                         indicates that the content is pending company certification or that the content's company certification status has expired.\n                        \n\n\n                        In the Certification Center, you can keep track of requests you have submitted as well as those waiting for your approval. You can see details of all requests, including the approval chain and the actions taken by each approver or group. For requests awaiting your approval, you can choose to approve or deny them here.\n                       \n\n                        The certification processes used for requesting company and department certification are found in\n                        \n                         Admin Settings > Certified Content\n                        \n                        . This Page is only accessible by users with an \"Admin\" default security role or a custom role with \"Certified Cards\" enabled. If you need to make changes to the fields and/or approvers for the certification form, you do it here. For more information about default security roles, see\n                        \n                         Managing Roles\n                        \n                        .\n                       \n\n                        For more information, see\n                        \n                         Creating a Request Form\n                        \n                        .\n                       \n\n\n\n                          Video - How to Certify a Card\n                         \n\n\n\n\n\n\n\n\n\n                        Requesting Certification for a Card\n                       \n\n                        Requesting certification for a Card is easy. All you need to do is select the\n                        \n                         Request certification\n                        \n                        option for the Card, select the appropriate certification process, then submit. Note that if you are not the Card owner, clicking\n                        \n                         Request certification\n                        \n                        sends a notification to the Card owner so he/she can choose whether or not to initiate the approval process.\n                       \n\n\n                         To request certification for a Card,\n                        \n\n\n\n\n                          In either the Page view or Details view for the Card, select\n                          \n                           Request certification\n                          \n                          in the wrench menu.\n                         \n\n\n\n                          (Conditional) If you are not the Card owner, a message appears saying your request has been sent to the owner. At this point, you are done; the responsibility for beginning the certification process falls on the Card owner. The Card owner can then choose to reject or start the certification process by going into the Details view for the Card, clicking the\n                          \n                          icon at the top of the screen, then clicking\n                          \n                           Deny\n                          \n                          or\n                          \n                           Start\n                          \n                          . Additionally, the Card owner may review the certification request in the Certification Center.\n                         \n\n\n\n                          Select the desired certification process in the\n                          \n                           Select a process\n                          \n                          menu.\n                          \n\n\n\n\n                          A pane appears with information about the process, including the description, instructions (if any), and members of the approval chain.\n                         \n\n\n\n                          Click\n                          \n                           Submit\n                          \n                          .\n                         \n\n\n\n                        The Card is then sent on to the first approver in the approval chain.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If any users in the approval chain do not have access to the Card, they are granted access when the Card is submitted for certification. They can find the Card to take action on it in the Shared Page. They can also take action on Cards in the Certification Center.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n                              You can keep track of all of your submitted requests by opening the Certification Center (\n                              \n                               More\n                              \n\n                               > Certification Center\n                              \n                              ) then clicking anywhere in the \"Submitted by You\" area.\n                             \n\n\n\n\n\n\n\n                        Requesting Certification for a DataSet\n                       \n\n                        You can request certification for DataSets in Domo. To do this, you simply go into the Details view for the DataSet and select\n                        \n                         Request certification\n                        \n                        , select the desired certification process, and submit.\n                       \n\n                        Here are two important things to note when requesting certification for a DataSet:\n                       \n\n\n\n                          Only DataSet owners—\n                          \n                           not\n                          \n                          co-owners—can start the certification process for the DataSet. If a request for certification is submitted by someone other than the owner, a message is sent to the owner informing them that certification has been requested. That person can then choose whether or not to go in and request certification. For more information about DataSet ownership, see\n                          \n                           Sharing a DataSet\n                          \n                          .\n                         \n\n\n\n                          The certification will expire if the DataSet undergoes a schema change (i.e. columns are deleted or renamed), a configuration change, or an account change.\n                         \n\n\n\n\n                         To request certification for a DataSet,\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Tip:\n                            \n                            You can keep track of all of your submitted requests by opening the Certification Center (\n                            \n                             More\n                            \n\n                             > Certification Center\n                            \n                            ) then clicking anywhere in the \"Submitted by You\" area.\n                           \n\n\n\n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Data\n                          \n                          .\n                         \n\n\n\n                          In the Data Center, locate the DataSet you want to request certification for, and click on it to open its Details view.\n                         \n\n\n\n                          In the wrench menu, select\n                          \n                           Request certification\n                          \n                          .\n                         \n\n\n\n                          (Conditional) If you are not the DataSet owner, a message appears saying your request has been sent to the owner. At this point, you are done; the responsibility for beginning the certification process falls on the owner. The DataSet owner can then choose to reject or start the certification process by going into the Details view for the DataSet, clicking the\n                          \n                          icon at the top of the screen, then clicking\n                          \n                           Deny\n                          \n                          or\n                          \n                           Start\n                          \n                          . Additionally, the DataSet owner may review the certification request in the Certification Center.\n                         \n\n\n\n                          Select the desired certification process in the\n                          \n                           Select a process\n                          \n                          menu.\n                          \n\n                          A pane appears with information about the process, including the description, instructions (if any), and members of the approval chain.\n                         \n\n\n\n                          Click\n                          \n                           Submit\n                          \n                          .\n                          \n\n                          The Card is then sent on to the first approver in the approval chain.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                             Tip:\n                            \n                            You can keep track of all of your submitted requests by opening the Certification Center (\n                            \n                             More\n                            \n\n                             > Certification Center\n                            \n                            ) then clicking anywhere in the \"Submitted by You\" area.\n                           \n\n\n\n\n\n\n\n                          Handling Certification Requests\n                         \n\n\n\n                        If you are specified as an approver for any certification request, it is your sole responsibility to handle any requests that come your way (unless you are a member of an approver group, in which case any member of the group may handle certification requests). When a request is made, a notification is sent to you letting you know that you need to take action. The type of notification you receive is based on your Notification Settings. For more information, see\n                        \n                         Configuring Notification and Alert Settings\n                        \n                        .\n                       \n\n                        You can take action on certification requests (approving or rejecting them, requesting modifications, etc.) in the Certification Center.\n                       \n\n                        For any submitted certification request, you can take the following actions in the Certification Center:\n                       \n\n\n\n                          You can\n                          \n\n                            approve\n                           \n\n                          the request, causing a notification to be sent to the next person in the chain (unless you are the only user in the approver chain, in which case the submitting user is notified of the approval).\n                         \n\n\n\n                          You can\n                          \n\n                            ask a question\n                           \n\n                          about the request. This question will appear in the Buzz channel for the request, and any users with access will be able to read it, respond to it, etc. For more information, see\n                          \n                           Posting to Buzz\n                          \n                          .\n                         \n\n\n\n                          You can\n                          \n\n                            share\n                           \n\n                          access to the Buzz channel for the request with specified users and groups.\n                         \n\n\n\n                          You can\n                          \n\n                            edit\n                           \n\n                          details of the request yourself.\n                         \n\n\n\n                          You can\n                          \n\n                            request changes\n                           \n\n                          from the previous person in the chain (or the submitter if there is no one before you in the chain).\n                         \n\n\n\n                          You can\n                          \n\n                            delegate\n                           \n\n                          a new approver for the request.\n                         \n\n\n\n                          You can\n                          \n\n                            reject\n                           \n\n                          the request altogether.\n                         \n\n\n\n\n                         To handle Card certification requests in the Certification Center,\n                        \n\n\n\n\n                          Open the Certification Center by selecting\n                          \n                           More\n                          \n\n\n                            > Certification Center\n                           \n                           .\n                          \n\n\n\n\n                          Select\n                          \n                           Waiting on You\n                          \n                          in the left-hand navigation area.\n                          \n                          A list of all active certification requests that require your review appears.\n                         \n\n\n\n                          In the\n                          \n\n                            Active\n                           \n\n                          tab, locate and click on the request you have been asked to handle. (You can use the search and filter options to find the desired request.)\n                          \n                          When you click a request, details for that request appear in the pane on the right side of the screen.\n                         \n\n\n\n                          Read through the request details.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            To\n                            \n\n                              approve\n                             \n\n                            the request, click\n                            \n\n                              Approve\n                             \n\n                            .\n                            \n                            If there are approvers after you in the chain, the next approver is notified about the approval, and it now falls upon that user to approve the request, reject it, etc. Otherwise, the approval process is finished and the submitter is notified.\n                           \n\n\n\n                            To\n                            \n\n                              ask a question\n                             \n\n                            about the request in Buzz, click\n                            \n                            in the top-right corner, then select\n                            \n\n                              Ask a question\n                             \n\n                            . This opens Buzz if it is not open already.\n                           \n\n\n\n                            To\n                            \n\n                              share access\n                             \n\n                            to the Buzz channel, click\n                            \n                            in the top-right corner, then select\n                            \n\n                              Share link\n                             \n\n                            . In the\n                            \n\n                              Share With\n                             \n\n                            field, select the users and/or groups you want to share access with. Then click\n                            \n\n                              Share\n                             \n\n                            . These users and groups are then emailed the link to the Buzz channel.\n                           \n\n\n\n                            To\n                            \n\n                              edit\n                             \n\n                            the request, click\n                            \n                            in the top-right corner, then select\n                            \n\n                              Edit request\n                             \n\n                            . Make your changes as desired then click\n                            \n\n                              Save\n                             \n\n                            .\n                           \n\n\n\n                            To\n                            \n\n                              request changes\n                             \n\n                            , click\n                            \n\n                              Send Back\n                             \n\n                            , then select\n                            \n\n                              Request Change\n                             \n\n                            . In the message field, explain the changes you want to be made to the request. Finally, click\n                            \n\n                              Send\n                             \n\n                            .\n                            \n                            The previous person in the approval flow is notified about the requested changes. He/she can now either make the changes and resubmit, or request that the previous user in the chain or submitter make the changes.\n                           \n\n\n\n                            To\n                            \n\n                              delegate\n                             \n\n                            a new approver, click\n                            \n                            in the top-right corner, then select\n                            \n\n                              Delegate\n                             \n\n                            . Select the user you want to delegate in the\n                            \n\n                              Delegate to\n                             \n\n                            field then enter a message explaining the reason for the delegation. Finally, click\n                            \n\n                              Send\n                             \n\n                            .\n                           \n\n\n\n                            To\n                            \n\n                              reject\n                             \n\n                            the request, click\n                            \n\n                              Send Back\n                             \n\n                            , then select\n                            \n\n                              Deny\n                             \n\n                            . In the message field, enter the reason you are rejecting the request. Finally, click\n                            \n\n                              Deny\n                             \n\n                            .\n                            \n                            This stops the approval flow, and the submitter is notified that the request has been denied.\n                           \n\n\n\n\n\n\n\n\n                        Taking Admin Actions\n                       \n\n                        In\n                        \n                         Admin Settings > Certified Content > Certified Cards/Certified DataSets\n                        \n                        , you have access to a number of actions that are\n                        \n                         only\n                        \n                        available for users with an \"Admin\" default security role or a custom role with \"Certified Cards\" or \"Certified DataSets\" enabled. These actions include the following:\n                       \n\n\n\n                          Viewing all pieces of content that have been certified or are in a requesting, pending, or expired certification state\n                         \n\n\n\n                          Adding new Department-level Card certification processes (you can only have one Company-level certification process)\n                         \n\n\n\n                          Modifying both Company- and Department-level Card certification processes\n                         \n\n\n\n                          Determining whether certifications are expired if content is edited\n                         \n\n\n\n                          Canceling certification requests\n                         \n\n\n\n                        Viewing Certified or Certification Pending Content\n                       \n\n                        In\n                        \n                         Admin Settings > Certified Content > Certified Cards/Certified DataSets\n                        \n                        , you can see a list of all Cards or DataSets that have been certified, requested for certification, pending certification, or have an expired certified state. Entries for certified pieces of content appear with a\n                        \n                        or\n                        \n                        badge, and entries for \"Certification requested,\" \"Certification pending,\" and \"Certification expired\" pieces of content appear with a\n                        \n                        or\n                        \n                        badge. All entries display the name of the Card owner, the last updated date, the certification date (or a \"Pending\" stamp if pending), the number of views, and a\n                        \n                        icon with additional options.\n                       \n\n\n\n\n                        You can use the menu in the top right corner to filter the Cards or DataSets in the list. Available filters include\n                        \n                         Pending\n                        \n                        ,\n                        \n                         Expired\n                        \n                        ,\n                        \n                         Certified\n                        \n                        , etc.\n                       \n\n                        Adding a Department-Level Certification Process\n                       \n\n                        You can add a new Department-level certification certification process by navigating to\n                        \n                         Admin Settings > Certified Content > Certified Cards/Certified DataSets\n                        \n                        then clicking on the \"+\" tile in the \"Departments\" section. (You\n                        \n                         cannot\n                        \n                        create additional Company-level certification processes.)\n                        \n\n\n\n\n\n                        You can also open an existing form to modify it by clicking on it.\n                       \n\n                        In the Department-level certification process editor, you can change the default process name (the default is \"Department title\"); add a description and instructions for filling out the process; and specify the users and/or groups in the approval chain. You can also preview the process to see how it will look when opened by a user by clicking\n                        \n                        .\n                       \n\n\n\n                          To add a Department-level certification process,\n                         \n\n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n\n                            > Admin > Certified Content > Certified Cards\n                           \n\n                          or\n                          \n                           More >\n                          \n\n                           Admin > Certified Content > Certified DataSets\n                          \n                          .\n                         \n\n\n\n                          Click the \"+\" tile under \"Departments\" to open the certification process editor.\n                         \n\n\n\n                          Enter a unique name for the new certification process in the area at the top of the screen.\n                         \n\n\n\n                          (Optional) If you want to include a description, enter it in the\n                          \n                           Description\n                          \n                          field.\n                         \n\n\n\n                          (Optional) If you want to include specific instructions for users filling out this form, enter those instructions in the\n                          \n\n                            Instructions\n                           \n\n                          field.\n                         \n\n\n\n                          Under\n                          \n                           Approval Chain\n                          \n                          , click\n                          \n                           Add Approver Step\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Select user or set a placeholder\n                          \n                          field, enter the name of the first user or group in the approval chain.\n                         \n\n\n\n                          (Optional) If the request will need to be approved by more than one user or group, click\n                          \n\n                            Add Approver Step\n                           \n\n                          and select the new approving user or group.\n                         \n\n\n\n                          (Optional) Repeat step 8 as often as necessary until all approvers and/or approver groups are added to the chain.\n                          \n\n                          Requests will be sent to users and groups for approval in the order provided here. For example, if the first user in the chain was \"Brad Storch\" and the second user was \"Betty Symington,\" any requests made using this form would first be sent to Brad for his approval. Once Brad gave his approval, they would then be sent to Betty. If Betty then gave her approval, the submitter would then be notified that the request had been successfully approved at both levels.\n                         \n\n\n\n                          (Optional) If desired, change the approver order by clicking\n                          \n                          for a given approver or group and dragging their name up or down in the chain.\n                         \n\n\n\n                          (Optional) If you do not want users to be able to add approvers when filling out this form, be sure to turn on the\n                          \n\n                            Lock Chain\n                           \n\n                          option.\n                         \n\n\n\n                          (Optional) To preview this form, click\n                          \n                          in the top right corner of the screen.\n                         \n\n\n\n                          When you are satisfied with the configuration of your form, click\n                          \n\n                            Save\n                           \n\n                          .\n                         \n\n\n\n                        Modifying Certification Processes\n                       \n\n                        You can modify content (description, instructions, or approvers) in any certification process (either Company or Department level) by clicking the tile for the process in\n                        \n                         Admin Settings > Certified Content\n                        \n\n                         > Certified Cards/Certified DataSets\n                        \n                        then making the desired changes. The processes for Company- and Department-level certification are essentially the same, except that in the Company-level certification process, you cannot edit the name.\n                       \n\n                        Expiring Certifications for Edited Content\n                       \n\n                        In\n                        \n                         Admin Settings > Certified Content > Certified Cards/Certified DataSets\n                        \n                        , you can specify whether certifications for Cards or DataSets are automatically expired if changes are made to those Cards or DataSets in Analyzer. This lets you ensure that any content updates to certified Cards or DataSets get approval first. You do this by toggling the\n                        \n                         Expire if edited\n                        \n                        switch. Note that this is a\n                        \n                         global\n                        \n\n\n\n                         setting\n                        \n                        ; you cannot enable this setting on a Card-by-Card or DataSet-by-DataSet basis.\n                       \n\n\n\n\n                        When this option is enabled, if a user attempts to save after editing a certified Card or DataSet, a message similar to the following appears:\n                       \n\n\n\n\n                        If the user then saves the Card or DataSet, it reverts to \"Certification pending\" (with the\n                        \n                        or\n                        \n                        badge appearing on the Card or DataSet) until it has gone through the approval process again.\n                       \n\n                        Canceling or Removing Certification\n                       \n\n                        In\n                        \n                         Admin Settings > Certified Content > Certified Cards/Certified DataSets\n                        \n                        , you can cancel any pending certifications as well as remove any certifications that have already been given. You do this by clicking the\n                        \n                        icon for a Card or DataSet then selecting\n                        \n                         Cancel certification\n                        \n                        (for pending certifications) or\n                        \n                         Remove certification\n                        \n                        (for approved certifications).", "Preview Article": "Click here to preview", "URL Name": "360043430613", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003015", "Archived Date": "", "Language": "English", "Primary Version": "Certifying Cards and DataSets", "Article Total View Count": "8,006", "": "", "Article Created Date": "10/24/2022, 8:59 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Certifying Cards and DataSets\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Certifications\n              \n", "url": "/s/topic/0TO5w000000ZanGGAS"}]}