{"file_path": "../../raw_kb_v2\\article\\360043442453\\index.html", "content": {"Title": "Domo Layout", "Article Body": "Domo consists of various screens that allow access to your data and options for working with it. Navigation buttons for the most important screens are shown at the top of the Domo window, as follows:\n                       \n\n\n\n\n                        These buttons are available all throughout Domo, so you can easily jump between screens no matter where you are (with a few exceptions, such as the Analyzer view). Buttons include the following:\n                       \n\n\n\n\n                           Dashboards\n                          \n                          . Opens the Dashboards portion of Domo. This is the \"main\" area of Domo, in which you can view all of your data in the form of \"Cards.\" Cards are organized into various \"Pages\" or \"Dashboards,\" which are listed in a navigation bar on the left side of the screen for your convenience. The\n                          \n                           Dashboards\n                          \n                          area is the first thing users see when they log into Domo. For more information, see\n                          \n                           New Navigation Announcement.\n                          \n\n\n\n\n\n                           Alerts\n                          \n                          . Opens the Alert Center, in which you can create, view, and manage Alerts—notifications of changes to your business. For more information, see\n                          \n                           Alert Center Layout\n                          \n                          .\n                         \n\n\n\n\n                           Buzz\n                          \n                          . Opens the full-screen view for Buzz, a tool for having conversations with other members of your Domo instance. Buzz is usually open by default in a side-panel view, which you can close or expand as desired. For more information, see\n                          \n                           Buzz Layout\n                          \n                          .\n                         \n\n\n\n\n                           Appstore\n                          \n                          . Opens the Domo Appstore, in which you can deploy different custom Apps and Quickstarts to your Domo instance. For more information, see\n                          \n                           Appstore Layout\n                          \n                          .\n                         \n\n\n\n\n                           Data Center\n                          \n                          . Opens the Data Center, in which you can manage all of your Domo data, including DataSets, DataFlows, DataFusions, and the like. For more information, see\n                          \n                           Data Center Layout\n                          \n                          .\n                         \n\n\n\n\n                           More\n                          \n                          . Provides access to a number of additional screens and tools not shown in the main toolbar, including the following:\n                         \n\n\n\n\n                             Admin\n                            \n                            . Opens the Admin Settings. Here, you have access to controls for administering Domo, including user and group management, security settings, and more. For more information, see\n                            \n                             Admin Settings Overview\n                            \n                            .\n                           \n\n\n\n\n                             Analyzer\n                            \n                            . Lets you jump right into creating a Card in Domo by choosing a DataSet then opening the Card Analyzer so you can customize the Card how you wish. For more information, see\n                            \n                             Analyzer Layout\n                            \n                            .\n                           \n\n\n\n\n                             Asset Library\n                            \n                            . Opens the Asset Library, which contains components for designing custom Apps. Custom App design is discusssed in much more detail in the Domo developer portal at\n                            \n                             https://developer.domo.com/domo-apps/get-started\n                            \n                            .\n                           \n\n\n\n\n                             Certification Center\n                            \n                            . Opens the Certification Center, in which you can manage certification requests that have been submitted by you or that are waiting for your approval. For more information, see\n                            \n                             Certifying Content\n                            \n                            .\n                           \n\n\n\n\n                             Launcher\n                            \n                            . Opens the Launcher, in which you can dynamically view the integrated cards and DataSets for a specific connector or data provider. For more information, see\n                            \n                             Viewing Cards for Data Providers\n                            \n                            .\n                           \n\n\n\n\n                             Projects and Tasks\n                            \n                            . Opens the Projects and Tasks area of Domo. Here, you can take real action with simple planning, assigning, and task-tracking features. For more information, see\n                            \n                             Projects and Tasks Layout\n                            \n                            .\n                           \n\n\n\n\n                             Publications\n                            \n                            . Opens the Publications page, in which you can build slideshows for showcasing your Domo data. For more information, see\n                            \n                             Publications Page Layout\n                            \n                            .\n                           \n\n\n\n\n                             Scheduled Reports\n                            \n                            . Opens the Report Scheduler, where you can set options for sharing Card Pages with designated recipients at a scheduled time. For more information, see\n                            \n                             Scheduling Reports\n                            \n                            .\n                           \n\n\n\n\n                             Feedback\n                            \n                            . Lets you send feedback to Domo.\n                           \n\n\n\n\n                             Help Center\n                            \n                            . Opens the Help Center, from which you can access various help resources, including the Knowledge Base, the Community Forum, the video library, and training resources. For more information, see\n                            \n                             Getting Help\n                            \n                            .\n                           \n\n\n\n\n\n                        In the upper right corner of Domo you'll see five icons for accessing different options. As with the buttons described in the above list, these icons are usually available from anywhere in Domo.\n                       \n\n\n\n\n                        These icons are as follows:\n                       \n\n\n\n                         . Opens the Search tool in Domo. You can use this to search for Cards, Pages, people, Alerts, Buzz messages, Apps, and more. For more information, see\n                         \n                          Searching in Domo\n                         \n                         .\n                        \n\n\n                         . Provides a shortcut for adding many objects into Domo, including connector DataSets, ETL transforms, Cards, Pages, people and groups, Projects and Tasks, and Apps.\n                        \n\n\n                         . Provides a shortcut to the Domo Help Center. For more information, see\n                         \n                          Getting Help\n                         \n                         .\n                        \n\n\n                         . Opens a dialog that shows your most recent Buzz messages and provides access to your user Profile and Settings. In the Profile, you can see where people fit in, find their contact information, and learn how they contribute to the organization. For more information, see\n                         \n                          Notification and Alert settings\n                         \n                         , and more.\n                        \n\n\n                         . Toggles Buzz on or off in the application window. For information about Buzz, see Buzz. wXmlDENeA-k\n                        \n\n\n\n                         Video - Domo Interface - Navigation Header\n                        \n\n\n\n\n\n\n\n                         Video - Domo Interface - Dashboard Menu", "Preview Article": "Click here to preview", "URL Name": "360043442453", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004332", "Archived Date": "", "Language": "English", "Primary Version": "Domo Layout", "Article Total View Count": "8,014", "": "", "Article Created Date": "10/24/2022, 9:40 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Domo Layout\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Getting Started\n              \n", "url": "/s/topic/0TO5w000000ZanlGAC"}]}