{"file_path": "../../raw_kb_v2\\article\\360042922794\\index.html", "content": {"Title": "Submitting Domo Product Feedback", "Article Body": "Intro\n                       \n\n\n                         With the July 2022 release, Domo is introducing a new product feedback process: the\n                         \n                          Ideas Exchange\n                         \n                         in the Community\n                        \n                        Forum\n                        \n\n                          .\n                         \n\n\n\n\n                         The\n                         \n                          Ideas Exchange\n                         \n                         enables users to:\n                        \n\n\n\n\n                          Submit ideas for feature improvement\n                         \n\n\n\n                          Get support from other users and Domo's product managers\n                         \n\n\n\n\n                         Domo users can submit, track, and follow up on feedback. Additionally, users can add multimedia to their submissions and upvote ideas. Domo's product managers regularly review idea submissions, and the most upvoted ideas are given top consideration for future development.\n                        \n\n\n\n                         Video: Product Feedback in the Ideas Exchange\n                        \n\n\n\n\n\n\n                        Submit a Feature Request Using the Ideas Exchange\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           In order to post, you must be logged in using your Domo credentials.\n                          \n\n\n\n\n\n\n                        Follow the steps below to post in the Ideas Exchange:\n                       \n\n                        1. In the navigation header, select\n                        \n                         More > Feedback.\n                        \n\n\n\n\n\n\n\n                        2.\n                        \n                         Select\n                        \n\n                         Product feedback\n                        \n\n                         .\n                        \n\n\n\n                         You will be taken to the Community Forum's\n                         \n                          Ideas Exchange.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you would like to submit an issue rather than an enhancement to the product, select\n                           \n                            Support Issue\n                           \n                           to contact Domo Support.\n                          \n\n\n\n\n\n\n                        3. To share an idea for a new feature, select\n                        \n                         New Idea\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Tip:\n                             \n\n\n                             To ensure our product team can use your suggestions, we have a few guidelines to help you get the most out of the Ideas Exchange:\n                            \n\n\n\n\n\n                             1. Search your product idea before you post a new one. It is likely your idea or something similar has already been posted.\n                            \n\n\n\n\n\n                               If your idea has already been posted,\n                               \n\n                                Upvote\n                               \n                               to increase validity.\n                              \n\n\n\n\n\n                               If a variation of your idea exists,\n                               \n\n                                Upvote\n                               \n                               the idea, then comment with your added recommendations.\n                              \n\n\n\n\n                              Finally, if your idea doesn’t exist, post your new idea.\n                             \n\n\n\n                            2. Please include images and detailed descriptions for your idea. The more context, the better the product team can understand your suggestion.\n                           \n\n\n                            3. Our product team regularly reviews top-voted ideas. You can expect updates (via the comments) from product managers on top-voted ideas.\n                           \n\n\n\n\n\n\n\n                        4. Add a title, description, and tags. You can also add pictures, files, and URLs. To see trending topics, select\n                        \n                         Show popular tags\n                        \n                        .\n                       \n\n\n\n\n\n\n                        5. Select\n                        \n                         Save\n                        \n                        .\n                       \n\n                        Your post is added to the Ideas Exchange. Top-voted suggestions will be reviewed by the product team.\n                       \n\n\n\n                        FAQs\n                       \n\n\n                         How do I know when to submit Product Feedback as opposed to a Support ticket?\n                        \n\n\n                        Product Feedback is reserved for features or enhancements that you would like added to Domo and not necessarily problems or bugs that you may encounter. Any issues you experience should be sent to our\n                        \n                         Help Center\n                        \n                        for additional troubleshooting or assistance. Reach out to the support team by emailing\n                        \n                         support@domo.com\n                        \n\n\n\n\n\n                         When can I expect to hear back from Domo's Product team regarding my feedback?\n                        \n\n\n                        We do not have an exact timeframe on when this turnaround will occur. However, we can assure you that our team will follow up with you directly to address your request in detail.\n                       \n\n\n\n\n                         When will my requested feature be added to the Domo product?\n                        \n\n\n                        We cannot guarantee that all features will be added, but your ideas help us to create an incredible Domo experience for everyone.", "Preview Article": "Click here to preview", "URL Name": "360042922794", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004375", "Archived Date": "", "Language": "English", "Primary Version": "Submitting Domo Product Feedback", "Article Total View Count": "5,084", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Submitting Domo Product Feedback\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Support Resources\n              \n", "url": "/s/topic/0TO5w000000ZaoIGAS"}]}