{"file_path": "../../raw_kb_v2\\article\\360043428993\\index.html", "content": {"title": "\n\n\n 100 Percent Stacked Bar Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nA 100% stacked bar chart is similar to a\n\nstacked bar chart\n\nin that categories are represented as bars and series as components of those bars. However, in a 100% stacked bar chart, each series bar represents the percentage of the overall category to which it belongs. For example, if a category was composed of three series, one with a value of 100, one of 200, and one of 300, the first series would make up 16.6% of the category (because 100 is equal to 16.6% of 600, the total value of all three series), the second would make up 33%, and the third 50%. In a way, then, a 100% stacked bar chart is also similar to a\n\npie chart\n\n, in which each bar corresponds to a pie.\n\n\n As with standard bar charts, both vertical and horizontal versions of 100% stacked bar charts are available. In vertical 100% stacked bar charts, series in categories are \"stacked\" on top of each other; in horizontal 100% stacked bar charts, the series appear side by side.\n\n\n By default the values on the y-axis appear with percent symbols. You can change this behavior in the\n **Chart Properties**\n if you want. For more information, see\n\nFormatting Values in Your Chart\n\n.\n\n\n Powering 100% stacked bar charts\n----------------------------------\n\nA 100% stacked bar chart requires three data columns or rows from your DataSet—one for categories, one for the series in each category, and one for values. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your 100% stacked bar chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how the data from a typical column-based spreadsheet is converted into a vertical 100% stacked bar chart:\n\nThe following graphic shows you how the data from a typical column-based spreadsheet is converted into a horizontal 100% stacked bar chart:\n\nCustomizing 100% stacked bar charts\n-------------------------------------\n\nYou can customize the appearance of a 100% stacked bar chart by editing its\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of 100% stacked bar charts include the following. You can click a thumbnail image to see a larger image.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n General > Sort Each Category\n  |\n Allows you to sort the items in each individual category in most kinds of multi-series bar and lollipop charts. You can choose an ascending or descending sort. If you select\n **Default**\n , the default sort is applied. This option does not work when the\n **Value Scale > Log Scale**\n box is checked.\n\n\n In the example at right, bars within all categories are sorted in descending order.\n  |\n\n|\n|\n General > Sort on Totals\n  |\n Allows you to sort categories in many kinds of bar and lollipop charts by their total values, in either ascending or descending order. If you select\n **Default**\n , the default sort is applied. This option does not work when the chart has automatic time scaling applied. (You can turn off automatic time scaling by checking the box for\n **Category Scale > Never Use Time Scale**\n .\n\n\n In the example at right, the categories are sorted by their totals in ascending order.\n  |\n\n|\n|\n Bar Settings > Non-Stacked Interactivity\n  |\n Turns off the default stacked bar chart interactivity.\n\n\n When you hover over any series in a stacked bar or 100% stacked bar chart, all of the corresponding series are highlighted and connected across the chart, as shown in the first screenshot at right. However, if series data is missing for any stack in the chart, the highlighting is removed and a \"0\" appears in the stack, as shown in the second screenshot. By checking\n **Non-Stacked Interactivity**\n , the connecting lines, highlighting, and \"0\" no longer appear upon hover, as shown in the third screenshot.\n\n\n For more information about DataSet columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n\n|\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428993\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004724\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\n100 Percent Stacked Bar Chart\n\n", "article_total_view_count": "\n\n\n 5,322\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:26 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "100_percent_stacked_bar_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}