{"file_path": "../../raw_kb_v2\\article\\360043437693\\index.html", "content": {"Title": "Domo ODBC Data Driver", "Article Body": "Intro\n                       \n\n                        Domo ODBC Data Driver is an ODBC driver that can be used to fetch data from a Domo Dataset. It is available as 32-bit and 64-bit installer packages for Microsoft Windows. Bitness is decided by the application you are using. 64-bit Windows can run 32-bit as well as 64-bit applications. If your application (the application using Domo ODBC Data Driver) is 32-bit, install a 32-bit driver. This document describes the steps involved in setting up Domo ODBC Data Driver on your machine.\n                       \n\n                        Domo ODBC Data Driver fetches data from Domo over HTTPS. The query execution time depends on the size of data and the data speed of your network.\n                       \n\n                        Domo ODBC Data Driver requires a Client ID and Client Secret for authentication, and it supports simple queries as described later in this document.\n                       \n\n                        To obtain Domo ODBC Data Driver, go to\n                        \n                         Admin\n                        \n                        >\n                        \n                         Tool Downloads\n                        \n                        .\n                       \n\n                        To purchase the ODBC Data Driver, reach out to your Account Executive (AE).\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The ODBC Driver fetches up to 1 million rows.\n                          \n\n\n\n\n                        Connection Strings\n                       \n\n                        ODBC drivers follow this format for the connection string:\n                       \n\n\n                         Driver={<Driver Name>};<additional parameters like username, password>\n                        \n\n\n                        This is the format of additional parameters (key-value pairs separated by semicolon):\n                       \n\n\n                         param1=value1;param2=value2;\n                        \n\n\n                        The Domo ODBC Data Driver follows the same format. A Client ID and Client Secret are required for authentication and must be included in the connection string. A sample connection string for the Domo ODBC Data Driver looks like this:\n                       \n\n\n                         Driver={Domo ODBC Data Driver};ClientID=1234-abcd-5678-efgh;ClientSecret=abcdefgh123456;\n                        \n\n\n                        You can also create connection strings by specifying the DSN (Data Source Name). In the Domo ODBC Data Driver, the DSN stores the Client ID and Client Secret, and the connection string becomes simpler:\n                       \n\n\n                         DSN=DomoDataDSII;\n                        \n\n\n                        DomoDataDSII is the default DSN created during the installation of the Domo ODBC Data Driver. You need to configure the DNS (DomoDataDSII) before using it in any connection string. Configuration is done in the\n                        \n                         ODBC Data Sources\n                        \n                        tool of Windows. You need a valid ClientID and ClientSecret to configure the DSN.\n                        \n                        Syntax of the connection string might change according to the application, as some applications add\n                        \n                         Driver={ and DSN=\n                        \n                        to the provided inputs by default.\n                       \n\n                        Query Syntax\n                       \n\n                        Domo ODBC Data Driver supports standard SQL-type statements in the format\n                        \n                         SELECT <column names, or *> FROM <dataset id> WHERE <clause> …\n                        \n                        etc. For example:\n                        \n\n\n                         SELECT * FROM 6f3def59-4a7b-4c25-99db-5e1b44501afd\n                        \n\n\n                        Or\n                        \n\n\n                         SELECT name, temperature, temperatureUnit, shortForecast FROM 3a2153e4-4b78-4319-9b47-84fb148afd22 WHERE name IN ('Today', 'Tonight', 'This Afternoon')\n                        \n\n\n                        Creating Client ID and Secret\n                       \n\n                        A ClientID and ClientSecret are required parameters for ODBC connection with Domo ODBC Data Driver.\n                       \n\n\n                         To obtain a Client ID and Client Secret for your account,\n                        \n\n\n\n\n                          Login to\n                          \n                           https://developer.domo.com\n                          \n                          and go to\n                          \n                           My Account > Manage Clients.\n                           \n\n\n\n\n\n\n\n\n                          (Conditional) If you don’t have a client, create a new one for the ODBC driver by doing the following:\n                         \n\n\n\n                            Click\n                            \n                             Create a Client\n                            \n                            .\n                            \n\n\n\n\n\n\n                            Enter the name and description.\n                           \n\n\n\n                            Select application scopes. (\n                            \n                             Data\n                            \n                            is a mandatory scope.)\n                           \n\n\n\n\n\n                          Get the Client ID and Client Secret, as these are required for ODBC connection.\n                         \n\n\n\n\n\n\n                        Installing Domo ODBC Data Driver\n                       \n\n                        Before you start, you'll need:\n                       \n\n\n\n                          .NET Framework 4.6.2\n                         \n\n\n\n                          Visual C++ Runtime Libraries.\n                         \n\n\n\n                        If these are missing, the installer will download and install them before continuing with the installation of Domo ODBC Data Driver.\n                       \n\n                        Please select the correct product to install. We have 32-bit and 64-bit installation packages (for Windows only). Check the bitness of the application you want to use the Domo ODBC Data Driver with, and install the correct driver.\n                       \n\n\n                         To install Domo ODBC Data Driver,\n                        \n\n\n\n\n                          Open\n                          \n                           setup.exe\n                          \n                          (not\n                          \n                           setup.msi\n                          \n                          ).\n                          \n\n                          If your system doesn’t have all the prerequisites, the installer will download and install them. You need to grant permission for the installation of the .NET framework and VC++ runtime. If you have all the prerequisites, you will see the Domo ODBC Data Driver Installation wizard.\n                         \n\n\n\n                          Follow the onscreen instructions.\n                         \n\n\n\n                        Test the Functionality\n                       \n\n                        Once the installation is done, you should check to see if the driver is working.\n                       \n\n\n                         To test the functionality of the driver,\n                        \n\n\n\n\n                          Open the ODBC Data Source Administrator.\n                          \n\n                          For 32-bit Domo ODBC Data Driver, you must open the 32-bit version of the ODBC Data Sources, and 64-bit Domo ODBC Data Driver for the 64-bit version. These versions are only available on 64-bit machines. On 32-bit machines, there will be only one version of the Administrator.\n                          \n\n                          The path of ODBC Data Source Administrator is\n                          \n                           %systemdrive%\\Windows\\SysWoW64\\odbcad32.exe\n                          \n                          for 32-bit and\n                          \n                           %systemdrive%\\Windows\\System32\\odbcad32.exe\n                          \n                          for 64-bit.\n                          \n\n                          This application is used for configuring DSNs and requires administrative permissions on the system.\n                         \n\n\n\n                          Go to the\n                          \n                           File DSN\n                          \n                          tab and click\n                          \n                           Add\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Domo ODBC Data Driver\n                          \n                          and click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Browse\n                          \n                          .\n                         \n\n\n\n                          Select a folder in which to save the DSN file.\n                         \n\n\n\n                          Type in file name you want to save and click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Finish\n                          \n                          .\n                          \n\n                          A dialog pops up asking for the Client ID and Client Secret.\n                         \n\n\n\n                          Enter the Client ID and Client Secret.\n                          \n\n                          If the values you entered are invalid or if the connection could not be made with Domo, a warning dialog appears.\n                          \n\n\n\n\n                          In this case, you must verify the installation, credentials, network, and accessibility to Domo APIs. Otherwise, a file will get created on successful verification.\n                          \n\n\n\n\n                          Proceed only if your files get created successfully.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are using the driver in \"Trial Mode\" (unpurchased) and the trial has expired you will also get this connection error message.\n                          \n\n\n\n\n                        Configure the DSN\n                       \n\n                        Once you have performed a successful test of your driver, the next step is to configure your DSN.\n                       \n\n\n                         To configure your DSN,\n                        \n\n\n\n\n                          In the ODBC Data Source Administrator, go to the\n                          \n                           System DSN\n                          \n                          tab.\n                          \n                          You should see a file called \"DomoDataDSII.\"\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Configure\n                          \n                          .\n                          \n                          A dialog asks for your Client ID and Client Secret.\n                         \n\n\n\n                          Enter a valid Client ID and Client Secret and click\n                          \n                           OK\n                          \n                          .\n                         \n\n\n\n                        Now you can use DomoDataDSII for ODBC connections. If the Client ID or Client Secret are invalid or not configured, you will face issues during connection with your application. If you see any connection issues while using DSN, please check the values of\n                        \n                         Client ID\n                        \n                        and\n                        \n                         Client Secret\n                        \n                        first.\n                       \n\n                        Instead of configuring the DomoDataDSII, you can also create your own DSN with the\n                        \n                         Add\n                        \n                        button. You can create as many DSNs as you need.\n                       \n\n                        Using Domo ODBC Data Driver in Excel\n                       \n\n                        As described in the\n                        \n                         Connection Strings\n                        \n                        section, there are two alternate formats of connection strings that can be used to connect to Domo ODBC Data Driver.\n                       \n\n                        Using DSN\n                       \n\n                        Prerequisite:\n                        \n                         Configure DSN\n                        \n                        .\n                       \n\n\n                         To connect to Domo ODBC Data Driver using DSN,\n                        \n\n\n\n\n                          In the\n                          \n                           Data\n                          \n                          tab in Excel, select\n                          \n                           New Query > From Other Sources > From ODBC\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Select \"DomoDataDSII\" (or the name of your DSN) from the dropdown.\n                         \n\n\n\n                          In\n                          \n                           Advanced Options\n                          \n                          , enter the \"Select\" query (see\n                          \n                           Query Syntax\n                          \n                          ), then click\n                          \n                           OK\n                          \n                          .\n                          \n\n\n\n\n                          A preview will load. Note that this may take a while for a large DataSet.)\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Load\n                          \n                          and data will be loaded after execution of the query.\n                          \n\n\n\n\n\n\n                        Using a Driver Connection String\n                       \n\n                        Follow the same steps mentioned in\n                        \n                         Using DSN\n                        \n                        to open ODBC settings. However, instead of selecting \"DomoDataDSII\" in step 2, select\n                        \n                         None\n                        \n                        in\n                        \n                         Data Source Name\n                        \n                        . Then enter the connection string as described in\n                        \n                         Connection Strings\n                        \n                        and the query as described in\n                        \n                         Query\n                        \n                        .\n                       \n\n                        All other steps after this are same as described in\n                        \n                         Using DSN\n                        \n                        .\n                       \n\n                        Using Domo ODBC Data Driver With DBeaver/ (ODBC SQL Tool)\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n\n                               The Bitness of the tool and the driver should match. The 64-bit tool will work with the 64-bit driver, and the 32-bit tool will work with the 32-bit Domo ODBC Data Driver. Please make sure\n                              \n                              you are using the correct products.\n                             \n\n\n\n                              If you are using a DSN to connect, make sure you have configured the DSN correctly. For more details, see\n                              \n                               Configure the DSN\n                              \n                              .\n                             \n\n\n\n\n\n\n\n\n                         To use Domo ODBC Data Driver with DBeaver,\n                        \n\n\n\n\n                          Select\n                          \n                           ODBC\n                          \n                          and click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Type \"DomoDataDSII\" in the\n                          \n                           Database/Schema\n                          \n                          box.\n                         \n\n\n\n                          Click\n                          \n                           Test Connection.\n                          \n\n                          You should see the test results.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          ,\n                          \n                           Next\n                          \n                          , and then\n                          \n                           Finish\n                          \n                          .\n                         \n\n\n\n                          Open the SQL Editor as shown below.\n                          \n\n\n\n\n\n\n                          Type in the query and execute as shown below.\n                          \n\n\n\n\n\n\n\n                          Once query execution is complete, you should see the results.\n                          \n\n\n\n\n\n\n                        The DBeaver does not support long connection strings, so we cannot create a connection using Driver Name. If your tool supports long connection strings, you can use Driver Name instead of DSN. Please see\n                        \n                         Connection Strings\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043437693", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003162", "Archived Date": "", "Language": "English", "Primary Version": "Domo ODBC Data Driver", "Article Total View Count": "5,902", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Domo ODBC Data Driver\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}