{"file_path": "../../raw_kb_v2\\article\\360042936254\\index.html", "content": {"Title": "April 2016 Release Notes", "Article Body": "Note:\n                           \n                           Depending on the product version you are using, the documentation may include information about features that may not be available or may have changed.\n                          \n\n\n\n\n                        New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Android App\n                       \n\n                        Domo has been hyper-focused on the modern business executive since we began. That person is not tied down to a desk—they are often on the move. In February we released our new Mobile Web experience to provide a mobile optimized experience for iOS and Android users in a mobile browser. In March we released a newly rewritten iOS app. This month we are completing the mobile triple play with the release of the new Android app we announced at Domopalooza.\n                       \n\n                        With this app you get the same features as the iOS app, with a design that will be familiar to Android users while also distinctly Domo. Android users will now have access to such features as filtering cards using Analyzer, support for new publication groups, and a new Home experience. As with Home on iOS, Android's Home will give you trending content, allow you to personalize your daily hotlist of critical content, and help you discover new people and cards.\n                       \n\n                        The new Android app will be available in the Google Play Store.\n                       \n\n                        Updated menus\n                       \n\n                        In the interest of providing a more consistent and enjoyable user experience, the main menu bar in Domo has been consolidated and most options moved to one of two menus. The icon that previously resembled a downward-pointing arrow has been replaced with a more intuitive \"grid\" icon, and nearly all tools have been relocated into this menu:\n                       \n\n                        In addition, notifications, profile access, and user settings have been moved into a new menu accessible by clicking the user profile picture:\n                       \n\n                        For more information, see\n                        \n                         Domo Application Layout\n                        \n                        .\n                       \n\n                        DataSet Import Manual Cancellation\n                       \n\n                        Domo now provides you with additional control over your DataSets by allowing you to stop long-running imports instead of waiting for the job to complete. If you have a DataSet that is taking too long to update and you need to stop it, simply select\n                        \n                         Stop Import\n                        \n                        in the DataSet options menu. This stops the import from running and allows you to make adjustments to the configuration before re-running the import. The DataSet history will be updated to indicate that the import has been cancelled. You can re-run the job manually or let the import run on the existing schedule.\n                       \n\n\n\n\n\n\n                        DataFlow updates\n                       \n\n\n                         DataFlows has been updated with a number of new enhancements designed to improve the user experience and increase consistency.\n                        \n\n\n\n\n\n                           Options menu on Details page\n                          \n                          . This menu provides the same options as the Options menu in the DataSet Details page, such as\n                          \n                           Edit\n                          \n                          ,\n                          \n                           Run\n                          \n                          ,\n                          \n                           Duplicate\n                          \n                          , etc. This allows for a more consistent and pleasing user experience.\n                          \n\n\n\n\n\n\n\n\n                           Ability to check permissions on run\n                          \n                          . You can now control who has access to your data through sharing of cards powered by DataFlow inputs.\n                          \n\n\n\n\n\n\n\n\n                           Ability to reassign owner\n                          \n                          . Admin users can now change the owner of a DataFlow from the DataFlow Details page.\n                         \n\n\n\n\n\n\n\n\n\n\n                           Magic ETL interface improvements\n                          \n                          .\n                          \n                           All\n                          \n                          Magic ETL actions now have their own unique icons, and the icons in the palette match those in the sidebar. These improvements will help alleviate confusion experienced by users new to the Magic ETL interface. Also, you can now do multi-select for duplicating and deleting.\n                          \n\n\n\n\n\n\n\n\n                         Full-screen cards\n                        \n\n\n                        While in the Details view for a card, you can now access a full-screen mode. This full-screen viewing mode provides all of the same functionality found in the standard Details view, including drilldown, alert functionality, filtering, access information, and so on. The full-screen mode persists until you leave the Details view, so if you navigate to another card using a link, that card will also appear in the full-screen mode. This mode is available for all types of cards.\n                       \n\n                        For more information, see\n                        \n                         Card Details View Layout\n                        \n                        .\n                       \n\n                        Document card clicker capability\n                       \n\n                        You can now navigate through document cards in preview mode using a clicker, just as you could in a Microsoft PowerPoint presentation.\n                       \n\n                        Frozen table headers\n                       \n\n                        Users of tables can now scroll down a table to view rows while still seeing the header rows. This improves the user experience by allowing users to preserve their context while navigating tables.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Card Details View Layout\n                        \n                        .\n                       \n\n                        Future date range options on cards\n                       \n\n                        The list of available date ranges for cards now includes several \"future\" date ranges, such as \"Tomorrow,\" \"Next Quarter,\" etc. This data is\n                        \n                         not\n                        \n                        forecast/projection data; it merely allows you to include future dates already included in your DataSet.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Filtering Dates\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by using @DomoSupport in Buzz, by email at\n                          \n                           support@domo.com\n                          \n                          or by phone at 801-805-9505 (Monday through Friday, 7 am to 6 pm MST)\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042936254", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004461", "Archived Date": "", "Language": "English", "Primary Version": "April 2016 Release Notes", "Article Total View Count": "2,398", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              April 2016 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}