{"file_path": "../../raw_kb_v2\\article\\360043435353\\index.html", "content": {"Title": "Bureau of Labor Statistics Connector", "Article Body": "Intro\n                       \n\n\n                         The Bureau of Labor Statistics (BLS) is a unit of the United States Department of Labor. It is the principal fact-finding agency for the U.S. government  in the broad field of labor economics and statistics and serves as a principal agency of the U.S. Federal Statistical System. The Domo Bureau of Labor Statistics connector allows you to extract headlines from BLS publications in RSS Feed (XML) format.\n                        \n\n\n                        The Bureau of Labor Statistics connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n\n                         You create a Bureau of Labor Statistics DataSet in the Data Center. This topic discusses the fields and menus that are specific to the Bureau of Labor Statistics connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         To learn about BLS Unemployment public-facing datasets, see\n                         \n                          Public Datasets Connectors\n                         \n                         .\n                        \n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Use this connector to...\n                           \n\n\n\n                              View consumer price index (CPI) trends\n                             \n\n\n\n                              View college enrollment trends\n                             \n\n\n\n                              View employment trends\n                             \n\n\n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Unemployment numbers/percentages\n                             \n\n\n\n                              Consumer price index trends\n                             \n\n\n\n                              Employee wage trends\n                             \n\n\n\n                              Employee cost indices\n                             \n\n\n\n                              Real average hourly earnings\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            HR directors\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            A few minutes\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            1\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n                        It is helpful to review the BLS report types and definitions to identify where appropriate data can be obtained.\n                       \n\n\n                         Prerequisites\n                        \n\n\n                        There are no prerequisites for this connector unless you plan to run the \"Local Area Unemployment Statistics\" report, in which case a registration key is required. Otherwise no credentials are necessary.\n                       \n\n                        To obtain a registration key, go to the BLS Public Data API 2.0\n                        \n                         registration page\n                        \n                        , and enter your email address and organization name. Complete the CAPTCHA. You will receive an email from\n                        \n\n                          labstat@bls.gov\n                         \n\n                        with your registration key.\n                       \n\n\n                         Creating a Bureau of Labor Statistics DataSet\n                        \n\n\n\n                         This section describes how to create a Bureau of Labor Statistics DataSet in the Bureau of Labor Statistics Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Details Pane\n                        \n\n\n\n                         This pane contains a single menu in which you select a Bureau of Labor Statistics report type.\n                        \n\n\n\n                         The following table describes all of the predefined reports you can create using the Domo Bureau of Labor Statistics connector.\n                        \n\n\n\n\n\n\n\n\n                              Menu\n                             \n\n\n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n\n                             Access to and Use of Leave\n                            \n\n\n\n\n\n                             Returns headlines about American wage and salary workers' access to leave, use of leave, and ability to adjust their work schedules.\n                            \n\n\n\n\n\n\n\n                             American Time Use Survey\n                            \n\n\n\n\n\n                             Returns headlines from the American Time Use Survey.\n                            \n\n\n\n\n\n\n\n                             Census of Fatal Occupational Injuries\n                            \n\n\n\n\n\n                             Returns headlines from the Census of Fatal Occupational Injuries.\n                            \n\n\n\n\n\n\n\n                             College Enrollment and Work Activity of High School Graduates\n                            \n\n\n\n\n\n                             Returns headlines about college enrollment and work activity of high school graduates in the United States.\n                            \n\n\n\n\n\n\n\n                             Consumer Expenditures Midyear Update\n                            \n\n\n\n\n\n                             Returns headlines about spending by American consumers.\n                            \n\n\n\n\n\n\n\n                             Consumer Expenditures Survey (Annual)\n                            \n\n\n\n\n\n                             Returns headlines about spending by American consumers.\n                            \n\n\n\n\n\n\n\n                             Consumer Price Index\n                            \n\n\n\n\n\n                             Returns monthly headlines on changes in the prices paid by American urban consumers for a representative basket of goods and services.\n                            \n\n\n\n\n\n\n\n                             County Employment and Wages\n                            \n\n\n\n\n\n                             Returns headlines about U.S. counties with the largest percentage increases in average weekly wages.\n                            \n\n\n\n\n\n\n\n                             Employee Benefits in the United States\n                            \n\n\n\n\n\n                             Returns headlines about the percentage of American employees receiving benefits.\n                            \n\n\n\n\n\n\n\n                             Employee Tenure\n                            \n\n\n\n\n\n                             Returns headlines about the median number of years that wage and salary workers in the U.S. have been with their current employer.\n                            \n\n\n\n\n\n\n\n                             Employer Costs for Employee Compensation\n                            \n\n\n\n\n\n                             Returns headlines about the average hourly costs for employee compensation in the U.S.\n                            \n\n\n\n\n\n\n\n                             Employment Characteristics of Families\n                            \n\n\n\n\n\n                             Returns headlines about the percentages of families in the U.S. with employed and unemployed members, working single mothers or fathers, etc.\n                            \n\n\n\n\n\n\n\n                             Employment Cost Index\n                            \n\n\n\n\n\n                             Returns headlines about employment costs for civilian, private industry, and state and government workers in the U.S.\n                            \n\n\n\n\n\n\n\n                             Employment Experience of Youths: Results from a Longitudinal Survey\n                            \n\n\n\n\n\n                             Returns headlines about work experience for young adults in the U.S.\n                            \n\n\n\n\n\n\n\n                             Employment Projections\n                            \n\n\n\n\n\n                             Returns headlines about employment projections in the U.S.\n                            \n\n\n\n\n\n\n\n                             Employment Situation\n                            \n\n\n\n\n\n                             Returns headlines about total nonfarm payroll employment in the U.S.\n                            \n\n\n\n\n\n\n\n                             Employment Situation of Veterans\n                            \n\n\n\n\n\n                             Returns headlines about employment among U.S. Armed Forces veterans.\n                            \n\n\n\n\n\n\n\n                             Extended Mass Layoffs (Quarterly)\n                            \n\n\n\n\n\n                             Returns quarterly headlines about the number of mass layoff events in the U.S.\n                            \n\n\n\n\n\n\n\n                             Green Goods and Services\n                            \n\n\n\n\n\n                             Returns headlines about the percent change of jobs associated with the production of Green Goods and Services (GGS).\n                            \n\n\n\n\n\n\n\n                             Green Technologies and Practices\n                            \n\n\n\n\n\n                             Returns headlines from the Green Technologies and Practices (GTP) survey, a special survey of business establishments designed to collect data on establishments' use of green technologies and practices and the occupations of workers who spend more than half of their time involved in green technologies and practices. (Note: The Green Technologies and Practices program has been eliminated.)\n                            \n\n\n\n\n\n\n\n                             International Comparisons of Hourly Compensation Costs in Manufacturing\n                            \n\n\n\n\n\n                             Returns headlines about U.S. compensation costs compared to those of various other nations. (Note: The International Labor Comparisons program has been eliminated.)\n                            \n\n\n\n\n\n\n\n                             Job Openings and Labor Turnover Survey\n                            \n\n\n\n\n\n                             Returns headlines about changes in the number of job openings in the U.S. per month.\n                            \n\n\n\n\n\n\n\n                             Labor Force Characteristics of Foreign-Born Workers\n                            \n\n\n\n\n\n                             Returns headlines about the unemployment rate for native and foreign-born workers in the U.S.\n                            \n\n\n\n\n\n                           Local Area Unemployment Statistics\n                          \n\n\n                            Returns monthly and annual data about employment, unemployment, and labor force.\n                           \n\n                            To use this report, you\n                            \n                             must\n                            \n                            enter a registration key in the\n                            \n                             Credentials\n                            \n                            pane. For more information, see \"Prerequisites,\" above.\n                           \n\n\n\n\n\n\n                             Major Work Stoppages (Annual)\n                            \n\n\n\n\n\n                             Returns annual headlines about the number of strikes and lockouts in the U.S.\n                            \n\n\n\n\n\n\n\n                             Mass Layoffs (Monthly)\n                            \n\n\n\n\n\n                             Returns monthly headlines about mass layoff actions in the U.S. (Note: The Mass Layoff Statistics program has been eliminated.)\n                            \n\n\n\n\n\n\n\n                             Metropolitan Area Employment and Unemployment (Monthly)\n                            \n\n\n\n\n\n                             Returns monthly headlines about employment and unemployment in U.S. metropolitan areas.\n                            \n\n\n\n\n\n\n\n                             Multifactor Productivity Trends\n                            \n\n\n\n\n\n                             Returns the percent change in private nonfarm business sector multifactor productivity in the U.S.\n                            \n\n\n\n\n\n\n\n                             Multifactor Productivity Trends for Detailed Industries\n                            \n\n\n\n\n\n                             Returns headlines about changes in productivity trends in the U.S.\n                            \n\n\n\n\n\n\n\n                             Multifactor Productivity Trends in Manufacturing\n                            \n\n\n\n\n\n                             Returns the percent change in multifactor productivity in the manufacturing sector in the U.S.\n                            \n\n\n\n\n\n\n\n                             Number of Jobs, Labor Market Experience, and Earnings Growth\n                            \n\n\n\n\n\n                             Returns headlines about the number of jobs held by U.S. workers during specific ranges of years.\n                            \n\n\n\n\n\n\n\n                             Occupational Employment and Wages\n                            \n\n\n\n\n\n                             Returns headlines about occupations in the U.S., such as the occupations with the largest employment, mean wages across the U.S., the highest paying occupational groups, etc.\n                            \n\n\n\n\n\n\n\n                             Occupational Employment and Wages in Green Goods and Services\n                            \n\n\n\n\n\n                             Returns headlines about U.S. occupations in establishments that receive all their revenue from Green Goods and Services (GGS).\n                            \n\n\n\n\n\n\n\n                             Occupational Injuries and Illnesses (Annual)\n                            \n\n\n\n\n\n                             Returns annual headlines about the number of injuries and illnesses occurring in the workplace in the U.S.\n                            \n\n\n\n\n\n\n\n                             Occupational Outlook Handbook\n                            \n\n\n\n\n\n                             Returns publication information for the BLS' Occupational Outlook Handbook.\n                            \n\n\n\n\n\n\n\n                             Persons with a Disability: Labor Force Characteristics\n                            \n\n\n\n\n\n                             Returns headlines about employment for individuals with a disability in the U.S.\n                            \n\n\n\n\n\n\n\n                             Producer Price Index\n                            \n\n\n\n\n\n                             Returns headlines about the average change over time in the selling prices received by domestic producers for their output in the U.S.\n                            \n\n\n\n\n\n\n\n                             Productivity and Costs\n                            \n\n\n\n\n\n                             Returns quarterly headlines about changes in nonfarm business sector labor productivity in the U.S.\n                            \n\n\n\n\n\n\n\n                             Productivity and Costs by Industry: Manufacturing\n                            \n\n\n\n\n\n                             Returns annual percent change data for productivity in the manufacturing industry in the U.S.\n                            \n\n\n\n\n\n\n\n                             Productivity Costs by Industry: Selected Service-Providing and Mining Industries\n                            \n\n\n\n\n\n                             Returns annual percent change data for productivity in service-providing and mining industries in the U.S.\n                            \n\n\n\n\n\n\n\n                             Productivity Costs by Industry: Wholesale and Retail Trade, Food Services, and Drinking Places\n                            \n\n\n\n\n\n                             Returns annual percent change data for productivity in wholesale and retail trade, food services, and drinking establishments in the U.S.\n                            \n\n\n\n\n\n\n\n                             Quarterly Data Series on Business Employment Dynamics\n                            \n\n\n\n\n\n                             Returns headlines generated from the Quarterly Census of Employment and Wages program. These quarterly data series consist of gross job gains and gross job losses statistics from 1992 forward. These data help to provide a picture of the dynamic state of the labor market.\n                            \n\n\n\n\n\n\n\n                             Real Earnings\n                            \n\n\n\n\n\n                             Returns percent change data for real average hourly earnings for all employees in the U.S.\n                            \n\n\n\n\n\n\n\n                             Regional and State Employment and Unemployment (Monthly)\n                            \n\n\n\n\n\n                             Returns monthly employment and unemployment comparison data for U.S. states and regions.\n                            \n\n\n\n\n\n\n\n                             Regional and State Employment and Unemployment (Annual)\n                            \n\n\n\n\n\n                             Returns annual employment and unemployment comparison data for U.S. states and regions.\n                            \n\n\n\n\n\n\n\n                             Summer Youth Labor Force\n                            \n\n\n\n\n\n                             Returns annual percent change data for youth employment during the months of April to July in the U.S.\n                            \n\n\n\n\n\n\n\n                             U.S. Import and Export Price Indexes\n                            \n\n\n\n\n\n                             Returns monthly percent change data for U.S. imports and exports.\n                            \n\n\n\n\n\n\n\n                             Union Membership (Annual)\n                            \n\n\n\n\n\n                             Returns annual percent change data for union membership rates in the U.S.\n                            \n\n\n\n\n\n\n\n                             Usual Weekly Earnings of Wage and Salary Workers\n                            \n\n\n\n\n\n                             Returns median weekly earnings of full-time wage and salary workers by quarter in the U.S.\n                            \n\n\n\n\n\n\n\n                             Volunteering in the United States\n                            \n\n\n\n\n\n                             Returns annual percent change data for the volunteer rate in the U.S.\n                            \n\n\n\n\n\n\n\n                             Work Experience of the Population (Annual)\n                            \n\n\n\n\n\n                             Returns annual headlines about work experience in the U.S., including the proportion of workers who worked full time, the number of individuals who looked for work but could not find it, unemployment rate, etc.\n                            \n\n\n\n\n\n\n\n                             Worker Displacement\n                            \n\n\n\n\n\n                             Returns headlines about the number of workers displaced from their jobs.\n                            \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Best Practices\n                       \n\n                        This connector provides predefined metrics of well-known and common reports from the BLS. It is helpful to review the BLS report types and definitions to identify where appropriate data can be obtained.\n                       \n\n                        Troubleshooting\n                       \n\n                        If running the \"Local Area Unemployment Statistics\" report, make sure your API key is valid.\n                       \n\n                        FAQ\n                       \n\n                        How can I view other reports without a registration key?\n                       \n\n                        You do not need a registration key to view other reports. Click Connect to skip adding a registration key.\n                       \n\n                        Can this connector pull custom fields?\n                       \n\n                        No.\n                       \n\n                        How frequently will my data update?\n                       \n\n                        As often as needed.", "Preview Article": "Click here to preview", "URL Name": "360043435353", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003380", "Archived Date": "", "Language": "English", "Primary Version": "Bureau of Labor Statistics Connector", "Article Total View Count": "4,711", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Bureau of Labor Statistics Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}