{"file_path": "../../raw_kb_v2\\article\\360043439193\\index.html", "content": {"Title": "Turning on Multi-Factor Authentication", "Article Body": "Intro\n                        \n\n\n\n                         In the Admin Settings, you can access options for enabling multi-factor authentication for the employees in your company. When multi-factor authentication is enabled, users who log into\n                        \n                        Domo\n                        \n                         are sent an authentication code via text message. They must then enter this code to access\n                        \n                        Domo\n                        \n                         . If they have not entered mobile numbers into Domo, they will receive an email instead. They will not receive a separate prompt.\n                        \n\n\n                        The mobile app does not currently act as the second factor for authentication. Users on mobile will need to receive the SMS message the first time they log in.\n                       \n\n                        If enabling multi-factor authentication outside the US, please note that your valid mobile phone number MUST start with a country code. For instance, if receiving SMS notifications in Japan, enter your number as \"+81 80-1234-5678\" where 81 is the Japan country code. If you are unsure what your country code is, see\n                        \n                         https://countrycode.org/\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Multi-Factor Authentication settings are not enforced when users log in through SSO. If you require multi-factor authentication for SSO users, this needs to be configured with the identity provider. Direct Sign-On users will still have multi-factor authentication applied to their logins. For more information, see\n                            \n                             Understanding and Configuring Domo Single Sign-On\n                            \n\n\n                            .\n                           \n\n\n\n\n\n\n                         In\n                         \n                          More >\n                         \n\n\n\n                          Admin\n                         \n\n\n\n                          > Authentication > Authentication\n                         \n                         , you have access to the following multi-factor authentication options:\n                        \n\n\n\n\n\n                           You can set a requirement that users redo their multi-factor authentication after a given number of days.\n                          \n\n\n\n\n\n                           You can set a requirement that codes expire after a given number of failed attempts.\n                          \n\n\n\n\n\n                         You can also set multi-factor authentication for yourself, as opposed to turning it on for your entire company. You do this in your user\n                         \n                          Settings\n                         \n                         screen.\n                        \n\n\n\n\n                          Video - Multi-Factor Authentication\n                         \n\n\n\n\n\n\n\n\n\n\n                         Enabling Multi-Factor Authentication for Your Company\n                        \n\n\n\n                         You can only change the authentication settings if you have an Admin default security role or a custom role with the Manage All Company Settings grant enabled. For more information about default security roles, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n                         The\n                        \n\n                         Admin Settings\n                        \n\n                         displays.\n                        \n\n\n                        2. In the\n                        \n                         Authentication\n                        \n                        panel, locate\n                        \n                         Multi-factor Authentication\n                        \n                        .\n                       \n\n\n                         a. (Optional) To require that users redo their multi-factor authentication after a given number of days, do the following:\n                        \n\n\n\n\n                          Check the\n                          \n                           Require users to periodically redo Multi-factor authentication\n                          \n                          box.\n                         \n\n\n\n                          Enter the number of days before multi-factoring expires.\n                         \n\n\n\n\n                         b. To set that codes expire after a given number of failed attempts, do the following:\n                        \n\n\n\n\n                          Enter the number of accepted invalid attempts before code expiration.\n                         \n\n\n\n                          Select\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n\n                         Your authentication preferences are complete.\n                        \n\n\n\n\n\n\n\n\n\n                         FAQs\n                        \n\n\n\n\n                          Can I require Multi-Factor Authentication for my users?\n                         \n\n\n\n\n                         Yes. Please contact your customer service team to have this capability added to your instance. You'll then have access to a new setting on the Authentication screen that will allow you to require MFA for your users.\n                        \n\n\n\n\n                          Is multi-factor verification supported by Workbench, Excel Plugin, or PowerPoint Plugin?\n                         \n\n\n\n\n\n                          Not at this time.\n                         \n\n\n\n\n                         Why can't I receive my verification code?\n                        \n\n\n                        Your valid mobile phone number MUST start with a country code. If your\n                        \n                         phone number in Japan is 080-1234-5678, enter it as \"+81 80-1234-5678\" w\n                        \n                        here 81 is the Japan country code. If you are unsure what your country code is, see\n                        \n                         https://countrycode.org/\n                        \n\n\n\n                         What will happen if multi-factor authentication is enabled before users have entered their mobile numbers?\n                        \n\n\n\n                         Those users will receive an email with the code instead of a text message.", "Preview Article": "Click here to preview", "URL Name": "360043439193", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003018", "Archived Date": "", "Language": "English", "Primary Version": "Turning on Multi-Factor Authentication", "Article Total View Count": "5,262", "": "", "Article Created Date": "10/24/2022, 8:59 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Turning on Multi-Factor Authentication\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Domo Security Options\n              \n", "url": "/s/topic/0TO5w000000ZandGAC"}]}