{"file_path": "../../raw_kb_v2\\article\\360042929434\\index.html", "content": {"title": "\n\n\n Predix Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGE Predix is an Industrial Internet of Things (IIoT) Platform as a Service that allows developers to build monitoring and predictive analytics solutions for industrial sensors. To learn more about the Predix API, visit their page (\n\nhttps://www.predix.io/api\n\n).\n\n\n You connect to your Predix account in the Data Center. This topic discusses the fields and menus that are specific to the Predix connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Predix account and create a DataSet, you must have the following:\n\n The client ID for your OAuth service.\n* The client secret for your OAuth service.\n* The URI of your UAA instance. Use\n\ncf env\n\nto find your URI. For more information, see Predix's API documentation at\n\nhttps://www.predix.io/api\n\n.\n* The OAuth credentials for your Predix app.\n\nConnecting to Your Predix Account\n-----------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Predix Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Predix account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Client ID\n  |\n Enter the client ID for your OAuth service.\n  |\n|\n Client Secret\n  |\n Enter the client secret for your OAuth service.\n  |\n|\n OAuth (UAA) URL\n  |\n Enter the URI of your UAA instance. Use\n\ncf env\n\nto find your URI. Enter the value from the \"uri\" field here.\n  |\n\n\n Once you have entered valid Predix credentials and hit\n **Connect**\n , you are taken to the OAuth page for your Predix app where you are requested to log in using your credentials. Once you have suyou can use the same account any time you go to create a new Predix DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Predix report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Analytics\n  |\n Returns information about Predix analytics and orchestrations.\n  |\n|\n Assets\n  |\n Returns information about the Predix asset catalog and asset collections.\n  |\n|\n Time Series\n  |\n Returns time series data points based on a specified query.\n  |\n\n|\n|\n Subreport\n  |\n Select a subreport to filter your results by.\n  |\n|\n API Region\n  |\n Select your Predix API region.\n  |\n|\n Resource Zone ID\n  |\n Enter the zone ID for the selected report. For example, for the \"Time Series\" report, enter your Predix Time Series Zone ID. You can generate a list of zone IDs using the Predix command line tool, using\n\ncf env\n\n. For more information, refer to Predix's API documentation at\n\nhttps://www.predix.io/api\n\n.\n  |\n|\n Query Method\n  |\n Select the method to use to build your Time Series query.\n **Query Builder**\n builds a query for you based on your selections.\n **Advanced**\n lets you enter your own JSON query. For more information on valid JSON query syntax, refer to Predix's API documentation at\n\nhttps://www.predix.io/api\n\n.\n  |\n|\n Time Series JSON Query\n  |\n Enter your Time Series JSON query. For more information on valid JSON query syntax, refer to Predix's API documentation at\n\nhttps://www.predix.io/api\n\n.\n  |\n|\n Start Date Mode\n  |\n Select whether to use a specific or relative start date for your report (relative meaning the connector sets the start date to a relative number of time units back from the day the report is run).\n  |\n|\n End Date Mode\n  |\n Select whether to use a specific or relative end date for your report (relative meaning the connector sets the end date to a relative number of time units back from the day the report is run).\n  |\n|\n Specific Start Date\n  |\n Select the start date for your report.\n  |\n|\n Specific End Date\n  |\n Select the end date for your report.\n  |\n|\n Units\n  |\n Enter the desired number of time units back for the Predix Time Series query.\n  |\n|\n Relative Start Date Time Unit\n  |\n Select the desired time unit for your relative start date.\n  |\n|\n Relative End Date Time Unit\n  |\n Select the desired time unit for your relative end date.\n  |\n|\n Quality Filter (Optional)\n  |\n Enter a minimum and maximum quality threshold for your time series query in the format\n\nx,y\n\n. For example, entering 1,3 returns only results that have a minimum quality value of 1 and a maximum quality value of 3. If you leave this blank, results for all quality values are returned.\n  |\n|\n Asset Tags\n  |\n Select the asset tags you want to filter data for.\n  |\n|\n Asset Collection\n  |\n Select the desired asset collection tag.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How often can the data be updated?\n\nAs often as needed.\n\n####\n Are there any API limits I should be aware of?\n\nNo.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929434\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003514\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nPredix Connector\n\n", "article_total_view_count": "\n\n\n 2,349\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "predix_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}