{"file_path": "../../raw_kb_v2\\article\\360043877854\\index.html", "content": {"Title": "New Navigation Announcement", "Article Body": "Intro\n                       \n\n                        Domo's new navigation makes it easy to organize and manage your Pages so that they are easier to find, regardless of whether you have just a few Pages or a few hundred. It also makes is possible to navigate to all of Domo’s most used features in fewer clicks, decreasing the time it takes you to perform actions in Domo and get answers. For more information, watch this\n                        \n                         demo video\n                        \n                        .\n                       \n\n                        The new navigation will be released to all Domo customers in March 2020. Until then, all customers have the option to turn on the new navigation by going into the Admin Settings and selecting\n                        \n\n                          Company Settings > Feature control\n                         \n\n                        , then switching on the option reading \"Enable updated navigation for all users.\" (You must have Admin security privileges to do this.) This way, your organization has the freedom to make the transition whenever it is ready. Note that third-level and favorited Pages are only supported in the updated navigation, so if you switch back to the old navigation from the new navigation, these Pages won't be visible in the UI.\n                       \n\n                        Here’s a highlight list of some of the most notable improvements:\n                       \n\n                        Improved UI\n                       \n\n                        The Pages menu has been moved to the left side of the screen in a scrollable \"Dashboards\" list. You can collapse this list by clicking the\n                        \n                        icon, giving more space when you want to focus on important dashboard content. You can still show the list when it is in its collapsed state by mousing over the\n                        \n                        icon, or \"repin\" the list by clicking\n                        \n                        .\n                       \n\n\n\n\n                        The list is searchable too, allowing you to quickly filter down the list of Pages as you type.\n                       \n\n\n\n\n                        You will also find shortcuts to your most important Domo functions now exposed at the top of the screen, giving you quicker access.\n                       \n\n\n\n\n\n\n                        Third-level Pages\n                       \n\n                        An additional level of Page hierarchy lets you create Subpages of your Subpages. You have more options than ever for how you organize your Pages to show related information.\n                        \n\n\n\n\n\n\n                        Favorite Pages\n                       \n\n                        You can now mark Pages as \"favorites,\" making it easier for you to get to your most important content in Domo. You can add any Page as a \"favorite\" Page by choosing the\n                        \n                         Add to favorites\n                        \n                        option in the wrench menu for the Page.\n                       \n\n\n\n\n                        Once a Page is added as a Favorite, you can jump to it quickly by clicking\n                        \n                         Favorites\n                        \n                        at the top of the Pages list and selecting the Page you want to open.", "Preview Article": "Click here to preview", "URL Name": "360043877854", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004333", "Archived Date": "", "Language": "English", "Primary Version": "New Navigation Announcement", "Article Total View Count": "4,914", "": "", "Article Created Date": "10/24/2022, 9:40 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              New Navigation Announcement\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Getting Started\n              \n", "url": "/s/topic/0TO5w000000ZanlGAC"}]}