{"file_path": "../../raw_kb_v2\\article\\360043431153\\index.html", "content": {"title": "\n\n\n Eloqua Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Eloqua Corp. is a marketing automation SaaS company which develops automated marketing and demand generation software and services for business-to-business marketers. You can use Domo’s Eloqua connector to compile reports on marketing statistics such as contacts, emails opened, website visits, subscribes and unsubscribes, and so on. To learn more about the Eloqua API, visit their page (\n\nhttps://community.oracle.com/community/topliners/code-it\n\n).\n\nThe Eloqua connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\nYou connect to your Eloqua account in the Data Center. This topic discusses the fields and menus that are specific to the Eloqua connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n|  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is appropriate for web analytics and digital marketing use cases.\n  |\n|\n**Primary Metrics**\n | * Sends\n* Opens\n* Clicks\n* Impressions\n* Form fills\n* Web visits\n* Landing page visits\n* Unsubscribes\n* Subscribes\n* Contacts\n |\n|\n**Primary Company Roles**\n | * Digital marketers\n* Marketing directors\n* Marketing analysts\n* CMOs\n |\n|\n**Average Implementation Time**\n |\n 50+ hours\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 6\n  |\n\nBest Practices\n----------------\n\n\n* Set your \"Contacts\" report to\n **Replace**\n , not\n **Append**\n (as \"Contacts\" may change over time).\n* You may need to make recursive DataFlow if you need a historical record of your contacts. For more information, see\n\nCreating a Recursive/Snapshot Magic ETL DataFlow\n\n.\n* For the \"Activities\" report, set your connector to pull a full history, then reconfigure to do a daily Append (this will let you keep your historical data and move forward and diminish runtime).\n* If you need to join \"Activities\" to \"Contacts\" reports (\"Form Submits,\" \"Email Sends,\" \"Email Click-throughs,\" and \"Email Opens\"), join on the \"CONTACT ID\" and to the \"ID\" fields.\n* For subscribes, unsubscribes, and bouncebacks, join on \"EMAIL ADDRESS.\"\n\n\n Prerequisites\n----------------\n\n\n To connect to your Eloqua account and create a DataSet, you must have the following:\n\n\n* The username for your Eloqua account\n* The password for your Eloqua account\n* The company name associated with your Eloqua account\n\n\n Connecting to Your Eloqua Account\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Eloqua Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Eloqua account. The following table describes what is needed for each field:\n\n\n|\n\n*Field**\n\n|\n\n*Description**\n\n|\n| --- | --- |\n|\n\nCompany\n\n|\n\nEnter the company name associated with your Eloqua account.\n\n|\n|\n\nUsername\n\n|\n\nEnter the username you use to log into your Eloqua account.\n\n|\n|\n\nPassword\n\n|\n\nEnter the password you use to log into your Eloqua account.\n\n|\n\n\n Once you have entered valid Eloqua credentials, you can use the same account any time you go to create a new Eloqua DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n\nDetails Pane\n\n\n This pane contains a primary\n **Report**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n**Important:**\n Pulling back excessively large amounts of data may result in Eloqua disabling the user's API connection. Re-enabling the API connection could take up to a few days. Avoid this by limiting the data calls to about 15 million rows per day.\n\n\n|\n\n*Menu**\n\n|\n\n*Description**\n\n|\n| --- | --- |\n|\n Eloqua Report\n  |\n\nSelect the Eloqua report you want to run. The following reports are available:\n\n  |  |\n| --- | --- |\n|\n\nAccounts\n\n|\n\nReturns information on all accounts associated with your company for the given number of days.\n\n|\n|\n\nBouncebacks\n\n|\n\nReturns information on all bouncebacks for the given number of days.\n\n|\n|\n\nCampaigns\n\n|\n\nReturns information on all campaigns for the given number of days.\n\n|\n|\n\nContacts\n\n|\n\nReturns information on all selected contacts.\n\n|\n|\n\nCustom Object\n\n|\n\nReturns information on a selected Custom Data Object.\n\n|\n|\n\nCustom URL from “Data Export”\n\n|\n\nReturns information on a Data Export URL that is ready to download. You enter the URL in the\n **Custom Export Report URL**\n field.\n\n|\n|\n\nEmail Click-Throughs\n\n|\n\nReturns information on the number of users who clicked links in emails sent by your company for the given number of days.\n\n|\n|\n\nEmail Opens\n\n|\n\nReturns information on the number of users who opened emails sent by your company for the given number of days.\n\n|\n|\n\nEmails\n\n|\n\nReturns information on company emails for the given number of days, such as subject line, current status, sender name, creation time, etc.\n\n|\n|\n\nEmail Sends\n\n|\n\nReturns information on emails sent by your company for the given number of days.\n\n|\n|\n\nForm Submits\n\n|\n\nReturns information on the number of users who have submitted forms (either complete or incomplete) on your website for the given number of days.\n\n|\n|\n\nForm Submits (All Fields)\n\n|\n\nReturns information on the number of users who have submitted completed forms on your website for the given number of days.\n\n|\n|\n\nLanding Pages\n\n|\n\nReturns statistics for landing pages for your website.\n\n|\n|\n\nMicrosites\n\n|\n\nReturns information on the number of visits to your company’s microsites for the given number of days.\n\n|\n|\n\nPage Views\n\n|\n\nReturns information on the number of visits to specific pages in your website for the given number of days.\n\n|\n|\n\nSubscribes\n\n|\n\nReturns information on the number of users who have subscribed for the given number of days.\n\n|\n|\n\nSubscriptions\n\n|\n\nReturns information on user subscriptions for the given number of days.\n\n|\n|\n\nUnsubscribes\n\n|\n\nReturns information on the number of users who have unsubscribed for the given number of days.\n\n|\n|\n\nUsers\n\n|\n\nReturns information on users of your company’s Eloqua instance.\n\n|\n|\n\nWeb Visits\n\n|\n\nReturns information on the number of visits to your website for the given number of days.\n\n|\n\n*Note:**\n Data for Eloqua is scattered across numerous reports. With the QuickStart offering, users will not be able to connect data between two individual reports.\n\n|\n|\n\nDays\n\n|\n\nEnter the number of days back that should be represented in the report. For example, if you entered\n\n\n 60\n\n\n , the report would contain data for the last 60 days.\n\n|\n|\n\nData to be Retrieved\n\n|\n\nSpecify whether the report contains all data or just new data since the last successful run. If there has not been a successful run, the\n **All data**\n option should be used.\n\n|\n|\n\nContact Fields\n\n|\n\nSelect up to 95 contact fields. If you do not select any contact fields, the report pulls information for all contacts. Click\n **Clear All**\n to clear all selected contacts.\n\n|\n|\n\nCustom Object\n\n|\n\nSelect a Custom Data Object from the list.\n\n|\n|\n\nCustom Export Report URL\n\n|\n\nEnter the URL for a Data Export that is ready to download. For example:\n\nhttps://secure.p01.eloqua.com/ExportedFiles/customerName/dbb7134f-0305-4e3d-f445-c96971493894`\n\n\n |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQ\n-----\n\n\n####\n Can I use the same Eloqua account for multiple DataSets?\n\nYes.\n\n###\n How frequently will my data update?\n\nAs often as needed.\n\n###\n Are there any API limits I should be aware of?\n\nNo.\n\nSuggested Reports\n--------------------\n\n\n Get up and running quickly with Eloqua data for metrics regarding emails, contacts, landing pages, forms and more by following these suggestions.\n\n\n Load 180 days of data for the following DataSets to get started.\n\n\n**Email Data**\n\n\n Suggested DataSets to use:\n\n\n* Email Sends\n* Email Opens\n* Email Click-Throughs\n* Unsubscribes\n* Bouncebacks\n* Campaigns\n* Emails\n\n\n**Landing Page Data**\n\n\n* Page Views\n* Web Visits\n* Landing Pages\n\n\n**Form Submits Data**\n\n\n* Form Submits\n\n\n**People Data**\n\n\n* Contacts\n* Users\n* Accounts\n\n\n**Custom Data**\n\n\n* Custom Object\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431153\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003767\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nEloqua Connector\n\n", "article_total_view_count": "\n\n\n 4,837\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "eloqua_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}