{"file_path": "../../raw_kb_v2\\article\\360042928694\\index.html", "content": {"title": "\n\n\n GitHub Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGitHub is a web-based version control repository and Internet hosting service. Use Domo's GitHub connector to retrieve data about GitHub followers, repositories, organizations, users, gists, and much, much more. To learn more about the GitHub API, visit their page (\n\nhttps://developer.github.com/v3/\n\n).\n\n\n You connect to your GitHub account in the Data Center. This topic discusses the fields and menus that are specific to the GitHub connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your GitHub account and create a DataSet, you must have your GitHub credentials (i.e. your username/email address and password).\n\n\n Connecting to Your GitHub Account\n-----------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the GitHub Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\nThe Domo GitHub connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing GitHub accounts in Domo) to open the GitHub OAuth screen where you can enter your GitHub credentials. Once you have entered valid third-party tool credentials, you can use the same account any time you go to create a new GitHub DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into GitHub when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of GitHub.\n\n\n###\n\nDetails P\n\n\n ane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the GitHub report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n All Public Events\n  |\n Returns all public events\n  |\n|\n All Public Gists\n  |\n Returns the list of all Public Gists\n  |\n|\n All Public Repositories\n  |\n Returns all public repositories\n  |\n|\n All User Issues\n  |\n Returns all user issues\n  |\n|\n All Users\n  |\n Returns the list of all users\n  |\n|\n Assignees - Specify Owner Name and Repository Name\n  |\n Returns Assignees by specifying owner name and repository name\n  |\n|\n Logged In User Followers\n  |\n Returns logged in user followers\n  |\n|\n Logged In User Following\n  |\n Returns the data of logged in following users\n  |\n|\n Logged In User Gist\n  |\n Returns logged in user gist\n  |\n|\n Logged In User Organizations\n  |\n Returns logged in user organizations\n  |\n|\n Logged In User Repositories\n  |\n Returns logged in user repositories\n  |\n|\n Logged In User Starred Repositories\n  |\n Returns logged in user starred repositories\n  |\n|\n Logged In User Team Members\n  |\n Returns logged in user team members\n  |\n|\n Logged In User Team Repositories\n  |\n Returns logged in user team repositories\n  |\n|\n Logged In User Watched Repositories\n  |\n Returns logged in user watched repositories\n  |\n|\n Organization Issues - Specify Organization name\n  |\n Returns the data of organization issues by specifying organization name\n  |\n|\n Organization Members - Specify Organization name\n  |\n Returns organization members by specifying organization name\n  |\n|\n Organization Public Events - Specify Organization name\n  |\n Returns organization public events by specifying organization name\n  |\n|\n Organization Public Members - Specify Organization name\n  |\n Returns organization public members by specifying organization name\n  |\n|\n Organization Repositories - Specify Organization name\n  |\n Returns organization repositories by specifying organization name\n  |\n|\n Organization Teams - Specify Organization name\n  |\n Returns organization teams by specifying organization name\n  |\n|\n Public Events for a network of Repositories - Specify Username and Repository Name\n  |\n Returns public events for a network of repositories by specifying username and repository name\n  |\n|\n Repositories Issue Events - Specify Owner Name and Repository Name\n  |\n Returns repositories issue events by specifying owner name and repository name\n  |\n|\n Repository Branches - Specify Owner Name and Repository Name\n  |\n Returns repository branches by specifying owner name and repository name\n  |\n|\n Repository Code Frequency - Specify Owner Name and Repository Name\n  |\n Returns repository code frequency by specifying owner name and repository name\n  |\n|\n Repository Collaborators - Specify Owner Name and Repository Name\n  |\n Returns the repository collaborators by specifying owner name and repository name\n  |\n|\n Repository Comments - Specify Owner Name and Repository Name\n  |\n Returns repository comments by specifying owner name and repository name\n  |\n|\n Repository Commit Activity - Specify Owner Name and Repository Name\n  |\n Returns the data for repository commit activity by specifying owner name and repository name\n  |\n|\n Repository Commits - Specify Owner Name and Repository Name\n  |\n Returns the repository commits by specifying owner name and repository name\n  |\n|\n Repository Contributor Activity - Specify Owner Name and Repository Name\n  |\n Returns contributor activity by specifying owner name and repository name\n  |\n|\n Repository Contributors - Specify Owner Name and Repository Name\n  |\n Returns the repository contributors by specifying owner name and repository name\n  |\n|\n Repository Deployments - Specify Owner Name and Repository Name\n  |\n Returns the repository deployments by specify the owner name and repository name\n  |\n|\n Repository Downloads - Specify Owner Name and Repository Name\n  |\n Returns the repository downloads by specifying owner name and repository name\n  |\n|\n Repository Events - Specify Owner Name and Repository Name\n  |\n Returns the repository events by specifying owner name and repository name\n  |\n|\n Repository Forks - Specify Owner Name and Repository Name\n  |\n Returns repository forks by specifying owner name and repository name\n  |\n|\n Repository Hooks - Specify Owner Name and Repository Name\n  |\n Returns repository hooks by specifying owner name and repository name\n  |\n|\n Repository Issues - Specify Owner Name and Repository Name\n  |\n Returns the repository issues by specifying the owner name and repository name\n  |\n|\n Repository Issues Comments - Specify Owner Name and Repository Name\n  |\n Returns the repository issues comments by specifying the owner name and repository name\n  |\n|\n Repository Labels - Specify Owner Name and Repository Name\n  |\n Returns the repository labels by specifying the owner name and repository name\n  |\n|\n Repository Languages - Specify Owner Name and Repository Name\n  |\n Returns the repository languages by specifying owner name and repository name\n  |\n|\n Repository Milestones - Specify Owner Name and Repository Name\n  |\n Returns the repository milestones by specifying the owner name and repository name\n  |\n|\n Repository Notifications - Specify Owner Name and Repository Name\n  |\n Returns the repository notifications by specifying owner name and repository name\n  |\n|\n Repository Participation - Specify Owner Name and Repository Name\n  |\n Returns the repository participation by specifying the owner name and repository name\n  |\n|\n Repository Pulls - Specify Owner Name and Repository Name\n  |\n Returns the repository pulls by specifying the owner name and repository name\n  |\n|\n Repository Readme - Specify Owner Name and Repository Name\n  |\n Returns the repository readme by specifying the owner name and repository name\n  |\n|\n Repository Releases - Specify Owner Name and Repository Name\n  |\n Returns the repository releases by specifying the owner name and repository name\n  |\n|\n Repository Subscribers - Specify Owner Name and Repository Name\n  |\n Returns the repository subscribers by specifying owner name and repository name\n  |\n|\n Repository Tags - Specify Owner Name and Repository Name\n  |\n Returns the repository tags by specifying the owner name and repository name\n  |\n|\n Search Code - Specify Search Field, User and Repository Name\n  |\n Returns the search code by specifying the search field, user and repository name\n  |\n|\n Search Issues - Specify State of issue and Search Field\n  |\n Returns the issues by specifying the state of issue and search field\n  |\n|\n Search Repositories - Specify Search Field\n  |\n Returns the repositories by search field\n  |\n|\n Search Users - Specify Search Field\n  |\n Returns the users by search field\n  |\n|\n Stargazers - Specify Owner Name and Repository Name\n  |\n Returns the stargazers by specifying the owner name and repository name\n  |\n|\n Templates\n  |\n Returns the templates\n  |\n|\n User\n  |\n Returns the user\n  |\n|\n User Emails\n  |\n Returns the user emails\n  |\n|\n User Followers - Specify Username\n  |\n Returns the user followers\n  |\n|\n User Following - Specify Username\n  |\n Returns the user following\n  |\n|\n User Gist - Specify Username\n  |\n Returns the user gist\n  |\n|\n User Gist Comments\n  |\n Returns the user gist comments\n  |\n|\n User Issues\n  |\n Returns the user issues\n  |\n|\n User Keys - Specify Username\n  |\n Returns the user keys\n  |\n|\n User Limit Rate\n  |\n Returns the user limit rate\n  |\n|\n User Notifications\n  |\n Returns the user notifications\n  |\n|\n User Organization Events - Specify Organization Name\n  |\n Returns the user organization events\n  |\n|\n User Organizations - Specify Username\n  |\n Returns the user organizations\n  |\n|\n User Performed Events - Specify Username\n  |\n Returns the user performed events\n  |\n|\n User Public Repositories - Specify Username\n  |\n Returns the user public repositories\n  |\n|\n User Recieved Events - Specify Username\n  |\n Returns the user received events\n  |\n|\n User Starred gists\n  |\n Returns the user starred gists\n  |\n|\n User Starred Repositories - Specify Username\n  |\n Returns the user starred repositories\n  |\n|\n User Teams\n  |\n Returns the user teams\n  |\n|\n User Watched Repositories - Specify Username\n  |\n Returns the user watched repositories\n  |\n\n|\n|\n User Name/Owner Name (Optional)\n  |\n Enter the user name or owner name you want to pull data for.\n  |\n|\n User Name (Optional)\n  |\n Enter the user name you want to pull data for.\n  |\n|\n Owner Name (Optional)\n  |\n Enter the owner name you want to pull data for.\n  |\n|\n Repository Name (Optional)\n  |\n Enter the name of the repository you want to pull data for.\n  |\n|\n Organization Name (Optional)\n  |\n Enter the name of the organization you want to pull data for.\n  |\n|\n Sort (Optional)\n  |\n Enter a sort value for your report. This option is available for the below reports:\n\n\n|\n Report Name\n  |\n Applicable Values\n  |\n| --- | --- |\n|\n Search Repositories\n  |\n stars/forks/updated\n  |\n|\n Search Code\n  |\n indexed\n  |\n|\n Search Issues\n  |\n comments/created/updated\n  |\n|\n Search Users\n  |\n followers/repositories/joined\n  |\n\n|\n|\n Order (Optional)\n  |\n Enter the sort order if you entered a parameter in the\n **Sort**\n field. Use\n\nasc\n\nfor ascending and\n\ndesc\n\nfor descending.\n  |\n|\n State of Issue to be Searched (Optional)\n  |\n Enter a state to filter by, either\n\nopen\n\n,\n\nclosed\n\n, or\n\nall\n\n(default is\n\nopen\n\n).\n  |\n|\n Past Days (Optional)\n  |\n Enter the number of past days for which you want to retrieve data. The value can be entered as\n\nX\n\n,\n\nXDay\n\n, or\n\nXDays\n\n, where\n\nX\n\nis a positive integer. For example:\n\n30Days\n\n.\n  |\n|\n Issue Filter (Optional)\n  |\n Enter a value to filter out issues in the authenticated user's context. Possible values are\n\nassigned\n\n,\n\ncreated\n\n,\n\nmention\n\n,\n\nsubscribed\n\n, and\n\nall\n\n.\n  |\n|\n Type (Optional)\n  |\n Enter the type of item to search for. This option is available for the below reports:\n\n\n|\n Report Name\n  |\n Applicable Values\n  |\n| --- | --- |\n|\n Search Issues\n  |\n issue / pr\n  |\n|\n Search Users\n  |\n user / org\n  |\n\n|\n|\n Search Field\n  |\n Enter the keyword to search for.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n How do I know my Github credentials are secure?\n\nThe login process uses OAuth, so your Github credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account anytime.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits I should be aware of?\n\nYou can make up to 5000 requests per hour.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928694\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003582\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGitHub Connector\n\n", "article_total_view_count": "\n\n\n 4,747\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "github_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}