{"file_path": "../../raw_kb_v2\\article\\360043434493\\index.html", "content": {"title": "\n\n\n LinkedIn Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Domo LinkedIn Connector integrates Domo with LinkedIn to extract data from the LinkedIn API. The connector provides access to company profiles and updates and follower information. To learn\n\n\n more about the LinkedIn API, visit their site (\n\nhttps://developer.linkedin.com\n\n).\n\n\n The LinkedIn connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n**Important:**\n Certain connectors require an API usage fee charged to you by the company, not Domo, depending on the customers' accounts with that company. Use of this connector may require an API usage fee.\n\n\n**Important:**\n LinkedIn has announced that they are disabling version 1 of their API on May 1, 2019. This is the API used by the LinkedIn and LinkedIn Enterprise connectors. LinkedIn has released a new version of the API, which has been implemented in Domo as the connector LinkedIn V2. Due to the two versions being considerably different, there is no way to automatically migrate existing LinkedIn DataSets to the new LinkedIn V2 connector. You will need to create new DataSets using the LinkedIn V2 connector. If there are metrics or features that are not available in the new connector, please contact Domo Support as soon as possible so those features can be added to the new connector.\n\n\n These changes do not apply to DataSets using the LinkedIn Ads connector as it is already on the new API version.\n\n\n You connect to your LinkedIn account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the LinkedIn connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is useful for measuring engagement from company updates and posts.\n  |\n|\n**Primary Metrics**\n | * Company follow statistics\n* Post likes\n* Post comments\n* Share statistics\n |\n|\n**Primary Company Roles**\n |\n Marketing roles, especially those involving social engagement\n  |\n|\n**Average Implementation Time**\n |\n Less than 10 minutes\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\nPrerequisites\n---------------\n\nTo connect to your LinkedIn account and create a DataSet, you must have the following:\n\n The email address you use to log in to LinkedIn\n* The password you use to log in to LinkedIn\n\nConnecting to Your LinkedIn Account\n-------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the LinkedIn Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo LinkedIn connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing LinkedIn accounts in Domo)\n\n\n to open the LinkedIn OAuth screen where you can enter the email address and password you use to log in to LinkedIn. Once you have entered valid credentials, you can use the same account any time you go to create a new LinkedIn DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Report\n\ns**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the LinkedIn report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Company Follow Statistics - Breakdown\n  |\n Returns statistics about a given company’s  total followers, which can be broken down by various metrics such as industry, seniority, company size, month, etc.\n  |\n|\n Company Follow Statistics - Historical\n  |\n Returns a daily breakdown of company follower statistics for a specific date or date range.\n  |\n|\n Company Follow Statistics - Overview\n  |\n Returns an overview of followers for a given company.\n  |\n|\n Company Search\n  |\n Returns data for one or more given companies. You can use this data to compare employee count, followers, etc.\n  |\n|\n Company Update Statistics\n  |\n Returns share statistics (clicks, shares, and likes) for a given company, broken down by month.\n  |\n|\n Company Update Statistics - Historical\n  |\n Returns share statistics (clicks, shares, and likes) for a given company for a specific date or date range.\n  |\n|\n Company Update Posts\n  |\n Returns information about the latest update posts for a given company.\n  |\n|\n Company Update Post Comments\n  |\n Returns all comments for the latest update posts for a given company.\n  |\n|\n Company Update Post Likes\n  |\n Returns all likes for the latest update posts for a given company.\n  |\n\n\n |\n|\n Break Down By\n  |\n Select how you want data in your report to be presented. For example, if you select\n **Industry**\n , the report data will be broken down by industry type.\n  |\n|\n Company Name\n  |\n Enter the name of the company you want to retrieve data for.\n  |\n|\n Company ID\n  |\n Select the company you want to retrieve data for.\n  |\n|\n Duration\n  |\n Specify whether the data in this report is for a single date or a range of dates.\n  |\n|\n Report Date\n  |\n Specify whether the data is for a specific or relative date. Choose\n **Relative**\n if you always want the report to retrieve data for a given number of days back (which you specify in\n **Date Offset**\n ) from the current date. For example, if you enter\n\n5\n\nfor\n **Date Offset**\n and set the DataSet to update daily, each new day the report will update to show information for the date 5 days in the past.\n  |\n|\n Date Offset\n  |\n Enter the number of days back from the current date that will be presented in the report.\n  |\n|\n Date From\n  |\n Specify whether the first date in your date range is a specific or relative date. Choose\n **Relative**\n if you always want the report to retrieve data for a given number of days back (which you specify in\n **Date From Offset**\n ) from the current date. If you choose\n **Relative here**\n , you should also choose\n **Relative**\n for\n **Date To**\n and specify a value for\n **Date To Offset**\n .\n\n\n For example, if you enter\n\n10\n\nfor\n **Date From Offset**\n and\n\n5\n\nfor\n **Date To Offset**\n and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n  |\n|\n Date To\n  |\n Specify whether the end date in your date range is a specific or relative date. Choose\n **Relative**\n if you always want the report to retrieve data for a given number of days back (which you specify in\n **Date To Offset**\n ) from the current date. If you choose Relative here, you should also choose\n **Relative**\n for\n **Date From**\n and specify a value for\n **Date From Offset**\n .\n\n\n For example, if you enter\n\n10\n\nfor\n **Date From Offset**\n and\n\n5\n\nfor\n **Date To Offset**\n and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n  |\n|\n Select Specific Date From\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific Date To\n  |\n Select the last date in your date range.\n  |\n|\n Select Specific Date\n  |\n Select the date you want to retrieve data for.\n  |\n|\n Company IDs\n  |\n Enter the IDs of companies you want to compare in your report, separated by commas. Find the ID of a company by entering the name in the\n **Company Name**\n field. The number in parentheses that follows the name in the\n **Company ID**\n dropdown menu is the ID.\n  |\n|\n Post Type\n  |\n Select the post type for the report. When\n **Status Update**\n is selected, only the 50 most recent posts are returned. For other post types, the report retrieves all posts within the last 20 days or 250 total posts, whichever comes first.\n  |\n|\n Update Key\n  |\n Enter the update key. You can find the update key for a specific post in the\n **Company Update Posts**\n report. If you leave this blank, the report retrieves likes or comments for all company update posts.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* The LinkedIn user account used to create the DataSet\n *must*\n have access to a Company page. Otherwise the connector will not be able to pull any data.\n* LinkedIn access tokens stay valid until the number of seconds returned in the\n\nexpires\\_in\n\nfield in the API response. Currently, all access tokens are issued with a 60-day lifespan.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043434493\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003468\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nLinkedIn Connector\n\n", "article_total_view_count": "\n\n\n 4,817\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "linkedin_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}