{"file_path": "../../raw_kb_v2\\article\\4533903600407\\index.html", "content": {"Title": "Dropdown Selector Card", "Article Body": "Intro\n                        \n\n\n\n                        Dropdown Selector Cards display values from a selected DataSet column. When you add them to a Dashboard in Domo, users visiting that Dashboard can click on values to filter the other Cards on the Dashboard. You can set up the Dropdown Selector Card to filter on a single value or multiple values at once.\n                       \n\n                        For example, you could build a Dropdown Selector Card with names of U.S. states and add it to a Dashboard. If you then clicked \"Texas\" and \"Oklahoma,\" all of the Cards in the Dashboard would be filtered to show only data for those states. Filter Cards only work when Interaction Filters are turned on. If Interaction Filters are not turned on, clicking a filter opens the Details view for the Card instead of applying the filter. For more information about using Filter Cards on a Dashboard, see\n                        \n                         Applying Page-Level Filters with Filter Views\n                        \n                        . All Dropdown Selector Cards have a 25,000 row limit.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            In order to use a Beast Mode as the column in the \"Items\" section to power your Dropdown Selector Card, you must share the Beast Mode to the DataSet.\n                           \n\n\n\n\n\n\n\n\n                        You can also use a Dropdown Selector filter in the Card Details view to filter data to a specific column value before applying a drill path.\n                       \n\n                        Dropdown Selector and Checkbox Cards are essentially the same. The only difference is that the filters in Dropdown Selector Cards are represented as a searchable list...\n                       \n\n\n\n\n                        ...and the filters in Checkbox Cards use checkboxes.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can select multiple options from the Dropdown Selector list if you have enabled the Allow Multiple Selections Chart Property. You will know this has been enabled if there are checkboxes next to the list of items.\n                           \n\n\n\n\n\n\n\n                        Radio Button Cards are similar to both of the above but use radio buttons instead of buttons or checkboxes, meaning users can filter on only one value at a time.\n                       \n\n                        For information about other Filter Card types, see the following:\n                       \n\n\n\n                          Slicer, Checkbox, and Radio Button Cards\n                         \n\n\n\n\n                           Date Selector Card\n                          \n\n\n\n\n\n                           Range Selector Card\n                          \n\n\n\n\n\n                         Video - Filter Chart Types\n                        \n\n\n\n\n\n\n\n\n                        Powering Dropdown Selector Cards\n                       \n\n                        Dropdown Selector Cards require two columns or rows of data from your DataSet. One of these contains the category values you want to use as filters. You drop this column into the \"Items\" field in Analyzer.\n                        \n\n\n\n\n\n\n                        The other field is called \"Group By.\" Though this field is required to power up the Card, in general, it doesn't matter what column you drop here. If you need to aggregate the data, you can use this column to do so. For example, if the column with the filter names is duplicated in your DataSet, you can make the filter names unique by aggregating.\n                       \n\n                        For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        Customizing Dropdown Selector Cards\n                       \n\n                        You can customize the layout of filters in a Dropdown Selector Card by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        . Unique properties of Dropdown Selector Cards include the following.\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           General > Allow Multiple Selections\n                          \n\n                           When set, the selector will allow you to select more than one item from the list.\n                          \n\n\n\n                           General > Label Text\n                          \n\n                           Optional label displayed with the dropdown selector.\n                          \n\n\n\n                           General > Label Position\n                          \n\n                           Sets the position for the label associated with the dropdown selector.\n                          \n\n\n\n                           General > Default Select Text\n                          \n\n                           This is the text that will be displayed by default when nothing is selected. The default is Select.\n                          \n\n\n\n                           General > Vertical Alignment\n                          \n\n                           Determines where the selector will be displayed within the Card.\n                          \n\n\n\n                           Full Size Settings\n                          \n\n                           Lets you specify the width and height to use when \"full\" size is selected on a page of cards. For reference, a medium card is 1x1 and a large card is 2x2.", "Preview Article": "Click here to preview", "URL Name": "4533903600407", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004662", "Archived Date": "", "Language": "English", "Primary Version": "Dropdown Selector Card", "Article Total View Count": "5,441", "": "", "Article Created Date": "10/24/2022, 10:20 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Dropdown Selector Card\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}