{"file_path": "../../raw_kb_v2\\article\\360042931834\\index.html", "content": {"title": "\n\n\n Snowflake Unload V2 Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Snowflake is a data warehouse built for the cloud for all your data and users. Use Domo's Snowflake Unload V2 Connector to unload data from your Snowflake into Amazon S3. Unloaded files are imported from Amazon S3 into Domo. Choose this connector instead of the Snowflake connector if you are executing very large queries.\n\nTo learn more about the Snowflake API, visit their page (\n\nhttps://docs.snowflake.net/manuals\n\n).\n\n\n This Connector is the same as the standard\n\nSnowflake Unload\n\nconnector, except that it allows you to enter your own custom query in addition to using the auto-generate option, whereas the standard version of the connector only includes the auto-generate option.\n\n\n You connect to your Snowflake account in the Data Center. This topic discusses the fields and menus that are specific to the Snowflake Unload V2 connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Snowflake account and create a DataSet, you must have the following:\n\n The full name of your account (provided by Snowflake). This is the portion of your Snowflake URL immediately following\n\nhttps://\n\n.\n\n\n Note that your full account name may include additional segments that identify the region and cloud platform where your account is hosted. The following table provides account name examples by cloud platform/region. For each row, it assumes your account name is \"xy12345.\"\n* The username and password used to connect to your Snowflake host.\n* Your AWS access key. This is available in the AWS Console in the\n **Security Credentials**\n section (unless you are using IAM, in which case it is under\n **Users**\n ).\n* Your AWS secret key. This was provided when you created your access key. You can generate a new key in the AWS Console.\n* The name of the AWS S3 bucket in which Snowflake data will be unloaded.\n\nConnecting to your Snowflake account\n--------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Snowflake Unload V2 Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials pane\n\n\n This pane contains fields for entering credentials to connect to your Snowflake account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Account Name\n  |\n Enter your Snowflake account name. For more information, see \"Prerequisites.\"\n  |\n|\n Username\n  |\n Enter the username you use to connect to your Snowflake host.\n  |\n|\n Password\n  |\n Enter the password you use to connect to your Snowflake host.\n  |\n|\n Access Key\n  |\n Enter your AWS access key. For information about obtaining an access key, see \"Prerequisites,\" above.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. For information about obtaining a secret key, see \"Prerequisites,\" above.\n  |\n|\n Bucket\n  |\n Enter the name of the AWS S3 bucket.\n  |\n|\n Region\n  |\n\nSelect your S3 bucket\n\nregion\n\n.\n\n|\n|\n Role\n  |\n\nEnter your role.\n\n|\n\n\n Once you have entered valid Snowflake credentials, you can use the same account any time you go to create a new Snowflake Unload V2 DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\n\n In this pane you create an SQL query to pull data from your database. You can choose a specific database table and partition column. You can also specify the number of past days you want to get data for.\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n How would you like to import data into Domo?\n  |\n\nSelect whether you want to import your data by using the\n\n\n standard update method (replace/append), by using partition, or upsert mode.\n\n|\n|\n How would you like to build your Query?\n  |\n\n\n Query Type\n  |\n Description\n  |\n|\n Custom Query\n  |\n Enter the SQL query to execute.\n  |\n|\n Query Builder\n  |\n Select a table and fields to autogenerate your query.\n  |\n\n|\n|\n Warehouses\n  |\n Select the warehouse containing the data you want to retrieve. The list populates all warehouses you have access to based on your credentials.\n  |\n|\n Databases\n  |\n Select the database containing the data you want to retrieve. The list populates all databases you have access to based on your credentials.\n  |\n|\n Schemas\n  |\n Select the database schema containing the data you want to retrieve. The list populates all schemas you have access to based on your credentials.\n  |\n|\n Tables\n  |\n Select the database table you want to retrieve. The list populates all tables you have access to based on your credentials. If you do not select a database table, the connector retrieves your entire database schema.\n  |\n|\n Table Column Name\n  |\n Select the partition column name.\n  |\n|\n Table Query Helper\n  |\n A query is generated based on the selected fields. Copy and paste this text into the QUERY field. You may edit this query, if desired.\n  |\n|\n Query\n  |\n Enter the SQL query you want to execute.\n  |\n|\n Partition Criteria\n  |\n Select whether you want to partition your data using the date keys, non-date keys, or meta query.\n  |\n|\n Select Partition Date Key Column Name\n  |\n Select the partition column name. Only date fields will be shown in this discovery.\n  |\n|\n Past Days\n  |\n Enter the number of past days that you want to get data for. Value can be X, where X is a positive integer. Example: 30.\n  |\n|\n Date Format\n  |\n Please select/enter proper date format according to the date format present in partition column. By default\n\n\n**yyyy-MM-dd**\n will be used.\n  |\n|\n Custom Date Format\n  |\n Enter the custom date format.\n  |\n|\n Select Partition Non Date Key Column Name\n  |\n Select a non-date key column name to partition the data. All fields excluding Date fields will appear in this dropdown.\n  |\n|\n Enter Partition Non Date Key Column Name\n  |\n Enter a non-date key column name to partition the data.\n  |\n|\n Partition Query to determine partition tags\n  |\n\nEnter the partition meta query to determine the distinct partition tags (or keys). The column containing the\n\n\n**Date**\n\n\n data is your partition column.\n\n\n Example: SELECT DISTINCT (DATE\\_COLUMN\\_NAME) FROM TABLENAME\n\n|\n|\n Upsert Key Column(s)\n\n|\n\nEnter upsert key column name or a comma separated list of upsert key column names.\n **Required only when Update method is Merge**\n .\n\n|\n\n\n###\n Selecting the Update Mode\n\nOnce you decide how you want to import your data into Domo\n\n(by using the\n\n\n standard update method (replace/append), by using partition, or upsert mode), you need to select the relevant update mode in the\n **Scheduling section**\n in the Connector.\n\n\n* If you select 'Partition' in the Details section, then you need to select the 'Append' update mode in the Scheduling section.\n\n If you select 'Upsert' in the Details section, then you need to select 'Merge' update mode in the Scheduling section.\n\n##\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What is the difference between this connector and the standard Snowflake Unload connector?\n\nThis connector allows you to enter your own custom query in addition to using the auto-generate option, whereas the standard version of the connector only includes the auto-generate option. Additionally, with this Connector, you can import your data\n\nby using the\n\n\n standard update mode (replace/append), by using partition, or upsert mode.\n\n\n####\n Are there any API limits I should be aware of?\n\nThis depends on your server configuration.\n\n###\n How frequently will my data update?\n\nDataSets can run as often as every 15 minutes. However, depending on the runtime of the query, DataSets may need to run less frequently.\n\n###\n What should I be aware of while writing a query?\n\nMake sure that all the words, table names, and field names are correctly spelled. Refer to the Query Helper field for query help.\n\n###\n Why can't I connect to my Snowflake database? Do I need to whitelist any IP addresses?\n\nBefore you can connect to a Snowflake database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses in Domo\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931834\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003878\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSnowflake Unload V2 Connector\n\n", "article_total_view_count": "\n\n\n 4,732\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "snowflake_unload_v2_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}