{"file_path": "../../raw_kb_v2\\article\\360042923854\\index.html", "content": {"Title": "100 Percent Stacked Bar with Line Chart", "Article Body": "Intro\n                       \n\n                        A 100% stacked bar with line chart is similar to a\n                        \n                         100% stacked bar chart\n                        \n                        in that each series bar in a stack represents the percentage of the overall category to which it belongs. The difference is that it also includes one or more trendlines and two y-axes, similar to other kinds of line-bar combination charts. One of these is used to measure the values along the line(s), and the other is used to measure the percentages of the bars in each stack. By default, the first item that appears in your chart legend is represented as the line and all remaining items are represented as stacks of bars. You can change this behavior in the Chart Properties if you want.\n                       \n\n                        Both vertical and horizontal versions of 100% stacked bar with line charts are available. In vertical 100% stacked bar with line charts, series in categories are \"stacked\" on top of each other; in horizontal 100% stacked bar charts, the series appear side by side.\n                       \n\n                        Powering 100% stacked bar with line charts\n                       \n\n                        A 100% stacked bar with line chart requires three data columns or rows from your DataSet—one for categories, one for the series in each category, and one for values. For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your 100% stacked bar with line chart. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Analyzer Overview\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from a typical column-based spreadsheet is converted into a vertical 100% stacked bar with line chart:\n                       \n\n\n\n\n                        The following graphic shows you how the data from a typical column-based spreadsheet is converted into a horizontal 100% stacked bar with line chart:\n                       \n\n\n\n\n                        Customizing 100% stacked bar with line charts\n                       \n\n                        You can customize the appearance of a 100% stacked bar with line chart by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties.\n                        \n                        Unique properties of 100% stacked bar with line charts include the following. You can click a thumbnail image to see a larger image.\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n                           General > Series on Left Scale\n                          \n\n                           Determines how many series in your chart appear as lines (or symbol series in a stacked bar with symbols chart). By default, the first series that appears in your legend for these chart types becomes a line, and all remaining series become bars. However, you can convert series from bars to lines by entering the desired number of lines in\n                           \n                            Chart Properties\n                           \n                           . For example, if your chart had three series, the first series appearing in your legend would appear as a line, and the remaining two series would appear as bars. You could turn the second series into a line by entering\n                           \n                            2\n                           \n                           in the\n                           \n                            Series on Left Scale\n                           \n                           field.\n                          \n\n                           —\n                          \n\n\n\n                           General > Line Style\n                          \n\n\n                            Lets you change the line style in your chart. By default, lines in line-bar combination charts appear angular. If you want, you can change the line style to be curved, plain with symbols, curved with symbols, or consist only of symbols.\n                           \n\n                            The example shows a chart in which the line style has been set to\n                            \n                             Curved\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n                           General > Sort Each Category\n                          \n\n\n                            Allows you to sort the items in each individual category in most kinds of multi-series bar and lollipop charts. You can choose an ascending or descending sort. If you select\n                            \n                             Default\n                            \n                            , the default sort is applied. This option does not work when the\n                            \n                             Value Scale > Log Scale\n                            \n                            box is checked.\n                           \n\n                            In the example at right, bars within all categories are sorted in descending order.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Bar Settings > Non-Stacked Interactivity\n                           \n\n\n\n                            Turns off the default stacked bar chart interactivity.\n                           \n\n                            When you hover over any series in a stacked bar or 100% stacked bar chart, all of the corresponding series are highlighted and connected across the chart, as shown in the first screenshot at right. However, if series data is missing for any stack in the chart, the highlighting is removed and a \"0\" appears in the stack, as shown in the second screenshot. By checking\n                            \n                             Non-Stacked Interactivity\n                            \n                            , the connecting lines, highlighting, and \"0\" no longer appear upon hover, as shown in the third screenshot.\n                           \n\n                            For more information about DataSet columns, see\n                            \n                             Applying DataSet Columns to Your Chart\n                            \n                            .", "Preview Article": "Click here to preview", "URL Name": "360042923854", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004747", "Archived Date": "", "Language": "English", "Primary Version": "100 Percent Stacked Bar with Line Chart", "Article Total View Count": "4,970", "": "", "Article Created Date": "10/24/2022, 10:29 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              100 Percent Stacked Bar with Line Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}