{"file_path": "../../raw_kb_v2\\article\\1500002454002\\index.html", "content": {"title": "\n\n\n Salesforce Chatter Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSalesforce Chatter is a collaboration tool that allows you to collaborate on business processes, take action, and engage in collaboration. With your Chatter data in Domo, you can get an at-a-glance view of how Chatter is being used and make changes to drive usage, share data on usage, and more. To learn more about the Salesforce Chatter API, visit\n\nhttps://developer.salesforce.com/doc...er\\_connect.htm\n\n.\n\n\n You connect to your Salesforce account in the Data Center. This topic discusses the fields and menus that are specific to the Salesforce Chatter connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Salesforce account and create a DataSet, you must have the following:\n\n The username  and password for your Salesforce account\n* An installed Domo Connector Package from the Salesforce AppExchange (required as of August 1, 2018; see next section for installation instructions)\n\n\n###\n Installing the Domo Connector Package\n\nThe \"Domo Connector Package\" found in Salesforce AppExchange allows Salesforce users to import their data into Domo. Follow these instructions to download and install the Connector Package from the AppExchange.\n\n\n**To install Domo's Salesforce Managed Package,**\n\n. Log into Salesforce.\n2. Navigate to the Salesforce AppExchange at\n\nhttps://appexchange.salesforce.com\n\nand search for \"Domo Connector Package,\" then click on it.\n\nAlternatively, you can go directly to\n\nhttps://appexchange.salesforce.com/a...A00000EcrsyUAB\n\n.\n3. Click\n **Get It Now**\n .\n4. Choose whether you want to install in a production environment or sandbox.\n5. Check the box reading \"I have read and agree to the terms and conditions.\"\n6. Click\n **Confirm and Install**\n .\n7. Click the\n **Install for All Users**\n tile.\n\nFor more details, see Salesforce's documentation at\n\nhttps://help.salesforce.com/articleV...ges.htm&type=5\n\n.\n\n##\n Verifying your Installation\n\nUse Domo's Salesforce Managed Package Validator to verify that your Salesforce Managed Package has been installed correctly.\n\n\n**To verify your installation,**\n\n. In the Connectors page in either the Data Center or Appstore in Domo, search for \"Salesforce Managed Package\" and double-click on on the icon.\n2. Click\n **Get the Data**\n .\n3. Under\n **Credentials**\n , select your Salesforce account name, then click\n **Next**\n .\n4. Under\n **Details**\n , click\n **Next**\n .\n5. In the\n **Update**\n menu, select\n **Manually**\n , then click\n **Next**\n .\n6. Give your DataSet a name, then click\n **Save**\n .\n\nThe DataSet now runs. If everything has been set up correctly, the run will be successful, and a message will appear reading, \"Validation Success: You have set up your Salesforce Managed Package correctly.\"\n\nIf everything has\n *not*\n been set up correctly, the DataSet fails, and a message appears reading, \"You have not installed Salesforce's Domo Connector Package,\" with a help link to this article.\n\nConnecting to Your Salesforce Account\n---------------------------------------\n\n\n This section enumerates the options in the Credentials and Data Selection panes in the Salesforce Chatter Connector page. The components of the other panes in this page,\n **Scheduling**\n , and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\n\n Adding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\n\n The Domo Salesforce Chatter connector uses OAuth to connect, so there is no need to enter credentials within Domo. Choose an environment in the Salesforce Environment menu then click Connect to open the Salesforce login screen. Here you can enter your Salesforce username and password. Once you have entered valid Salesforce credentials, you can use the same account any time you go to create a new Salesforce Chatter DataSet. You can manage connector accounts in the\n\n*Accounts**\n\ntab in the Data Center. For more information about this tab, see\n\n\n Managing User Accounts for Connectors\n\n.\n\n##\n Data Selection Pane\n\nThis pane contains a primary\n **How Do You Want to Select Your Salesforce Data**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n How Do You Want to Select Your Salesforce Data?\n  |\n Select the method you want to use to pull data from Salesforce. Methods are as follows:\n * Browse Objects and Fields - Lets you select Salesforce objects with associated fields and relationships.\n* Query - Lets you enter SOQL queries to retrieve data.\n |\n|\n Query Option\n  |\n\nSelect a predefined query (\n\n*Chatter Activity**\n\n) or create your own query (\n\n*Custom**\n\n).\n\n|\n|\n Query\n  |\n Enter your Salesforce SOQL query here. For example:\n\nSELECT\n *Account*\n FROM Account\n\nFor more information about writing SOQL queries, see\n\nhttp://www.salesforce.com/us/developer/docs/officetoolkit/Content/sforce\\_api\\_calls\\_soql.htm\n\n.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nSalesforce is generally a very stable connector so there are just a few common issues that arise with it. Most of the issues are due to insufficient permissions (on both the object and the field). Your Salesforce admin should be able to upgrade permissions on specific objects and fields.\n\n\n Another common error is the “Query Locator Error.” Salesforce only keeps 10 query locators at a time for a single user and for a maximum of 15 minutes. If too many DataSets are running at the same time, some of these will fail. The best way to avoid this issue is to spread out the times when the DataSets are running.\n\n\n FAQ\n-----\n\n\n####\n\nWhat version of the Salesforce API does this connector use?\n\nThis connector uses version 44.0 of the Salesforce API (\n\nhttps://{\n\ncustomer instance}.\n\nsalesforce.com/services/data\n\n/v44.0.)\n\n###\n\nWhich endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Browse Objects and Fields\n  |\n /query\n  |\n|\n Query\n  |\n /query\n  |\n\n\n####\n\nWhat kind of credentials do I need to power up this connector?\n\nYou need the username and password associated with your Salesforce account.\n\n###\n\nHow do I know my Salesforce credentials are secure?\n\nThe login process uses the OAuth process, so your Salesforce credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n\nAre there any API limits that I need to be aware of?\n\nNo\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500002454002\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003243\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSalesforce Chatter Connector\n\n", "article_total_view_count": "\n\n\n 2,359\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "salesforce_chatter_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}