{"file_path": "../../raw_kb_v2\\article\\360042923274\\index.html", "content": {"Title": "Duplicating Cards (\"Save As\")", "Article Body": "Intro\n                       \n\n                        You can use the\n                        \n                         Save As\n                        \n                        option to duplicate a Card to create a new instance of that Card that can be manipulated separately from the original Card. This is different from the\n                        \n                         Copy\n                        \n                        functionality because Cards that are copied are still linked—if you make a change to a copy, the original and any other copies receive the same changes. You can change the name and underlying data of the duplicate, and the original stays the same. When you duplicate a Card, you are assigned as the owner of the new instance of the Card.\n                       \n\n                        To duplicate a Card, you must have an Editor, Privileged, or Admin security role, or a custom role with the Edit Cards grant enabled.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If a Page has been locked, you can only move or copy Cards if you are the Page owner or you have an Admin default security role or a custom role with Manage All Cards and Pages grant enabled. For more information about locking and unlocking content on Pages, see\n                           \n                            Managing Custom Roles\n                           \n                           .\n                          \n\n\n\n\n                        You can also duplicate multiple Cards at once in the Admin Settings. You must have an Admin security role to use this feature. For more information about security roles, see\n                        \n                         Security Role Reference\n                        \n                        .\n                       \n\n\n\n                          Video - Move, Copy, and Duplicate Cards\n                         \n\n\n\n\n\n\n\n\n\n                        Duplicating a Single Card\n                       \n\n                        You can duplicate a Card from the Page or the Card's Details view.\n                       \n\n\n                         To duplicate a Card from the Page,\n                        \n\n\n\n\n                          Mouse over the Card you want to duplicate.\n                         \n\n\n\n                          Click\n                          \n                          , then select\n                          \n                           Save As\n                          \n                          from the menu.\n                         \n\n\n\n                          (Optional) Enter a name for the new Card in the\n                          \n                           Title\n                          \n                          field.\n                         \n\n\n\n                          (Optional) Enter a description of the changes you have made in the\n                          \n                           Add Card Description\n                          \n                          field.\n                         \n\n\n\n                          In the menu, select the Page where you would like the new Card to reside.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        A new instance of the Card is created.\n                       \n\n                        You can also duplicate a Card from the Details view. This is especially useful after you have performed in-depth analyses on the Card by\n                        \n                         filtering the data\n                        \n                        . You can save your updated view of the Card as a new version that can then be Favorited, shared with other users, etc.\n                       \n\n\n                         To duplicate a Card from the Details view,\n                        \n\n\n\n\n                          Click the\n                          \n                          icon in the toolbar in the top-right corner of the Card Details view.\n                         \n\n\n\n                          Select\n                          \n                           Save As\n                          \n                          .\n                         \n\n\n\n                          (Optional) Enter a name for the new Card in the\n                          \n                           Title\n                          \n                          field.\n                         \n\n\n\n                          (Optional) Enter a description of the changes you have made in the\n                          \n                           Add Card Description\n                          \n                          field.\n                         \n\n\n\n                          In the dropdown menu, select the Page where you would like the new Card to reside.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        A new instance of the Card is created.\n                       \n\n                        Duplicating Multiple Cards\n                       \n\n                        In\n                        \n                         Admin Settings > Cards\n                        \n                        , you can duplicate multiple Cards to any number of selected Pages with a single action. You must have an Admin default security role or a custom role with Manage All Cards and Pages grant enabled to use this feature. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n                         To duplicate multiple Cards,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n                           Admin\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Cards\n                          \n                          in the left-hand pane.\n                          \n                          A list of all Cards in your Domo instance appears.\n                         \n\n\n\n                          Check the boxes for all Cards you want to duplicate.\n                          \n                          You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Duplicate Cards\n                          \n                          .\n                          \n                          A dialog opens in which you can specify the Pages where the new Cards will be added.\n                         \n\n\n\n                          In the\n                          \n                           Search Pages\n                          \n                          field, enter the name of a Page where you want the duplicated Cards to live.\n                          \n                          The names of Pages matching the characters you've entered pop up in a list.\n                         \n\n\n\n                          Click the name of the desired Page to add it to the field.\n                         \n\n\n\n                          (Optional) To add more Pages to the field, repeat steps 5 and 6 as often as necessary.\n                         \n\n\n\n                          Click\n                          \n                           Duplicate Cards\n                          \n                          .\n                         \n\n\n\n                        The Cards are duplicated into the Pages you specified.", "Preview Article": "Click here to preview", "URL Name": "360042923274", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004107", "Archived Date": "", "Language": "English", "Primary Version": "Duplicating Cards (\"Save As\")", "Article Total View Count": "5,677", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Duplicating Cards (\"Save As\")\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Card And Dashboard Management\n              \n", "url": "/s/topic/0TO5w000000ZanDGAS"}]}