{"file_path": "../../raw_kb_v2\\article\\360061873754\\index.html", "content": {"title": "\n\n\n October 2020 Release Notes\n\n\n", "article_body": "\n\n\n New features and enhancements\n--------------------------------\n\nFeatures and enhancements in this release include the following:\n\n\n Beast Mode Manager\n--------------------\n\nImprovements to Beast Mode Manager make managing your Beast Modes even easier.\n\n##\n Archive Beast Modes\n\nYou now have the ability to archive Beast Modes. This removes Beast Modes from Cards or DataSets. You are only able to archive a Beast Mode if it is not in use on a Card. The archive feature is also available for bulk use. You can select up to 100 Beast Modes at a time when using bulk archive. There is no limit to the total amount of Beast Modes that you can archive.\n\n\n You can then unarchive Beast Modes and it will restore it to the Card or DataSet it originated from. If a Card or DataSet is deleted, then the Beast Mode is also deleted. For more information, see\n\nBeast Mode Manager\n\n.\n\n\n###\n Duplicate Beast Mode name modal\n\nInside of Analyzer, there is a new modal that appears when there is a duplicate Beast Mode name. This allows you to rename the Beast Mode or delete duplicate Beast Modes. For more information, see\n\nAdding a Beast Mode Calculation to Your Chart\n\n.\n\nEnhanced Connector scheduling\n-------------------------------\n\nThe new Connector scheduler showcases a simplified and streamlined UI that is easier to understand and displays your time zone when scheduling. Connectors are still scheduled in UTC, but our new Scheduler shows you what time that converts to in your chosen time zone. For more information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Code Block Apps\n-----------------\n\nCode Blocks allow users to copy and paste several different code types that can be used to create solutions to complex questions. This makes advanced functionality much more accessible. For more information, see\n\nCode Block Apps\n\n.\n\n\n**Available Code Block types:**\n\n Beast Modes\n* SQL\n* R\n* Python\n* Jupyter Notebooks\n\n\n Public Domo App assets\n------------------------\n\nYou now have the ability to share assets like pictures or javascript code between your custom Domo app and your public website. You also have the option to build your public website directly on Domo instead of having to find another hosting provider. For more information, see\n\nPublic Domo App Assets\n\n.\n\n\n Buzz Conversation toggle\n--------------------------\n\nWith the new Buzz Conversation toggle arrows, you can easily switch between your Buzz messages. Use the arrows to move back and forth through conversations as you viewed them. For more information, see\n\nBuzz Layout\n\n.\n\nGoals\n-------\n\nWith Domo Goals you can power your company objectives by measurable data, watch progress with automatic updates and alerts, and create top to bottom alignment. With Goals you also have visibility into everyone’s goals and track how goals interrelate and progress. For more information, see\n\nCreating and Editing Goals\n\n.\n\n\n**With Goals you can,**\n\n Set company, department, and personal goals that everyone can view.\n* Measure the results with metrics powered by data in Domo.\n* Align your objectives with your company, department, and team so everyone can see how your work fits into the big picture.\n* View your progress as it updates in real-time with your data.\n* Check-in with regular updates so everyone knows how you’re progressing.\n* Create powerful dashboards to analyze your company’s progress.\n* Easily show which individual objectives align with company goals.\n\n\n Federated Data\n----------------\n\nDomo's Federated Data model allows you to directly render Cards and other user-level interactions in the Domo platform using a database hosted outside of Domo's cloud. Instead of executing the visualization query against Domo, the query is executed at the target database and the results are sent to Domo to render the visualization. This model is especially relevant for users who would like to keep their data at rest in their infrastructure for security or logistical reasons. For more information, see\n\nUsing the Federated Data Solution\n\n.\n\nMagic ETL v2 (Beta)\n---------------------\n\nMagic ETL v2 (Beta) has many backend and tile improvements as well as new tiles. When you open the edit view of a Magic ETL DataFlow, there is now a toggle switch to enable Magic ETL v2. It is important to note that some of the tiles have changed their functionality. For more information, see\n\nMagic ETL v2 DataFlow Optimizations\n\n.\n\n\n**Important:**\n You\n **MUST**\n read through the following article before switching an existing Magic ETL DataFlow to v2 or you risk breaking your DataFlow as several tiles have changed their functionality:\n\nUpgrading to Magic ETL v2\n\n\n**The following is a list of Magic ETL v2 features:**\n\n Faster runtimes\n* New tile categorizations\n* Searchable tooltip text\n* Color-coded and curved lines\n* Expression support (Add Formula, Filter Rows, and Group By tiles)\n* Views as Inputs\n* Enhancements to data type classifying\n* Enhancements to error handling\n* Join tile updates\n* Append tile optimizations\n* Value Mapper tile updates\n* Pivot and Unpivot tiles (renamed from Collapse and Uncollapse Columns)\n* New Dynamic Unpivot tile\n* Improvements to the Python Script and R Script tiles (dropped required schema tab)\n* Selectable text in data previews\n\nGetting help\n--------------\n\nYou can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n\nin the top navigation bar.\n\n\n If you have questions about Domo,\n\n search for a topic in the Help Center\n* train in Domo University at\n\nhttp://domo.com/university/\n* search for training apps in the Appstore\n* get answers in the Domo Community at\n\nhttps://dojo.domo.com\n* contact Technical Support by entering a help ticket in the Domo Support Portal\n* reach out to your Domo Customer Success Manager or Technical Consultant\n\nIf you have feedback, please send it from within Domo (\n **More**\n****> Feedback****\n ). Or send an email to\n\nproduct.feedback@domo.com\n\n.\n\n\n For more information about getting help, see\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360061873754\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004419\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nOctober 2020 Release Notes\n\n", "article_total_view_count": "\n\n\n 11,588\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:48 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "october_2020_release_notes", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "release_notes", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "archived_feature_release_notes", "url": "/s/topic/0TO5w000000Zan7GAC"}]}