{"file_path": "../../raw_kb_v2\\article\\360043439453\\index.html", "content": {"Title": "Viewing and Entering Peers in Your Company Org Chart", "Article Body": "Intro\n                       \n\n                        You can use the Org Explorer feature to view the org chart for your company. This feature is found in the\n                        \n                         Profile page\n                        \n                        .\n                       \n\n                        Specifying your place in the organization\n                       \n\n                        In the Profile page, you can specify who you report to and who reports to you in your organization. As you and other users specify these relationships, they are added to the org chart. When changes are made to these relationships—for example, if you change departments and specify a new supervisor in the Profile page—the org chart is updated accordingly.\n                       \n\n                        You do not need to specify your peers (those who report to the same person as you). Domo determines these automatically when they specify the same supervisor as you.\n                       \n\n                        If you have an \"Admin\" default security role or a custom role with \"Edit Users\" enabled, you can specify org chart relationships for others in your organization.\n                        \n                         For more information about default security roles, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n\n                         To specify your place in your company org chart,\n                        \n\n\n\n\n                          Open your Profile page by clicking your profile picture in the top right corner of the screen. (If you have not yet selected a profile picture, a\n                          \n                          icon appears instead.)\n                         \n\n\n\n                          Mouse over the area to the right of the \"Reports to\" text.\n                          \n                          A pencil icon appears.\n                          \n\n\n\n\n\n\n                          Click the pencil icon.\n                          \n                          A field pops up in which you can select the name of the person to whom you report.\n                         \n\n\n\n                          Enter the name of the person to whom you report. As you enter letters, the names of all users matching the letters you've entered pop up in a scrollable list.\n                         \n\n\n\n                          Select the name you want from the list.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                          To select the names of those who report to you, click the + in the \"Reports\" area then repeat steps 4-6 for each person you want to add.\n                          \n\n\n\n\n\n\n                        Viewing your org chart\n                       \n\n                        You can view your company org chart using the Org Browser feature in the Profile page.\n                       \n\n\n                         To view your company org chart,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Open your Profile page by clicking your profile picture in the top right corner of the screen. (If you have not yet selected a profile picture, a\n                            \n                            icon appears instead.)\n                           \n\n\n\n                            Open the Profile page for another user by clicking that user's profile picture anywhere it appears.\n                           \n\n\n\n\n\n                          Click\n                          \n                           View Full Org\n                          \n                          , which is found on the right side of the profile header.\n                          \n\n\n\n\n\n\n                        Your organizational line to the CEO appears, with your superiors, peers, and reports called out. You can see other individuals and lines in the chart by searching for specific employees or clicking on different employees in the chart. These actions are described more in continuation.\n                       \n\n                        To close the Org Browser and return to the Profile page, click\n                        \n                        .\n                       \n\n                        Understanding connections\n                       \n\n                        Circles with profile pictures appear for all users in your organizational line who have specified their place in the hierarchy, starting with the CEO at the top and drilling down to each successive individual in the line. The selected individual's picture appears larger than the others to make it easier to spot. In addition, that picture and the pictures of all the selected individual's superiors are connected by a thick blue line, while pictures of the selected individual and his or her peers and reports are connected by a thin gray line.\n                       \n\n\n\n                          Organization Explorer Example\n                         \n\n\n\n                        In the following example, the user has selected the individual named \"Blaine Mossman.\" A thick blue line connects Blaine to his supervisor, Andie Breiter, and continues from Chad to his supervisor, Charlie O'Brien. Blaine's four direct reports are connected to him by a thin gray line. In addition, Blaine's four peers (that is, those individuals who also report to Andie Breiter) are shown next to her, also connected by a gray line. Andie's peers are not shown in this view, but you could see them by clicking the circle to the left of her picture.\n                       \n\n\n\n\n                        Only one level of reports is shown below the selected individual. In the previous example, Brett Haymond's reports are not shown because his supervisor, Blaine Mossman, is selected. However, you can see further down the hierarchy by selecting a report. In the following example, the user has selected Brett Haymond, so his reports are now shown.\n                       \n\n\n\n\n                        The graphic in the bottom center of the Org Explorer (under the \"How Are You Connected?\" text) shows the selected user's connection to the CEO. In the following example, the connection line is shown between user \"Brett Haymond\" and his CEO, Charlie O'Brien.\n                       \n\n\n\n\n                        Viewing a user's name and position\n                       \n\n                        When you click a user's picture, their name, position, and contact information appears at the bottom left of the Org Explorer, under \"Employee Selection.\" You can then jump directly to that user's Profile page by clicking\n                        \n                         View Profile\n                        \n                        . You can also send an email to the user by clicking\n                        \n                         Send Email\n                        \n                        . This opens your email client, with the user's email address entered automatically.\n                       \n\n                        Searching for a user\n                       \n\n                        In the top right corner of the Org Explorer, there is a\n                        \n                         Search Users\n                        \n                        bar you can use to search for any user in the Org Explorer. When a user is found, his or her connection line is shown, and the information in\n                        \n                         How Are You Connected?\n                        \n                        and\n                        \n                         Employee Selection\n                        \n                        is updated accordingly.", "Preview Article": "Click here to preview", "URL Name": "360043439453", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004397", "Archived Date": "", "Language": "English", "Primary Version": "Viewing and Entering Peers in Your Company Org Chart", "Article Total View Count": "4,848", "": "", "Article Created Date": "10/24/2022, 9:46 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Viewing and Entering Peers in Your Company Org Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}