{"file_path": "../../raw_kb_v2\\article\\360042923454\\index.html", "content": {"Title": "Dynamic Pivot", "Article Body": "Intro\n                       \n\n                        As a use case, let's say a user receives a dataset every month from Finance and uploads it to Domo in Excel format via Workbench. This dataset contains a column titled \"Account.\" The values on this column show a list of financial metrics or transactions as shown below. (The screenshot below is just sample data but the schema is similar to the schema of the actual dataset, albeit with fewer columns.)\n                       \n\n\n\n\n                        The client needs to pivot each metric into its own column to perform certain calculations and to report the data in tabular format as requested by the Exec team. One option is to use the Magic ETL \"Uncollapse Columns\" transformation, which works pretty well; however, one disadvantage of this transform is that it's not dynamic. The client does not want to manually edit the Magic DataFlow because he would have to add a new \"Account\" metric every time a new metric was added to the source data.\n                       \n\n                        Luckily there is at least one solution to accomplish this. You can create a MySQL stored procedure to dynamically include/add any new metric under the Account field every time a new value is added to the data source.\n                       \n\n                        Transformation Steps\n                       \n\n                        This section shows you how to dynamically add new metrics to a DataSet by creating and calling a MySQL stored procedure. The stored procedure is available here as a text file:\n                        \n                         Dynamic_Pivot.sql\n                        \n\n\n\n                         To dynamically add new metrics,\n                        \n\n\n\n\n                          Add backticks (`) for all values with spaces (i.e. `Net Revenue`).\n                          \n                          This is necessary so the Group CONCAT function will work in the next step.\n                          \n\n\n\n\n\n\n                          Create your stored procedure, making sure to uncheck\n                          \n                           Generate Output Table\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Call the stored procedure, making sure to uncheck\n                          \n                           Generate Output Table\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Query the new table generated by the procedure.\n                          \n\n\n\n\n\n\n                          Generate the output DataSet.", "Preview Article": "Click here to preview", "URL Name": "360042923454", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004599", "Archived Date": "", "Language": "English", "Primary Version": "Dynamic Pivot", "Article Total View Count": "5,351", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Dynamic Pivot\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Transformation Tips And Tricks\n              \n", "url": "/s/topic/0TO5w000000ZaoJGAS"}]}