{"file_path": "../../raw_kb_v2\\article\\360060476953\\index.html", "content": {"Title": "Awardco Connector", "Article Body": "Intro\n                       \n\n                        Awardco is a cloud-based employee recognition solution designed to boost employee engagement and simplify the reward process with incentivized programs. With Awardco, managers can recognize and reward the deserving employee within a matter of seconds, making the recognition process more empowering, relaxing, and flavorful from service awards to sales incentives. Use Domo's Awardco connector to retrieve data about recognitions, redemptions, transactions, and users in your organization. To learn more about the Awardco API, visit their page (\n                        \n                         https://api.awardco.com/\n                        \n                        ).\n                       \n\n                        You connect to your Awardco account in the Data Center. This topic discusses the fields and menus that are specific to the Awardco connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Awardco account and create a DataSet, you must have your Awardco API key.\n                       \n\n                        Obtaining the API key:\n                       \n\n\n                         Log in to your Award Force account.\n                        \n\n                         Go to\n                         \n                          Settings > General > Integration\n                         \n                         .\n                        \n\n                         Note your Account ID (It will be required for validating your access tokens).\n                        \n\n                         Next to the\n                         \n                          API key\n                         \n                         field, click\n                         \n                          Generate key\n                         \n                         .\n                        \n\n                         You will see the API key field populated with your new key. Copy this key and paste it in the Connector's Credentials section (API Key). You can generate a new key at any time. Once a new key is generated, the old key will stop working.\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                           In order to generate the API key, you must have the \"Awards manager\" account privileges.\n                          \n\n\n\n\n                        Connecting to Your Awardco Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the\n                        \n                        Awardco\n                        \n                         Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your\n                        \n                        Awardco\n                        \n                         account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Awardco API key. See \"Prerequisites\" for more details.\n                          \n\n\n\n\n\n                         Once you have entered valid Awardco credentials, you can use the same account any time you go to create a new Awardco DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the\n                            \n                             Awardco\n                            \n                            report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Recognition Detail\n                              \n\n                               Returns a detail level report for recognition within the selected time frame.\n                              \n\n\n\n                               Recognition Summary\n                              \n\n                               Returns a summary level report for recognition within the selected time frame.\n                              \n\n\n\n                               Redemption Detail\n                              \n\n                               Returns a detail level report for redemption within the selected time frame.\n                              \n\n\n\n                               Redemption Fifo\n                              \n\n                               Returns the information for redemption fifo report within the selected time frame\n                              \n\n\n\n                               Redemption Summary\n                              \n\n                               Returns a summary level report for redemption within the selected time frame.\n                              \n\n\n\n                               Transactions\n                              \n\n                               Returns all transactions within the selected time frame.\n                              \n\n\n\n                               Users\n                              \n\n                               Returns a list of all users.\n                              \n\n\n\n\n\n\n\n                           Date Selection\n                          \n\n                           Select the date format for your data.\n                          \n\n\n\n                           Single Date\n                          \n\n                           Select whether the report data is for a specific date or for a relative number of days back from today.\n                          \n\n\n\n                           Specific Date\n                          \n\n                           Select the specific date using the date selector.\n                          \n\n\n\n                           Relative Date\n                          \n\n                           Enter the number of days back that you would like to get data for in the\n                           \n\n                             Days Back\n                            \n\n                           field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n                          \n\n\n\n                           Date Range\n                          \n\n                           Select the specific or relative date range.\n                          \n\n\n\n                           Start Date - Specific\n                          \n\n                           Select the first date in your date range using the date selector.\n                          \n\n\n\n                           End Date - Specific\n                          \n\n                           Select the last date in your date range using the date selector.\n                          \n\n\n\n                           Start Date - Relative\n                          \n\n\n                            Enter the number of days back that you would like to get data from (start day). Combine with\n                            \n\n\n\n\n\n\n\n                                    End Date\n                                   \n\n\n\n\n\n\n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n\n\n\n\n\n\n                                    Start Date\n                                   \n\n\n\n\n\n\n\n                            and 5 for\n                            \n\n\n\n\n\n\n\n                                    End Date\n                                   \n\n\n\n\n\n\n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n                           End Date - Relative\n                          \n\n\n                            Enter the number of days back that you would like to get data to (end day). Combine with\n                            \n\n\n\n\n\n\n\n                                    Start Date\n                                   \n\n\n\n\n\n\n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n\n\n\n\n\n\n                                    Start Date\n                                   \n\n\n\n\n\n\n\n                            and 5 for\n                            \n\n\n\n\n\n\n\n                                    End Date\n                                   \n\n\n\n\n\n\n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n                           Time Period\n                          \n\n                           Choose the time period that you would like to receive data for.\n                          \n\n\n\n                           Starting Day of the Week\n                          \n\n                           Select the day you would like your week to start with.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360060476953", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003283", "Archived Date": "", "Language": "English", "Primary Version": "Awardco Connector", "Article Total View Count": "2,406", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Awardco Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}