{"file_path": "../../raw_kb_v2\\article\\360043433553\\index.html", "content": {"title": "\n\n\n Sumo Logic Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSumo Logic is a cloud-based log management and analytics service that leverages machine-generated big data to deliver real-time IT insights. You can use Domo's Sumo Logic connector to pull your IT insight data into Domo.\n\n\n The Sumo Logic connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n There are two versions of the Sumo Logic connector—a regular version and an advanced version. The only difference between these is that the advanced version requires authenticating via an API access ID and access key, while the regular version just requires a username and password.\n\n\n This topic discusses the fields and menus that are specific to the Sumo Logic connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Sumo Logic account and create a DataSet, you must have the following:\n\n The username you use to log into Sumo Logic account (standard version only)\n* The password you use to log into your Sumo Logic account (standard version only)\n* Your API access ID (advanced version only)\n* Your API access key (advanced version only)\n\nTo find or generate API access credentials, visit\n\nhttps://help.sumologic.com/Manage/Se...ty/Access-Keys\n\n.\n\n\n Connecting to your Sumo Logic account\n---------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Sumo Logic connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Sumo Logic connector uses OAuth to connect to Sumo Logic. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Sumo Logic accounts in Domo) to open the Box OAuth screen where you can enter the username and password associated with your Sumo Logic account. After you have entered valid Sumo Logic credentials, you can use the same account in Domo any time you create a Sumo Logic DataSet.\n\n\n You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane includes a primary menu,\n **Report**\n , and other menus that appear depending on the report you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Sumo Logic report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Collector Management\n  |\n Retrieves the list of collectors and associated information.\n  |\n|\n Dashboard\n  |\n Retrieves data defined on your dashboard in Sumo Logic.\n  |\n|\n Search Job\n  |\n Queries the log information in Sumo Logic.\n 1. In the\n **Query**\n field, enter the search query to run.\n\nFor information about the Sumo Logic search syntax, see\n\nhttps://help.sumologic.com/05Search/Get-Started-with-Search/How-to-Build-a-Search/Search-Syntax-Overview\n\n.\n1. In the\n **Date Offset**\n field, select the report date.\n2. In the\n **Time Zone**\n field, enter the 3 letter time zone. For example:\n\nMST\n\n.\n |\n\n\n |\n|\n Query\n  |\n This option appears when \"Search Job\" is selected.\n  |\n|\n Date Offset\n  |\n This option appears when \"Search Job\" is selected.\n  |\n|\n Time Zone\n  |\n This option appears when \"Search Job\" is selected.\n\n\n |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How often can the data be updated?\n\nDataSets can run as often as every 15 minutes. However, depending on the runtime of the query, DataSets may need to run less frequently.\n\n####\n Are there any API limits I should be aware of?\n\nSumo Logic may limit API calls. To prevent rate limiting, reduce the number of DataSets scheduled to run at the same time.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433553\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003555\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSumo Logic Connector\n\n", "article_total_view_count": "\n\n\n 4,692\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "sumo_logic_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}