{"file_path": "../../raw_kb_v2\\article\\360042926514\\index.html", "content": {"Title": "BuzzSumo Connector", "Article Body": "Intro\n                       \n\n                        BuzzSumo discovers the content that performs best for any topic or competitor and finds the key influencers to promote the content. Use the Domo BuzzSumo connector to receive details about most shared content, top influencers, trending content, and more. To learn more about the BuzzSumo API, visit their page (\n                        \n                         http://buzzsumo.com/knowledge/buzzsumo-api/\n                        \n                        ).\n                       \n\n                        You connect to your BuzzSumo account in the Data Center. This topic discusses the fields and menus that are specific to the BuzzSumo connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your BuzzSumo account and create a DataSet, you must have a BuzzSumo API key. For information about obtaining an API key, reach out to your BuzzSumo account representative.\n                       \n\n                        Connecting to Your BuzzSumo Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the BuzzSumo Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your BuzzSumo account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            API Key\n                           \n\n\n\n                            Enter your BuzzSumo API key.\n                           \n\n\n\n\n\n\n                         Once you have entered valid BuzzSumo credentials, you can use the same account any time you go to create a new BuzzSumo DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the BuzzSumo report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Article Sharers\n                               \n\n\n\n                                Returns a sampling of the people who have shared a given article on Twitter. This is the same data you see when you click\n                                \n                                 View Sharers\n                                \n                                in the top content search.\n                               \n\n\n\n\n\n                                Links Shared\n                               \n\n\n\n                                Returns recent links shared by a given Twitter user, ordered by most recent first.\n                               \n\n\n\n\n\n                                Most Shared\n                               \n\n\n\n                                Returns the most shared content for a specific domain or topic/keyword.\n                               \n\n\n\n\n\n                                Top Influencers\n                               \n\n\n\n                                Returns influencers for a given topic. These are the same results you see in BuzzSumo's\n                                \n                                 Influencer Search\n                                \n                                area.\n                               \n\n\n\n\n\n                                Trending\n                               \n\n\n\n                                Returns the most popular content over the last 24 hours.\n                               \n\n\n\n\n\n\n\n\n\n                            Search Query\n                           \n\n\n\n                            Enter a search query to retrieve data filtered to that query.\n                           \n\n\n\n\n\n                            Result Type\n                           \n\n\n\n                            Select a social network to filter your data by. If you select\n                            \n                             Total\n                            \n                            , data is returned for all social networks.\n                           \n\n\n\n\n\n                            Article Type\n                           \n\n\n\n                            Select an article type to filter your data by.\n                           \n\n\n\n\n\n                            Language (Optional)\n                           \n\n\n\n                            Enter the language you want to filter results by.\n                           \n\n\n\n\n\n                            Search Type\n                           \n\n\n\n                            Select whether you want to sort results by trending score or total shares.\n                           \n\n\n\n\n\n                            Topic (Optional)\n                           \n\n\n\n                            Enter the topic you want to retrieve data for.\n                           \n\n\n\n\n\n                            TLD (Optional)\n                           \n\n\n\n                            Enter the TLD (top-level domain) you want to retrieve data for.\n                           \n\n\n\n\n\n                            Domain (Optional)\n                           \n\n\n\n                            Enter the domain you want to retrieve data for.\n                           \n\n\n\n\n\n                            Person Types\n                           \n\n\n\n                            Select the person types you want to retrieve data for.\n                           \n\n\n\n\n\n                            Ignore Broadcasters?\n                           \n\n\n\n                            Check the box if you do not want broadcasters to be shown in your data.\n                           \n\n\n\n\n\n                            Option to Select Article IDs\n                           \n\n\n\n                            Select whether you want to collect data for all articles for a specified search query or only for a specified article.\n                           \n\n\n\n\n\n                            Article ID\n                           \n\n\n\n                            Select the ID of the article you want to retrieve data for.\n                           \n\n\n\n\n\n                            Blocked Domains (Optional)\n                           \n\n\n\n                            Enter the names of blocked domains you want to retrieve data for.\n                           \n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter the username you want to retrieve data for.\n                           \n\n\n\n\n\n                            Hours (Optional)\n                           \n\n\n\n                            Enter the number of hours you want to retrieve data for.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042926514", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003800", "Archived Date": "", "Language": "English", "Primary Version": "BuzzSumo Connector", "Article Total View Count": "4,642", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              BuzzSumo Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}