{"file_path": "../../raw_kb_v2\\article\\360043433633\\index.html", "content": {"Title": "Sysomos Connector", "Article Body": "Intro\n                       \n\n                        Sysomos is a unified, insights-driven social platform that lets marketers search, discover, listen, publish, engage, and analyze at scale across earned, owned, and paid media. To learn more about the Sysomos API, visit their page (\n                        \n                         https://sysomos.com/products/api-data-partners/\n                        \n                        ).\n                       \n\n                        You connect to your Sysomos account in the Data Center. This topic discusses the fields and menus that are specific to the Sysomos connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Sysomos account and create a DataSet, you must have a Sysomos API key. If you do not have an API key, reach out to your Sysomos account representative.\n                       \n\n                        Connecting to Your Sysomos Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Sysomos Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Sysomos account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Sysomos API key.\n                          \n\n\n\n\n\n                         Once you have entered valid Sysomos credentials, you can use the same account any time you go to create a new Sysomos DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Sysomos report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Analytics Blogs\n                              \n\n                               Returns aggregate analytics (sentiment, trend, demographics, etc.) for blog posts.\n                              \n\n\n\n                               Analytics Forums\n                              \n\n                               Returns aggregate analytics (sentiment, trend, demographics, etc.) for forums.\n                              \n\n\n\n                               Analytics News\n                              \n\n                               Returns aggregate analytics (sentiment, trend, demographics, etc.) for news sites.\n                              \n\n\n\n                               Analytics Twitter\n                              \n\n                               Returns aggregate analytics (sentiment, trend, demographics, etc.) for Twitter.\n                              \n\n\n\n                               Search Blogs\n                              \n\n                               Returns search results from blogs for the provided query.\n                              \n\n\n\n                               Search Forums\n                              \n\n                               Returns search results from forums for the provided query.\n                              \n\n\n\n                               Search News\n                              \n\n                               Returns search results from news sites for the provided query.\n                              \n\n\n\n                               Search Twitter\n                              \n\n                               Returns search results from Twitter for the provided query.\n                              \n\n\n\n\n\n\n\n                           Search Term\n                          \n\n                           Enter the search term you want to retrieve data for.\n                          \n\n\n\n                           Start Days\n                          \n\n                           Enter the number of days back you want to begin pulling data for. Pair with\n                           \n                            End Days\n                           \n                           to pull data for a range of days. For example, if you entered\n                           \n                            14\n                           \n                           for\n                           \n                            Start Days\n                           \n                           and\n                           \n                            7\n                           \n                           for\n                           \n                            End Days\n                           \n                           , each time the report ran it would pull data for 14 days ago up until 7 days ago.\n                          \n\n\n\n                           End Days\n                          \n\n                           Enter the number of days back you want to stop pulling data for. Pair with\n                           \n                            Start Days\n                           \n                           to pull data for a range of days. For example, if you entered\n                           \n                            14\n                           \n                           for\n                           \n                            Start Days\n                           \n                           and\n                           \n                            7\n                           \n                           for\n                           \n                            End Days\n                           \n                           , each time the report ran it would pull data for 14 days ago up until 7 days ago.\n                          \n\n\n\n                           Countries to Report\n                          \n\n                           Enter a comma-separated list of two-letter postal codes for countries you want to include in your report (e.g.\n                           \n                            US,CN,MX\n                           \n                           ).\n                          \n\n\n\n                           Record Limit\n                          \n\n                           Enter the maximum number of records you want to retrieve. At least this many records will be returned, but there will likely be more. Up to 50,000 records can be fetched.\n                          \n\n\n\n                           Report Country Results Individually\n                          \n\n                           Select whether you want individual results to be shown for countries entered in the\n                           \n                            Countries to Report\n                           \n                           field. If you select\n                           \n                            Yes\n                           \n                           , all countries you've entered will have their results shown separately. If you select\n                           \n                            No\n                           \n                           , the statistics for all countries you've entered will be aggregated.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043433633", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003537", "Archived Date": "", "Language": "English", "Primary Version": "Sysomos Connector", "Article Total View Count": "2,361", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Sysomos Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}