{"file_path": "../../raw_kb_v2\\article\\360043434313\\index.html", "content": {"title": "\n\n\n Salesforce Desk Connector\n\n\n", "article_body": "\n\nIntro\n---------\n\nSalesforce Desk is an online customer service software and support ticket help desk application for small businesses and fast-growing companies. The Domo Salesforce Desk connector integrates Domo with Salesforce Desk to extract data from the Salesforce Desk API. The connector allows you to retrieve data about articles, cases, customers, and many other Salesforce Desk components. To learn more about the Salesforce Desk API, visit their website. (\n\nhttp://dev.desk.com/API/using-the-api/#general\n\n)\n\n\n The Salesforce Desk connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Salesforce Desk account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the Salesforce Desk connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Salesforce Desk account and create a DataSet, you must have the following:\n\n Your Salesforce Desk customer ID. You can find your customer ID in the URL of your company's Salesforce Desk instance. For example, in the Salesforce Desk URL\n **https://yourcompany.desk.com**\n , the company ID is\n\nyourcompany\n\n.\n* The email address you use to log in to your Salesforce Desk account.\n* The password you use to log in to your Salesforce Desk account.\n\nConnecting to Your Salesforce Desk Account\n--------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Salesforce Desk Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains a single field where you enter your Salesforce Desk company ID. You are then taken to the Salesforce Desk OAuth page where you are required to enter your email address and password. Once you have entered valid Salesforce Desk credentials, you can use the same account any time you go to create a new Salesforce Desk DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select a Salesforce Desk report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Articles\n  |\n Returns data about articles, including subject, body text, etc.\n  |\n|\n Article Translations\n  |\n Returns data about article translations.\n  |\n|\n Brands\n  |\n Returns data about brands, including name, creation date, etc.\n  |\n|\n Cases\n  |\n Returns data about cases, including status, description, customer ID, last modification date and time, etc.\n  |\n|\n Case Attachments\n  |\n Returns data about case attachments. This includes private case attachments as well as those on replies and the original message.\n  |\n|\n Case Replies\n  |\n Returns data about case replies.\n  |\n|\n Case Notes\n  |\n Returns data about case notes. Notes are private internal messages created by agents.\n  |\n|\n Companies\n  |\n Returns data about companies, including name, ID, domain, etc.\n  |\n|\n Customers\n  |\n Returns data about customers, including first and last name, company, title, etc.\n  |\n|\n Facebook Accounts\n  |\n Returns data about Facebook accounts, including name, ID, image URL, etc.\n  |\n|\n Facebook Feeds\n  |\n Returns data about Facebook feeds, including name, ID, image URL, etc.\n  |\n|\n Facebook Users\n  |\n Returns data about Facebook users, including image URL, profile, URL, etc.\n  |\n|\n Filters\n  |\n Returns data about filters, including names, positions, sort directions, etc.\n  |\n|\n Groups\n  |\n Returns data about groups, including names, IDs, etc.\n  |\n|\n Insights\n  |\n Return data about insights.\n  |\n|\n Inbound Mailboxes\n  |\n Returns data about inbound mailboxes, including mailbox name, type, mail server hostname and port, last update time, etc.\n  |\n|\n Integration URLs\n  |\n Returns data about integration URLs, including names, rendered URLs, descriptions, etc.\n  |\n|\n Jobs\n  |\n Returns data about jobs, including job type, status, percent complete, any errors encountered while running jobs, etc.\n  |\n|\n Labels\n  |\n Returns data about labels, including names, descriptions, type, etc.\n  |\n|\n Macros\n  |\n Returns data about macros, including names, descriptions, folders, etc.\n  |\n|\n Outbound Mailboxes\n  |\n Returns data about outbound mailboxes, including names, email addresses, mail server hostname and port, etc.\n  |\n|\n Rules\n  |\n Returns data about rules, including names, descriptions, etc.\n  |\n|\n Site Settings\n  |\n Returns data about site settings, including names, values, etc.\n  |\n|\n Topics\n  |\n Returns data about topics, including names, descriptions, etc.\n  |\n|\n Topic Translations\n  |\n Used to discover how people interact with your website through the conversion process. You can use this report to get information about which tactic and channel are generating the most revenue and return-on-ad spending.\n  |\n|\n Twitter Accounts\n  |\n Returns data about Twitter accounts, including name, handle, profile image URL, etc.\n  |\n|\n Twitter Users\n  |\n Returns data about Twitter users, including handle, number of followers, etc.\n  |\n|\n Users\n  |\n Returns user data, including user name, email, avatar URL, level, etc.\n  |\n\n\n |\n|\n Date Filter Criteria\n  |\n Specify how you want the data in the report to be filtered.\n\n\n If you select\n **Created at**\n , the report is filtered based on when the record was created.\n\n\n If you select\n **Updated at**\n , the report is filtered based on when this record was last updated by any action.\n  |\n|\n Past Days\n  |\n Enter the number of days of data to be retrieved. You can use any of the following formats:\n\nX\n\n,\n\nXDay\n\n, or\n\nXDays\n\n, where x is a positive integer. For example, to retrieve data for 30 days you could enter\n\n30\n\n,\n\n30Day\n\n, or\n\n30Days\n\n.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043434313\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003488\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSalesforce Desk Connector\n\n", "article_total_view_count": "\n\n\n 4,643\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "salesforce_desk_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}