{"file_path": "../../raw_kb_v2\\article\\360043436613\\index.html", "content": {"title": "\n\n\n Google Drive Connector\n\n\n", "article_body": "\n\n*Important:**\n\nDue to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. All pre-existing DataSets will continue to run normally. Current Connectors that rely on Google OAuth authentication will no longer be able to power up new DataSets. These connectors include the following:\n * Google BigQuery\n* Google Adwords via BigQuery\n* DoubleClick Campaign Manager via Google Cloud Storage (DTV2)\n* Google Cloud Storage\n* Google Contacts\n* Google Drive\n* Google Gmail\n* Google Admin SDK Reports\n\nIf you need to change a pre-existing Google OAuth DataSet, please use the corresponding Service Account connector. The following Service Account connectors are now available:\n\n Google BigQuery Service\n* Google Ads (fomerly AdWords) via BigQuery Service\n* Google Drive Service\n* Google Cloud Storage Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Admin SDK Reports Service\n\nAll other equivalent Google Service Account connectors are currently in development. Domo will communicate when these connectors become available. You will need to look for the Service Account equivalent connector in Data Center or the App Store and use that connector to get their data.\n\n\n Domo recommends that you proactively repower existing Google connections by creating new DataSets utilizing the new Service Account Key connectors as the connectors become available.  Domo will notify you if any further migration changes should arise.\n\n\n Intro\n-------\n\nGoogle Drive is a file storage and synchronization service developed by Google that allows users to store files in the cloud, synchronize files across devices, and share files. Use Domo's Google Drive connector to retrieve Excel and CSV files from a Google Drive account and output them as Domo DataSets. To learn more about the Google Drive API, visit their page (\n\nhttps://developers.google.com/drive/\n\n).\n\n\n You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Drive connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Google account and create a Google Drive DataSet, you must have Google credentials.\n\n\n Connecting to Your Google Account\n-----------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Drive Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google Drive connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google Drive accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Drive  DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Details Pane\n\nIn this pane, you specify the Google Drive file you want to import into Domo and set options for how you want to data to appear.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n File Name\n  |\n Enter the name of the file you want to import from Google Drive. Extensions are optional. If you do not specify an extension, Domo will first look for XLSX files with the name you provided. If no XLSX files are found, it will then look for XLS files, and finally CSV files. If your Google Drive contains more than one file with the same name, the latest updated version will be used.\n  |\n|\n Is Password Protected?\n  |\n Indicate whether the file you are importing is password-protected.\n  |\n|\n File Password\n  |\n Enter the password needed to access the requested file.\n  |\n|\n Sheet Name (optional)\n  |\n Enter the name of the sheet in which the file is found. If you do not enter a sheet name, data will be pulled from the first sheet in the file.\n  |\n|\n Layout\n  |\n Select the layout of your file. The following options are available:\n * ****Column as Header****\n . Indicates that your data uses a column-based layout (i.e. each column has a header).\n* ****Row as Header****\n . Indicates that your data uses a row-based layout (i.e. each row has a header).\n* ****Cross Tab****\n . Indicates that your data uses a cross-tab (pivot) layout.\n* ****Raw****\n . Indicates that your data is raw (unformatted).\n |\n|\n Mode\n  |\n Select how the cell range of your data will be determined. If you select\n ****Auto****\n , the range is determined automatically. If you select\n ****Manual****\n , you will be asked to enter the column header and data ranges manually.\n  |\n|\n Column Header Range\n  |\n Enter the range for the column headers in your Excel sheet. For example:\n\nA2:F8\n\n|\n|\n Data Range\n  |\n Enter the range for the data (non-header) cells in your Excel sheet. For example:\n\nA3:F20\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How do I know my Google credentials are secure?\n\nThe login process uses the OAuth process, so your Google credentials are never seen or stored by Domo. You can revoke Domo's access to your account at any time.\n\n####\n How often can the data be updated?\n\nDataSets should be set to update no more than once an hour.\n\n####\n Are there any API limits I should be aware of?\n\nWhile Google may enforce call rate limits, you should not have to worry about them.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436613\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003937\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Drive Connector\n\n", "article_total_view_count": "\n\n\n 4,885\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_drive_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}