{"file_path": "../../raw_kb_v2\\article\\360042925714\\index.html", "content": {"Title": "Buzz Onboarding", "Article Body": "Buzz provides an onboarding experience that allows first-time users to learn about and adopt all the great value around collaborating in Buzz in their own time and at their own pace. They can also easily invite their collaborators or network without concern for licensing or budget constraints.\n                       \n\n\n\n\n                        As part of this onboarding experience, you are taken through a number of steps in which you are asked to enter all of the following:\n                       \n\n\n\n                          Your name.\n                         \n\n\n\n                          Your photo.\n                          \n                          If you want to change your photo later, you can do so in your Profile. For more information, see\n                          \n                           Adding or Changing Your Profile Picture\n                          \n                          .\n                         \n\n\n\n                          Email addresses of team members you want to invite to Domo.\n                          \n                          Alternatively, if you want to invite multiple users at once instead of entering email addresses manually, you can do so by proceeding to the fourth step and copying the Domo-generated URL, which you can then share with your team. They can click this link to get access to Buzz.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Domains of email addresses for users you invite must be whitelisted in the Admin Settings. For more information, see\n                             \n\n\n\n\n\n\n\n\n                        If you want to invite team members later, you can do this by clicking the\n                        \n                         Invite User\n                        \n                        button in the Buzz panel on the left and then choosing either invite option. For more information, see\n                        \n                         Inviting Others to Join Domo\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042925714", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004320", "Archived Date": "", "Language": "English", "Primary Version": "Buzz Onboarding", "Article Total View Count": "4,720", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Buzz Onboarding\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Buzz\n              \n", "url": "/s/topic/0TO5w000000ZanCGAS"}]}