{"file_path": "../../raw_kb_v2\\article\\360043435753\\index.html", "content": {"Title": "Entrata Connector", "Article Body": "Intro\n                       \n\n                        Entrata is an online property management system for marketing, leasing and management of rental property. Use Domo's Entrata connector to retrieve transaction lists, customer testimonials, lead lists, and so on. For more information about the Entrata API, visit their website. (\n                        \n                         https://www.entrata.com/api-documentation\n                        \n                        )\n                       \n\n                        The Entrata connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to your Entrata account in the\n                        \n                         Data Center\n                        \n                        . This topic discusses the fields and menus that are specific to the Entrata connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Entrata account and create a DataSet, you must have an Entrata username and password. You must also know your Entrata account domain. This is the portion of your Entrata URL immediately following\n                        \n                         https://\n                        \n                        , e.g.\n                        \n                         https://[mycompany].entrata.com.\n                        \n\n\n                        Connecting to Your Entrata Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Entrata Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your Entrata account. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter your Entrata username.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter your Entrata password.\n                           \n\n\n\n\n                           Domain\n                          \n\n                           Enter the account domain for your Entrata instance.\n                          \n\n\n\n\n                        Once you have entered valid Entrata credentials, you can use the same account any time you go to create a new Entrata DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Report\n                         \n\n                        menu in which you select a report type. Depending on the report type you select, other options may be available.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select an Entrata report. The following reports are available:\n                           \n\n\n\n\n                               Report\n                              \n\n                               Description\n                              \n\n\n\n                               AR Codes\n                              \n\n                               Returns all AR codes for a specified management company.\n                              \n\n\n\n                               AR Payments\n                              \n\n                               Retrieves AR payments details.\n                              \n\n\n\n                               AR Transactions\n                              \n\n                               Retrieves a list of all transactions.\n                              \n\n\n\n                               Customers\n                              \n\n                               Retrieves a list of customers for a property.\n                              \n\n\n\n                               Customer Testimonials\n                              \n\n                               Retrieves a list of customer testimonials for a property.\n                              \n\n\n\n                               Customer Testimonial PickList\n                              \n\n                               Retrieves pick lists for Testimonials.\n                              \n\n\n\n                               Financial Budget Actuals\n                              \n\n                               Returns all budget actual data from a selected property, gl tree, and budget. Data is selected by month. For example, when selecting a start date of 2017-05-15 to an end date of 2017-05-21, you are selecting all data from the start to the end of May 2017.\n                              \n\n\n\n                               Financial General Ledger Transactions\n                              \n\n                               Returns all General Ledger transactions for a property.\n                              \n\n\n\n                               Financial General Ledger Trees\n                              \n\n                               Retrieves General Ledger accounts information.\n                              \n\n\n\n                               Financial PickList\n                              \n\n                               Retrieves financial picklist.\n                              \n\n\n\n                               Leads MITS\n                              \n\n                               Retrieves a list of leads.\n                              \n\n\n\n                               Lease Details\n                              \n\n                               Returns charge detail information for all leases for the selected property.\n                              \n\n\n\n                               Leases Expiring\n                              \n\n                               Returns a list of expiring leases.\n                              \n\n\n\n                               Lease PickList\n                              \n\n                               Pulls a list of Ids required for other leases services.\n                              \n\n\n\n                               Maintenance Work Orders\n                              \n\n                               Retrieves work orders information.\n                              \n\n\n\n                               Properties\n                              \n\n                               Retrieves properties details for the management company.\n                              \n\n\n\n                               Properties Floor Plans\n                              \n\n                               Retrieves a list of floor plans for a property.\n                              \n\n\n\n                               Properties PickList\n                              \n\n                               Pulls a pick list for Properties.\n                              \n\n\n\n                               Property Amenities\n                              \n\n                               Pulls a list of property Amenities.\n                              \n\n\n\n                               Property Unit Amenities\n                              \n\n                               Pulls a list of Unit Amenities.\n                              \n\n\n\n                               Property Units Availability and Pricing\n                              \n\n                               Pulls a list of Unit availability and their pricing.\n                              \n\n\n\n                               Property Units MITS\n                              \n\n                               Retrieves property information.\n                              \n\n\n\n                               Property Units MITS - ILS Units\n                              \n\n                               Retrieves property ILS unit information.\n                              \n\n\n\n                               Property Unit Types\n                              \n\n                               Pulls a list of unit types.\n                              \n\n\n\n                               Report Data\n                              \n\n                               Retrieves data about a report based on user supplied filters.\n                              \n\n\n\n                               Report Data V2\n                              \n\n                               Retrieve data about a report based on user supplied post body. To import data from an Entrata report, export the report definition from the Entrata UI and enter it in it's entirety in the 'REPORT DATA POST BODY' section.\n                              \n\n\n\n                               Report Filters\n                              \n\n                               Retrieves the filters available for an individual report.\n                              \n\n\n\n\n\n\n\n                           Batch Size\n                          \n\n                           Only change this property if Entrata is failing to return a successful response. This modifies how many properties are requested per API request. Smaller numbers can be handled better by the API, but will result in more API requests, which could cause you to go over your daily API rate limits. Maximum is 100.\n                          \n\n\n\n                           Select Properties\n                          \n\n\n                            Specify whether you would like to retrieve all properties or a specific property.\n                           \n\n\n\n\n                           Property\n                          \n\n\n                            Select the property you would like to view.\n                           \n\n\n\n\n\n\n\n                           Budget\n                          \n\n\n                            Select the budget you would like to view.\n                           \n\n\n\n\n                           Tree\n                          \n\n\n                            Select the Tree you would like to view.\n                           \n\n\n\n\n                           Report Name\n                          \n\n\n                            Select the name of the Entrata report you would like to retrieve data for.\n                           \n\n\n\n\n                           Accounting Method\n                          \n\n\n                            Enter the accounting method for the budget actuals.\n                           \n\n\n\n\n                           Show Detail Line Items\n                          \n\n\n                            When selected, this will break your transaction up into a detail level report. This will mean that you will see one row of data per transaction detail. This is usually a breakdown of credits and debits for that transaction. Be cautious when aggregating data with this option selected. This report can be very large.\n                           \n\n\n\n\n                           Report Filters\n                          \n\n\n                            Input user customized report filters to limit returned data. Available filters can be found in the Report Filters report. Filters must be in JSON format, and any date fields in the filters must have the m/d/Y value replaced with an appropriate date string. For example, if you find daterange-start, daterange-end, or date parameters, replace m/d/Y with a string formatted like the following: 5/1/2017. If you are replacing the date parameter, this will select reports on the date of May 1st, 2017. Only include the inner filters and not the filters or filter keys. So instead of \"filters\": { \"filter\": [{\"name\": \"property\", \"required\": null},{\"name\": \"property_stats\", \"required\": true}]} you would supply the following inner array object {\"name\": \"property\", \"required\": null},{\"name\": \"property_stats\", \"required\": true}\n                           \n\n\n\n\n                           Field to Flatten\n                          \n\n\n                            Enter the column name for Entrata Data that you would like parsed and flattened to retrieve data that is normally returned as a List. You may only enter one column at a time.\n                           \n\n\n\n\n                           Report Data Post Body\n                          \n\n\n                            Enter the json post body in the below format {\"auth\":{\"type\":\"basic\",\"password\":\"password\",\"username\":\"username\"},\"method\":{\"name\":\"getReportData\",\"version\":\"r2\",\"params\":{\"reportName\":\"\",\"reportVersion\":\"\",\"filters\":{ }}}}.\n                           \n\n\n                            The value of the username and password will be replaced by the username and password entered in the Credentials section.\n                           \n\n\n                            You can export filters for the report from the Entrata UI.\n                           \n\n\n\n\n                           Picklist\n                          \n\n\n                            Select the property picklist you would like to view.\n                           \n\n\n\n\n                           Lead MITs Sub Report\n                          \n\n                           Select the sub report data you want included in your report. This creates a new row of data per record. For example, if you selected the\n                           \n                            Phone\n                           \n                           sub report and a lead had 5 phone numbers, 5 rows of data would be added for that lead.\n                          \n\n\n\n                           Generate New Schema\n                          \n\n\n                            Select this check box if you would like to generate new schema in every run.\n                           \n\n\n\n\n                           Date Selection Type\n                          \n\n\n                            Select to filter by post date or transaction date.\n                           \n\n\n\n\n                           Start Date\n                          \n\n\n                            Specify whether the first date in your date range is a specific or relative date. Choose\n                            \n                             Relative\n                            \n                            if you always want the report to retrieve data for a given number of days back (which you specify in\n                            \n                             Days Back to Start From\n                            \n                            ) from the current date. If you choose\n                            \n                             Relative\n                            \n                            here, you should also choose\n                            \n                             Relative\n                            \n                            for\n                            \n                             End Date\n                            \n                            and specify a value for\n                            \n                             Date Back to End At\n                            \n                            .\n                           \n\n                            For example, if you enter\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n                           \n\n\n\n\n                           End Date\n                          \n\n\n                            Specify whether the last date in your date range is a specific or relative date. Choose\n                            \n                             Relative\n                            \n                            if you always want the report to retrieve data for a given number of days back (which you specify in\n                            \n                             Days Back to End At\n                            \n                            ) from the current date. If you choose\n                            \n                             Relative\n                            \n                            here, you should also choose\n                            \n                             Relative\n                            \n                            for\n                            \n                             Start Date\n                            \n                            and specify a value for\n                            \n                             Date Back to Start From\n                            \n                            .\n                           \n\n                            For example, if you enter\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n                           \n\n\n\n\n                           Select Specific Start Date\n                          \n\n                           Select the first date in your date range.\n                          \n\n\n\n                           Select Specific End Date\n                          \n\n                           Select the last date in your date range.\n                          \n\n\n\n                           Days Back to Start From\n                          \n\n\n                            Enter the number of days before the current date to use as the start date.\n                           \n\n                            For example, if you enter\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            and you set the DataSet to update daily, each day the report updates to show information for a 5-day range, starting 10 days ago and ending 5 days ago.\n                           \n\n\n\n\n                           Days Back to End At\n                          \n\n\n                            Enter the number of days before the current date to use as the end date.\n                           \n\n                            For example, if you enter\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            and you set the DataSet to update daily, each day the report updates to show information for a 5-day range, starting 10 days ago and ending 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        Can I use the same account to create multiple DataSets?\n                       \n\n                        Yes.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        As often as once an hour.\n                       \n\n                        Are there any API limits I should be aware of?\n                       \n\n                        Entrata does not document rate limits in its API.", "Preview Article": "Click here to preview", "URL Name": "360043435753", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003329", "Archived Date": "", "Language": "English", "Primary Version": "Entrata Connector", "Article Total View Count": "4,754", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Entrata Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}