{"file_path": "../../raw_kb_v2\\article\\360043430173\\index.html", "content": {"Title": "Adding a Doc Card to Domo", "Article Body": "You can add a document, image, or video to Domo to share with others.\n                       \n\n                        In Domo, the document, image, or video appears as a Doc Card. For many file types, the document, image, or video will be embedded right into the Doc Card, allowing users to view it without having to first download it. If you go to the Details view for that Doc Card, you can view a full-sized version of the document, image, or video. These embeddable file types include all of the following:\n                       \n\n\n\n                          DOC/DOCX\n                         \n\n\n\n                          PDF\n                         \n\n\n\n                          JPEG\n                         \n\n\n\n                          PNG\n                         \n\n\n\n                          PPT/PPTX\n                         \n\n\n\n                          MP4\n                         \n\n\n\n                          XLS/XLSX\n                         \n\n\n\n                          TXT\n                         \n\n\n\n                          BMP\n                         \n\n\n\n                        For other permitted file types not in this list, a download button appears instead of an embedded view.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                           In the interest of preventing users from uploading malicious files into Domo accounts, Domo allows a specific set of file types to be uploaded. If you attempt to upload a file not within this list, an error message appears. For more information, see\n                           \n                            Permitted File Types for Attachments\n                           \n                           .\n                          \n\n\n\n\n\n                         To add a Doc Card to Domo,\n                        \n\n\n\n\n                          In the Page where you want the Doc Card to appear, click  the\n                          \n                          button in the upper right corner.\n                         \n\n\n\n                          Click\n                          \n                           Create new Card\n                          \n                          .\n                          \n\n                          A dialog appears with a number of Card upload options.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Card\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Click\n                          \n                           Doc Card\n                          \n                          .\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Drag and drop a file from your machine onto the dashboard.\n                           \n\n\n\n\n\n                            Click\n                            \n                             Browse\n                            \n                            , browse to the desired file on your hard drive, then click\n                            \n                             Open\n                            \n                            .\n                            \n                            A preview of the document, image, or video appears. A thumbnail preview will NOT display if the file is password protected.\n                            \n\n                            For documents and images, you can navigate through the preview (if more than one dashboard is available) using the\n                            \n                            and\n                            \n                            buttons, download the document or image to your machine using\n                            \n                            , or open a full-screen view of the document or image using\n                            \n                            . For more information about the full-screen view for a Doc Card, see\n                            \n                             Previewing a Document\n                            \n                            .\n                            \n\n                            For videos, you can choose to use a default black thumbnail or drag and drop or browse to a JPEG/PNG image to use as a thumbnail. The image for the thumbnail must be 10 MB or less.\n                            \n\n\n\n\n\n\n\n                          Click\n                          \n                           Save\n                          \n                          to save the file as a Doc Card.\n                         \n\n\n\n                        A card is added for the document, image, or video.\n                       \n\n                        If you want, you can resize the card or move it to another position in the dashboard or to another dashboard. To learn about resizing cards, see\n                        \n                         Moving or Copying Cards to Other Pages\n                        \n                        .\n                       \n\n                        You can also change the owner of the new Card. For more information, see\n                        \n                         Assigning or Changing a Card Owner\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           You can download a document, image, or video from a Doc Card in Domo by mousing over the preview in the Details view then clicking\n                           \n                           . For more information, see\n                           \n                            Downloading a Document from Domo\n                           \n                           .\n                          \n\n\n\n\n\n                         Video - Videos in Doc Cards", "Preview Article": "Click here to preview", "URL Name": "360043430173", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004105", "Archived Date": "", "Language": "English", "Primary Version": "Adding a Doc Card to Domo", "Article Total View Count": "4,946", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Adding a Doc Card to Domo\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n\n", "url": "/s/topic/"}]}