{"file_path": "../../raw_kb_v2\\article\\360043431873\\index.html", "content": {"title": "\n\n\n SimilarWeb Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSimilarWeb collects, measures, analyzes and provides user engagement statistics for websites and mobile apps.  To learn more about the SimilarWeb API, visit their page (\n\nhttps://developer.similarweb.com/\n\n).\n\n\n You connect to your SimilarWeb account in the Data Center. This topic discusses the fields and menus that are specific to the SimilarWeb connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\na DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your SimilarWeb account and create a DataSet, you must have a SimilarWeb API key. For information about finding your API key, visit SimilarWeb's FAQ at\n\nhttps://developer.similarweb.com/faq\n\n.\n\n\n Connecting to Your SimilarWeb Account\n---------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the SimilarWeb Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your SimilarWeb account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n API Key\n  |\n Enter your SimilarWeb API key. For information about finding your API key, visit SimilarWeb's FAQ at\n\nhttps://developer.similarweb.com/faq\n\n.\n  |\n\n\n Once you have entered valid SimilarWeb credentials, you can use the same account any time you go to create a new SimilarWeb DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the SimilarWeb report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Audience Interests\n  |\n Returns a list of additional websites that were frequently visited by the same visitors of a given domain within the browsing session, along with their affinity score.\n  |\n|\n Engagement Bounce Rate\n  |\n Returns the Bounce Rate for the given domain.\n  |\n|\n Keyword Competitors Organic Search\n  |\n Returns a list of websites competing for the same organic keywords as the given domain and competition score.\n  |\n|\n Keyword Competitors Paid Search\n  |\n Returns a list of websites competing for the same paid keywords as the given domain and competition score.\n  |\n|\n Mobile App Current Installs\n  |\n Returns installs, minus uninstalls for the App as a percentage of all Android device users in the country.\n  |\n|\n Mobile App Details\n  |\n Returns the Title, Image, Publisher, Price, Main Category, Main Category ID, and Rating for a requested application.\n  |\n|\n Mobile Web Avg. Visit Duration\n  |\n Returns the average visit duration on the given mobile web domain.\n  |\n|\n Mobile Web Bounce Rate\n  |\n Returns the Bounce Rate for the given mobile web domain.\n  |\n|\n Mobile Web Pages Per Visit\n  |\n Returns the average page views for the given mobile web domain.\n  |\n|\n Mobile Web Site Related Apps\n  |\n Returns a list of all mobile applications (Google Play Store) related to the given domain.\n  |\n|\n Mobile Web Visits\n  |\n Returns estimated number of visits for the mobile web domain\n  |\n|\n Similar Sites\n  |\n Returns the top 40 most similar websites to the given domain and their similarity scores.\n  |\n|\n Total Traffic Avg. Visit Duration\n  |\n Returns the average visit duration on the given domain on a Monthly, Weekly, or Daily basis.\n  |\n|\n Total Traffic Bounce Rate\n  |\n Returns the Bounce Rate for the given domain on a Monthly, Weekly, or Daily basis.\n  |\n|\n Total Traffic Engagement\n  |\n Returns the estimated number of visits for the domain on a Monthly, Weekly, or Daily basis.\n  |\n|\n Total Traffic Page Visits\n  |\n Returns the average page views for the given domain on a Monthly, Weekly, or Daily basis.\n  |\n|\n Traffic Avg. Visit Duration\n  |\n Returns the average visit duration on the given domain on a Monthly, Weekly, or Daily basis.\n  |\n|\n Traffic Country Rank\n  |\n Returns SimilarWeb's monthly Country Rank for a given domain on a Monthly basis.\n  |\n|\n Total Traffic Desktop vs Mobile Split\n  |\n Returns the desktop vs mobile web traffic share split on a Monthly, Weekly, or Daily basis\n  |\n|\n Traffic Engagement\n  |\n Returns estimated number of visits for the domain on a Monthly, Weekly, or Daily basis.\n  |\n|\n Traffic Global Rank\n  |\n Returns SimilarWeb's monthly Global Rank for a given domain on a Monthly basis.\n  |\n|\n Traffic Page Visits\n  |\n Returns the average page views for the given domain on a Monthly, Weekly, or Daily basis.\n  |\n|\n Traffic Sources Organic Search Keywords\n  |\n Returns the organic search keywords for the given domain, keyword traffic share, change %, keyword volume, CPC, URL, and keyword position.\n  |\n|\n Traffic Sources Overview\n  |\n Returns a detailed overview of traffic sources broken down by source type and traffic share.\n  |\n|\n Traffic Sources Paid Search Keywords\n  |\n Returns the paid search keywords for the given domain, keyword traffic share, change %, keyword volume, CPC, URL, and keyword position\n  |\n|\n Traffic Sources Referrals\n  |\n Returns the referring websites for the given domain, and traffic share per referrer.\n  |\n|\n Traffic Sources Social Referrals\n  |\n Returns the leading social networks sending traffic to a given domain as well as traffic share per social network.\n  |\n|\n Traffic by Geography Distribution\n  |\n Returns traffic share, visits, pages per visit, average visit duration, and bounce rate broken down by country.\n  |\n|\n Website Category Rank\n  |\n Returns the Category of a given domain and its Global Rank within its given category\n  |\n\n|\n|\n Domain\n  |\n Enter the domain name you want to retrieve data for.\n  |\n|\n App ID\n  |\n Enter the ID of the app you want to retrieve data for.\n  |\n|\n Country\n  |\n Enter the name of the country you want to retrieve data for. If you leave this blank, data is returned for all countries.\n  |\n|\n Time Granularity\n  |\n Select whether you want your report data to be broken down by day, week, or month.\n  |\n|\n Date Range\n  |\n Select the start and end dates for your report.\n  |\n|\n Months Back\n  |\n Enter the number of past months you want to retrieve data for.\n  |\n|\n Start Date\n  |\n Enter the start month for your report in the format\n\nYYYY-MM\n\n.\n  |\n|\n End Date\n  |\n Enter the end month for your report in the format\n\nYYYY-MM\n\n. A previous month of data is not available until the 11th of the current month.\n  |\n|\n Main Domain\n  |\n Select\n **True**\n if your report data should come from the main domain; otherwise select\n **False**\n .\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431873\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003714\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSimilarWeb Connector\n\n", "article_total_view_count": "\n\n\n 2,400\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "similarweb_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}