{"file_path": "../../raw_kb_v2\\article\\4403537355543\\index.html", "content": {"Title": "Group Ownership of Accounts (Beta)", "Article Body": "Intro\n                       \n\n                        In the\n                        \n                         Accounts\n                        \n                        tab in the Data Center, you can add, delete, share, and edit the accounts associated with DataSets. Each account appears as an item in the list, with the name and logo of the data provider, the owner(s) of the Account, the number of DataSets being powered from this account, and the last updated date. You can see and manage only your own accounts and the accounts that are shared with you; however, you can transfer DataSets to other users' accounts or change the accounts associated with DataSets. You can also share accounts with others so they can also create DataSets using that Account.\n                       \n\n                        When the OAuth token for an account is about to expire, you receive notifications in Domo and via email/SMS. For information about setting notification preferences, see\n                        \n                         Configuring Notification and Alert Settings\n                        \n                        .\n                       \n\n                        If you delete a user from Domo and reassign his/her DataSets to another user, the ownership for the DataSet accounts is not passed to the new user (although permission to use the Accounts is passed to the new user as “Read Only” access). Account Owners must be updated on the Account itself. For more information, see\n                        \n                         Removing Users from Domo\n                        \n                        .\n                       \n\n                        For more information about the layout of this tab, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n                        Getting this feature\n                       \n\n                        If you are interested in joining the Beta for this feature, please contact your Customer Success Manager (CSM). This beta will be more broadly available in 2022.\n                       \n\n                        Accessing the Accounts tab\n                       \n\n                        You access the\n                        \n                         Accounts\n                        \n                        tab from the Data Center.\n                       \n\n\n                         To access the Accounts tab,\n                        \n\n\n\n                         Click\n                         \n                          Data\n                         \n                         in the toolbar at the top of the screen.\n                         \n\n\n\n\n\n                         Click the\n                         \n                         icon from the left pane of the screen to open the\n                         \n                          Accounts\n                         \n                         tab.\n                         \n                         The accounts visible in the accounts Tab are accounts that you either own, or have been shared with you. There are exceptions to this if you have either the “Manage All Accounts” grant or the “View All Accounts” grant. See\n                         \n                          Grants for Account Management\n                         \n                         below for more information about Account grants.\n                        \n\n\n                        Sharing an account\n                       \n\n                        You can share accounts with others at varying levels of access ranging from owning the account to using the account to create DataSets.\n                       \n\n                        You can see accounts that have been shared with you in the\n                        \n                         Accounts\n                        \n                        tab.\n                       \n\n\n                         To share an account with another user,\n                        \n\n\n\n                         Mouse over the account you want to share.\n                        \n\n                         Click\n                         \n                         and select\n                         \n                          Share account\n                         \n                         .\n                         \n\n\n\n\n\n                         A Manage account access dialog for the selected account appears, listing the users with and without access to this account.\n                        \n\n                         Select the desired access for the user that you want to share the account with.\n                         \n\n\n\n\n\n                         You can share the account with multiple users in the same attempt just by selecting the accesses for the users you want to share the account with.\n                        \n\n                         Click\n                         \n                          Apply\n                         \n                         .\n                        \n\n                         A dialogue will appear with a confirmation for the account change permission. Click\n                         \n                          Apply\n                         \n                         .\n                         \n\n\n\n\n\n                        Group Ownership of Accounts\n                       \n\n                        Group Ownership of Accounts means that individual users and groups can be the owners of an account, and multiple users and groups can also be the owners of accounts at the same time.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           The account credentials are not visible to anyone in Domo, including the owners.\n                          \n\n\n\n\n                        Account Owner Permissions\n                       \n\n                        The account owner can do the following:\n                       \n\n\n                         Share the account with other users with \"Owner\", \"Can Edit\", \"Can Share\", \"Can Read\", or \"No Access\" permissions.\n                        \n\n                         Update the credentials for the account.\n                        \n\n                         Use the account to create a DataSet.\n                        \n\n                         Delete the account.\n                        \n\n\n                        \"Can Edit\" Permission\n                       \n\n                        A user with the Can Edit permission can do the following:\n                       \n\n\n                         Update the credentials for the account.\n                        \n\n                         Add other users to the account with \"Can Edit\", \"Can Share\", or \"Can Read\" permissions.\n                        \n\n                         Use the account to create a DataSet in Domo.\n                        \n\n\n                        \"Can Share\" Permission\n                       \n\n                        A user with the Can Share permission can do the following:\n                       \n\n\n                         Add other users to the account with \"Can Share\" or \"Can Read\" permissions.\n                        \n\n                         Use the account to create a DataSet in Domo.\n                        \n\n\n                        \"Can Read\" Permission\n                       \n\n                        A user with the Can Read permission can do only one thing:\n                       \n\n\n                         Use the account to create a DataSet in Domo.\n                        \n\n\n                        \"No Access\" Permission\n                       \n\n                        A user with the No Access permission cannot see or use the account.\n                       \n\n                        Searching Accounts\n                       \n\n                        You can search any accounts on the accounts page using the Search bar and by adding filters.\n                       \n\n                        Search Accounts using the Search bar\n                       \n\n                        You can search the accounts in Search bar by a number of things as follows:\n                       \n\n\n                         Data provider (i.e. Facebook, Salesforce, etc…)\n                        \n\n                         Account Name\n                        \n\n                         Account Owners\n                        \n\n\n\n\n\n                        Search Accounts using the Account Filters\n                       \n\n                        You can use the Add Filter feature to filter the accounts to a specific subset. Domo provides the following filters:\n                       \n\n\n                         Owned by: Accounts are filtered by the selected owners of the accounts.\n                        \n\n                         Valid: Accounts are filtered based on whether or not the accounts are valid, and can be used to connect to a data provider.\n                        \n\n                         Used: Accounts are filtered based on whether or not the accounts are connected to a data provider.\n                        \n\n                         Data Provider Type: Accounts are filtered by the Data Provider the account is connected to (Salesforce, Facebook, etc…)\n                        \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Account filters are \"and\" filters, so you can use multiple filters at the same time.\n                          \n\n\n\n\n                        Adding an account\n                       \n\n                        You can add an account to Domo by doing either of the following:\n                       \n\n\n                         By adding a DataSet using a Connector to Domo and entering new account information (as opposed to selecting an existing account). An entry for the new account appears automatically in the\n                         \n                          Accounts\n                         \n                         view. This method is discussed in more detail in\n                         \n                          Adding a Dataset Using a Connector\n                         \n                         .\n                        \n\n                         By clicking\n                         \n                          Add New\n                         \n                         in the\n                         \n                          Accounts\n                         \n                         view and following the steps in the wizard.\n                        \n\n\n\n                         To add an account to Domo from the Accounts view,\n                        \n\n\n\n                         In\n                         \n                          Accounts\n                         \n                         , click\n                         \n                          Add New\n                         \n                         .\n                        \n\n                         Select the desired Integration Method (Federated connection, Account, etc…)\n                        \n\n                         For a Connector, search for and select the desired Connector.\n                        \n\n                         Click the\n                         \n                          Connect to\n                         \n                         button.\n                        \n\n                         Enter your connection information.\n                        \n\n                         Click\n                         \n                          Done\n                         \n                         .\n                        \n\n\n                        An entry for the new account appears in the\n                        \n                         Accounts\n                        \n                        view listing.\n                       \n\n                        Deleting an account\n                       \n\n                        You can disconnect (delete) any account listing from the\n                        \n                         Accounts\n                        \n                        view. Any DataSets that use this account are unassociated and stop updating. You must be an owner of an Accounts, or have the Manage All Accounts grant to be able to delete an Account.\n                       \n\n\n                         To delete an account in the Accounts view,\n                        \n\n\n\n                         Mouse over the account you want to delete.\n                        \n\n                         Click\n                         \n                         and select\n                         \n                          Delete Account\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Delete Account\n                         \n                         to confirm.\n                        \n\n\n                        Viewing DataSets associated with accounts\n                       \n\n                        In the\n                        \n                         Accounts\n                        \n                        view, you can see a listing of DataSets associated with each account. You can see any DataSet in more detail by clicking a DataSet's name in the list.\n                       \n\n\n                         To view DataSets associated with an account,\n                        \n\n\n\n                         In\n                         \n                          Accounts\n                         \n                         , on a listed account, mouse over the\n                         \n                          DataSets\n                         \n                         column item.\n                         \n                         A list of the associated DataSets appears.\n                        \n\n                         Click the name of a DataSet to see the Details page for that DataSet.\n                        \n\n\n                        Reconnecting accounts\n                       \n\n                        For connectors that use OAuth to authenticate, you can reconnect, if necessary in the\n                        \n                         Accounts\n                        \n                        tab. If an OAuth token has expired, you may have to re-enter your credentials to reconnect.\n                       \n\n\n                         To reconnect an account,\n                        \n\n\n\n                         Mouse over the account you want to reconnect.\n                        \n\n                         Click\n                         \n                         and select\n                         \n                          Re-connect\n                         \n                         .\n                        \n\n                         (Conditional) Enter your credentials or grant account access to Domo, if you are asked to do so.\n                        \n\n\n                        Renaming accounts\n                       \n\n                        When you create accounts, either by adding them in the\n                        \n                         Accounts\n                        \n                        tab or entering credentials for a new DataSet, those accounts take the name of the connector. For example, if you add an account for Facebook, that account is called \"Facebook Account.\" Subsequently added accounts for the same connector share this name. This can make it confusing to differentiate between accounts for the same connector. You can eliminate this confusion by giving unique names to accounts in the\n                        \n                         Accounts\n                        \n                        tab.\n                       \n\n\n                         To rename accounts in the Accounts tab,\n                        \n\n\n\n                         Click the account name. (You can also select\n                         \n                          Edit account\n                         \n                         in the gear menu.)\n                         \n                         The account name and credentials open for editing.\n                        \n\n                         Enter a new name for the account.\n                        \n\n                         Click\n                         \n                          Save Changes\n                         \n                         .\n                        \n\n\n                        Editing account credentials\n                       \n\n                        For connectors that require you to enter account credentials manually (as opposed to using OAuth), you can edit the credentials as necessary in the\n                        \n                         Accounts\n                        \n                        tab.\n                       \n\n\n                         To edit connector information in the Accounts tab,\n                        \n\n\n\n                         Click the account you want to edit. (You can also select\n                         \n                          Edit account\n                         \n                         in the gear menu.)\n                        \n\n                         Enter the required credentials in the necessary fields.\n                        \n\n                         Click\n                         \n                          Save Changes\n                         \n                         .\n                        \n\n\n                        Removing a user account\n                       \n\n                        You can remove a user from the account that you added earlier. The removed user will no longer have the access to your datasets.\n                       \n\n\n                         To remove a user's account access,\n                        \n\n\n\n                         Mouse over the account you want to remove access from.\n                        \n\n                         Click\n                         \n                         and select\n                         \n                          Share account\n                         \n                         .\n                        \n\n                         A dialog appears listing the users with access to DataSets from this account.\n                        \n\n                         Select\n                         \n                          No Access\n                         \n                         from the dropdown in front of the user name that you want to remove the access for.\n                         \n\n\n\n\n\n                         You can remove the account access with multiple users in the same attempt just by selecting the\n                         \n                          No Access\n                         \n                         from the dropdown in front of the user names that you want to remove the access for.\n                        \n\n                         Click\n                         \n                          Apply\n                         \n                         . A dialog will appear with a confirmation for the account change permission.\n                        \n\n                         Click\n                         \n                          Apply\n                         \n                         .\n                        \n\n\n                        The user(s) no longer have access to the DataSets associated with this account.\n                       \n\n                        Grants for Account Management\n                       \n\n                        You can view account grants in the Roles section of the Admin Center\n                       \n\n\n                         To navigate to the Admin center select\n                         \n                          More  > Admin  > Governance > Roles > Grants\n                         \n                         .\n                         \n\n\n\n\n\n                         A list of the grants appears along with their details such as associated roles, role participation, associated features, and members.\n                        \n\n\n                        Manage All Accounts Grant\n                       \n\n                        When the Manage All Accounts grant is added as part of a custom role, it gives a person the ability grant to see and make themselves owners of all the accounts in that instance.\n                       \n\n\n                         Note:\n                        \n                        The Manage All Accounts Grant is not automatically given to the Domo Admin role.\n                       \n\n\n                         To access the Manage All Accounts grant,\n                        \n\n\n\n                         Start typing the grant name in the Search bar in the right side of the pane.\n                        \n\n                         The Manage All Accounts grant will surface.\n                        \n\n                         Click on the grant entry to view the role details. With the Manage All Accounts grant, you can perform all functions on an account including viewing who has access to the account, sharing with any user at any permission level, editing credentials, and deleting the account.\n                         \n\n\n\n\n\n                        View All Accounts Grant\n                       \n\n                        The View Account Grant allows you to see all the accounts in an instance. However, the accounts still need to be shared with you before you can use them.\n                       \n\n\n                         To access the View All Accounts grant,\n                        \n\n\n\n                         Start typing the grant name in the Search bar in the right side of the pane.\n                        \n\n                         The View All Accounts grant will surface.\n                        \n\n                         Click on the grant entry to view the role details. With the View All Accounts grant, you can view all accounts in that instance.\n                         \n\n\n\n\n\n                        Notifications for Accounts\n                       \n\n                        Owners receive notifications for any changes make to the account, including changes they made to the account. These changes include editing credentials, sharing the account, or deleting the account.\n                       \n\n                        Notifications are also sent to any person whose permissions are updated on an account.\n                       \n\n                        Notifications for accounts can be managed for a person in the notifications section of Domo.\n                       \n\n                        Known issues\n                       \n\n                        If you have the \"Manage all Accounts\" grant and try to edit an OAuth Account, you will not see the fields to edit. In order to see the fields, please add yourself as an owner to the Account.\n                       \n\n                        FAQ's\n                       \n\n                        How do I add a Federated Account?\n                       \n\n                        The\n                        \n                         + Federated\n                        \n                        button in the upper right corner on the\n                        \n                         Account\n                        \n                        page helps you create a Federated Account.\n                       \n\n\n                         Click the\n                         \n                          + Federated\n                         \n                         button.\n                        \n\n\n                          Create Federated Account\n                         \n                         window will appear.\n                         \n\n\n\n\n\n                         Select the desired adapter, and click\n                         \n                          Next\n                         \n                         .\n                        \n\n                         Now, provide the connection details to configure the account.\n                        \n\n                         Click\n                         \n                          Connect\n                         \n                         .\n                        \n\n\n                        If someone has the “Manage All Accounts” grant, will they be able to share an Account I created with other people?\n                       \n\n                        Yes. You will be notified via email about any activity on Accounts you create and are the owner of.\n                       \n\n                        Can I perform actions on multiple Accounts at once?\n                       \n\n                        No, bulk actions on Accounts is not available at this time.\n                       \n\n                        If I delete a user or group that owns an Account, will I be prompted to reassign those Accounts before they are deleted?\n                       \n\n                        Not at this time. However, if Accounts do not have owners, any DataSets associated with that Account will continue to execute successfully for those the Account has been shared with. Any person with the “Manage All Accounts” grant will be able to assign a new owner to the Account.", "Preview Article": "Click here to preview", "URL Name": "4403537355543", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004889", "Archived Date": "", "Language": "English", "Primary Version": "Group Ownership of Accounts (Beta)", "Article Total View Count": "2,660", "": "", "Article Created Date": "10/24/2022, 10:34 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Group Ownership of Accounts (Beta)\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Data Center Overview\n              \n", "url": "/s/topic/0TO5w000000ZanRGAS"}]}