{"file_path": "../../raw_kb_v2\\article\\360042933174\\index.html", "content": {"Title": "Appstore Overview", "Article Body": "Intro\n                       \n\n                        In the Appstore you can view apps; deploy apps to your Domo; and add DataSets by connecting to third-party connectors. For information about the layout of the Appstore, see\n                        \n                         Appstore Layout\n                        \n                        .\n                       \n\n\n\n                          Video - Appstore Overview\n                         \n\n\n\n\n\n\n\n\n\n                        App types\n                       \n\n                        Apps in Domo come in the following types:\n                       \n\n\n\n                          QuickStart apps. These are packs of template KPI cards, each associated with a particular third-party connector, that you can power up with your own data in a matter of minutes. You power up QuickStart apps by connecting to a connector, usually by entering credentials and/or other information. When you install a QuickStart app, a page for the QuickStart app is added to your Domo. This page contains all of the cards associated with this connector, powered by your own live data. For example, if you were to add the LinkedIn QuickStart app to your Domo, a LinkedIn page would appear, with cards for \"Company Followers,\" \"Likes,\" \"Clicks vs. Impressions,\" and so on, all powered up with your own LinkedIn data. For more information about KPI cards, see\n                          \n                           Understanding KPI cards\n                          \n                          .\n                         \n\n\n\n                          Card Builder apps. These are similar to QuickStart apps in that pages of template KPI cards you can power with your own data are produced. The major difference is that you power them not by connecting to a third-party connector but by selecting a DataSet with matching column names.\n                         \n\n\n\n                          Custom apps. These are cards that use multiple charts and images to present data measurements using rich visualizations. You can create Custom apps yourself using app Design Studio (an Adobe Illustrator-based plugin) or app Dev Studio (a tool best suited for developers with web-based experience). For information about creating and publishing Domo apps, see\n                          \n                           https://developers.domo.com\n                          \n                          .\n                         \n\n\n\n                        Connectors in Domo\n                       \n\n                        Connectors are an extremely efficient method for accessing your data. They allow you to use your existing data service to power your apps within Domo. By simply inputting your data provider credentials (where necessary), the connector will map the data from the provider to power your app, and there’s no need to involve any people to get your apps up and running.\n                       \n\n                        Publishers\n                       \n\n                        In an effort to meet the needs of as many different customers as possible, Domo has given the opportunity to third-party developers (called publishers) to create apps and publish them to the Appstore to be installed by anybody. This partnership allows publishers to specialize in the content they produce while simultaneously increasing value in the Appstore experience. All publisher apps are subject to the same approval process and criteria as any Domo-made app, so you can rest assured that all content in the Appstore meets Domo’s standard.\n                       \n\n                        For more information about publishing apps, see\n                        \n                         https://developer.domo.com\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042933174", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004120", "Archived Date": "", "Language": "English", "Primary Version": "Appstore Overview", "Article Total View Count": "7,110", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Appstore Overview\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Explore the Appstore\n              \n", "url": "/s/topic/0TO5w000000ZaoMGAS"}]}