{"file_path": "../../raw_kb_v2\\article\\360043433053\\index.html", "content": {"title": "\n\n\n Xero Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nXero develops cloud-based accounting software for small- and medium-sized businesses. You can use this connector to retrieve data about bank accounts, transactions, expense claims, contacts, and the like. To establish the connection between Domo and Xero, a user must first authenticate to Xero and then grant Domo permission to access his or her data. To learn more about the Xero API, visit their page (\n\nhttp://developer.xero.com/documentat.../api-overview/\n\n).\n\n\n You connect to your Xero account in the Data Center. This topic discusses the fields and menus that are specific to the Xero connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\na DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Xero account and create a DataSet, you must have the email address and password you use to log into your Xero account.\n\n\n Connecting to Your Xero Account\n---------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Xero Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\na DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Xero connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Xero accounts in Domo) to open the Xero OAuth screen where you can enter your Xero credentials. Once you have entered valid Xero credentials, you can use the same account any time you go to create a new Xero DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n**Note:**\n You can only have one Xero account authenticated at a time with a given set of credentials. If you try to use OAuth with Xero anywhere else, it will invalidate your Xero account in Domo.\n\n--\n\n\n**Note:**\n If you are already logged into Xero when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Xero.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Xero report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Accounts\n  |\n Returns account information, including ID, name, description, status, type, etc.\n  |\n|\n Aged Payables by Contact\n  |\n Returns aged payables for a specified contact.\n  |\n|\n Aged Receivables by Contact\n  |\n Returns aged receivables for a specified contact.\n  |\n|\n Balance Sheet\n  |\n Returns balance sheet information for the current month.\n  |\n|\n Bank Statement\n  |\n Returns statement lines for a specified bank account.\n  |\n|\n Bank Summary\n  |\n Returns balances and cash movements for all bank accounts.\n  |\n|\n Bank Transactions\n  |\n Returns all spend and receive money transactions.\n  |\n|\n Bank Transfers\n  |\n Returns information about bank transfers.\n  |\n|\n Branding Themes\n  |\n Returns a list of defined branding themes.\n  |\n|\n Budget Summary\n  |\n Returns a monthly budget summary.\n  |\n|\n Contacts\n  |\n Returns information on your contacts, including ID, first and last name, email address, physical address, etc.\n  |\n|\n Credit Notes\n  |\n Returns information about credit notes, including issue date, type, status, etc.\n  |\n|\n Currencies\n  |\n Returns information about currencies used in your account.\n  |\n|\n Employees\n  |\n Returns information about payroll employees, including first and last name, job title, contact information, salary information, etc.\n  |\n|\n Executive Summary\n  |\n Returns a summary that includes monthly totals and common business ratios.\n  |\n|\n Expense Claims\n  |\n Returns submitted expense claims with their status.\n  |\n|\n Invoices\n  |\n Returns invoices, including contact name and ID, invoice date, status, totals and subtotals, amount paid, etc.\n  |\n|\n Items\n  |\n Returns items, including purchase and sales details.\n  |\n|\n Journals\n  |\n Returns journals, including ID, date, journal number, source type, etc.\n  |\n|\n Manual Journals\n  |\n Returns manual journals, including date, status, URL, etc.\n  |\n|\n Organizations\n  |\n Returns information about organizations, including name, address, business type, tax status, etc.\n  |\n|\n Payments\n  |\n Returns information about payments for invoices and credit notes.\n  |\n|\n Profit and Loss\n  |\n Returns profit and loss information for the current months.\n  |\n|\n Purchase Orders\n  |\n Returns a list of purchase orders.\n  |\n|\n Receipts\n  |\n Returns draft expense claim receipt information, including user, date, totals, tax, etc.\n  |\n|\n Repeating Invoices\n  |\n Returns repeating invoice templates.\n  |\n|\n Tax Rates\n  |\n Returns tax rates, including tax type, status, tax and effective rates, etc.\n  |\n|\n Tracking Categories\n  |\n Returns tracking categories and options.\n  |\n|\n Trial Balance\n  |\n Returns trial balance information, including provider name, report name and date, debit and credit amounts, etc.\n  |\n|\n Users\n  |\n Returns account user information, including ID, first and last name, email address, etc.\n  |\n\n|\n|\n Past Days\n  |\n Enter the number of past days that represents the start date of the report. You can use any of the following formats:\n\nx\n\n,\n\nx day\n\n, or\n\nx days\n\n, where\n\nx\n\nis a number between 1 and 365.\n  |\n|\n Contact\n  |\n Select the contact for which you want to retrieve data.\n  |\n|\n Bank Account\n  |\n Select the bank account for which you want to retrieve data.\n  |\n|\n To Days\n  |\n Enter the number of past days that represents the end date of the report. You can use any of the following formats:\n\nx\n\n,\n\nx day\n\n, or\n\nx days\n\n, where\n\nx\n\nis a number between 1 and 365.\n  |\n|\n Offset\n  |\n Enter a journal number. The report will retrieve only journals with a number higher than this number.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\nTroubleshooting for Consulting/Support\n----------------------------------------\n\n\n###\n Dates in Column Names\n\nSome Xero reports return data in which the run date is used as a column name. For example, if you were to run the \"Profit & Loss\" report on Feburary 17th, 2017, an amount column called \"Row\\_\\_17\\_Feb\\_17\" would appear. This prevents these columns from being used in a DataFlow or card, as the name of the column changes with each scheduled DataSet update.\n\n\n To resolve this issue, we recommend replacing dates in column names with generic column names. You can use a Domo SQL query to replace the faulty column with a generically named column, which can then be referred to in a Magic DataFlow.\n\n\n In the following example, we replace the column name \"Row\\_\\_16\\_Feb\\_17\" with the name \"ProfitLossAmount.\"\n\nselect NULL AS Row_Id, NULL AS Row_ProviderName, NULL AS Row_DateTimeUTC, NULL AS Row_ReportName, NULL AS Row_ReportDate, NULL ​AS Row_UpdatedDateUTC, NULL AS Row_ReportTitle, NULL AS Row_column_0, NULL AS ProfitLossAmount, NULL AS _BATCH_ID_, NULL AS _BATCH_LAST_RUN_ from xero_profit_and_loss_report\n\n\n where 1 = 0 --this row returns nothing but allows setting the column names for the query`\n\n\n`union all`\n\n\n`select * from xero_profit_and_loss_report`\n\n##\n Unwanted Pivot Tables\n\nOften, data with the column naming issue described above is represented as a pivot table. You cannot use the Collapse Columns action IN ETL to unpivot this data because the column names change for each scheduled run. An example of this is the \"Budget\" report.\n\n\n To resolve this issue, unpivot columns that have been named with dates, but retain date values as rows so the output DataSet has one date row per column.\n\n\n In the following example, we first use a Domo SQL query to rename the columns to generic names. Then we use a Magic ETL DataFlow to perform a\n **Collapse Columns**\n action and then convert the generic column name (which is now row data) back into a date.\n\n. Create a Domo SQL query as follows:\n\n\n Input: Xero DataSet created using the report \"Budget\"\n\nTransform: Replace the column names \"Row\\_\\_Feb-17,\" \"Row\\_\\_Mar-17,\" etc. with \"Month1,\" \"Month2,\" etc. using the method described above.\n\n\n Output Format: Renamed columns\n2. In a Domo Magic DataFlow, unpivot the output data defined above and replace the Month1, Month2 etc. values with dates based on the\n\n\\_BATCH\\_LAST\\_RUN\n\ndate.\n\n1. Perform a\n\t **Collapse Columns**\n\t action in which you unpivot the 12 date columns.\n\t2. Perform a\n\t **Value Mapper**\n\t action in which you create a new field that contains the number of months to add to the\n\n BATCH\\_LAST\\_RUN\\_\n\n date to get the correct date field for the row.\n\t3. Perform a\n\t **Set Column Type**\n\t action in which you change the data type of the number of months column to a numeric type.\n\t4. Perform a\n\t **Date Operations**\n\t action in which you use the\n\t **Add Months to Date**\n\t operation to add the number of months to the\n\n \\_BATCH\\_LAST\\_RUN\\_\n\n date to determine the date for the row.\n\nYour output format should be as follows: one row per month instead of one column per month\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433053\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003607\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nXero Connector\n\n", "article_total_view_count": "\n\n\n 2,467\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "xero_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}