{"file_path": "../../raw_kb_v2\\article\\360042924834\\index.html", "content": {"Title": "Period-over-Period Charts", "Article Body": "Intro\n                       \n\n\n                         P\n                        \n\n                         eriod-over-period\n                        \n                        charts allow you to see data for a specified date range compared with data for the same range for another period. For example, you might have a period-over-period chart showing your earnings for the previous year side-by-side with the same measurements for earlier years. The following screenshot shows you how this might appear:\n                        \n\n\n\n\n                        In this example, earnings for the previous year are represented by a dark blue bar. Earnings for the three years before that are also represented as bars. All years are included in the legend so you can tell which is which.\n                       \n\n                        You can also include variance amounts in period-over-period charts. The following screenshot shows a similar chart as the one above, with a line for variance values:\n                       \n\n\n\n\n                        You build period-over-period charts in the Analyzer in Domo by selecting one of several special period-over-period chart types, applying columns for the x- and y-axes, then setting up your comparison in the date filter menu.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Drilling on period-over-period charts is not currently supported and because charts within a drill path are set to \"All Time\" by default, period-over-period charts cannot be selected within a drill path. In addition, at this time, period-over-period charts are unable to be exported.\n                           \n\n\n\n\n\n\n\n                          Video - Creating Period-Over-Period Cards\n                         \n\n\n\n\n\n\n\n\n\n                        Period-over-period chart types\n                       \n\n                        There are currently seven period-over-period chart types, all of which have a corresponding standard chart type. All period-over-period charts include only two fields, one for an x-axis column (which will always include time period data) and one for a y-axis column (which will always include value data). For information about applying columns to a chart, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n\n\n\n\n                            Period-over-Period Chart Type\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Screenshot\n                           \n\n\n\n\n\n\n\n                            Bar Line\n                           \n\n\n\n                            Period being compared is shown as bars; all other periods are shown as lines.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Variance Bar Line\n                           \n\n\n\n                            Periods are shown as bars and variance values are shown as lines.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Line Bar\n                           \n\n\n\n                            Period being compared is shown as a line; all other periods are shown as bars.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Variance Line Bar\n                           \n\n\n\n                            Periods are shown as lines and variance values are shown as bars.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Trendline\n                           \n\n\n\n                            All periods are shown as lines.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Variance Trendline\n                           \n\n\n\n                            All periods and variance values are shown as lines.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Grouped Bar\n                           \n\n\n\n                            All periods are shown as bars.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Running Total Line\n                           \n\n\n\n                            All periods are split into\n                            \n                             running total lines\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Multi-Value Gauge\n                           \n\n\n\n                            Shows the value for the selected date range, with the percent change from the selected comparison timeframe (e.g. the quarter-to-date value with the percent change from one quarter ago for comparison). For more information about these gauges, see\n                            \n                             Multi-Value Gauge\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Shape Gauge\n                           \n\n\n\n                            Shows a different shape depending on your chart properties and the percent of change from the selected comparison timeframe compared to the selected date range. For more information about these gauges, see\n                            \n                             Shape Gauge\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Flex Table\n                           \n\n\n\n                            All periods are shown as individual rows within the table, with their own spark line or spark bar chart, percent of change, etc. For more information about these tables, see\n                            \n                             Flex Table\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Filled Gauge\n                           \n\n\n\n                            Gauge shows the value for the selected date range, while labels indicate this value along with the value for the selected comparison timeframe. For more information about these gauges, see\n                            \n                             Filled Gauge\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Progress Bar\n                           \n\n\n\n                            Gauge shows the percent change for the selected comparison timeframe. For more information about these gauges, see\n                            \n                             Progress Bar Gauge\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                        For information about Chart Properties for these charts, see\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n                        Understanding comparison options\n                       \n\n                        After selecting a period-over-period chart type in Analyzer and applying the desired columns to the x- and y-axes, you must specify 1) the time period you want to compare, and 2) the periods the selected time period is being compared to. You do this in the date filter menu, which is located above the chart preview near the chart name and description fields.\n                       \n\n\n\n\n                        To enable period-over-period functionality in a chart, you must set options in three of the sub-menus in the date filter menu—\n                        \n                         Card date range\n                        \n                        ,\n                        \n                         Compare to\n                        \n                        , and\n                        \n                         chart by\n                        \n                        .\n                       \n\n                        Card date range\n                       \n\n                        In the\n                        \n                         Card date range\n                        \n                        menu, you select the primary time period you want to compare. For period-over-period to work, you should select a period from either the\n                        \n                         Current\n                        \n                        ,\n                        \n                         Previous\n                        \n                        , or\n                        \n                         Next\n                        \n                        sections of the menu. If you select\n                        \n                         All Time\n                        \n                        or\n                        \n                         Between\n                        \n                        , the\n                        \n                         Compare to\n                        \n                        menu is grayed out and unavailable.\n                       \n\n                        Compare to\n                       \n\n                        In the\n                        \n                         Compare to\n                        \n                        menu, you specify the time period(s) the period you selected in\n                        \n                         Card date range\n                        \n                        is being compared to. For this menu to be available, all of the following criteria must apply:\n                       \n\n\n\n                          A period-over-period chart type must be selected in the Chart Picker.\n                         \n\n\n\n                          A date/time column must be applied to your chart's x-axis.\n                         \n\n\n\n                          A\n                          \n                           Current, Previous\n                          \n                          or\n                          \n                           Next\n                          \n                          value must be selected in the\n                          \n                           Card date range\n                          \n                          menu.\n                         \n\n\n\n                          The\n                          \n                           chart by\n                          \n                          menu must not be set to\n                          \n                           None\n                          \n                          .\n                         \n\n\n\n                        Options may or may not be available in the\n                        \n                         Compare to\n                        \n                        menu, depending on the time period selected in\n                        \n                         Card date range\n                        \n                        and the date-time data available in your chart.\n                       \n\n                        For any selectable period under\n                        \n                         Compare to\n                        \n                        , you can select any of the four most recent instances of that period. For example, if you selected\n                        \n                         This Month\n                        \n                        under\n                        \n                         Card date range\n                        \n                        and the current month was November 2016, and you then checked\n                        \n                         Month\n                        \n                        under\n                        \n                         Compare to\n                        \n                        , you would then be able to select any of the four months prior to November (July, August, September, or October) for comparison.\n                       \n\n                        You can check\n                        \n                         Align\n                        \n\n                         By Day of Week\n                        \n                        options (if available) to show data for 4, 12, or 52 weeks previous to the period selected in\n                        \n                         Card date range\n                        \n                        .\n                       \n\n                        Graph by\n                       \n\n                        In the\n                        \n                         Graph\n                        \n\n                         by\n                        \n                        menu, you select how the chart data is to be broken down, timewise. For example, if you select\n                        \n                         Week\n                        \n                        , data points are shown for each week. This is sometimes called \"date grain\" and is discussed in more detail in\n                        \n                         Adding Filters to Your Chart\n                        \n                        .\n                       \n\n                        You\n                        \n                         must\n                        \n                        select an option in\n                        \n                         Graph by\n                        \n                        for your period-over-period chart to work (otherwise,\n                        \n                         Compare to\n                        \n                        will not be available).\n                       \n\n                        Changing the chart type in the Details view\n                       \n\n                        You can change your period-over-period chart type in the Details view using the Chart Type Picker. When you open the Chart Type Picker for a period-over-period chart, you can see thumbnails for the chart as it would appear for each period-over-period chart type, with your data already applied. Click a thumbnail for a chart type to switch your chart over to that chart type.\n                       \n\n                        In the following example, the user opens the Details view for a Variance Bar Line chart. When he opens the Chart Type Picker, thumbnails display for the chart as it would appear with each chart type applied.\n                       \n\n\n\n\n                        For more information about the Chart Type Picker, see\n                        \n                         Using Card Interaction Tools in a Card Details View\n                        \n                        .\n                       \n\n                        Use cases\n                       \n\n                        This section discusses how to use period-over-period chart types to accomplish a variety of commonly needed use cases.\n                       \n\n                        Use case #1: Year-over-year\n                       \n\n\n                         To create a year-over-year chart,\n                        \n\n\n\n\n                          Open the Analyzer, either for an existing Card or in the workflow for building a new Card.\n                          \n                          The Card\n                          \n                           must\n                          \n                          be powered by a DataSet that has at least one date-time column.\n                         \n\n\n\n                          In the Chart Picker, click the icon for period-over-period charts.\n                          \n\n\n\n\n\n\n                          Select the desired period-over-period chart type from the Chart Picker.\n                         \n\n\n\n                          Drag a date column into the\n                          \n                           X Axis\n                          \n                          field.\n                         \n\n\n\n                          Drag a value column into the\n                          \n                           Y Axis\n                          \n                          field.\n                         \n\n\n\n                          Open the date range picker and select\n                          \n                           Year to Date\n                          \n                          in the\n                          \n                           Card date range\n                          \n                          menu.\n                          \n\n\n\n\n\n\n                          In the\n                          \n                           Compare to\n                          \n                          menu, expand the\n                          \n                           Previous\n                          \n                          section then check the box for\n                          \n                           Year over Year\n                          \n                          .\n                          \n\n\n\n\n\n\n                          (Optional) If you want your chart to show data for additional past years, you can select them by clicking\n                          \n                           1 year ago\n                          \n                          ,\n                          \n                           2 years ago\n                          \n                          , etc.\n                          \n                          You can select as many of the available years as you wish.\n                         \n\n\n\n                          Under\n                          \n                           Graph By\n                          \n                          , select the desired date grain for the chart.\n                         \n\n\n\n\n\n\n                           Your period-over-period chart is now complete. This chart will roll, so when data becomes available for another day it will be captured in that month and the previous year.\n                          \n\n\n\n\n                        Use case #2: Year-over-year and month-over-month combined\n                       \n\n\n                         To create a chart with both year-over-year and month-over-month,\n                        \n\n\n\n\n                          Open the Analyzer, either for an existing Card or in the workflow for building a new Card.\n                          \n                          The Card\n                          \n                           must\n                          \n                          be powered by a DataSet that has at least one date-time column.\n                         \n\n\n\n                          In the Chart Picker, click the icon for period-over-period charts.\n                          \n\n\n\n\n\n\n                          Select the desired period-over-period chart type from the Chart Picker.\n                         \n\n\n\n                          Drag a date column into the\n                          \n                           X Axis\n                          \n                          field.\n                         \n\n\n\n                          Drag a value column into the\n                          \n                           Y Axis\n                          \n                          field.\n                         \n\n\n\n                          Open the date range picker and select\n                          \n                           This Month\n                          \n                          in the\n                          \n                           Card date range\n                          \n                          menu.\n                          \n\n\n\n\n\n\n                          In the\n                          \n                           Compare to\n                          \n                          menu, expand the\n                          \n                           Previous\n                          \n                          section then check the boxes for\n                          \n                           Month over Month\n                          \n                          and\n                          \n                           Year over Year\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Under\n                          \n                           Graph By\n                          \n                          , select\n                          \n                           Week\n                          \n                          or\n                          \n                           Day\n                          \n                          as the date grain.\n                         \n\n\n\n\n                         Your period-over-period chart is now complete. This chart will roll, so when data becomes available for another day it will be captured in that month and the previous year.\n                        \n\n\n\n                         Use case #3: This month vs. 1 week ago, 4 weeks ago, and 52 weeks ago\n                        \n\n\n\n\n                          To create a POP chart for Last 12 Weeks vs. Previous Weeks,\n                         \n\n\n\n\n\n                          Open the Analyzer, either for an existing Card or in the workflow for building a new Card.\n                         \n\n                         The Card\n                         \n                          must\n                         \n                         be powered by a DataSet that has at least one date-time column.\n                        \n\n\n                          In the Chart Picker, click the icon for period-over-period charts.\n                          \n\n\n\n\n\n\n                          Select the desired period-over-period chart type from the Chart Picker.\n                         \n\n\n\n                          Drag a date column into the\n                          \n                           X Axis\n                          \n                          field.\n                         \n\n\n\n                          Drag a value column into the\n                          \n                           Y Axis\n                          \n                          field.\n                         \n\n\n\n                          Open the date range picker.\n                         \n\n\n\n                          In the\n                          \n                           Card date range\n                          \n                          menu, expand the\n                          \n                           Current\n                          \n                          section then select\n                          \n                           This Month\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Compare to\n                          \n                          dropdown, expand\n                          \n                           Previous\n                          \n                          if necessary, then check the box for\n                          \n                           Week over Week\n                          \n                          .\n                         \n\n\n\n                          Under the\n                          \n                           Week over Week\n                          \n                          option, select\n                          \n                           1 week ago\n                          \n                          and\n                          \n                           4 weeks ago\n                          \n                          .\n                         \n\n\n\n                          Under \"Align by Day of the Week,\" select\n                          \n                           52 weeks ago\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Under\n                          \n                           Graph by\n                          \n                          , select\n                          \n                           Week\n                          \n                          or\n                          \n                           Day\n                          \n                          .\n                         \n\n\n\n\n                         Your period-over-period chart is now complete. This chart will roll, so when data becomes available for another day it will be captured in that month and the previous year.\n                        \n\n\n\n                         Use Case #4: Marketing Event Compare To\n                        \n\n\n\n\n                          To create a Marketing Event Compare To chart,\n                         \n\n\n\n\n\n                          Open the Analyzer, either for an existing Card or in the workflow for building a new Card.\n                         \n\n                         The Card\n                         \n                          must\n                         \n                         be powered by a DataSet that has at least one date-time column.\n                        \n\n\n                          In the Chart Picker, click the new icon for POP charts.\n                          \n\n\n\n\n\n\n                          Select the desired period-over-period chart type from the Chart Picker.\n                         \n\n\n\n                          Drag a date column into the\n                          \n                           X Axis\n                          \n                          field.\n                         \n\n\n\n                          Drag a value column into the\n                          \n                           Y Axis\n                          \n                          field.\n                         \n\n\n\n                          Open the date range picker.\n                         \n\n\n\n                          In the\n                          \n                           Card date range\n                          \n                          menu, select\n                          \n                           Between\n                          \n                          .\n                         \n\n\n\n                          Choose the beginning and ending date for your chart.\n                         \n\n\n\n                          Under\n                          \n                           Compare to\n                          \n                          , enter the beginning and ending dates for comparison.\n                          \n\n\n\n\n\n\n                          Under\n                          \n                           Graph\n                          \n\n                           by\n                          \n                          , select\n                          \n                           Day\n                          \n                          .\n                         \n\n\n\n\n                         Your Marketing Event Compare To chart is now complete. This chart is fixed, so the dates do not change unless you modify them.\n                        \n\n\n                        Use Case #5: \"Last\" time period\n                       \n\n                        You can use the\n                        \n                         Last\n                        \n                        option to select any last time period. For example, you could have a chart showing the last 2 weeks, charted by day, with a comparison showing the last 7 days. This use case shows you how to do this to an already-created Period-over-Period chart in the Details view for the chart.\n                       \n\n\n                         To include a \"Last\" time period in a period-over-period chart,\n                        \n\n\n\n\n                          Open the Details view for your period-over-period chart.\n                         \n\n\n\n                          Click the date range dropdown next to the chart name.\n                         \n\n\n\n                          Under\n                          \n                           Date Range\n                          \n                          , select\n                          \n                           Last\n                          \n                          in the first dropdown menu, enter a value for the number of time periods in the field, then select the desired time period in the last dropdown.\n                         \n\n\n\n                          Select the desired date grain under\n                          \n                           Graph by.\n                          \n\n\n\n\n                          Under\n                          \n                           Compare To\n                          \n                          , enter the number of time periods to show as a comparison. (The time period used here will always be the same as the one you select under\n                          \n                           chart by\n                          \n                          .)\n                         \n\n\n\n\n\n\n                        Multiple series in period-over-period charts\n                       \n\n                        The Analyzer currently includes options only for a single series when building period-over-period charts. However, many options are available for doing this using DataFlows and Beast Mode calculations. Here is one method for doing so using a DataFlow:\n                       \n\n\n\n                          Identify the year of the date field, such as\n                          \n                           year(`DATE FIELD`)\n                          \n                          .\n                         \n\n\n\n                          Identify the year of the current date, such as\n                          \n                           year(curdate)\n                          \n                          .\n                         \n\n\n\n                          Use the formula\n                          \n                           year(`DATE FIELD`) - year(curdate)\n                          \n                          to create an offset between the current date and the date field.\n                          \n                          So if\n                          \n                           year(curdate)) = 2017\n                          \n                          and\n                          \n                           year(`DATE FIELD`)\n                          \n                          = 2016, the year offset would be -1.\n                         \n\n\n\n                          Create the following Beast Mode calculations:\n                         \n\n\n\n                            Current Year:\n                            \n                             Case when `Year Offset` = 0 then `Amount` end\n                            \n\n\n\n\n                            Prior Year:\n                            \n                             Case when `Year Offset` = -1 then `Amount` end\n                            \n\n\n\n\n\n\n                        For more information about DataFlows, see\n                        \n                         Data Transformation\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042924834", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004684", "Archived Date": "", "Language": "English", "Primary Version": "Period-over-Period Charts", "Article Total View Count": "7,392", "": "", "Article Created Date": "10/24/2022, 10:22 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Period-over-Period Charts\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}