{"file_path": "../../raw_kb_v2\\article\\4662511363351\\index.html", "content": {"Title": "Troubleshooting Scripting Tiles Memory Errors", "Article Body": "Intro\n                       \n\n                        You can use Scripting tiles to automate data processing and data science workflows. For an overview, see\n                        \n                         Magic ETL Tiles: Scripting\n                        \n                        .\n                       \n\n                        In this article, we’ll provide an overview of troubleshooting tips for optimizing memory use in your container. In some cases, you may still need to upgrade your container. For guidance on requesting a container upgrade, see\n                        \n                         Requesting Memory Upgrades\n                        \n                        .\n                       \n\n                        Troubleshooting tips\n                       \n\n                        Tip 1\n                       \n\n                        You can use Magic ETL tiles to reduce the memory footprint in your script. Magic ETL tiles have been optimized for memory-intensive operations. We recommend excluding intensive operations in your script that can be handled through Magic ETL tiles instead.\n                       \n\n                        Examples\n                       \n\n                        You can use the Performance tiles in Magic ETL to exclude columns in your DataSet that are not needed in your script. For information on using Performance tiles, see\n                        \n                         Magic ETL Tiles: Performance\n                        \n                        . This will reduce the DataSet that will be processed in your script.\n                       \n\n                        You can also use the Filter Rows tile and the Remove Duplicates tile to exclude rows that are not needed for the DataSet used in your script. For information on using the Filter tile, see\n                        \n                         Magic ETL Tiles: Filter\n                        \n                        .\n                       \n\n                        Tip 2\n                       \n\n                        Verify that you are using the latest versions of the packages needed in your script. Newer versions of the package are often optimized for performance and memory. If you need to request a package upgrade, see\n                        \n                         Requesting Custom Environments\n                        \n                        for details.\n                       \n\n                        Tip 3\n                       \n\n                        Breaking up an operation into segments can help reduce memory footprint, especially for intensive operations like looping. You could also consider breaking up the DataFlow into separate DataFlows.\n                       \n\n                        Tip 4\n                       \n\n                        Test memory for data size only. You can set up a DataFlow that simply writes the input (no operations in the script.) If the DataFlow, errors out then you need to reduce the DataSet size (\n                        \n                         Tip 1\n                        \n                        ) or evaluate a memory upgrade.\n                       \n\n                        Requesting Memory Upgrades\n                       \n\n                        While the tips above may help lower your memory footprint, in some cases your workflow will simply require more memory. To request this upgrade, see\n                        \n                         Requesting Memory Upgrades\n                        \n                        for a walkthrough.", "Preview Article": "Click here to preview", "URL Name": "4662511363351", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004587", "Archived Date": "", "Language": "English", "Primary Version": "Troubleshooting Scripting Tiles Memory Errors", "Article Total View Count": "4,747", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Troubleshooting Scripting Tiles Memory Errors\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}