{"file_path": "../../raw_kb_v2\\article\\360042934794\\index.html", "content": {"Title": "May 2016 Release Notes", "Article Body": "Note:\n                           \n                           Depending on the product version you are using, the documentation may include information about features that may not be available or may have changed.\n                          \n\n\n\n\n                        New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Week Display control\n                       \n\n                        In charts in which a weekly date grain has been set, the default week display format now includes a date instead of a week number. For example, the tenth week of 2012 would now display as \"03-04-2012\" instead of \"Week 10.\" Domo administrators who want to revert back to the old format can do so\n                        \n                         Admin Settings > Company Settings.\n                        \n                        This is a global setting that affects all charts in a Domo instance; it cannot be turned on for individual users.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Changing the Date Format in Your Chart\n                        \n                        .\n                       \n\n                        Mobile updates\n                       \n\n                        Several cool new enhancements have just been released for our mobile product:\n                       \n\n                        Landscape Mode\n                       \n\n                        Domo landscape mode\n                        \n\n                        is now available for iPhone and iPad. For iPhone, this is only available in Interactive mode. For iPad, you can switch to Landscape Mode at any time.\n                        \n\n\n\n                          Landscape Mode for iPhone\n                          \n\n\n\n\n\n\n\n\n                          Landscape Mode for iPad\n                          \n\n\n\n\n                          Landscape Mode for iPad Pro\n                          \n\n\n\n\n\n\n                        Mobile Web Home\n                       \n\n                        The \"Home\" page is now available in Mobile Web. This page includes trending cards, recently shared cards, new people, favorited cards, and more. The Home page experience is consistent across all platforms.\n                        \n\n\n\n\n                          Design Studio updates\n                         \n\n\n\n\n\n                          The following enhancements have been made to the Design Studio:\n                         \n\n\n\n\n\n                          Notifications for users with older versions. Creative Cloud syncs version updates to users, so if users have turned off the Creative Cloud desktop sync application or if they need IT permission to upgrade, their version of Design Studio may be out of date. To accommodate this problem, a notification system has been built to identify users with older versions and instruct them on how to upgrade.\n                         \n\n\n\n\n\n                          New font selection interface. The former interface required users to type the font name into a text field. This has now been changed to a drop-down menu that populates with supported web fonts.\n                          \n\n\n\n\n\n\n\n\n                          Cool new widgets, including...\n                         \n\n\n\n\n\n                          A Canadian FSA Map widget that shows data by province and FSA areas.\n                          \n\n\n\n\n\n\n\n\n                          Image and text link widgets that allow you to link to URLs on Domo's whitelist.\n                          \n\n\n\n\n\n\n\n\n                          Table Widget V2. The new table widget allows you to add sorts; define width by pixels or points; have alternating row colors; and set background transparency, cell borders, and border size.\n                          \n\n\n\n\n\n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042934794", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004453", "Archived Date": "", "Language": "English", "Primary Version": "May 2016 Release Notes", "Article Total View Count": "2,414", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              May 2016 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}