{"file_path": "../../raw_kb_v2\\article\\360043434673\\index.html", "content": {"Title": "Twitter Counter Connector", "Article Body": "Important:\n                           \n                           Twitter Counter announced it is ceasing operations on November 5, 2018.\n                          \n\n\n\n\n                        Intro\n                       \n\n                        Twitter Counter is an analytics service for Twitter. It provides statistics of Twitter usage and also offers a variety of widgets and buttons that people can use to show recent Twitter visitors and number of followers. To learn more about the Twitter Counter API, visit their page (\n                        \n                         https://twittercounter.com/pages/api\n                        \n                        ).\n                       \n\n                        You connect to your Twitter Counter account in the Data Center. This topic discusses the fields and menus that are specific to the Twitter Counter connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Twitter Counter account and create a DataSet, you must have a Twitter Counter API key. To obtain an API key, visit the following webpage and follow the instructions:\n                        \n                         https://twittercounter.com/pages/api-signup/\n                        \n\n\n                        Connecting to Your Twitter Counter Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Twitter Counter Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Twitter Counter account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Twitter Counter API key. To obtain an API key, visit the following webpage and follow the instructions:\n                           \n                            https://twittercounter.com/pages/api-signup/\n                           \n\n\n\n\n\n\n                         Once you have entered valid Twitter Counter credentials, you can use the same account any time you go to create a new Twitter Counter DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with a field for entering the username you want to retrieve data for.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Twitter Counter report you want to run. Currently only a single report is available.\n                           \n\n\n\n\n                               Followers per Date\n                              \n\n                               Returns a list of dates and the number of followers on that date.\n                              \n\n\n\n\n\n\n\n                           Username\n                          \n\n                           Enter the Twitter username you want to retrieve data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043434673", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003449", "Archived Date": "", "Language": "English", "Primary Version": "Twitter Counter Connector", "Article Total View Count": "4,836", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Twitter Counter Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}