{"file_path": "../../raw_kb_v2\\article\\000005114\\index.html", "content": {"title": "\n\n\n Spotify Third Party Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Spotify is a digital music distribution service that offers tens of millions of songs.\n\n\n Domo's Spotify connector allows you to use Spotify's Bulk API to import performance data provided by Spotify For Artists into your Domo instance. This performance data includes users, tracks, and streams tied to licensors.\n\nYou connect to your Spotify account in the Data Center. This topic discusses the fields and menus that are specific to the Spotify Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Spotify account and create a DataSet, you must have the following:\n\n Client ID\n* Client Secret\n\nThe Spotify Connector uses Spotify’s Bulk API. To use the API, you must have a direct distribution relationship with Spotify. Also, you need to request to use the API to Spotify.\n\n\n For details, see\n\nHelp - Getting access to Spotify's Bulk API – Spotify for Artists\n\n. After your request is approved, you can get the Client ID and the Client Secret.\n\n\n Connecting to your Spotify Account\n------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Spotify Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Spotify account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Client ID\n  |\n Enter your Client ID published by Spotify.\n  |\n|\n Client Secret\n  |\n Enter your Client Secret published by Spotify\n  |\n\n\n For information about obtaining these credentials, see\n **Prerequisites**\n above.\n\n\n After you have entered valid Spotify credentials, you can use the same account any time you go to create a new Spotify DataSet. You can manage connector accounts in the Accounts tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the reports you want to run. The following reports are available:\n\n\n|\n Streams\n  |\n This report contains individual stream objects with track and user information for a given licensor, date, and country. Only actual streams are included; plays from local tracks (stored on the user's computer) are not counted.\n  |\n|\n Users\n  |\n This report contains individual users objects with personal and device-related information for a given licensor and date.\n  |\n|\n Track\n  |\n This report contains individual track objects with more detailed track-level information for a given licensor and date.\n  |\n|\n Sub30SecStreams\n  |\n This report contains individual stream objects (only including streams lasting less than 30s) for a given licensor, date and country. Only actual streams are included; plays from local tracks (stored on the user's computer) are not counted.\n  |\n|\n Aggregated Stream – Summary\n  |\n This report contains individual track-based aggregated stream objects with metadata and demographic data for a given licensor and date. Only actual streams are included; plays from local tracks (stored on the user's computer) are not counted.\n  |\n|\n Aggregated Stream – Count\n  |\n This report contains individual track-based aggregated stream objects with play count for each country, gender and age for a given licensor and date. Only actual streams are included; plays from local tracks (stored on the user's computer) are not counted.\n  |\n|\n Aggregated Stream – Skips\n  |\n This report contains individual track-based aggregated stream objects with skip count for each country for a given licensor and date. Only actual streams are included; plays from local tracks (stored on the user's computer) are not counted.\n  |\n|\n Aggregated Stream – Saves\n  |\n This report contains individual track-based aggregated stream objects with save count for each country and user’s plan for a given licensor and date. Only actual streams are included; plays from local tracks (stored on the user's computer) are not counted.\n  |\n\n|\n|\n Licensore\n  |\n Enter the Licensor name.\n\nCheck your welcome email to locate the licensor name that Spotify has on file.\n  |\n|\n Date\n  |\n In the\n **Date**\n selection, select whether to use a single day or a date range when filtering the results by item update date.\n\n\n|\n Single date\n  |\n Select the specific or relative single date.\n  |\n|\n Date range\n  |\n Select the specific or relative date range.\n  |\n|\n Time period\n  |\n Select the time period from Time period dropdown for your report.\n  |\n\n|\n|\n|\n Date – Date\n  |\n Select in\n **Date Type**\n from the followings whether the report data is for a specific date or for a relative number of days back from today:\n\n\n|  |  |\n| --- | --- |\n|\n Relative\n  |\n Enter the number of days back that you would like to get data for in the\n **Days Back**\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Specific\n  |\n Select the specific date using the date selector in the\n **Date**\n field.\n  |\n\n|\n|\n Date – Start Date\n  |\n Select in\n **Date Type**\n from the followings:\n\n\n|  |  |\n| --- | --- |\n|\n Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with End Date to create a range of represented days.\n\nFor example, if you entered 10 for\n **Start Date**\n and 5 for\n **End Date**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n\n|\n|\n Date – End Date\n  |\n Select in\n **Date Type**\n from the followings:\n\n\n|  |  |\n| --- | --- |\n|\n Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with Start Date to create a range of represented days.\n\nFor example, if you entered 10 for\n **Start Date**\n and 5 for\n **End Date**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n\n|\n|\n Date – Time period\n  |\n Choose the time period for which you would like to receive data.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n FAQs\n\n\n####\n What is needed to use the connector?\n\nThe Spotify Connector uses Spotify’s Bulk API. To use the API, you must have a direct distribution relationship with Spotify. Also, you need to request to use the API to Spotify. For details, see\n\nHelp - Getting access to Spotify's Bulk API – Spotify for Artists\n\n.\n\n###\n Are there any API limits that I need to be aware of?\n\nCurrently there are no limits.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 000005114\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005114\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSpotify Third Party Connector\n\n", "article_total_view_count": "\n\n\n 3,198\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 2/3/2023, 6:16 AM\n\n\n", "first_published_date": "\n\n\n 2/3/2023, 6:17 AM\n\n\n"}, "title": "spotify_third_party_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}