{"file_path": "../../raw_kb_v2\\article\\360042932994\\index.html", "content": {"title": "\n\n\n Sharing and Removing Access to Cards and Dashboards\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can share access rights for cards and dashboards with groups and users. In the\n **Share**\n dialog, you can share and remove access for any resource to which you have access. This dialog is available for all cards and dashboards.  If you have an Admin default security role or a custom role with Manage All Cards and Pages enabled, you can share any card or dashboard. For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n\n\n When you share cards and dashboards, Domo sends an email to those with whom you shared the cards and dashboards. You can enter a message to be added to the email.\n\nYou can choose whether to send notifications when you share content with others. You do this by toggling the\n **Send email notifications**\n option in the\n **Share**\n dialog.\n\n\n You can also choose to receive notifications when content is shared with you. You do this in the Manage Notifications & Alerts screen. For more information about this screen, see\n\nManaging Your Alerts\n\n.\n\n\n When you share a card with a user or group, access to the DataSet(s) powering the card is granted to that user or group.\n\n\n For administrative information about granting and restricting access to content to users and groups, see\n\nControlling Access to Cards and Pages\n\n.\n\n\n For information about specifying group content in the Overview Page for group members, see\n\nSpecifying Default Overview Content for Users\n\n.\n\n\n For information about sharing Pages and Subpages, see\n\nManaging Pages\n\n.\n\n*Notes:**\n\n\n* If you share a card with someone, that person will be able to view the card AND the DataSet it is powered from.\n* If you share a card powered by a DataFlow-generated DataSet...\n\n+ If the user already has access to cards that grant them access to all of the input DataSets in the DataFlow, they can view the DataFlow.\n\t+ If the user does not have access to Cards that grant them access to all of the input DataSets in the DataFlow, they cannot see the DataFlow.\n\nFor more information about DataFlows, see\n\nCreating a Magic ETL DataFlow\n\n.\n\n--\n\n*Note:**\n As a best practice, consider working with your Domo Admin or MajorDomo to make sure you have the correct level of access in your instance.\n\n*Video - Sharing a Card**\n\n\n**Video - Sharing a Page**\n\n*Video - Sharing a Filtered Card**\n\nSharing access to resources\n-----------------------------\n\nWhen you share access to a card\n\nwith a user, a copy of that card is sent to the user's\n **Shared**\n page; when you share access with a group, a copy of the card is sent to the\n **Shared**\n page of every member of the group. When you share access to a\n\ndashboard with a user, the dashboard is added to the user's\n **Dashboards**\n pane, displayed on the left side of the screen; when you share access with a group, the dashboard is added to the\n **Dashboards**\n pane for every member of the group.\n\n\n If you share a PDP-affected KPI or Sumo Card with a user who does not have access to the PDP policy applied to the DataSet, the user sees the following message on the card:\n\nThe user must be added as a member of the policy before he or she can view the card content. The user can click\n **Request Access**\n to send a Buzz message to the DataSet owner asking for access.\n\n\n**To share access rights for a resource,**\n\n. Do one of the following:\n\n* To share access rights for a Page, click the\n\n icon in the upper right portion of the Page.\n\t* To share access rights for a card, hover over the card, select\n\n**Card options**\n\t , then select\n\t **Share**\n\t .\n2. Type the name of the desired recipients in the share field.\n\n\n As you share a card or dashboard, any email addresses you enter for people without an account in Domo are sent an invitation to join Domo. Additionally, Domo creates accounts and Profile Pages for them, and the card or dashboard is shared with them. For more information about inviting users to Domo, see\n\nSpecifying Authorized Domains for Invited Users\n\n.\n\n\n A list of users and/or groups matching your query pops up.\n3. Select the desired user or group from the list.\n4. (Optional) Remove a user or group you've added by clicking the \"X\" to the right of the user or group name.\n5. Add more users and/or groups by entering their names in the box and clicking\n **Add**\n .\n6. (Optional) In the message field, enter a message to be added to the email sent to those with whom you shared the content.\n7. (Optional) If you do not want share recipients to receive email notifications that you are sharing content with them, uncheck the\n **Send email notifications**\n box.\n8. Click\n **Share**\n .\n\n\n The names of the users and groups that can access this card or dashboard appear in the list.\n\n\n Shared dashboards appear in the\n **Dashboards**\n pane. Shared cards appear on the\n **Shared**\n page.\n\nRemoving access to resources\n------------------------------\n\nYou can also remove access to resources for certain users or groups in the\n **Share**\n dialog.\n\n\n**To remove access from users or groups,**\n\n. Locate the user or group name in the\n **Access List**\n .\n2. Click the \"X\" to the right of the corresponding user or group name in the\n **Access List**\n .\n\n\n**Note:**\n When a member of a shared group is removed from the group, sharing of the card is removed, unless access is granted via another group or as a user. For more information, see\n\nControlling Access to Cards and Pages\n\n.\n\n\n---\n\n*Tip:**\n It is possible for you to remove access to content for yourself. If you accidentally remove access to yourself, follow the instructions above to grant access. If your user level does not allow you to share something with yourself, such as a Participant, then reach out to an Admin or the owner of the content to gain access.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042932994\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004113\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSharing and Removing Access to Cards and Dashboards\n\n", "article_total_view_count": "\n\n\n 13,277\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:22 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "sharing_and_removing_access_to_cards_and_dashboards", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "sharing_access_to_cards_and_dashboards", "url": "/s/topic/0TO5w000000ZaoEGAS"}]}