{"file_path": "../../raw_kb_v2\\article\\360042926114\\index.html", "content": {"Title": "Setting the Expected Update Frequency for a DataSet", "Article Body": "You can set the\n                        \n                         expected\n                        \n                        update frequency for a DataSet, which Domo uses to determine when to send a notification or to display a warning that the DataSet has not been updated. When the\n                        \n                         actual\n                        \n                        update does\n                        \n                         not\n                        \n                        occur within your expected update frequency, Domo displays a warning on the DataSet and cards powered by the DataSet. (The warning appears after a delay, depending on the specified frequency.) For connectors like Excel that do not include automatic update capability, you can choose how often you want to receive\n                        \n\n                        reminders to update manually.\n                       \n\n\n                         To set the expected update frequency for a DataSet,\n                        \n\n\n\n\n                          Click\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                          \n                          The Data Center opens, with the\n                          \n                           Data Warehouse\n                          \n                          tab opened by default.\n                         \n\n\n\n                          Click the\n                          \n                          icon on the left side of the screen to open the\n                          \n                           DataSets\n                          \n                          tab.\n                         \n\n\n\n                          Search for the DataSet you want, then view the details either by clicking the name or by clicking\n                          \n                          >\n                          \n                           View Details\n                          \n                          .\n                          \n\n                          A page appears showing details for the DataSet. If you are the owner of this DataSet or have an \"Admin\" default security profile or a custom role with the \"Manage DataSets\" privilege enabled, a\n                          \n                           Settings\n                          \n                          tab appears in the tab row; otherwise this tab does not appear. (This tab also does not appear for a few unique connectors such as the Webform connector.) For more information about default security roles, see\n                          \n                           Changing the Owner of a DataSet\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Settings\n                          \n                          .\n                          \n\n                          You should see several expandable sections with options for configuring the connector, such as \"Credentials,\" \"Details,\" and so on. Note that the buttons you see may differ depending on the connector. For example, many connectors that pull public information do not have a\n                          \n                           Credentials\n                          \n                          section.\n                         \n\n\n\n                          Click\n                          \n                           Scheduling\n                          \n                          .\n                         \n\n\n\n                          Set the desired update frequency.\n                          \n                          The controls for setting the update frequency depend on the connector. For connectors that don't have automatic update capability, such as File Upload, only one menu appears; you can choose a preset setting or leave it set to\n                          \n                           Never\n                          \n                          if you don't want to receive reminders to update this DataSet. For most connectors, you can choose whether to use basic or advanced scheduling. For more information about scheduling, see\n                          \n                           Connecting to Data with Connectors\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n                            \n\n\n\n\n\n\n                          When finished, click\n                          \n                           Save\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360042926114", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004897", "Archived Date": "", "Language": "English", "Primary Version": "Setting the Expected Update Frequency for a DataSet", "Article Total View Count": "5,047", "": "", "Article Created Date": "10/24/2022, 10:34 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Setting the Expected Update Frequency for a DataSet\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Data Center Overview\n              \n", "url": "/s/topic/0TO5w000000ZanRGAS"}]}