{"file_path": "../../raw_kb_v2\\article\\360043440273\\index.html", "content": {"title": "\n\n\n Leaving Table Cards Behind: Effective Chart Types for Reporting\n\n\n", "article_body": "\n\nIntro\n-------\n\nThere are a variety of ways in which you can maximize the use of different chart types in Domo. Because people are familiar with the Excel spreadsheet reporting their organization has been using, one of the first chart types new users select is a Table chart or Table card. Often people will see the Table card and want to replicate the same Excel reports in Domo, but there are a number of different options that may work better to visualize your data and the story you are telling.\n\n##\n Different chart or card options for visualizing your data\n\n\n####\n Heat Maps\n\nHeat Maps allow you to visualize relationships between data categories and draw attention to \"hot spots\" of activity and trends.\n\n\n See\n\nHeat Maps\n\nfor more information.\n\n\n####\n Bullet charts\n\nIf you have data you want to show pacing or progress to a goal, you can use a bullet card, which allow you to see clearly how the pacing is trending.\n\n\n See\n\nBullet Graph\n\nfor more information.\n\n\n####\n Gauge charts\n\nIf you have visualizations, for example, that show pacing towards goal or budgets, you could also choose to use a gauge chart. For the department details or broken out tasks and activities, you can create filters or drill paths on the card.\n\n\n See\n\nGauge Charts\n\nfor more information.\n\n\n####\n Gantt charts\n\nGantt charts can be used to illustrate project schedules, for example, in campaign scheduling systems or project management scheduling. Each task in a project or campaign is represented by a horizontal bar and tasks are represented along the vertical axis, and dates are represented along the horizontal axis.\n\n\n See\n\nGantt Chart\n\nfor more information.\n\n###\n Vertical bar plus symbol chart and other bar graphs\n\nIf you are looking to show a comparison, from y our Excel spreadhseet data, like what is the different between these two numbers? Is there a trend between numbers? You could utilize a vertical bar plus symbol chart.\n\n\n See\n\nBar Charts\n\nfor more information.\n\n\n####\n Slicer cards\n\nYou can use the slicer cards if you want to be able to look through different sections of your Excel data and create cards that allow you to click on a quick filter that immediately pull up a specific segment of your data. You are able to filter on multiple values at once in the Slicer card to show data filtered for various fields.\n\n\n See\n\nSlicer Card\n\nfor more information.\n\n\n####\n Period-Over-Period charts\n\nPeriod-over-period charts allow you to see data for a specified date range compared with data for the same range for another period. If you want to identify week to week or other period over period trends from your data, you could look through the Period over Period chart types and determine which would be best for your data.\n\n\n See\n\nPeriod-over-Period charts\n\nfor more information.\n\n\n####\n Create a custom card app\n\nUsing the Domo Developer Portal, you can create custom card apps that will specifically tell your data story. One company created their own Stoplight card app-using the green, yellow, red iconic symbol to indicate changes in their data.\n\n\n See the\n\nDeveloper Portal\n\nfor more information.\n\n\n###\n Take advantage of Domo Chart Properties and tools\n\n\n1. Create Custom Alerts for your cards\n\n\n When you set an alert on a card, you are notified whenever certain conditions (which you specify) are met (a value going above or below a certain threshold, for example). You can select the alert conditions and frequency, as well as share out alerts to others.\n\n\n See\n\nCreate Alerts\n\nfor more information.\n2. Use annotation features to make notes in your cards\n\n\n To replace the 'Notes' column that is often used in Excel spreadsheets, you can take advantage of the annotating features in Domo\n\n\n**Date annotation**\n\n\n You can add annotations (explanatory notes) to data points in the graph to provide context for your viewers. Each annotation appears in an Annotations sidebar with a colored flag that allows users to quickly match the annotation with its associated data point.\n\n\n See\n\nDate Annotations\n\nfor more information.\n\n\n**Note:**\n This functionality is available only for charts containing date/time data. You must have a security role of Editor or above to add date annotations.\n\n\n**Snapshot annotation**\n\n\n You can take a snapshot of a card in Domo and add annotations and share it with other users. One of the most useful features of the Snapshot tool is the ability to add annotations such as text, arrows, and simple shapes. This allows you to call out aspects of the card you want to draw attention to.\n\n\n See\n\nSnapshot Annotations\n\nfor more information.\n3. Use Personalized Data Permissions to get the right data to the right people\n\n\n You can use Personalized Data Permissions on cards so that people are only seeing the data that they are responsible for. In on example, a marketing division that is responsible for a number of categories and campaigns could be permissioned to only see the number of campaigns or categories they are in charge of using PDP on a map card representing sales across regions.\n\n\n See\n\nPDP Alerts\n\nfor more information.\n4. Use Drill Paths to provide specific views of your data\n\n\n Add layers of drill path by setting filters on specific columns in your data so when a user clicks a graph element in the chart, they drill to another view that represents the underlying data for that column.\n\n\n See\n\nAdding A Drill Path\n\nfor more information.\n\n\n###\n Table card best practices\n\n\n1. Understand row limits in Table Cards\n\n\n The maximum number of rows visible in a Table card depends on how many columns are selected. To minimize scrolling, the best practice is to limit data to six columns wide or fewer, and similar in # of columns high - if your data is so wide or so tall/long that it falls off the side or bottom of the table card, then it's not consumable at the page level. You don't want viewers to have to scroll in order to see all of the information that the Table card contains.\n\n\n See\n\nTable Cards\n\nfor more information.\n2. Use Domo color rules\n\n\n To color-coordinate various elements of your data, that were previously managed in Excel cells with different patterns or colors on cells, you can take advantage of Domo's color rules and set up customized colors for your data similar to the Excel shadings.\n\n\n See\n\nColor Rules\n\nfor more information.\n3. Customize tables by:\n\n\n - Adding Total and Subtotal Rows to Tables\n\n\n - Applying formatting to Tables (text font color, text wrap, column widths, header row fill or font color, bold or italic font style, row fill or font color and style, labeling, and so forth)\n\n\n - Create a hyperlink within your table card to ease the end user's navigation\n\n\n See\n\nTable Cards\n\nfor more information on Table customizations.\n4. Table cards can be useful when writing and validating a Beast Mode that you intend to then use in a non-table graphic. For example, you can pull in the columns used in a Beat Mode into a table card and then the result of the Beast Mode at the far right or left. You can spot check your math or logic statements, showing the result side-by-side with the inputs. This helps you gain confidence in your Beast Mode results and lets you switch your card away from a table and to a different style of visualization where you can use the Beast Mode.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043440273\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004987\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nLeaving Table Cards Behind: Effective Chart Types for Reporting\n\n", "article_total_view_count": "\n\n\n 4,969\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/1/2022, 11:20 PM\n\n\n", "first_published_date": "\n\n\n 11/1/2022, 11:23 PM\n\n\n"}, "title": "leaving_table_cards_behind_effective_chart_types_for_reporting", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "training", "url": "/s/topic/0TO5w000000ZamyGAC"}, {"text": "selfservice_training", "url": "/s/topic/0TO5w000000ZaoCGAS"}, {"text": "business_users_and_adoption_resources", "url": "/s/topic/0TO5w000000ZaoYGAS"}]}