{"file_path": "../../raw_kb_v2\\article\\360043428493\\index.html", "content": {"Title": "Bar Chart", "Article Body": "Intro\n                       \n\n                        In a vertical bar chart, the most common type of bar chart, the categories are represented along the horizontal axis, or x-axis, and the values are represented along the vertical axis, or y-axis. A horizontal bar chart has the same overall concept, but the categories are represented along the vertical axis and the values are represented along the horizontal axis.\n                       \n\n                        Powering bar charts\n                       \n\n                        Both vertical and horizontal bar charts require only two columns or rows of data from your DataSet—one for categories and one for values. However, you can add series columns to a vertical or horizontal bar chart if you want. Adding series data to a bar chart turns it into a different chart type, usually either a\n                        \n                         grouped bar chart\n                        \n                        , depending on the data.\n                       \n\n                        For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your bar chart. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows how the data from a typical column-based spreadsheet is converted into a vertical bar chart:\n                       \n\n\n\n\n                        The following graphic shows how the data from a typical column-based spreadsheet is converted into a horizontal bar chart:\n                       \n\n\n\n\n                        Customizing bar charts\n                       \n\n                        You can customize the appearance of a bar chart in a number of ways. Many customizations are possible by setting\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        . Unique properties of bar charts include the following. You can click a thumbnail image to see a larger image.\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n                           General > Sort Each Category\n                          \n\n\n                            Allows you to sort the items in each individual category in most kinds of multi-series bar and lollipop charts. You can choose an ascending or descending sort. If you select\n                            \n                             Default\n                            \n                            , the default sort is applied. This option does not work when the\n                            \n                             Value Scale > Log Scale\n                            \n                            box is checked.\n                           \n\n                            In the example at right, bars within all categories are sorted in descending order.\n                           \n\n\n\n\n\n\n\n\n\n                           General > Sort on Totals\n                          \n\n\n                            Allows you to sort categories in many kinds of bar and lollipop charts by their total values, in either ascending or descending order. If you select\n                            \n                             Default\n                            \n                            , the default sort is applied. This option does not work when the chart has automatic time scaling applied. (You can turn off automatic time scaling by checking the box for\n                            \n                             Category Scale > Never Use Time Scale\n                            \n                            .\n                           \n\n                            In the example at right, the categories are sorted by their totals in ascending order.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > Maximum Bars\n                           \n\n\n\n                            Allows you to specify the number of bars that appear in your bar chart. Data for all remaining bars is lumped into a single \"Other\" bar (unless you hide this bar using the\n                            \n                             Hide 'Other' Bar\n                            \n                            toggle.\n                           \n\n                            The example at right shows a bar chart in which the maximum number of bars has been set to 7.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            General > Hide 'Other' Bars\n                           \n\n\n\n                            Hides or shows the \"Other\" bar that appears when you set a maximum number of bars using the\n                            \n                             Maximum Bars\n                            \n                            option.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Category Scale (Y) > Position (horizontal bar only)\n                           \n\n\n\n                            Allows you to set the orientation of the bars in the chart to the\n                            \n                             Right\n                            \n                            . The\n                            \n                             Default\n                            \n                            setting is set to the\n                            \n                             Left\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n                            Category Scale > Never Use Time Scale\n                           \n\n\n\n                            Determines which type of timeline is used in supported charts with time data.\n                           \n\n                            By default, when time data is used in supported charts, such as line and bar charts, Domo automatically makes it appear using a\n                            \n                             date grain\n                            \n                            appropriate for your data. This is shown in the first example at right, in which the timeline takes date data spanning several months and shows it by month.\n                           \n\n                            If you check this box, however, date data appears as it does in your DataSet. This is shown in the second example at right, in which the time scale uses individual dates, as in the DataSet.\n                           \n\n                            This option is available for vertical bar charts only.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Last Value Projection > Project Using (vertical bar only)\n                           \n\n\n\n                            Determines whether a final value is projected in bar and line charts and, if so, how this value is determined. You can enter a specific value for a projection or set Domo to project a value automatically by...\n                           \n\n\n\n                              taking the current value for the period and comparing it to the previous period (forecasting),\n                             \n\n\n\n                              taking the average of the previous points in the chart, or\n                             \n\n\n\n                              using a linear regression.\n                             \n\n\n\n                            The example graphic shows a bar chart in which a final value has been projected using a linear regression. For more information, see\n                            \n                             Projecting the Last Value in Your Chart\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Last Value Projection > Projection Value (vertical bar only)\n                           \n\n\n\n                            Lets you specify the final projected value in a bar or line chart. This option only works if you have selected\n                            \n                             Specified Value\n                            \n                            as the\n                            \n                             Project Using\n                            \n                            property. For more information, see\n                            \n                             Projecting the Last Value in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Last Value Projection > Previous Values to Average (vertical bar only)\n                           \n\n\n\n                            Lets you specify the number of points to average to determine the final projected value in a bar or line chart. This option only works if you have selected\n                            \n                             Average Previous Values\n                            \n                            as the\n                            \n                             Project Using\n                            \n                            property. For more information, see\n                            \n                             Projecting the Last Value in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Grid Lines > Remove Min/Max/Avg Lines\n                           \n\n\n\n                            Removes the minimum, maximum, and average lines that normally display on mouse-over in standard bar and line charts.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Grid Lines > Calculated Line\n                           \n\n\n\n                            Determines whether a median or average line appears in your chart. If you select\n                            \n                             None\n                            \n                            , no line appears.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Scale > Title Position\n                           \n\n\n\n                            Determines whether value scale labels in vertical bar charts appear to the left of the chart or above it.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Regression Line > Show Linear Regression Line\n                           \n\n\n\n                            Allows you to add a regression line to your vertical bar chart. In the example at right, the dashed orange line represents the regression line.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Regression Line > Include Last Data Point\n                           \n\n\n\n                            Determines whether the last data point in your bar chart is included in the calculation for the regression line. If your chart shows a timeline that is not complete (for example, November appears as the last month in the timeline but has not yet ended), you should check this box.\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Regression Line > Line Style\n                           \n\n\n\n                            Lets you specify whether your regression line is solid or dashed (default).\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Regression Line > Line Color\n                           \n\n\n\n                            Lets you select the color for the regression line.\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n\n\n                          Video - Adding Regression Lines\n                         \n\n\n\n\n\n\n\n\n\n\n\n                        Changing the size of bars in a bar chart\n                       \n\n                        For any bar chart, you can set the percentage of space taken up by bars in that chart or specify a fixed bar width. For more information, see\n                        \n                         Specifying the Size of bars in bar charts\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043428493", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004743", "Archived Date": "", "Language": "English", "Primary Version": "Bar Chart", "Article Total View Count": "6,210", "": "", "Article Created Date": "10/24/2022, 10:28 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Bar Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}