{"file_path": "../../raw_kb_v2\\article\\360042935234\\index.html", "content": {"Title": "February 2018 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        New File Upload Connector\n                       \n\n                        The new version of the File Upload connector provides an intuitive workflow to make even the most complicated Excel or CSV files usable within Domo. Due to Excel's nature as an extremely extensible product, there are nearly endless combinations of formatting and configurations that you can use in order to make your data actionable. With the new File Upload connector, you can maintain all of the organization and configuration of your custom Excel or CSV files and still have usable data within Domo. Requiring virtually no input, the Excel/CSV Upload Wizard does the heavy lifting for you when you need to leverage the power of your Excel or CSV data in Domo.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         File Upload Connector\n                        \n                        .\n                       \n\n                        Domo Skills\n                       \n\n                        Domo Skills empowers new Freemium users to understand the fundamentals of Domo. To set these users up for success, they are walked through a series of skills that have been shown to be critical tasks in determining Domo's value to the customer. They learn how to connect data, create cards, and organize dashboards through a series of guided challenges. A progress bar encourages them through this journey toward success in Domo.\n                       \n\n                        The Domo Skills feature is presented after sign-up to new English language Freemium customers.\n                       \n\n\n\n\n                        SAML RelayState Redirect Option\n                       \n\n                        We have shipped a fix to SSO that enables loading of multiple cards on the same page using Domo Everywhere: Domo Embed. To allow this, we have repurposed the SAML \"RelayState\" tag. You can enable this behavior by checking the\n                        \n                         Use SAML RelayState to redirect\n                        \n                        checkbox in\n                        \n                         Admin > Security Settings > Single Sign-On (SSO)\n                        \n                        . Any customers who have built a custom SAML solution to support Domo embed will likely want to make use of this feature. If this feature doesn't work with your setup, there is fallback logic to continue using the previous method for redirects.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Understanding and Configuring Domo Single Sign-On\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n                          \n                           \\support.\n                          \n\n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042935234", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004435", "Archived Date": "", "Language": "English", "Primary Version": "February 2018 Release Notes", "Article Total View Count": "4,666", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              February 2018 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}