{"file_path": "../../raw_kb_v2\\article\\360043428113\\index.html", "content": {"Title": "Creating a Recursive/Snapshot Old Magic ETL DataFlow", "Article Body": "A \"recursive\" or \"snapshot\" DataFlow is a DataFlow that uses itself as an input.\n                       \n\n                        DataFlows (neither SQL nor Magic ETL types) cannot append data natively like connectors. However, if you need to create a DataFlow that appends data, you can do so by running it once and then using the output as part of the input for the next run. This way, every time the DataFlow runs, it includes the data from before and also appends the new data onto itself.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            If a recursive DataFlow is edited incorrectly, you could lose ALL historical data. To avoid this any time you are editing, create an additional DataSet that is a copy of your historical DataSet. This DataSet will remain static. If anything happens to your historical DataSet, you will have a backup from before you began editing.\n                           \n\n\n\n\n\n\n\n                          Video - What is a Recursive DataFlow?\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                         To create a recursive DataFlow in Magic ETL,\n                        \n\n\n\n\n\n\n                          Create and run a Magic ETL DataFlow.\n                          \n\n\n\n\n\n\n                          Once the DataFlow has finished running, load the output DataSet as an input DataSet.\n                          \n                          The DataSet name will show the output DataSet name followed by \"1.\"\n                          \n\n\n\n\n                          You should now have two DataSets in the DataFlow—the updating original DataSet and the historical DataSet.\n                          \n                          You now need to find a column to use as a constraint. This helps determine when to replace data in your historical DataSet with new data. Constraint columns are normally ID columns or date columns or have other unique identifiers. In this example we use the `Date` column as a constraint.\n                         \n\n\n\n                          Use\n                          \n                           Select Columns\n                          \n                          to select only the constraint column.\n                          \n\n\n\n\n\n\n                          Use\n                          \n                           Remove Duplicates\n                          \n                          to return a unique list of constraints.\n                          \n\n\n\n\n\n\n\n                          Use\n                          \n                           Add Constants\n                          \n                          to create a new column that tells you when a row needs to be deleted.\n                          \n\n\n\n\n\n\n                          Use an Outer Join to join your deletion-identifying column to the unique constraint column in your historical DataSet.  If you selected the historical DataSet on the left side of the join, as shown below, use a left outer join. If you select the historical DataSet on the right side of the join, use a right outer join. (Do not select\n                          \n                           Inner Join\n                          \n                          , as this could result in a loss of data.)\n                          \n\n\n\n\n\n\n\n\n\n                          Filter any rows from your DataSet that contain the value \"Delete Me\" (or whatever identifier you came up with in step 5).\n                          \n                          This returns only rows from the historical DataSet that do not exist in the new updating DataSet.\n                          \n\n\n\n\n\n\n                          Use\n                          \n                           Select Columns\n                          \n                          to remove the additional unique constraint column (`Date`) and the unique deletion-identifying column.\n                          \n\n\n\n\n\n\n                          Use\n                          \n                           Append\n                          \n                          to join the historical DataSet and new updating DataSet.\n                          \n                          If all steps have been done correctly, both DataSets will show \"No changes.\"\n                          \n\n\n\n\n\n\n                          Connect the\n                          \n                           Append\n                          \n                          tile to your output.\n                         \n\n\n\n                        Once complete, your Magic ETL should look like the following:\n                        \n\n\n\n\n                        Troubleshooting/FAQ\n                       \n\n                        See\n                        \n                         Top 5 issues Users Experience with DataFlows\n                        \n                        to see common issues and errors seen when building DataFlows.", "Preview Article": "Click here to preview", "URL Name": "360043428113", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004606", "Archived Date": "", "Language": "English", "Primary Version": "Creating a Recursive/Snapshot Old Magic ETL DataFlow", "Article Total View Count": "5,418", "": "", "Article Created Date": "10/24/2022, 10:16 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Creating a Recursive/Snapshot Old Magic ETL DataFlow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Transformation Tips And Tricks\n              \n", "url": "/s/topic/0TO5w000000ZaoJGAS"}]}