{"file_path": "../../raw_kb_v2\\article\\360042933134\\index.html", "content": {"Title": "Using Programmatic Filters with Domo Embed", "Article Body": "Intro\n                       \n\n                        By using programmatic filtering with Domo Embed, you can distribute personalized content in portals and software at scale. You can share your Domo content with an unlimited number of viewers, even if they do not have Domo accounts.\n                       \n\n                        For more in-depth information about programmatic filters in Domo Embed, visit the following links:\n                       \n\n\n\n\n                           https://developer.domo.com/docs/overview/embedded-analytics\n                          \n\n\n\n\n\n                           https://developer.domo.com/docs/embed/embed-2\n                          \n\n\n\n\n\n                           https://github.com/domoinc/domo-node-embed-filters\n                          \n\n\n\n\n\n                           https://developer.domo.com/docs/embed-token-api-reference/embed-token-api-reference\n                          \n\n\n\n\n                        Programmatic filters provide all of the following benefits:\n                       \n\n\n\n                          Showing only approved and relevant content for the viewer.\n                         \n\n\n\n                          Decreasing the number of PDP policies you need to manage.\n                         \n\n\n\n                          Eliminating the need for viewers of embedded content to be full Domo users.\n                         \n\n\n\n                          Decreasing the risk of viewers logging into the full instance.\n                         \n\n\n\n                        Filters are defined in your code based on the login credentials of your systems instead of Domo data permissions policies. This ensures that viewers only see approved subsets of the data even if you choose not to integrate your identity provider or automate the provisioning of users in Domo.\n                       \n\n                        This is portrayed in the following example, in which user Mike logs into his company website using his username and password and is shown a filtered view of his company data based on his login credentials:\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Tip:\n                            \n\n\n                            You can also use Domo's JavaScript API to allow multiple iFrames on the same page to utilize the same dropdown control. For more information about using this API, please refer to\n                            \n                             developer.domo.com\n                            \n                            .\n                           \n\n\n\n\n\n                        Configuring an example of programmatic filtering\n                       \n\n                        To configure an example of programmatic filtering, follow these steps:\n                       \n\n\n\n                          Download the example code at\n                          \n                           https://github.com/domoinc/domo-node-embed-filters\n                          \n                          .\n                          \n                          You can also use these examples for the following programming languages:\n                          \n\n\n                            Asp.net\n                           \n                           :\n                          \n\n                           https://github.com/domoinc/domo-asp-embed-filters\n                          \n\n\n                           Python:\n                          \n\n                           https://developer.domo.com/docs/embed/python-code-example\n                          \n\n\n                           PHP:\n                          \n\n                           https://developer.domo.com/docs/embed/php-code-example\n                          \n\n\n                           Salesforce Lightning:\n                          \n\n                           https://github.com/michaelforce-repo/domo-salesforce-embed-example\n                          \n\n\n\n\n                          Activate an API client by doing the following:\n                         \n\n\n\n                            Go to\n                            \n                             https://developer.domo.com\n                            \n                            and log in (or create an account if you don't have one).\n                           \n\n\n\n                            Select\n                            \n                             My Account > New Client\n                            \n                            .\n                           \n\n\n\n                            Complete the fields.\n                            \n\n\n\n\n\n\n\n\n                          Use a text editor to open the\n                          \n                           README.md\n                          \n                          file.\n                         \n\n\n\n                          Follow the instructions in the file.\n                          \n\n                          The readme file walks you through the following tasks:\n                         \n\n\n\n                            Creating an example DataSet.\n                           \n\n\n\n                            Customizing the .env file with your specific embed IDs for each Card.\n                           \n\n\n\n                            Live-testing this example setup on your local machine.\n                           \n\n\n\n\n\n                        Setting up and configuring programmatic filtering for your environment\n                       \n\n                        The image below shows how your server gathers the access token, embed token, and embed ID in the embed.js file. This corresponds to the sample code in lines 1- and 11 of the\n                        \n                         embed.js\n                        \n                        file. You will need to update the\n                        \n\n                          customerserver.com\n                         \n\n                        entry, noted at the bottom of the image, with your own domain for the pages in which you will programmatically filter Cards.\n                        \n\n\n\n\n\n\n                        The next image shows how the self-submitting form makes the request for the modified Card. The ApiGateway (\n                        \n                         public.domo.com\n                        \n                        ) returns the filtered version of the Card based on the logic defined in your code. This corresponds to lines 100-113 of the\n                        \n                         embed.js\n                        \n                        file.\n                        \n\n\n\n\n\n                        In the last image, the \"request for card info\" section corresponds to lines 20-26 of the express.js file. Here, the core criteria of the programmatic filter is defined.\n                        \n\n\n\n\n\n\n                        It is critical that the developer of the code understands the schema of the underlying DataSet. Otherwise the query could fail and the API will respond with \"Bad request.\" This is to maintain the security of your server-side filters.", "Preview Article": "Click here to preview", "URL Name": "360042933134", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004246", "Archived Date": "", "Language": "English", "Primary Version": "Using Programmatic Filters with Domo Embed", "Article Total View Count": "5,456", "": "", "Article Created Date": "10/24/2022, 9:35 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Using Programmatic Filters with Domo Embed\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}