{"file_path": "../../raw_kb_v2\\article\\360043432333\\index.html", "content": {"Title": "Salesforce Advanced Connector", "Article Body": "Intro\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Salesforce API Change\n                           \n\n                           Due to Salesforce's changing API, on\n                           \n                            August 1st\n                           \n                           ,\n                           \n                            2018\n                           \n                           Domo will be releasing new Salesforce and Salesforce Advanced connectors. These connectors will work in conjunction with a Salesforce managed package installed via the Salesforce App Store. The new version will enable Salesforce administrators to control who can use the Domo Salesforce connectors inside Salesforce, providing ease of administration and enhanced security.\n                           \n\n\n                            Will my current DataSets continue to work?\n                           \n\n                           All current Salesforce and Salesforce Advanced connector DataSets do not work in conjunction with the Salesforce managed package and no dependencies need to be installed for the connectors to function. Existing DataSets will continue to run until\n                           \n                            September 1st, 2018\n                           \n                           .\n                           \n\n\n                            I want to create a new Salesforce DataSet. What should I do?\n                           \n\n                           Beginning August 1st 2018, any new DataSets created will require you to download the Salesforce managed package via the Salesforce App Store to properly function.\n                           \n\n                            What will happen if I don't install the Salesforce managed package before September 1st, 2018?\n                           \n\n                           Any Salesforce instance bringing data into Domo via the Salesforce or Salesforce Advanced connector will stop running until the Salesforce managed package is installed.\n                           \n\n                           For more information on how to download and install the Salesforce managed package, see\n                           \n                            Installing the Domo Connector Package\n                           \n                           .\n                          \n\n\n\n\n\n                         Salesforce.com\n                        \n                        builds the world's most popular customer relationship management (CRM) product. Use Domo's Salesforce Advanced connector to import prebuilt tabular reports or retrieve fields from a given Salesforce object. To learn more about Salesforce's APIs, visit their page (\n                        \n                         https://trailhead.salesforce.com/en/content/learn/modules/api_basics\n                        \n                        ).\n                       \n\n                        You connect to your Salesforce account in the Data Center. This topic discusses the fields and menus that are specific to the Salesforce connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Salesforce account and create a DataSet, you must have Salesforce credentials. You must also have an installed Domo Connector Package from the Salesforce AppExchange (required as of August 1, 2018; see next section for installation instructions)\n                       \n\n                        Installing the Domo Connector Package\n                       \n\n                        The \"Domo Connector Package\" found in Salesforce AppExchange allows Salesforce users to import their data into Domo. Follow these instructions to download and install the Connector Package from the AppExchange.\n                       \n\n\n                         To install Domo's Salesforce Managed Package,\n                        \n\n\n\n\n                          Log into Salesforce.\n                         \n\n\n\n                          Navigate to the Salesforce AppExchange at\n                          \n                           https://appexchange.salesforce.com\n                          \n                          and search for \"Domo Connector Package,\" then click on it.\n                         \n\n\n\n\n                           Customers can go directly to the package with the following link:\n                          \n\n\n                           https://login.salesforce.com/packaging/installPackage.apexp?p0=04t1I000001ymKN\n                          \n\n\n\n\n\n                           If you are installing into a sandbox organization you must replace the initial portion of the URL with\n                          \n\n                           http://test.salesforce.com\n                          \n\n\n\n\n\n                          Alternatively, you can go directly to\n                          \n                           https://appexchange.salesforce.com/a...A00000EcrsyUAB\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Get It Now\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Choose whether you want to install in a production environment or sandbox.\n                          \n\n\n\n\n\n\n                          Check the box reading \"I have read and agree to the terms and conditions,\" after Reading the terms and conditions.\n                         \n\n\n\n                          Click\n                          \n                           Confirm and Install\n                          \n                          .\n                          \n\n\n\n\n\n\n\n                          Click the\n                          \n                           Install for All Users\n                          \n                          tile.\n                          \n\n\n\n\n\n\n                        For more details, see Salesforce's documentation at\n                        \n                         https://help.salesforce.com/articleV...ges.htm&type=5\n                        \n                        .\n                       \n\n                        Connecting to Your Salesforce Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n                         Data Selection\n                        \n                        panes in the Salesforce Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Salesforce Advanced connector uses OAuth to connect, so there is no need to enter credentials within Domo. Select the desired Salesforce environment (either\n                        \n                         Sandbox\n                        \n\n\n                        or\n                        \n                         Salesforce\n                        \n                        ) then click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Salesforce accounts in Domo) to open the Salesforce OAuth screen where you can enter your Salesforce credentials. Once you have entered valid Salesforce credentials, you can use the same account any time you go to create a new Salesforce DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Salesforce when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Salesforce.\n                          \n\n\n\n\n                        Data Selection Pane\n                       \n\n                        This pane provides access to four different routes for pulling Salesforce data into Domo. Each of these is described in continuation.\n                       \n\n                        Browse Objects and Fields\n                       \n\n                        Use this option to select a Salesforce object and define its associated fields and relationships. Any configuration options you choose here are reflected in the SOQL query, which is automatically generated in the\n                        \n                         Query\n                        \n                        tab.\n                       \n\n                        The following table describes the configuration options available when choosing this route:\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Which Salesforce Object Would You Like to Use?\n                           \n\n\n\n                            Select the Salesforce object you want to import into Domo.\n                           \n\n\n\n\n\n                            What Fields Would You Like to Retrieve?\n                           \n\n\n\n                            Select all the fields you want to retrieve. You can select as many fields as you want. You can drill down on an object to show the fields under that object, or you can search for a specific field using the\n                            \n                             Search\n                            \n                            box.\n                           \n\n\n\n\n\n                            Would You Like to Filter by Date?\n                           \n\n\n\n                            Select a date filtering option. A number of options is available, including the creation date, last activity date, last viewed date, etc.\n                           \n\n\n\n\n\n                            What Relationships Would You Like to Include?\n                           \n\n\n\n                            Select all relationships you want to include in your DataSet.\n                           \n\n\n\n\n\n                            Column Name Styles\n                           \n\n\n\n                            Select whether to use Salesforce internal names or labels as the column names in the DataSet.\n                           \n\n\n\n\n\n                            Retrieve All Fields\n                           \n\n\n\n                            Select whether new fields will be automatically retrieved from Salesforce if all the fields under a parent object are selected.\n                           \n\n\n\n\n\n                            Type of Records to Retrieve\n                           \n\n\n\n                            Specify whether you want to import all records (including deleted records) or active fields only.\n                           \n\n\n\n\n\n                            Reset Schema?\n                           \n\n\n\n                            Specify whether you want your DataSet columns to be reset when a query or field selection is modified.\n                           \n\n\n\n\n\n                        Query\n                       \n\n                        Use this option to pull Salesforce data into Domo by inputting a query.\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n                            Enter your SOQL Query\n                           \n\n\n\n                            Enter the desired SOQL query. Note that a query is automatically generated here when you specify configuration options in the\n                            \n                             Browse Objects and Fields\n                            \n                            tab. However, you can edit this query if you want, or even enter an entirely new query.\n                           \n\n\n\n\n\n                            Data Retrieval -- Type of Records to Retrieve\n                           \n\n\n\n                            Specify whether you want to import all records (including deleted records) or active records only.\n                           \n\n\n\n\n\n                            Schema Options -- Reset Schema\n                           \n\n\n\n                            Specify whether you want your DataSet columns to be reset when a query or field selection is modified.\n                           \n\n\n\n\n\n                        Tabular Reports\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Select a Salesforce Tabular Report\n                           \n\n\n\n                            Select a tabular report to import from Salesforce.\n                           \n\n\n\n\n\n\n                           Select a Unique Key Present in the Data\n                          \n\n                           Select a unique key in your DataSet. This is necessary if you want to import more than 2000 rows of data.\n                          \n\n\n\n                           Select the Date Format Returned by the Report\n                          \n\n                           Select how you want dates to be formatted in your report.\n                          \n\n\n\n\n                        Sharing Rules Settings\n                       \n\n                        This option is locked to reduce the risk of error when creating reports.\n                       \n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043432333", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003668", "Archived Date": "", "Language": "English", "Primary Version": "Salesforce Advanced Connector", "Article Total View Count": "5,420", "": "", "Article Created Date": "10/24/2022, 9:14 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Salesforce Advanced Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}