{"file_path": "../../raw_kb_v2\\article\\4404717504023\\index.html", "content": {"Title": "JavaScript vs iframe in Embed", "Article Body": "Intro\n                       \n\n                        The use of JavaScript vs iframe for embed is a fair concern. Over the years, the main reasons some have preferred to use JavaScript in embed instead of iframes have been:\n                       \n\n\n\n                          Customizing the appearance\n                         \n                         .\n                        \n\n\n                          Adapting responsively across device types\n                         \n                         .\n                        \n\n\n                          Loading quickly across regions\n                         \n                         .\n                        \n\n\n                          Maintaining compatibility across browsers\n                         \n                         .\n                        \n\n\n                        Despite the flexibility in each of these design areas, some customers still struggle with a lingering fear that iframes are somehow unsafe. That is only relevant when an iframe points to a random third-party site where the embedder has no control over the content nor relationship with the other property.\n                        \n\n                        Domo Everywhere iframes are safe because you have total control over all content and because we have a secure relationship across systems. Even the most sensitive finance, healthcare, and government organizations trust our identity integrations (\n                        \n                         https://developer.domo.com/docs/embedded-capabilities/embedded-capabilities\n                        \n                        ), data access policies (\n                        \n                         https://developer.domo.com/docs/dataset/create-personalized-data-permissions-pdp\n                        \n                        ), and server-side filters (\n                        \n                         https://developer.domo.com/docs/embed/programmatic-filtering\n                        \n                        ).\n                        \n\n                        Ensuring that external users only ever see the data and content you approve is our primary commitment. After we earn your trust (\n                        \n                         https://www.domo.com/platform/security\n                        \n                        ), the following design options have been our guiding principles as we have expanded beyond embedded cards, dashboards, apps, and even the entire power of the platform.\n                       \n\n                        Customizing the appearance\n                       \n\n                        The appearance can be customized through the custom layouts, background colors, images, and fonts that you have already used to push the capabilities of Publish to new heights. Fortunately, Embed already had quite a head start here since it has a more direct path to inheriting the experience directly from the instance where it was created. You can see this continuing to develop as we add Page filters and Page exports.\n                       \n\n                        Visualization flexibility is higher than ever with\n                        \n                         Domo Data Experience (DDX)\n                        \n                        apps. For the few chart types that Domo does not already support, JavaScript can simply be pasted in-line and details can be edited in the context of the greater layout to avoid having to build everything from scratch.\n                       \n\n                        Adapting responsively across device types\n                       \n\n                        Responsive design started as a quick test for a prospect that wanted to embed Dashboards in the Salesforce mobile app. Only a month after we built it, the functionality was really put to the test with the\n                        \n                         Domo Covid Tracker\n                        \n                        . 65% of our traffic there was on mobile. It pushed us to move beyond dynamically reformatting the layout to a vertical stack of Cards with the addition of the Mobile layout edit capabilities. We also added a way to dynamically resize the iframe with postmessage to avoid scroll traps. Now embed works reliably on large screens, mobile browsers, and dedicated mobile apps.\n                       \n\n                        Loading quickly across regions\n                       \n\n                        Loading quickly becomes an even greater priority when the lag between the host page loading and the embedded content loading becomes the focus of the viewer’s attention. For that reason, we have been obsessing over speed. This has led to a variety of improvements with iframe speed:\n                       \n\n\n                         First, we started with gzip compression to make the assets as small as possible.\n                        \n\n                         Next, we continued by reducing the size of the JavaScript that drives the iframe even before compression.\n                        \n\n                         Then, we changed to activate browser caching by default.\n                        \n\n                         Finally, we consolidated API calls to avoid duplicate requests when validating columns.\n                        \n\n\n                        All these things result in iframe load times that are significantly faster than they were last year.\n                       \n\n                        Maintaining compatibility across browsers\n                       \n\n                        Compatibility across browsers is the final hurdle. This is definitely one to watch as we move from third-party cookies to header-based authentication. For now, Safari is the most strict. They have already started to block third-party cookies. Chrome will follow in the next couple years as Google figures out how to make their ad tracking work without it. In the meantime, it only really impacts Domo embed in a small segment: app embed on Safari. For that, we already have a workaround. The user clicks an “accept cookies” button similar to the\n                        \n                         General Data Protection Regulation (GDPR)\n                        \n                        dialogs that are common on almost every website these days. Fortunately, Card and Dashboard embed (especially when programmatically filtered through the JSON Web Token (JWT)) do not even have to show the “accept cookies” button because the token is based on header authentication.\n                       \n\n                        We use JavaScript where it is essential (authentication and context). For authentication, we use JavaScript to drive the server-side personalization at the row level. We recently expanded upon that to even switch DataSets dynamically. For context, we use JavaScript to push filters down from the host Page into the embedded content. Then we also use that same message channel to pull click events from the embedded content back to the host Page. This is very helpful in linking across Pages with and without embedded content.\n                       \n\n                        After that, the only reason to use JavaScript for embed is to define the actual experience. This is where you must make a decision. Do you want the experience to only be editable by those comfortable with coding JavaScript or for everyone familiar with the drag and drop experience of Story layouts? Do you want the updates to be reliant on the release schedule for the web development team or do you need the edits to be immediately applied as soon as someone presses the Save button in Domo? As Stories continue to progress, using iframe allows you to move faster than if you had to rebuild all the interactions from scratch in JavaScript.", "Preview Article": "Click here to preview", "URL Name": "4404717504023", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004247", "Archived Date": "", "Language": "English", "Primary Version": "JavaScript vs iframe in Embed", "Article Total View Count": "5,124", "": "", "Article Created Date": "10/24/2022, 9:35 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              JavaScript vs iframe in Embed\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}