{"file_path": "../../raw_kb_v2\\article\\360042934474\\index.html", "content": {"Title": "Setting Password Requirements", "Article Body": "Intro\n                       \n\n                        You can set password requirements for Domo to enforce when users create or change passwords. You can only do this if you have an \"Admin\" default security role or a custom role with \"Manage All Company Settings\" enabled.\n                       \n\n                        For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n                        To set user password requirements, do the following:\n                       \n\n                        1. In the navigation header, select\n                        \n                         More\n                        \n\n\n                          > Admin\n                         \n\n                        .\n                        \n                        The\n                        \n                         Admin Settings\n                        \n                        displays.\n                       \n\n                        2. Select\n                        \n\n                          Authentication\n                         \n\n                        >\n                        \n\n                          Authentication\n                         \n\n                        .\n                       \n\n                        3. Set the password requirements you want when users create or change passwords.\n                       \n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           Set reasonable password requirements, keeping in mind that users accessing Domo on a mobile device sign in using a keypad.\n                          \n\n\n\n\n\n                         4. Select\n                        \n\n                         Save\n                        \n\n                         .\n                        \n\n\n                        Password requirements you can set include the following:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Enable password length check\n                           \n\n\n\n                            Sets whether Domo checks password length. When enabled, the\n                            \n                             Minimum Password Length\n                            \n                            field displays, which sets the minimum number of characters that passwords must contain.\n                           \n\n\n\n\n\n                            Must contain UPPERCASE characters (A-Z)\n                           \n\n\n\n                            Sets whether passwords must contain uppercase characters.\n                           \n\n\n\n\n\n                            Must contain lowercase characters (a-z)\n                           \n\n\n\n                            Sets whether passwords must contain lowercase characters.\n                           \n\n\n\n\n\n                            Must contain digits (0-9)\n                           \n\n\n\n                            Sets whether passwords must contain numbers.\n                           \n\n\n\n\n\n                            Must contain non-alphanumeric characters (!,@,#,&)\n                           \n\n\n\n                            Sets whether passwords must contain characters besides alphabet and number characters.\n                           \n\n\n\n\n\n                            Enable account lock\n                           \n\n\n\n                            Sets whether Domo allows account locking. When enabled, the\n                            \n                             Accounts lock after\n                             \n                              #\n                             \n                             invalid login attempts\n                            \n                            field displays, which sets the number of invalid attempts to sign in before the account is locked.\n                           \n\n\n\n\n\n                            Enable password expiration\n                           \n\n\n\n                            Sets whether Domo allows account locking. When enabled, the\n                            \n                             Passwords expire in\n                             \n                              #\n                             \n                             days\n                            \n                            field displays, which sets the number of days after passwords are created or changed when users must change their password.\n                            \n                            Users are prompted to change their password before it expires (daily, 14 days before expiration).\n                           \n\n\n\n\n\n\n\n                        Password Blocklist (Beta)\n                       \n\n                        Enterprise customers can restrict their users from using specific passwords by creating a blocklist. This can be valuable if you've had unauthorized credential usage and to limit use of passwords commonly assigned within your organization. Entries in the blocklist include passwords that do not meet the requirements you set, as mentioned above, and a growing list of the most commonly used global passwords. Entries within the blocklist are not permitted when a user creates or changes their password, but they do not impact passwords currently in use.\n                       \n\n                        These settings only apply to Domo accounts passwords and do not impact your IdP account.\n                       \n\n                        If you are interested in this feature, please contact your Customer Success Manager (CSM).", "Preview Article": "Click here to preview", "URL Name": "360042934474", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003022", "Archived Date": "", "Language": "English", "Primary Version": "Setting Password Requirements", "Article Total View Count": "5,042", "": "", "Article Created Date": "10/24/2022, 9:00 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Setting Password Requirements\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Domo Security Options\n              \n", "url": "/s/topic/0TO5w000000ZandGAC"}]}