{"file_path": "../../raw_kb_v2\\article\\360042934594\\index.html", "content": {"title": "\n\n\n DomoStats - Activity Log\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomoStats gives you the freedom to explore how your team is using Domo. Because DomoStats is powered by a live Domo DataSet with no configuration, you can easily build cards, alerts, and workflows around the metrics you want to see as well as use the pre-built dashboard.\n\n\n The DomoStats Activity Log App provides key insights into how your organization is using Domo. See activities like how many people are logging in each day, the top favorited cards, and how many DataSets were created last week. Stay up to date and informed on all the activity happening in your Domo instance.\n\n*Note:**\n There are known limitations with using the Activity Log App to track certifications for cards and DataSets. To join the Beta for a DomoStats report that tracks certifications, contact your Customer Success Manager (CSM) or Account Executive (AE).\n\nRequirements\n--------------\n\nYou must have admin-level access to download the DomoStats Activity Log App from the Appstore.\n\n\n Using the DomoStats App\n-------------------------\n\nYou can use the pre-built dashboard or build any of your own content using the DomoStats DataSets in the Data Center. When you first download the app, a new page is created titled DomoStats - Activity Log. You'll need to power up the dashboard with the following steps:\n\n. Navigate to the\n **DomoStats - Activity Log**\n page.\n2. Select\n **Connect Data**\n .\n3. In the drop-down, select\n **Connect**\n to connect the page to the DomoStats DataSets or select\n **Assign**\n if you want to assign another Domo user to set up the data.\n4. In the last window, select\n **Connect**\n .\n5. The pre-built dashboard is now powered up and ready to use.\n\nThe dashboard\n---------------\n\n\n###\n Data\n\nThe following data is included in the download of the DomoStats - Activity Log app and can be found in the Data Center as a 'DomoStats' type DataSet.\n\n\n DataSets include:\n\n People\n* Activity Log\n\nDataFlows include:\n\n Activity Log - User Inactivity\n\n*Note:**\n All DataSets powering the app run once a day. Runtime is every 24 hours from when the app is first deployed. While the run frequency cannot be changed, you can edit the runtime in the DataSet settings. For more information on how to schedule DataSets, see\n\nDataSet Scheduling\n\n.\n\n\n###\n Cards\n\nThe following cards are included in the pre-built dashboard.\n\n  |  |  |\n| --- | --- | --- |\n| **Collection**  | **Card**  | **Description**  |\n|\n Users\n  |\n Distinct User Logins\n  |\n Distinct user logins over time.\n  |\n|\n Login Rate - Last 14 Days\n  |\n Percentage of users that logged into Domo during the given time period. The default date range is set to the last 14 days but can be adjusted.\n  |\n|\n Daily User Logins\n  |\n Total number of logins per day.\n  |\n|\n Most Active Users\n  |\n Most active users based on the number of actions they've taken.\n  |\n|\n User Inactivity\n  |\n Sorts users based on the length of time since their last login.\n  |\n|\n Zero Logins\n  |\n Displays the users that have been invited to Domo, but have yet to login.\n  |\n|\n Failed Logins\n  |\n Number of failed logins over time.\n  |\n|\n Password Resets\n  |\n Top users based on the number of times they've reset their password.\n  |\n|\n User Action Log\n  |\n Tracks every user action in your Domo instance.\n  |\n|\n Login Trend\n  |\n Tracks total logins over time.\n  |\n|\n Content\n  |\n Top 10 Favorited Cards\n  |\n Titles of the top 10 most favorited cards.\n  |\n|\n Card Detail Views Trend\n  |\n Shows the trend of card detail views over time.\n  |\n|\n Card Detail Views by User\n  |\n Number of card detail views and the distinct number of users who have viewed each card.\n  |\n|\n Top 10 Most Viewed Card\n  |\n Top 10 cards with the most detail views and counts the total number of detail views for each.\n  |\n|\n Top 10 Card Viewers\n  |\n Top 10 viewers based on their total number of card detail views.\n  |\n|\n Top 25 Card Creators\n  |\n 25 users that have created the highest number of cards.\n  |\n|\n Page Views Trend\n  |\n Trend of page views over time.\n  |\n|\n Page Views by User\n  |\n Number of times each page has been viewed and the number of distinct users who have viewed the page.\n  |\n|\n Top 10 Most Viewed Pages\n  |\n Top 10 most viewed pages, and the total view count for each.\n  |\n|\n Top 10 Page Viewers\n  |\n Top 10 viewers based on total page views.\n  |\n|\n Top Page Creators\n  |\n Shows the 25 users who have created the most cards.\n  |\n|\n App Deployment Trend\n  |\n Shows the trend of app deployments over time.\n  |\n|\n Top Apps Deployed\n  |\n Displays the apps that have been deployed, the users that have deployed the apps, and the number of times each app has been deployed.\n  |\n|\n Data\n  |\n Datasource Creation\n  |\n Tracks the number of datasources created over time, organized by creator.\n  |\n|\n DataFlow Creation\n  |\n Tracks the number of DataFlows created over time, organized by creator.\n  |\n|\n Datasource Edits\n  |\n Displays the amount of datasource edits in the specified time frame, grouped by edit type.\n  |\n|\n DataFlow Edits\n  |\n Displays the amount of DataFlow edits in the specified time frame, grouped by edit type.\n  |\n|\n Top Beast Mode Creators\n  |\n The users that have created the most calculated fields in the specified time frame.\n  |\n|\n Top Datasource Creators\n  |\n Top 15 users that have created the most datasources in the specified time frame.\n  |\n|\n Top DataFlow Creators\n  |\n Users that have created the most DataFlows in the specified time frame.\n  |\n|\n Time Since Last Update\n  |\n Tracks the number of datasources bucketed by the number of days since their last update.\n  |\n|\n Datasource Creation Log\n  |\n Displays datasource and DataFlow creation events over time.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042934594\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003041\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDomoStats - Activity Log\n\n", "article_total_view_count": "\n\n\n 5,622\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:05 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "domostats__activity_log", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "governance_tools", "url": "/s/topic/0TO5w000000ZannGAC"}]}