{"file_path": "../../raw_kb_v2\\article\\4415826269335\\index.html", "content": {"Title": "Governance Toolkit: DataSet Sharing", "Article Body": "Intro\n                       \n\n                        The Virtual DataSet Sharing Toolkit allows for a user to share a DataSet from one Domo instance to another. The DataSet created on the second instance is a virtual DataSet. Virtual DataSets are DataSets linked to the original DataSets, receiving new data and schema changes in real-time as the primary DataSet receives them.\n                       \n\n                        Alongside Domo Sandbox, this will allow for DataSets to be shared from the Prod instance down into the Dev or Testing instance.\n                       \n\n                        Accessing the toolkit\n                       \n\n                        The\n                        \n                         Governance Toolkit\n                        \n                        can be found in the\n                        \n                         Admin\n                        \n                        section of Domo, under\n                        \n                         Governance\n                        \n                        then\n                        \n                         Toolkit\n                        \n                        .\n                        \n\n                         https://{INSTANCE}.domo.com/admin/governance-toolkit/virtual-dataset-sharing\n                        \n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If the tool you wish to use is not enabled, please reach out to your Account Executive.\n                          \n\n\n\n\n                        If you are unable to find the Toolkit, ensure your user role has the\n                        \n                         required grants\n                        \n                        .\n                       \n\n\n\n\n                        The default view of the Virtual DataSet Sharing tool will be a list of existing DataSet sharing jobs.\n                        \n\n\n\n\n\n                        Required Grants\n                       \n\n                        To access the Governance Toolkit a user will need 1 of 2 grants enabled for a user. Grants can be added to a custom user role. By default the Administer Custom Pipeline Process grant is enabled for Admin users.\n                       \n\n\n                         Create Custom Pipeline Processes\n                         \n\n                           This grant will allow a user to create, update, share and delete jobs.\n                          \n\n                           This grant will only allow a user to see jobs that they created or jobs that have been shared with them.\n                          \n\n\n\n                         Administer Custom Pipeline Processes\n                         \n\n                           This Grant will allow a user to create, update, share and delete jobs.\n                          \n\n                           this grant will allow a user to see all jobs\n                          \n\n\n\n\n                        To learn more about custom roles and grants see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n                        Creating a job\n                       \n\n                        A job is a configuration of one destination instance and any number of DataSets to be shared.\n                       \n\n\n                         Click the\n                         \n                          + New Job\n                         \n                         button in the top right-hand side of the tool.\n                        \n\n                         Name your job.\n                        \n\n                         (Optional) Add a description of your job.\n                        \n\n                         (Optional) Enter the url for the destination Domo instance.\n                         \n\n                           This option may not be available in all customer instances and is therefore not required.\n                          \n\n                           I.E.\n                           \n                            instance.domo.com\n                           \n\n\n\n\n                         Select the DataSet Copy account that contains the developer token and instance url for your destination instance.\n                         \n\n                           An account must be set up prior to creating a job.\n                          \n\n                           To create an account:\n                           \n\n                             Navigate to:\n                             \n\n                               https://{\n                              \n                              source instance}.\n                              \n                               domo.com/datacenter/accounts\n                              \n\n\n\n                             At the top right click\n                             \n                              Add New\n                             \n                             then\n                             \n                              Account\n                             \n                             .\n                            \n\n                             Search for the account type\n                             \n                              DataSet Copy\n                             \n                             .\n                             \n\n\n\n\n\n\n                                  Note:\n                                 \n                                 Use the second DataSet Copy Account.\n                                \n\n\n\n\n\n\n\n\n                             Enter URL to the destination Domo instance.\n                             \n\n\n\n\n\n\n                                  Note:\n                                 \n                                 The account asks for the domain, but we need the entire URL to the instance. I.E.\n                                 \n                                  instance.domo.com\n                                 \n\n\n\n\n\n\n\n\n\n                             Create an Access Token for an Admin user in the destination instance. (Where you will be sending the data.)\n                            \n\n                             Enter the Access Token into the account.\n                             \n\n                               For information on creating/managing access tokens, see\n                               \n                                Managing Access Tokens\n                               \n                               .\n                               \n\n\n\n\n\n\n                                    Note:\n                                   \n                                   Virtual DataSets will be created by the user that the token was generated for.\n                                  \n\n\n\n\n\n\n\n                             (Optional) Rename the account.\n                            \n\n\n                              Save\n                             \n                             the account.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n                         Click\n                         \n                          Next\n                         \n                         .\n                        \n\n                         Select the\n                         \n                          DataSets you wish to share with the destination instance.\n                          \n\n\n\n\n\n\n                         Click\n                         \n                          Next\n                         \n                         .\n                        \n\n                         Map the PDP accounts you wish to use to restrict data access in the destination instance.\n                         \n\n\n\n\n\n\n                              Note:\n                             \n                             This process requires PDP to be enabled on the source DataSet and the PDP policy in place. The\n                             \n                              All rows\n                             \n                             policy is created by default and can be used in this tool. However, you still MUST enable PDP for this to work.\n                            \n\n\n\n\n\n                           The destination DataSet will use the PDP policy selected to restrict data access in the destination instance.\n                           \n\n\n\n\n\n\n\n                         Click\n                         \n                          Submit Changes\n                         \n                         .\n                        \n\n\n                        This will save your job and create the DataSets in the destination instance.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           Once the job is created there is nothing you need to do to keep the DataSet in the destination up to date. Any changes to the parent instance will be immediately seen in the destination DataSet.\n                          \n\n\n\n\n                        Deleting a job\n                       \n\n                        When you delete a job, it will also delete the DataSets in the destination DataSet.\n                       \n\n                        Common Issues\n                       \n\n\n                         No data in the DataSet.\n                         \n\n                           Check to ensure PDP is enabled on the parent instance.\n                          \n\n\n\n\n                        FAQ\n                       \n\n\n                         Can I have multiple jobs?\n                        \n\n\n                        Yes, you can have any number of jobs with one or many DataSets.\n                       \n\n\n                         Do Virtual DataSets inherit tags and descriptions from the source DataSet?\n                        \n\n\n                        No, the Virtual DataSets do not inherit tags and descriptions from the source DataSet.\n                       \n\n\n                         Will these virtual DataSets be available in ETL jobs?\n                        \n\n\n                        Yes, if the Beta feature allowing virtual DataSets to be used in ETL jobs is enabled. You can request this through the Domo Beta process.\n                       \n\n\n                         How do I get support for this tool?\n                        \n\n\n                        Email\n                        \n                         sandbox@domo.com\n                        \n                        .\n                       \n\n\n                         Is there a fee for this tool?\n                        \n\n\n                        This tool is available to Sandbox Customers and Sandbox Trial Customers. If the customer’s trial ends and they haven’t purchased Sandbox, their use of this tool will be removed (no existing virtual DataSets will be deleted.)", "Preview Article": "Click here to preview", "URL Name": "4415826269335", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003029", "Archived Date": "", "Language": "English", "Primary Version": "Governance Toolkit: DataSet Sharing", "Article Total View Count": "5,414", "": "", "Article Created Date": "10/24/2022, 9:04 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Governance Toolkit: DataSet Sharing\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Governance Tools\n              \n", "url": "/s/topic/0TO5w000000ZannGAC"}]}