{"file_path": "../../raw_kb_v2\\article\\4423762260375\\index.html", "content": {"Title": "Domo Bricks", "Article Body": "Intro\n                       \n\n                        Domo Bricks (formerly DDX Bricks) are pre-built objects that allow you to create advanced visualizations and apps that can be customized by simply copying and pasting code.\n                       \n\n                        With Domo Bricks, business users, citizen developers, and full-stack developers can quickly iterate, prototype, and compose new apps with beautiful and advanced features. You can choose from Bricks available in the Domo Appstore. You can also use Domo Bricks to render a new library you found online by copying and pasting.\n                       \n\n                        Domo Bricks let you use HTML, CSS, and JS to completely customize your app. These new custom solutions visuals are immediately rendered and can be easily updated all within your Domo instance.\n                       \n\n                        You can find Domo Bricks in the Appstore.\n                       \n\n\n\n\n                        Prerequisites\n                       \n\n                        To start using Domo Bricks you need the following:\n                       \n\n\n                         A Domo account.\n                        \n\n                         Permission to create an app from the Appstore.\n                        \n\n                         Understanding of how to work with Domo DataSets (for example how to build a card from a DataSet.)\n                        \n\n                         A basic understanding of HTML, CSS, and JS is useful to fully customize Domo Bricks.\n                        \n\n\n                        For information on implementing Domo Bricks, see our\n                        \n                         developer docs\n                        \n                        .\n                       \n\n\n                         Video - Domo Bricks Pendo Guide", "Preview Article": "Click here to preview", "URL Name": "4423762260375", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005012", "Archived Date": "", "Language": "English", "Primary Version": "Domo Bricks", "Article Total View Count": "3,638", "": "", "Article Created Date": "11/2/2022, 8:16 PM", "First Published Date": "11/2/2022, 8:37 PM"}, "title": "\n              Domo Bricks\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Explore the Appstore\n              \n", "url": "/s/topic/0TO5w000000ZaoMGAS"}]}