{"file_path": "../../raw_kb_v2\\article\\360043435453\\index.html", "content": {"Title": "Netatmo Connector", "Article Body": "Intro\n                       \n\n                        Netatmo provides online interfaces and APIs for interacting with and managing its internet-connected devices, such as cameras, thermostats and weather stations. Use Domo's Netatmo connector to retrieve public weather data, device listings, and so on. To learn more about the Netatmo API, visit their page (\n                        \n                         https://dev.netatmo.com/\n                        \n                        ).\n                       \n\n                        You connect to your Netatmo account in the Data Center. This topic discusses the fields and menus that are specific to the Netatmo connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Netatmo account and create a DataSet, you must have a Netatmo username and password.\n                       \n\n                        Connecting to Your Netatmo Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Netatmo Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Netatmo connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Netatmo accounts in Domo) to open the Netatmo OAuth screen where you can enter your Netatmo username and password. Once you have entered valid Netatmo credentials, you can use the same account any time you go to create a new Netatmo DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Netatmo when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Netatmo.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Netatmo report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Enterprise - Partner Devices\n                              \n\n                               Retrieves a list of devices associated with your Enterprise application.\n                              \n\n\n\n                               Measurements\n                              \n\n                               Retrieves selected measurements for weather station or thermostat devices or modules.\n                              \n\n\n\n                               Weather - Public Data\n                              \n\n                               Returns public weather data for a geographic area between the given northeast and southwest coordinate.\n                              \n\n\n\n                               Weather Stations - Data\n                              \n\n                               Returns data from your weather station device(s).\n                              \n\n\n\n                               Welcome - Home Data\n                              \n\n                               Returns information about users' homes and cameras.\n                              \n\n\n\n                               Welcome - Home Data - Cameras\n                              \n\n                               Returns home data, including a list of cameras.\n                              \n\n\n\n                               Welcome - Home Data - Persons\n                              \n\n                               Returns home data, including a list of persons.\n                              \n\n\n\n\n\n\n\n                           Device\n                          \n\n                           Select the ID of the device you want to retrieve data for.\n                          \n\n\n\n                           Scale (Aggregation)\n                          \n\n                           Select how you want your report data to be aggregated.\n                          \n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n                           Latitude Northeast\n                          \n\n                           Enter the latitude of the northeast corner of the requested area. This should be an integer between -85 and 85 degrees.\n                          \n\n\n\n                           Longitude Northeast\n                          \n\n                           Enter the longitude of the northeast corner of the requested area. This should be an integer between -180 and 180 degrees.\n                          \n\n\n\n                           Latitude Southwest\n                          \n\n                           Enter the latitude of the southwest corner of the requested area. This should be an integer between -85 and 85 degrees.\n                          \n\n\n\n                           Longitude Southwest\n                          \n\n                           Enter the longitude of the southwest corner of the requested area. This should be an integer between -180 and 180 degrees.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043435453", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003373", "Archived Date": "", "Language": "English", "Primary Version": "Netatmo Connector", "Article Total View Count": "2,368", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Netatmo Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}