{"file_path": "../../raw_kb_v2\\article\\360042934914\\index.html", "content": {"Title": "Viewing a User's Domo Score", "Article Body": "A user's Domo Score can be viewed in his or her\n                        \n                         Profile\n                        \n                        page. This is a value that represents a user's total influence in his or her company, based on a calculation determined from a number of attributes. These attributes include the following:\n                       \n\n\n\n\n\n                            Attribute\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Messages\n                           \n\n\n\n                            The number of Buzz messages this user has sent. For more information about Buzz, see\n                            \n                             Buzz\n                            \n                            .\n                           \n\n\n\n\n\n                            Favorites\n                           \n\n\n\n                            The number of cards this user has added as Favorites. For more information about Favorites, see\n                            \n                             Adding Cards as Favorites\n                            \n                            .\n                           \n\n\n\n\n\n                            Followers\n                           \n\n\n\n                            The number of users following this user. For more information about following, see\n                            \n                             Following a User in Domo\n                            \n                            .\n                           \n\n\n\n\n\n                            Likes\n                           \n\n\n\n                            The number of Buzz conversations initiated by this user, comments made by the user, and user tasks, photos, and statuses that others have \"liked.\"\n                           \n\n\n\n\n\n                            Invitations\n                           \n\n\n\n                            The number of invitations to join Domo this user has sent. For more information about inviting others to join Domo, see\n                            \n                             Inviting Others to Join Domo\n                            \n                            .\n                           \n\n\n\n\n\n                            Profile Completeness\n                           \n\n\n\n                            The percentage of Profile features this user has added, such as personal information, photos, social network connections, etc.\n                           \n\n\n\n\n\n                        Based on the user's total Domo Score, the image that appears next to the Domo Score may appear as an egg, a chick, a rooster, or a fighting rooster.\n                       \n\n\n\n\n                        Your Domo Score is impacted by all of the following:\n                       \n\n\n\n                          The completeness of your profile.\n                         \n\n\n\n                          The number of invitations to join Domo you have sent.\n                         \n\n\n\n                          The number of Buzz messages you have sent.\n                         \n\n\n\n                          People adding your cards as Favorites.\n                         \n\n\n\n                          People \"liking\" your content.\n                         \n\n\n\n                          The position of people who like or subscribe to your content. For example, your CEO liking a piece of content impacts your score more than someone lower in your organization liking the same content.\n                         \n\n\n\n                          The position of people you have Buzz conversations with.\n                         \n\n\n\n                          The passage of time. For example, if you go for an extended period without engaging in a Buzz conversation, your Domo Score may drop.\n                         \n\n\n\n                        The score is calculated once a day.\n                       \n\n\n                         To see a user's Domo Score,\n                        \n\n\n\n\n                          Navigate to that user's\n                          \n                           Profile\n                          \n                          page by clicking that user's profile picture anywhere it appears. If you want to see your own Domo Score, you can access your personal\n                          \n                           Profile\n                          \n                          page by clicking your profile picture in the top right corner of the screen. (If you have not yet selected a profile picture, a\n                          \n                          icon appears instead.)\n                          \n                          The user's Domo Score can be found in the profile header, in the center of the radiating lines (the \"hub of the wheel\") on the left side (see the preceding screenshot).", "Preview Article": "Click here to preview", "URL Name": "360042934914", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004382", "Archived Date": "", "Language": "English", "Primary Version": "Viewing a User's Domo Score", "Article Total View Count": "4,722", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Viewing a User's Domo Score\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}