{"file_path": "../../raw_kb_v2\\article\\360042926294\\index.html", "content": {"title": "\n\n\n Connector FAQs and Troubleshooting\n\n\n", "article_body": "\n\nFAQs\n------\n\n\n#####\n Is there an easy way to capture the current state of a DataSet and copy it into a new, independent DataSet?\n\nThere are 3 solutions to this problem:\n\n Use Domo's DataSet Copy Connector. This Connector lets you copy DataSets within your instance or across instances. You will need a username, password, access token, and DataSet ID to create a copy of the DataSet. You may need to work with your MajorDomo to generate an access token for your instance. For more information about this Connector, see\n\nDataSet Copy DataSet Connector\n\n.\n* Set your DataFlow to just append rows. You will then get a \"snapshot\" for each time the DataSet updates. This will lead to a lot of duplicate data, which you can easily filter out for analysis by filtering on either \\_BATCH\\_ID\\_ (a running counter of how many times that DataSet has been updated) or \\_BATCH\\_LAST\\_RUN\\_ (the date field of the last update time). Any analysis using a filter on these would always use the same data and you would have the bonus of getting a snapshot every day. So the DataSet would change, but any new data added would not affect your snapshot.\n* Recreate the Connector configuration with the \"Append\" setting and you will have a completely independent DataSet (not just one connected in a DataFlow). (If you simply change the update settings of the existing Connector, you will have to filter for the most recent batch in all connected Cards so you do not get inflated numbers.)\n\n\n#####\n Is it possible to \"snapshot\" data on a daily basis to run point-in-time reports?\n\nYes. Domo lets you create \"append chains\" across DataSets in order to snapshot. To do this, when configuring the\n **Update Settings**\n for the Connector, simply select\n **Append**\n instead of\n **Replace**\n . From there, you can use the \"BATCH\\_LAST\\_RUN\" value (a column Domo adds when a DataSet runs) as your snapshot date.\n\n\n Note that by taking this approach, you must be careful when using this DataSet for non-snapshot use cases since it automatically counts all historical values instead of the latest snapshot. You can run this kind of DataSet through an ETL or SQL DataFlow to add a \"Latest\" column that flags the records that came in as part of the last run. You can then use that column as a filter for Cards that satisfy a current, not snapshot, use case.\n\n####\n I am not seeing a particular field (column) in a report when I import data using a certain Connector. Can Domo add this field for me?\n\nIf you would like to have a certain field, value, etc. added to a Connector, you can submit an enhancement request to our Product team using the\n **Feedback**\n option in the\n **More**\n menu in your Domo instance and let them know which field you would like added to the Connector. Our Product team reviews every enhancement request submitted this way and will contact you if the field can indeed be added.\n\n####\n I can't find a Connector I need in the Domo Appstore. Can I build a custom Connector?\n\nDomo has hundreds of pre-built Connectors and is always adding more to the list. In the event that you find yourself needing to get data into Domo from a system or writeback data from Domo to a system, and a Connector for this purpose does not already exist, contact your Account Executive or Customer Success Manager to discuss the option of creating a new Connector or updating an existing Connector.\n\n\n If you're a little more technical, you can use our Connector IDE to build your own to any custom Connector. To get started, see our\n\nDeveloper Portal\n\n. For a list of all of our third-party custom Connectors currently available, see\n\nAvailable Custom Connectors\n\n.\n\n####\n Is it possible to refresh my data faster than every 15 minutes?\n\nYes, in order to do this, please reach out to your account team for evaluation.\n\n####\n Is there a limit to the number of columns that can be imported using a Connector?\n\nYes, Connectors allow for up to 1,500 columns in a DataSet.\n\n\n General Troubleshooting\n-------------------------\n\nIf one of your Connectors stops working, we recommend that you first try to discover and resolve the error yourself by doing the following:\n\n. Select\n **Data**\n in the toolbar at the top of the screen.\n2. Select\n **DataSets**\n in the left-hand menu.\n3. Search for the broken DataSet.\n\n\n Broken DataSets are indicated using a red exclamation point icon, while DataSets that need attention are indicated using an orange exclamation point icon. You can filter to show all of the broken DataSets in your instance by clicking\n **Add Filter**\n , selecting\n **Status**\n , then choosing the desired status.\n\n. In the details view of this DataSet, select the\n **History**\n tab.\n\n\n At this point, you should be able to see a running list of scheduled updates and which updates were successful or failed.\n5. In the right-hand\n **Result**\n column, identify the error message(s) associated with the failed update(s).\n\n\n Some of these messages provide you with information that you can act on to resolve the error and get the Connector working again, as in this example.\n\nHowever, if the error is not an issue that you can resolve on your own, contact Domo Support.\n\nFor information on how to contact Support, please see\n\nGetting Help\n\n.\n\nTroubleshooting Specific Errors\n---------------------------------\n\n\n#####\n Cloudflare is preventing me from connecting.\n\nIf you have Cloudflare running, be aware that this may prevent the Domo Connector from connecting to your server. If this is the case, you will need to configure Cloudflare to allow access to the Connector. This page explains how to do this:\n\nhttps://support.cloudflare.com/hc/en-us/articles/200171806-Error-1010-The-owner-of-this-website-has-banned-your-access-based-on-your-browser-s-signature\n\n\n#####\n I get the error message \"FTP is not supported\" when configuring the CSV Advanced/XML Advanced/JSON Connector.\n\nDue to security concerns, Domo no longer permits uploading data using FTP. If necessary, please update your server settings to support SFTP instead of FTP.\n\n####\n I've configured my Netsuite connection correctly as shown in\n\nConnecting to NetSuite Data in Domo\n\n, but I keep getting an \"Unexpected Error\" message.\n\nCheck your Netsuite column names for invalid characters such as apostrophes, quotation marks, backslashes, etc.\n\n\n Connector Best Practices\n--------------------------\n\n\n* Know your data. Have a vision for the data you expect to pull and how it will be used.\n* Think about the range of data, and pull in data according to what you will use. Only bring in the data you need.\n* Think about scheduling, especially with regards to the following:\n\n+ How is the data structured?\n\t+ How will the data be viewed?\n\t+ Be mindful of resources (look at associated DataSets).\n\t+ Remember data runs in UTC time!\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042926294\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003956\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nConnector FAQs and Troubleshooting\n\n", "article_total_view_count": "\n\n\n 5,433\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "connector_faqs_and_troubleshooting", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "general_connect_info", "url": "/s/topic/0TO5w000000ZaoyGAC"}]}