{"file_path": "../../raw_kb_v2\\article\\360043433073\\index.html", "content": {"title": "\n\n\n Xero Payroll Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nXero is a cloud-based online accounting software platform for small and medium-sized businesses. It manages invoicing, bank reconciliation, bookkeeping & more. Xero enables you to automate everyday business tasks, get up-to-date financials, and run your business - from wherever you are. Use Domo's Xero - Payroll connector to get employee details, timesheets, pay items, pay runs, and more. To learn more about the Xero API, visit\n\nhttps://developer.xero.com/documentation/api/api-overview\n\n.\n\n\n You connect to your Xero account in the Data Center. This topic discusses the fields and menus that are specific to the Xero Payroll connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Xero account and create a DataSet:\n\n First, you need to select the API you'd like to connect to\n* Then, you need the email address and password you use to log into your Xero account\n\nConnecting to Your Xero Account\n---------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the\n\nXero Payroll\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\nThe Domo Xero Payroll connector uses OAuth to connect, so there is no need to enter credentials within Domo. After selecting the Scope, click\n ****Connect****\n (or select\n ****Add Account****\n if you have existing Xero accounts in Domo) to open the Xero OAuth screen where you can enter your Xero credentials. Once you have entered valid Xero credentials, you can use the same account any time you go to create a new Xero Payroll DataSet. You can manage connector accounts in the\n ****Accounts****\n tab in the Data Center.\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Scope\n  |\n Select the API you would like to connect to.\n  |\n\n\n Once you have entered valid Xero credentials, you can use the same account any time you go to create a new Xero Payroll DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n**Note:**\n\nYou can only have one Xero account authenticated at a time with a given set of credentials. If you try to use OAuth with Xero anywhere else, it will invalidate your Xero account in Domo.\n\nIf you are already logged into Xero when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Xero.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Xero Payroll report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Employees\n  |\n Returns a list of employees in the Xero organization.\n  |\n|\n Leave Applications\n  |\n Returns a list of leave applications in the Xero organization.\n  |\n|\n Pay Items\n  |\n Returns a list of payroll items in the Xero organization.\n  |\n|\n Pay Runs\n  |\n Returns a list of pay runs in the Xero organization.\n  |\n|\n Payroll Calendars\n  |\n Returns a list of payroll calendars in the Xero organization.\n  |\n|\n Payslip\n  |\n Returns the pay-slip information for a particular person in the Xero organization.\n  |\n|\n Timesheets\n  |\n Returns a list of the payroll timesheet in the Xero organization.\n  |\n\n|\n|\n Modified Date Filter\n  |\n The modified date filter returns the data created or modified after the selected date. Select the modified date using relative or specific dates.\n  |\n|\n Select Specific Modified  Date\n  |\n Select the modified date using the date selector.\n  |\n|\n Day Back To Start From\n  |\n Enter the number of days back that you would like to get data for.\n  |\n|\n Pay Run Duration\n  |\n Select the pay run duration to fetch the pay slip ID.\n  |\n|\n Owner Name\n  |\n Select the pay-slip owner name to fetch the pay-slip data.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433073\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003609\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nXero Payroll Connector\n\n", "article_total_view_count": "\n\n\n 2,372\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "xero_payroll_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}