{"file_path": "../../raw_kb_v2\\article\\360056669354\\index.html", "content": {"Title": "Workbench 5.1", "Article Body": "Intro\n                       \n\n                        Domo Workbench is a secure, client-side solution for uploading your on-premise data to Domo.\n                       \n\n                        Use Workbench 5.1 to routinely upload data from external DataSets (ODBC, CSV, Microsoft Excel, Jira, QuickBooks, XML, and JSON) to Domo. You can also secure network communication using a proxy server, manage scheduled jobs, add columns based on calculations, transform columns using regular expressions.\n                       \n\n                        What You Need to Get Started\n                       \n\n\n\n\n                           Download\n                          \n                          Domo Workbench\n                          \n                           from the\n                           \n                            Tool Downloads\n                           \n                           menu in\n                          \n\n                           the\n                           \n                            Admin Center\n                           \n                           .\n                          \n\n\n\n\n                        What can Domo Workbench 5.1 do?\n                       \n\n\n                         Securely upload DataSets to Domo using helpful interface components.\n                        \n\n                         Upload data manually or on a schedule.\n                        \n\n                         Create groups of DataSet jobs that run on the same schedule.\n                        \n\n                         Import and export job files.\n                        \n\n                         Preview and validate jobs before you run them.\n                        \n\n                         Add, create, save, and delete accounts.\n                        \n\n                         Add, create, save, delete, open, preview, and cancel jobs.\n                        \n\n                         Revert to a previous version of a job you saved.\n                        \n\n                         Add/delete transforms to/from jobs, which includes the following:\n                         \n\n                           Add new columns.\n                          \n\n                           Change date format.\n                          \n\n                           Encrypt sensitive data in specific columns.\n                          \n\n                           Filter columns in the DataSet.\n                          \n\n                           Set the time zone for the DataSet job.\n                          \n\n                           Replace column values in the DataSet.\n                          \n\n                           Combine the DataSet with another DataSet.\n                          \n\n\n\n                         Export/import Excel, CSV, QuickBooks, OLAP, ODBC, JSON, and XML file types.\n                        \n\n                         View logs.\n                        \n\n                         Send logs as a zip file.\n                        \n\n                         Run logs from the command line.\n                        \n\n                         Add and manage plugins for using Workbench.\n                        \n\n                         Set up notifications for DataSet jobs that can email you if DataSets are uploaded successfully or if it experiences an error.\n                        \n\n\n                        Creating a Job for Uploading Data Using Workbench 5.1\n                       \n\n                        You can upload data from external data sources to Domo after specifying connection and data information as a job, which you can save and use again.\n                        \n                        Creating a DataSet job in Workbench 5.1:\n                       \n\n\n                         In the\n                         \n                          Jobs\n                         \n                         pane, click the\n                         \n                          +\n                         \n                         icon to create a new job.\n                         \n\n\n\n\n\n                         Specify the basic settings for the job, such as the DataSet job name, the method of data transport (such as Local File Provider, ODBC Connection Provider, etc.), the data reader (data source) type (such as JIRA, Excel, etc.), the DataSet name and type, and an optional DataSet description.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              The DataSet name is the only setting you can change after creating the job. If you want to change any other settings, you will need to create a new job.\n                             \n\n\n\n\n\n\n                         After providing the details, click\n                         \n                          Create\n                         \n                         . A newly added job entry will appear in your jobs listing. However, at this stage, the DataSet Job is still not ready for execution.\n                        \n\n\n                        Configuring and Scheduling your job\n                       \n\n\n                         In the\n                         \n                          Configure\n                         \n                         subtab for the job:\n                         \n\n                           Provide the source of the data in the\n                           \n                            Source\n                           \n                           menu. For example, if the data source was a local file, you would select the file path here.\n                           \n\n\n\n\n\n                           You can choose whether you want newly uploaded data to REPLACE the existing data in the DataSet or be APPENDED (added) to the existing data. You do this in the\n                           \n                            Update method\n                           \n                           menu.\n                          \n\n                           You can specify the error handling method, and the job run duration and conditions in the\n                           \n                            Advanced Settings\n                           \n                           . This section provides the advanced options for how your job uploads data in Domo.\n                          \n\n\n\n                         You can schedule a DataSet job to routinely upload data from external DataSets to Domo. You can select a\n                         \n                          Basic Schedule\n                         \n                         (update manually, update when file is changed, or update on a schedule.) Or, you can opt for an\n                         \n                          Advanced Schedule\n                         \n                         (once a day, specific days of the week/month, etc.) You can also select the\n                         \n                          Schedule mode\n                         \n                         to be in\n                         \n                          Local time\n                         \n                         (of your server/Workbench machine) or\n                         \n                          UTC time\n                         \n                         . You can also see the next five scheduled run times for the job.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             To automatically account for Daylight Savings in your Workbench scheduling, select\n                             \n                              Local time\n                             \n                             . When the time on your machine changes for Daylight Savings, the Workbench job schedule will automatically sync with the time on your machine.\n                            \n\n\n\n\n\n                         Click the\n                         \n                          Save\n                         \n                         button to save your changes.\n                        \n\n\n                        Schema Protections for your job\n                       \n\n                        To further improve the robustness of Data Pipelines, Domo has update schema protections in Workbench. With these improvements you can choose columns you want to protect and unprotect from schema changes, and choose between three different options about how you want the job to behave.\n                       \n\n\n                         Video - Introduction to Schema Improvements in Workbench 5.1\n                        \n\n\n\n\n\n\n                        Schema Protection Types\n                       \n\n                        Domo Workbench 5.1 offers three different schema protection types.\n                       \n\n\n                         Allow schema changes safely.\n                        \n\n                         Permit unprotected schema changes.\n                        \n\n                         Completely block all schema changes.\n                        \n\n\n\n                         Video - Deep Dive on the Three Schema Options in Workbench 5.1\n                        \n\n\n\n\n\n\n                        Allow safe schema changes\n                       \n\n                        If you select this option, the unprotected columns will accept the changes during the next execution, and will automatically be re-protected afterwards.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            They are only re-protected if schema changes. If the schema does not change, the columns will remain unprotected until it changes.\n                           \n\n\n\n\n\n                        New columns will be added, and will automatically be protected in future runs. The “Allow safe schema changes” option is the default setting for new jobs.\n                       \n\n                        Allow unprotected schema changes\n                       \n\n                        If you choose to allow unprotected schema changes, columns will remain unprotected after the job is executed and any new columns added will automatically be added as unprotected columns.\n                       \n\n                        Block all schema changes\n                       \n\n                        If you choose to block all schema changes, you will not see the Protect option for your columns. If you attempt to make changes to any column and run the job, you will receive an error stating about your forceful change.\n                        \n\n\n\n\n                        Protect column\n                       \n\n                        The Protect column indicates whether your column (data field) is protected or not when schema changes happen to your job.\n                       \n\n\n                         If the Protect checkbox is selected for a column, it means that column is protected, and no schema changes can be made. If you try to remove the protection for any column (by unchecking it) the Domo Workbench will give you a warning. Unchecking the Protect column checkbox will allow schema changes to be made for that specific column.\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Unprotected columns can be changed and deleted, which may break content in Domo.\n                           \n\n\n\n\n\n\n\n\n\n                         The Protect column provides you a control to protect or unprotect all columns with a single click. Select the checkbox next to the column header (Protect) to protect all your columns at once. Similarly, you can unprotect your columns at the same time by deselecting this checkbox.\n                         \n\n\n\n\n\n\n                         The column header also provides the control to get a filtered view of protected, unprotected, or both type of entries with a single click.\n                         \n\n                           When you click to select the regular select view\n                           \n                           , the Protect column will display all protected entries.\n                          \n\n                           When you click to select the unchecked view\n                           \n                           , the Protect column will display the unprotected entries.\n                          \n\n                           When you click to select the mixed view\n                           \n                           , the Protect column displays both protected and unprotected entries together.\n                          \n\n\n\n                         You can change the names or properties for the Destination Column and the Data Type column, but in order for these changes to take effect, the column will need to be unprotected.\n                         \n\n\n\n\n\n                         Similarly, you cannot delete a protected column.\n                        \n\n                         If you want to allow the schema change, uncheck the column and re-run the job.\n                        \n\n\n                        Viewing the Error messages for your job run\n                       \n\n                        When a job errors due to a schema change, Workbench offers error message and color-coding in the schema tab to help you understand what changed in your schema. These error messages will help you to find the changes so you can decide whether to allow the schema change to happen by unprotecting the column, or to find the error in your data and fix it before re-running the job in Workbench.\n                       \n\n\n                         Video - Troubleshooting Changing a Data Type in Workbench 5.1\n                        \n\n\n\n\n\n\n\n                         Video - Troubleshooting Column Name Changes in Workbench 5.1\n                        \n\n\n\n\n\n\n                        Once you make changes to your schemas and run the job, the Workbench will show a notification in your Schema tab, and the changed columns will appear in the designated color codes.\n                       \n\n\n\n\n                        If any errors occurred during the job run, you can view these errors in the Overview Tab, Preview window, and Logs.\n                       \n\n                        Overview Tab\n                       \n\n                        Click on the Overview Tab to view the errors. Here, you can see execution status and the error messages received for your job run.\n                       \n\n\n\n\n                        Preview Window\n                       \n\n                        Click on the Preview\n                        \n                        button in your job view.\n                       \n\n\n\n\n                        The output window will appear showing the preview for errors for your job.\n                       \n\n\n\n\n                        Log viewer\n                       \n\n\n                         You can view a detailed log for your job run in the History Tab. This log displays the errors in detail as well.\n                        \n\n                         Click on the History Tab.\n                        \n\n                         Here, you will see options for viewing the job’s history from the DataSet and local logs for this job.\n                        \n\n                         Click the\n                         \n                          Open Log Viewer\n                         \n                         button.\n                         \n\n\n\n\n\n                        The Domo Workbench Log Viewer window will appear displaying the detailed log with error messages occurred.\n                       \n\n\n\n\n                        Protecting Data Types while changing Column Names\n                       \n\n\n                         Changing the name of a column in the Data Source\n                        \n\n\n                        If the name of the column is changed in the data source, the column is unprotected and the Data Type is locked, Workbench will remove the column with a changed name and add it as a new column with the new name. At this point, the column will be reindexed with the data type present in the column at the time it is reindexed.\n                       \n\n\n                         Changing the name of a column in the Destination Column of Workbench\n                        \n\n\n                        If you want to change the name of a column in Domo while protecting the data type from changing, it is possible with the new schema protection changes in Workbench.\n                       \n\n\n                         Video - Protecting Data Types while Changing column Names in Workbench 5.1\n                        \n\n\n\n\n\n\n                        In this example, you want to update the Warranty claims column name in the Destination Column, and the column has been unprotected. The lock data type column has been selected.\n                       \n\n\n\n\n                        The column has been updated with a new Destination column name “2020 Warranty claims”.\n                       \n\n\n\n\n                        In addition to Lock Data Type being selected, the error handling options you have chosen in the configuration tab will play a role in how Workbench responds to this configuration.\n                       \n\n\n\n\n                        If\n                        \n                         Abort job on invalid data error\n                        \n                        is the selected option for this job and invalid data is introduced, the job will fail because the data type is locked, even though the column is unprotected.\n                       \n\n                        If\n                        \n                         Skip entire row if it contains invalid data\n                        \n                        is selected for this job and invalid data is introduced, the job will succeed because the row of data will be skipped and not included in the data sent to Domo. The messaging included in the execution logs will indicate a row has been skipped, and the Data Type will remain the same:\n                       \n\n\n\n\n                        If\n                        \n                         Replace invalid cells with NULL value\n                        \n                        is selected the job will execute successfully and invalid values will be replaced with NULL, resulting is this messaging in the execution logs. The Data Type will remain unchanged:\n                       \n\n\n\n\n                        Taking over a Connector DataSet\n                       \n\n                        Domo Workbench allows you to import the Workbench DataSet as well as the Connector DataSet. Once you select your DataSet, it will be further maintained by the Workbench.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            You need to have Editor or Owner permissions on the DataSet to successfully take it over using the Domo Workbench.\n                           \n\n\n\n\n\n\n                         Video - Taking Over a Connector DataSet in Workbench 5.1\n                        \n\n\n\n\n\n\n                        To select your DataSet:\n                       \n\n\n                         Visit the Overview tab of your job, and click the\n                         \n                          Browse\n                         \n                         button next to your DataSet name. Note that, you can also change your DataSet name here if you wish.\n                         \n\n\n\n\n\n                         The DataSet picker window appears showing the available Workbench DataSets and Connector DataSets.\n                        \n\n                         Select the Connector DataSet tab.\n                        \n\n                         Here, select your connector DataSet, and click\n                         \n                          Select\n                         \n                         .\n                         \n\n\n\n\n\n                         As you chose to update the Connector DataSet through Workbench, you will receive a warning as below saying that the Workbench will take over the connector schedule and stop further updates from the Connector for this DataSet.\n                         \n\n\n\n\n\n                         Click\n                         \n                          Continue\n                         \n                         . You can click\n                         \n                          Cancel\n                         \n                         if you do not wish the Workbench to take over the connector schedule for the selected DataSet.\n                        \n\n                         Now, in the\n                         \n                          Overview\n                         \n                         tab, you can see your DataSet Name updated to the selected connector DataSet name.\n                        \n\n                         For this change to take effect, save the job.\n                         \n\n\n\n\n\n                        Bulk Actions on your DataSet jobs\n                       \n\n                        As you create multiple DataSets in Workbench, you can perform certain actions in group on your jobs like execute, preview, export, bulk edit, save, revert, and delete.\n                       \n\n\n\n\n                        In order to perform these bulk operations on your jobs, you can select all jobs, or selective jobs that you intend to make changes to.\n                       \n\n\n                         Video - Bulk Actions in Workbench 5.1\n                        \n\n\n\n\n\n\n                        Execute\n                       \n\n\n                         Select the desired jobs from your job list and perform a mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Execute\n                         \n                         . The\n                         \n                          Bulk Edit\n                         \n                         wizard will appear showing your bulk change request details.\n                        \n\n                         Confirm your request and click\n                         \n                          Continue\n                         \n                         .\n                         \n\n\n\n\n\n                         The progress bar will appear showing the job execution progress, and the output will be displayed in the output window.\n                         \n\n\n\n\n\n                         Click\n                         \n                          Finish\n                         \n                         .\n                        \n\n\n                        Preview\n                       \n\n\n                         You can preview your multiple jobs together using the Preview option.\n                        \n\n                         Select the desired jobs from your job list and perform a mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Preview\n                         \n                         .\n                        \n\n                         Select continue to execute the Preview.\n                        \n\n\n                        Export\n                       \n\n\n                         You can export your multiple jobs together to a local backup using this Export option.\n                        \n\n                         Select the desired jobs from your job list and perform a mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Export\n                         \n                         .\n                        \n\n                         Export jobs to a local backup window will appear.\n                        \n\n                         Click the … (3dots) and select the local path to save your jobs at and click\n                         \n                          Export Jobs\n                         \n                         .\n                         \n\n\n\n\n\n                         A success message will appear as your jobs are exported to the selected location.\n                        \n\n\n                        Bulk Edit\n                       \n\n\n                         You can make changes to your job settings, job notifications, provider settings, and reader settings for multiple jobs at a time.\n                        \n\n                         Select the desired jobs from your job list and perform a mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Bulk edit\n                         \n                         .\n                        \n\n                         Bulk Edit wizard will appear displaying the choices of changes you can make on jobs together.\n                        \n\n                         Select the desired option, and click\n                         \n                          Continue\n                         \n                         .\n                         \n\n\n\n\n\n                         Make the desired changes accordingly, and click\n                         \n                          Continue\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Back\n                         \n                         to choose another option. Click\n                         \n                          Cancel\n                         \n                         to cancel the operation.\n                        \n\n                         You can choose to save the jobs automatically after making the bulk changes.\n                        \n\n                         The progress bar will appear showing the job execution progress.\n                        \n\n                         Click\n                         \n                          Finish\n                         \n                         .\n                        \n\n                         Your job changes will reflect in the job list.\n                        \n\n\n                        Clearing a field using the Bulk Editor\n                       \n\n                        You can use the bulk editor to clear a field from multiple jobs at the same time. You need to select the Edit checkbox\n                        \n                        and leave the field blank next to it, that you want to clear.\n                       \n\n                        Let’s take an example where we try to clear the Source File Path provided for our data.\n                       \n\n\n                         Select the jobs from the job list that you want to make bulk changes to, and perform the mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Bulk edit\n                         \n                         .\n                        \n\n                         The Bulk Edit wizard will appear displaying the choices of changes you can make on jobs together. Here, select Edit provider settings and click\n                         \n                          Continue\n                         \n                         .\n                         \n\n\n\n\n\n                         Now, the Bulk Edit wizard will display the fields that you can clear for the selected jobs. Select the Edit checkbox\n                         \n                         and leave the File Path field blank next to it (as we want to clear the file path that was selected while configuring the job.) and click\n                         \n                          Continue\n                         \n                         .\n                         \n\n\n\n\n\n                         The Bulk Edit wizard will ask you for the change confirmation. Click\n                         \n                          Continue\n                         \n                         .\n                         \n\n\n\n\n\n                         The progress bar will appear showing the progress. Click\n                         \n                          Finish\n                         \n                         .\n                        \n\n                         Now, visit the\n                         \n                          Configure\n                         \n                         Tab of the jobs that you made changes to. You will see that the Source file path that you had selected earlier while configuring the job, doesn’t show up there anymore.\n                         \n\n\n\n\n\n                        Thus, you can clear different fields for multiple jobs using the Bulk Edit feature.\n                       \n\n                        Save\n                       \n\n\n                         You can save the changes made to your multiple jobs together using the\n                         \n                          Save\n                         \n                         option.\n                        \n\n                         Select the desired jobs from your job list and perform a mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Save\n                         \n                         .\n                        \n\n                         Select\n                         \n                          Continue\n                         \n                         to Save.\n                        \n\n\n                        Revert\n                       \n\n\n                         You can revert the changes made to your multiple jobs together using the\n                         \n                          Revert\n                         \n                         option.\n                        \n\n                         Select the desired jobs from your job list and perform a mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Revert\n                         \n                         .\n                        \n\n                         Select\n                         \n                          Continue\n                         \n                         to Revert.\n                        \n\n\n                        Delete\n                       \n\n\n                         You can delete your multiple jobs together using the\n                         \n                          Delete\n                         \n                         option.\n                        \n\n                         Select the desired jobs from your job list and perform a mouse right-click operation.\n                        \n\n                         Click on\n                         \n                          Delete\n                         \n                         .\n                        \n\n                         Select\n                         \n                          Continue\n                         \n                         to Delete.\n                        \n\n\n                        Database Specific Plugins\n                       \n\n                        For specific databases, Workbench 5.1 has plugins designed explicitly for some of the most popular databases. These plugins read data types directly from the source system which can eliminate any inconsistency between the Workbench and the source system. It also eliminates the chance that the data type will change in Workbench 5.1 after the schema has been set unless the type changes in the source system. The currently supported databases are: MSSQL, MySQL, Oracle, and Postgres. These database plugins are available as optional plugins in the Workbench Installer when you install the latest version of Workbench for the first time. If you choose to install them by selecting the checkbox next to them, they will appear as an option in the\n                        \n                         Transport Type\n                        \n                        dropdown menu while creating a new job.\n                       \n\n\n\n\n                        Database specific plugins support advanced query building.\n                       \n\n\n                         While creating a job, select a database plugin as the\n                         \n                          Transport type\n                         \n                         .\n                        \n\n                         In the\n                         \n                          Configure\n                         \n                         tab, click the\n                         \n                          Edit\n                         \n                         button under\n                         \n                          Processing\n                         \n                         (to set up a query.)\n                         \n\n\n\n\n                         You’ll be able to see a tree structure of your data.\n                         \n\n\n\n\n\n                        Enhanced Logging\n                       \n\n                        With enhanced logging, Domo can receive anonymous logs for your jobs to get ahead on tackling Workbench issues as soon as they happen.\n                       \n\n                        To access this feature, click\n                        \n                         Settings\n                        \n                        and scroll down to the\n                        \n                         Logging\n                        \n                        section.\n                       \n\n                        Enhanced logging is ON by default, and uploads logs daily to Domo (in addition to critical errors.) You can redirect your log directory in the\n                        \n                         Change where log/cache files are stored\n                        \n                        section. You can choose to opt out of this feature anytime in the Workbench settings. You also can upload logs manually using the\n                        \n                         Upload logs now\n                        \n                        button to help with more real-time troubleshooting.\n                       \n\n\n\n\n                        Daily Summary Email\n                       \n\n                        With the daily summary email, you can see a daily review of all your job statuses to stay on the top of your Workbench health.\n                       \n\n                        To subscribe to the daily summary email, click the\n                        \n                         Notifications\n                        \n                        tab under the\n                        \n                         Accounts\n                        \n                        section.\n                       \n\n\n\n\n                        Workbench Migration\n                       \n\n                        Workbench migration makes moving your Workbench jobs to a new server or a Workbench machine easy. With a simple import and export experience, you can effortlessly and securely move your Workbench jobs from one machine to another.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are migrating machines, make sure to turn the service OFF on the machine you are migrating from; otherwise, you will see job errors frequently. Domo recommends migrating to a clean machine.\n                          \n\n\n\n\n                        Any jobs scheduled to run using local time will run based off the local time of the new machine after the migration.\n                       \n\n                        The migration allows a complete backup of Workbench including the encryption keys. This lets you restore settings and accounts exactly as they are on any computer.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Jobs are saved in Domo, so any changes made to the jobs, after the backup, will persist.\n                          \n\n\n\n\n                        To create backup for your Workbench jobs,\n                       \n\n\n                         Click\n                         \n                          Settings\n                         \n                         . The\n                         \n                          Workbench Backup\n                         \n                         section appears.\n                         \n\n\n\n\n                         Click\n                         \n                          Browse\n                         \n                         next to the\n                         \n                          Path\n                         \n                         field, and select or specify the filename for your backup.\n                        \n\n\n                          Click the\n                          \n                           Generate and copy\n                          \n                          button next to the\n                          \n                           Passcode\n                          \n                          field if you want Domo to generate a secure passcode for your backup.\n                         \n\n\n\n\n\n\n\n\n\n                              Tip\n                             \n                             : You can enter your own passcode that meets the passcode security criteria. Note that your passcode must be at least 20 characters length, including at least one uppercase character(s), one lowercase character(s), one number(s), and one symbol(s).\n                            \n\n\n\n\n\n                         Now, click\n                         \n                          Create\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note\n                           \n                           : To migrate your Workbench jobs, you need to run the Workbench as an Administrator.\n                          \n\n\n\n\n                        To import backup,\n                       \n\n\n                         Click\n                         \n                          Settings\n                         \n                         . The\n                         \n                          Workbench Backup\n                         \n                         section appears.\n                        \n\n                         Click the\n                         \n                          Import backup\n                         \n\n\n\n\n\n                         Click\n                         \n                          Browse\n                         \n                         next to the\n                         \n                          Path\n                         \n                         field, and select the Workbench backup file that you want to import.\n                        \n\n                         (Optional) Enter the\n                         \n                          Passcode\n                         \n                         that you generated for this backup file.\n                        \n\n                         Click\n                         \n                          Import\n                         \n                         .\n                        \n\n\n                        FAQs\n                       \n\n                        Where can I download the plugins from?\n                       \n\n                        The plugins are available to install from the Workbench installer. Select the plugins you would like to install by choosing the checkbox next to them on install.\n                       \n\n                        Do I have to use the plugins to connect to my database?\n                       \n\n                        It is not mandatory to use the plugins. You can still use the generic plugins to connect to your database.\n                       \n\n                        What are the benefits of using the database specific plugins?\n                       \n\n                        Workbench will read the datatypes directly from the database meaning you do not have to worry that Workbench will interpret the data type differently than your database.\n                       \n\n                        What DataSets can I take over?\n                       \n\n                        Any DataSets that were created by a Connector and for which you have Edit permissions or above.\n                       \n\n                        Can I transfer it back to the Connector if I change my mind?\n                       \n\n                        No, moving DataSets from Workbench 5.1 back to a Connector is currently not supported.\n                       \n\n                        Will the DataSet automatically start using the schedule from the Connector?\n                       \n\n                        No, you will need to set up a new job in Workbench 5.1 and set up the schedule you would like to use in Workbench 5.1, and then choose the DataSet.\n                       \n\n                        What if I accidentally bulk delete multiple jobs?\n                       \n\n                        Workbench 5.1 has added an extra confirm step so you can ensure you would like to delete DataSets. Once they have been deleted, they cannot be recovered.\n                       \n\n                        Have any actions been excluded from the Bulk Action menu?\n                       \n\n                        No, any actions that can be configured on a job can also be adjusted using the Bulk Actions menu.\n                       \n\n                        Can I edit DataSets from different providers at the same time?\n                       \n\n                        For some Bulk Action options, Workbench 5.1 will ask you to choose which provider jobs you would like to update first because the configuration steps are often different between providers.\n                       \n\n                        Will I be able to block all schema changes?\n                       \n\n                        Yes, when this option is selected, absolutely no schema changes will be allowed and Workbench 5.1 will automatically fail the job.\n                       \n\n                        Can I choose to prevent schema changes on some columns and allow them on others?\n                       \n\n                        Yes, the new protect column allows you to choose which columns will have schema protection and which ones will not. This option is not available when\n                        \n                         Block all schema changes\n                        \n                        is selected.\n                       \n\n                        If I add a new column to my DataSet will that fail the job?\n                       \n\n                        It depends, if you choose to\n                        \n                         Allow safe schema changes\n                        \n                        , Workbench 5.1 will prevent schema changes on existing columns while allowing new columns to be added to the DataSet.\n                       \n\n                        What date grains are available for partitioning?\n                       \n\n                        Partitioning will be available for all column types.\n                       \n\n                        Can I convert an existing DataSet to a partitioned DataSet?\n                       \n\n                        Partitioning is only available on new DataSets in this version. Converting to partitioned DataSets will be available in a future release.", "Preview Article": "Click here to preview", "URL Name": "360056669354", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004880", "Archived Date": "", "Language": "English", "Primary Version": "Workbench 5.1", "Article Total View Count": "6,720", "": "", "Article Created Date": "10/24/2022, 10:34 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Workbench 5.1\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Workbench\n              \n", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "\n\n               Workbench 5.1\n              \n", "url": "/s/topic/0TO5w000000ZapUGAS"}]}