{"file_path": "../../raw_kb_v2\\article\\9355841270167\\index.html", "content": {"Title": "Using Story Presentation Mode", "Article Body": "Intro\n                       \n\n                        Domo's Story Presentation Mode allows you to make better presentations featuring your data. While in the mode, you can still view important details about the data, like who owns it and when it was last updated. If your audience wants a closer look at a dense table or visualization, you don't have to leave your presentation—Filters and Drill Paths function normally in the mode.\n                       \n\n                        This article describes the Story Presentation Mode interface.\n                       \n\n                        Navigating Story Presentation Mode\n                       \n\n                        Enter Story Presentation Mode from any card on your dashboard by selecting\n                        \n\n                         Expand\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Now to get to the card Details view, you can select\n                           \n\n                            Card options\n                           \n                           >\n                           \n                            Details\n                           \n                           .\n                          \n\n\n\n\n\n\n\n                        The card displays in Story Presentation Mode.\n                       \n\n\n\n\n\n\n                          Tables\n                         \n\n\n\n                        In Story Presentation Mode, you can use the\n                        \n\n                         Zoom in/out\n                        \n                        buttons to make dense tables easier for your audience to read.\n                       \n\n\n\n\n                        Control Rail\n                       \n\n                        In Story Presentation Mode, visualization cards display with a control rail to the right of the chart. The control rail contains four buttons and three columns—\n                        \n                         Controls\n                        \n                        ,\n                        \n                         Segments\n                        \n                        , and\n                        \n                         About\n                        \n                        .\n                       \n\n\n\n\n\n\n                          Buttons\n                         \n\n\n\n                        This table describes the buttons in the control rail.\n                       \n\n\n\n\n\n                            Button\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n\n                            Filters —\n                           \n                           Add Filters to your card.\n                          \n\n\n\n\n\n\n\n                            Hide/Show controls —\n                           \n                           Hide or show the control rail to the right of the chart in Story Presentation Mode. The default when you open Story Presentation Mode is that the controls are showing.\n                          \n\n\n\n\n\n\n\n                            Card options —\n                           \n                           View the card options to share, export, go to card Details, open with Analyzer, or go to the DataSet.\n                          \n\n\n\n\n\n\n\n                            Close —\n                           \n                           Close Story Presentation Mode and return to the same place on the dashboard where you were when you entered Story Presentation Mode.\n                          \n\n\n\n\n\n\n                          Controls column\n                         \n\n\n\n\n\n\n                        The\n                        \n                         Controls\n                        \n                        column contains any Quick Filters or Variables that have been added to the card. You can interact with the controls and collapse or expand them.\n                       \n\n                        To learn more about Quick Filters, see\n                        \n                         Adding Filters to Your Chart\n                        \n                        .\n                       \n\n                        To learn more about Variables, see\n                        \n                         Variables Overview\n                        \n                        .\n                       \n\n\n\n                          Segments column\n                         \n\n\n\n                        The\n                        \n                         Segments\n                        \n                        column allows you to compare up to three segments or subsets of your data. If there are multiple segments, you can search to locate the one(s) you need.\n                       \n\n\n\n\n\n\n                          About column\n                         \n\n\n\n\n\n\n                        The\n                        \n                         About\n                        \n                        column contains the name of the card's owner, the name of the DataSet and when it was last updated, a link to the data's lineage, the card view count, and the date and time the page was last synced.\n                       \n\n                        Presentation Controls\n                       \n\n                        At the bottom of the screen in Story Presentation Mode, you can access the presentation controls.\n                       \n\n\n\n\n\n\n                          Next card/previous card\n                         \n\n\n\n                        Selecting the\n                        \n                         Next card\n                        \n                        or the\n                        \n                         Previous card\n                        \n                        arrows moves you through the cards on the dashboard.\n                       \n\n\n\n                          Card list\n                         \n\n\n\n                        Selecting\n                        \n                         Card list\n                        \n                        displays a panel with all the cards on the dashboard so that you can quickly move to a particular card without having to scroll through all other cards on the way.\n                       \n\n\n\n\n                        To exit the\n                        \n                         Card list\n                        \n                        , select\n                        \n\n                         Close\n                        \n                        .\n                       \n\n\n\n\n                         Video - Story Presentation Mode", "Preview Article": "Click here to preview", "URL Name": "9355841270167", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004976", "Archived Date": "", "Language": "English", "Primary Version": "Using Story Presentation Mode", "Article Total View Count": "2,796", "": "", "Article Created Date": "11/1/2022, 11:15 PM", "First Published Date": "11/1/2022, 11:23 PM"}, "title": "\n              Using Story Presentation Mode\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Consuming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamnGAC"}, {"text": "\n\n               Interacting With Cards And Dashboards\n              \n", "url": "/s/topic/0TO5w000000ZansGAC"}]}