{"file_path": "../../raw_kb_v2\\article\\360042931994\\index.html", "content": {"title": "\n\n\n Glu Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nUse this connector to retrieve files in CSV format from your glu SFTP server. Using this connector, you can specify the file name pattern of a specific glu report, the date format that is used in the glu report and the column delimiter used within the glu report.\n\n\n Using these settings, the glu connector will connect to the glu SFTP server and search all files. Each time the DataSet is updated, the connector will download any files that A) match the user-specified filename pattern and B) have not been downloaded already in the past.\n\n\n This connector also has a companion QuickStart available in the Domo AppStore.\n\n\n Prerequisites\n-----------------\n\nBefore using this connector, you must already have a glu SFTP server account.\n\n\n Four pieces of information are required:\n\n glu SFTP server address\n* glu SFTP server port\n* glu SFTP server username\n* glu SFTP server password\n\nIt is recommended that you also have the following information. This should be available to you within the glu system settings.\n\n The format of the dates in the glu report.\n\n+ Domo supports dates in Western format (e.g. 2016/12/01).\n* The file name pattern that the glu service is using to export files to the glu SFTP server.\n* The column delimiter used in the glu report files.\n* How often and at what time glu updates the reports on the SFTP server.\n\nConnecting to your glu SFTP Server\n--------------------------------------\n\n\n###\n\n\n Credentials Pane\n\nEnter the host name, username, password, and port. The hostname is required to be in the format\n\ns\n\nftp://<Hostname\\_or\\_IP\\_Address>\n\n;\n\n, and the port should be numeric values only.\n\n\n If you are using multiple glu SFTP accounts, it is recommended that you name each account appropriately.\n\n\n If you click\n **Connect**\n but receive an error message, there are two possibilities:\n\n The glu SFTP server is not yet available. Contact the ATARA team to check the status of the glu SFTP server.\n* The glu SFTP server is available but you still cannot connect. In this case, please contact the Domo support team.\n\n\n###\n\n\n Details Pane\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Filename Pattern\n  |\n When you specify a filename pattern, you are telling the glu connector to retrieve all files matching that filename pattern. The data from all files will be combined and added to the DataSet. You can find the filename pattern in the glu system settings.\n\n\n Once a filename pattern is specified, the glu connector will search the SFTP server for all files matching the filename pattern.\n\n\n The DataSet will be updated if, and only if:\n * Files are found matching the filename pattern.\n* The files that match the filename pattern have not been downloaded already in the past for this DataSet.\n\n+ If the file was downloaded in the past, but has been updated, it will be downloaded again even if the file name has not changed.\n\n\n The DataSet will not be updated if:\n * The filename pattern does not match any files on the glu SFTP server.\n* The filename pattern matches files, but the files were already downloaded previously for this DataSet.\n\n\n Given a filename such as “campaign\\_report\\_all~00000111.csv”, the most appropriate filename pattern would be “campaign\\_report\\_all.” Be careful not to configure a filename pattern that matches more than one type of glu report.\n  |\n|\n Date Format\n  |\n The Date Format feature is available so that you can specify the exact date format. Domo detects date formats by default, but in some cases it may be helpful to explicitly configure the format.\n\n\n For example, the date 2016/12/01 would be\n\nYYYY/MM/DD\n\n.\n  |\n|\n Select the delimiting character\n  |\n Select the column delimiter character used in the CSV files on the glu SFTP server.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Using glu DataSets in DataFlows\n---------------------------------\n\nglu will sometimes update reports to account for changes in impressions and clicks. The following is an example of how to build a DataFlow that displays only the most recent data from glu.\n\n\n**To build a DataFlow using glu,**\n\n. Create a new table of the latest data called \"latest\\_data\" from the source DataSet.\n2. Add an index to the new \"latest\\_data\" table.\n3. Add an index to the source DataSet table.\n4. Perform an inner join operation to return only the latest data.\n5. Select all data from the output in the previous step to create a new output DataSet.\n6. Check your final DataFlow configuration.\n\nFAQ\n-----\n\n\n####\n If a file on the glu SFTP server is updated, but the file name doesn’t change, will the glu connector download the updated file?\n\nYes, the glu connector will see that the file is updated even if its name has not changed, and it will download the file again.\n\n###\n Should I run the glu connector in append or replace mode?\n\nThe glu connector is built to be run in append mode.\n\n###\n Can I safely change column names in my glu reports?\n\nNo, column names should be fixed before the campaign starts. If column names are changed in the middle of a campaign, it will break the Domo DataSet.\n\n###\n Can I safely change filenames used for my glu reports?\n\nNo, filenames should be fixed and should not be changed. The glu connector supports one filename pattern per DataSet. The DataSet will fail to update if you change the filename because the filename pattern will not match any of the new files on the glu SFTP server.\n\n###\n Can I use Japanese date formats (e.g. 2016\n\n年\n\n12\n\n月\n\n01\n\n日\n\n) in my glu reports?\n\nNo, Domo connectors do not currently support Japanese date formats. Please use the Western date format (e.g. 2016/12/01).\n\n###\n I have multiple glu reports that I need to combine within Domo; how can I do this?\n\nDomo recommends configuring glu to output one master report so that it is not necessary to combine data. However, in some cases the report dimensions available from each media make this impossible and you must have a new DataSet for each media. In this case you can use a Dataflow to combine metrics from multiple DataSets.\n\n###\n Each day, past glu reports are updated with fresh impression, click, and conversion data. Are these rows automatically updated in the Domo DataSet?\n\nNo, you must use a DataFlow to filter out any old rows. See the\n\nUsing glu DataSets in Dataflows\n\nsection for more information.\n\n###\n I set up my glu connector after there are already many files on the glu SFTP server. Will the connector download all the past files?\n\nYes, the connector is built to download all past files that have not already been downloaded.\n\n###\n How often can the data be updated?\n\nDataSets should be set to update no more than once every 15 minutes.\n\n###\n Are there any API limits I should be aware of?\n\nNo.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931994\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003936\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGlu Connector\n\n", "article_total_view_count": "\n\n\n 4,716\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "glu_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}