{"file_path": "../../raw_kb_v2\\article\\000005174\\index.html", "content": {"Title": "October 2022 Release Notes", "Article Body": "Enhancements\n                       \n\n                        The following enhancements are part of the October 2022 release.\n                       \n\n                        Beast Mode Editor\n                       \n\n                        The updated Beast Mode Editor now contains more help to keep you from exiting without saving your changes.\n                       \n\n\n                         Any tab with unsaved changes displays an italicized title with an asterisk (*).\n                         \n\n\n\n                         If you attempt to close the editor while you have unsaved changes, a warning displays, advising that there are\n                         \n                          x\n                         \n                         number of unsaved changes in your tab(s). The tabs with unsaved changes are marked with a\n                         \n                         warning symbol along with the italicized title and asterisk so that you can easily identify them. You can also choose to close without saving.\n                         \n\n\n\n\n\n\n\n                        New Features\n                       \n\n                        The following features are part of the October 2022 release.\n                       \n\n                        Variables\n                       \n\n\n                         Variables are values that function inside Beast Modes and provide solutions for many use cases, including what-if analysis and time comparisons. Use Variables with cards in Analyzer or turn dashboards into fully functioning data apps.\n                        \n\n\n\n                         The Edit Variables grant allows anyone in your organization with the Edit Cards grant to create, edit, and delete Variables.\n                        \n\n\n\n                         With three new DomoStats reports, admins can quickly see what Variables exist in an instance, who is using them, and where they are being used to assist with data governance.\n                        \n\n\n\n                         Variables are now available in the enhanced Beast Mode Editor.\n                        \n\n\n                        To learn more, see\n                        \n                         Variables Overview\n                        \n                        .\n                       \n\n\n\n\n                        Story Presentation Mode\n                       \n\n                        With Story Presentation Mode, your presentations are smoother, more efficient, and more enjoyable for your audience. You can easily view details about your data in the control rail and move to any card on the dashboard without exiting the presentation. Our new Variables feature works with cards in Story Presentation Mode, too.\n                       \n\n                        For more information, see\n                        \n                         Using Story Presentation Mode\n                        \n                        .\n                       \n\n\n\n\n                        Mobile Updates\n                       \n\n\n\n                          Improved Mobile Dashboards\n                         \n\n\n\n                        Mobile Dashboards now give you more options to interact with your data.\n                       \n\n\n                         Apply and clear filters with a single tap and use Filter Cards without covering up content.\n                        \n\n                         Drill in Place to explore data on the go.\n                        \n\n                         Dashboards using Custom Apps, including DDX Bricks, are now interactive on mobile.\n                        \n\n\n\n\n                          Improved Menu for Android\n                         \n\n\n\n                        Added menu tabs in the Android version of Domo mean that Android and iOS devices now have a consistent navigation experience. Home, Pages, People, and Buzz can be selected from anywhere inside the app.\n                       \n\n\n\n\n\n\n                          Dark Mode Support on iOS\n                         \n\n\n\n                        The Domo and Goals mobile apps now support dark mode. You can configure this in your device's native settings.\n                       \n\n\n\n\n\n\n                        Workbench 5.2\n                       \n\n                        The following features are available in the latest version of Workbench, which you can download in the Appstore.\n                       \n\n\n\n                          Multi-Cloud Support\n                         \n\n\n\n                        Workbench users with Multi-Cloud enabled can now specify which cloud warehouse they want their Workbench data to write to.\n                       \n\n                        For more information, see\n                        \n                         Multi-Cloud Support in Workbench 5.2.\n                        \n\n\n\n\n                          Job Duplication\n                         \n\n\n\n                        Job Duplication allows you to duplicate a job and change only the details unique to that job to save configuration time. Jobs must be duplicated one at a time; bulk job duplication is not supported.\n                       \n\n                        For more information, see\n                        \n                         Duplicating a Job in Workbench 5.2.\n                        \n\n\n                        Password Blocklist\n                       \n\n                        Admins can now create a list of restricted passwords for their instances. This prevents unauthorized or leaked credential usage and keeps instances more secure. This feature does not impact passwords that are currently used, only future passwords.\n                       \n\n                        For more information, see\n                        \n                         Setting Password Requirements.\n                        \n\n\n                        AppDB Admin\n                       \n\n                        AppDB now has an interface. AppDB Admin allows you to create and maintain collections, update documents, add document-level Filters, and manage permissions from your browser without using API calls.\n                       \n\n                        For more information, see\n                        \n                         AppDB Admin User Interface\n                        \n                        .\n                       \n\n                        New Premium Features\n                       \n\n                        The following premium features are part of the October 2022 release.\n                       \n\n                        Domo Everywhere\n                       \n\n\n\n                          UI\n                         \n\n\n\n                        Domo Everywhere has an improved user interface, which you can access in the Domo Admin Settings. Customize your organization's appearance with Brand Kit, or distribute live data experiences with the new options available in Domo Everywhere.\n                       \n\n\n\n\n\n\n                          Publish Dynamic PDP\n                         \n\n\n\n                        Publish jobs are now more secure. With dynamic personalized data permissions (PDP), you can know that your sensitive data is only going to the customers who should see it. Apply a user or organization-based Filter, and only content that passes the Filter is visible to subscribers.\n                       \n\n                        For more information, see\n                        \n                         Publishing Content to a Subscriber Organization.\n                        \n\n\n\n\n                          Embed Authorized Domains\n                         \n\n\n                        With authorized domains, you control the portals, environments, and apps where your embedded data displays. Place any authorized domain on the list in your Domo environment. This tells Domo that you trust the domain and that your content can be shared there. Domains not on the list aren't allowed to host Domo content.\n                       \n\n                        For more information, see\n                        \n                         Sharing Content Outside of Domo with Embed\n                        \n                        .\n                       \n\n\n\n\n\n\n                          Whole-Page Filtering\n                         \n\n\n\n                        Now you can use Whole-Page Filtering on embedded content in your authorized domains. This gives you both control over the format and layout offered by Embed and the power and functionality of dashboard Filters. Create Filters for your customers' use cases and easily apply them to every embedded card on a page.\n                       \n\n                        For more information, see\n                        \n                         Sharing Content Outside of Domo with Embed\n                        \n                        .\n                       \n\n                        Form Builder\n                       \n\n                        The new Editable Submissions feature in Form Builder allows form creators to configure forms to be view-only or allow responses to be viewed, edited, and deleted. Form viewers can review their Previous Submissions in table format before resubmitting. New styling options offer enhanced design choices for fonts, rounded corners, and more.\n                       \n\n                        For more information, see\n                        \n                         Form Viewer App\n                        \n                        .\n                       \n\n                        Sandbox\n                       \n\n\n\n                          Support for Connectors, Variables, and Segments\n                         \n\n\n\n                        Sandbox now supports Connectors. This allows users to transport Connector configurations from their source instance into target instances. Additionally, Sandbox supports cards and dashboards that contain Variables and Segments.\n                       \n\n\n\n                          Link Mapping\n                         \n\n\n\n                        Sandbox now gives users mappings for items in their repositories during the promotion process. For example, if your page contains a link that isn't in the repository, Sandbox allows users to map the link.\n                       \n\n\n\n                          Heuristic Content Mapping\n                         \n\n\n\n                        Sandbox now automates the mapping process if your DataSets have similar details, such as names or schema types. This saves time if you use similar naming conventions across your instances.\n                       \n\n\n\n                          Repository Sharing\n                         \n\n\n\n                        Sandbox now allows you to share repositories with groups created in Domo.\n                       \n\n                        For more information, see\n                        \n                         Domo Sandbox\n                        \n                        .\n                       \n\n                        Jupyter\n                       \n\n\n\n                          Workspace Sharing\n                         \n\n\n\n                        Jupyter administrators can now enable workspace sharing, allowing other users to run and edit workspaces without sharing login credentials.\n                       \n\n\n\n                          Support for Domo Credentials\n                         \n\n\n\n                        The new Add Account feature allows you to link third-party accounts to reference in your workspace. Third-party accounts can be added when you create a workspace or later if you choose to edit.\n                       \n\n                        To learn more, see\n                        \n                         Jupyter Workspaces\n                        \n                        .\n                       \n\n                        Governance Toolkit\n                       \n\n\n\n                          Observability Metrics\n                         \n\n\n\n\n                         With the new Observability Metrics tool, you can pull DomoStats-style reports from target instances and bring them into your primary instance\n                         \n\n                           .\n                          \n\n\n\n\n\n\n\n                           For more information, see\n                          \n\n\n\n\n                            Governance Toolkit: Observability Metrics\n                           \n                           .\n                          \n\n\n\n\n\n\n                          Triggered Reports\n                         \n\n\n\n\n\n                          With Triggered Reports,\n                          \n                           you can create jobs that send Scheduled reports based off of DataSet updates and alerts.\n                          \n\n\n\n\n                          Triggered Reports data is then logged in new or existing DataSets, giving you more insight into your organization's most active data.\n                         \n\n\n\n\n\n\n\n                            For more information, see\n                            \n                             Governance Toolkit: Triggered Reports\n                            \n                            .\n                           \n\n\n\n\n\n\n\n                        Need Support?\n                       \n\n                        You can access the following resources:\n                       \n\n\n\n                          Search for a topic in the\n                          \n                           Help Center\n                          \n                          .\n                         \n\n\n\n                          Train in\n                          \n                           Domo University\n                          \n                          .\n                         \n\n\n\n                          Search for training apps in the\n                          \n                           Appstore\n                          \n                          .\n                         \n\n\n\n                          Get answers from the Domo Community in the\n                          \n                           Dojo\n                          \n                          .\n                         \n\n\n\n                          Contact Technical Support by entering a help ticket in the\n                          \n                           Domo Support Portal.\n                          \n\n\n\n\n                          Reach out to your Domo Customer Success Manager or Technical Consultant.\n                         \n\n\n\n                        If you have feedback, please send it from within Domo.\n                       \n\n                        In the navigation header, select\n                        \n                         More\n                        \n                        >\n                        \n                         Feedback\n                        \n                        . In the modal that displays, choose\n                        \n                         Product feedback\n                        \n                        .\n                       \n\n\n\n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "000005174", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005174", "Archived Date": "", "Language": "English", "Primary Version": "October 2022 Release Notes", "Article Total View Count": "3,166", "": "", "Article Created Date": "3/29/2023, 5:52 AM", "First Published Date": "3/29/2023, 5:52 AM"}, "title": "\n              October 2022 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}