{"file_path": "../../raw_kb_v2\\article\\360043435013\\index.html", "content": {"Title": "Procore Connector", "Article Body": "Intro\n                       \n\n                        Procore allows large teams of construction companies, property owners, project managers, contractors, and partners to collaborate on large-scale construction projects and share access to documents, planning systems and data. To learn more about the Procore API, visit their page (\n                        \n                         https://www.procore.com/platform/procore-connect.php\n                        \n                        ).\n                       \n\n                        You connect to your Procore account in the Data Center. This topic discusses the fields and menus that are specific to the Procore connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Procore account and create a DataSet, you must the email address you use to log into Procore, along with your Procore password.\n                       \n\n                        Connecting to Your Procore Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Procore Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Procore connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Procore accounts in Domo) to open the Procore OAuth screen where you can enter your Procore email address and password. Once you have entered valid Procore credentials, you can use the same account any time you go to create a new Procore DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Procore report you want to run. The following reports are available:\n                           \n\n\n\n\n                               ​​All Activity Details\n                              \n\n                               Returns activity details of all RFIs from all projects of a company.\n                              \n\n\n\n                               ​​All RFI Replies\n                              \n\n                               Returns replies of all RFIs from all projects of a company.\n                              \n\n\n\n                               ​​Budget ​Items\n                              \n\n                               Returns a list of all Budget Line Items.\n                              \n\n\n\n                               ​​Calendar ​Events\n                              \n\n                               Returns a list of all Calendar Events for a specified project.\n                              \n\n\n\n                               ​​Change ​Orders\n                              \n\n                               Returns a list of all Change Orders for a specified contract in a project.\n                              \n\n\n\n                               ​​Change ​Orders ​Requests\n                              \n\n                               Returns a list of all Change Orders Requests (COR) for a specified contract in a project.\n                              \n\n\n\n                               Change Order Request Details\n                              \n\n                               Returns detailed information about Change Order Request (COR) for a specified contract in a project.\n                              \n\n\n\n                               ​​Change Reason ​Templates\n                              \n\n                               Returns a list of Change Reasons for change orders.\n                              \n\n\n\n                               ​​Checklist ​Templates\n                              \n\n                               Returns a list of all Inspection Checklist Templates for a specified Project.\n                              \n\n\n\n                               ​​Checklists\n                              \n\n                               Returns a list of all Inspection Checklist for a specified Project.\n                              \n\n\n\n                               ​​Companies\n                              \n\n                               Returns a list of Companies visible by the authenticated user.\n                              \n\n\n\n                               ​​Company ​Insurances\n                              \n\n                               Returns a list of all Insurances associated with the specified Company.\n                              \n\n\n\n                               ​​Company ​Users\n                              \n\n                               Returns a list of all Users associated with a Company.\n                              \n\n\n\n                               ​​Company ​Vendor ​Insurances\n                              \n\n                               Returns a list of Insurances from the specified Company Vendor.\n                              \n\n\n\n                               ​​Company ​Vendors\n                              \n\n                               Returns a list of all Vendors associated with a Company.\n                              \n\n\n\n                               ​​Contract ​Payments\n                              \n\n                               Returns a list of Contract Payments.\n                              \n\n\n\n                               ​​Cost ​Codes\n                              \n\n                               Returns a list of all Standard Cost Code Lists at the Company level.\n                              \n\n\n\n                               ​​Direct ​Costs\n                              \n\n                               Returns a list of all Direct Cost Items for a Project.\n                              \n\n\n\n                               ​​Drawing ​Areas\n                              \n\n                               Returns a list of all Drawing Areas in the specified Project.\n                              \n\n\n\n                               ​​Drawings\n                              \n\n                               Returns a list of all Drawings for a specified drawing area.\n                              \n\n\n\n                               ​​Environmentals\n                              \n\n                               Returns a list of Environmental records for a given project.\n                              \n\n\n\n                               ​​Equipment\n                              \n\n                               Returns a list of all Project Equipment.\n                              \n\n\n\n                               ​​Harm Sources\n                              \n\n                               Return a list of all Harm Sources associated with a Company.\n                              \n\n\n\n                               ​​Incidents\n                              \n\n                               Returns a list of Incidents for a given project.\n                              \n\n\n\n                               ​​Injuries\n                              \n\n                               Returns a list of Injuries for a given project.\n                              \n\n\n\n                               ​​Inspectors (checklists)\n                              \n\n                               Returns a list of Possible Inspectors in a specified Project.\n                              \n\n\n\n                               ​​Line ​Item ​Types\n                              \n\n                               Returns a list of all defined Line Item Types.\n                              \n\n\n\n                               ​​Locations\n                              \n\n                               Returns a list of Locations associated with a Project.\n                              \n\n\n\n                               Manpower ​Logs\n                              \n\n                               Returns all approved Manpower Logs for the specified date.\n                              \n\n\n\n                               ​​Meetings\n                              \n\n                               Returns a list of all Meetings for a specified Project.\n                              \n\n\n\n                               ​​Meetings ​Categories\n                              \n\n                               Returns all Meeting Categories for a given Meeting.\n                              \n\n\n\n                               ​​Near Misses\n                              \n\n                               Returns a list of Near Misses for a given project.\n                              \n\n\n\n                               ​​Notes ​Logs\n                              \n\n                               Returns all Notes Logs for the current date.\n                              \n\n\n\n                               ​​Photo ​Albums\n                              \n\n                               Returns a list of all Photo Albums (Image Categories) in a specified project.\n                              \n\n\n\n                               ​​Photos\n                              \n\n                               Returns a list of all Images from a Project's Photo Album (Image Category).\n                              \n\n\n\n                               ​​Plan ​Revision ​Logs\n                              \n\n                               Returns all Plan Revision Logs for the current date.\n                              \n\n\n\n                               ​​Potential ​Change ​Orders\n                              \n\n                               Returns a list of all Potential Change Orders (PCO).\n                              \n\n\n\n                               Potential Change Order Details\n                              \n\n                               Returns detailed information about a Potential Change Order(PCO).\n                              \n\n\n\n                               ​​Prime ​Contract (​Attachment)\n                              \n\n                               Returns the Prime Contract for the specified Project and associated Attachments.\n                              \n\n\n\n                               ​​Prime ​Contract (​Change ​Orders)\n                              \n\n                               Returns the Prime Contract for the specified Project and associated Change Orders.\n                              \n\n\n\n                               ​​Prime ​Contract (​Line ​Items)\n                              \n\n                               Returns the Prime Contract for the specified Project and associated Line Items.\n                              \n\n\n\n                               ​​Prime ​Contract (​Order ​Packages)\n                              \n\n                               Returns the Prime Contract for the specified Project and associated Order Packages.\n                              \n\n\n\n                               ​​Prime ​Contract (​Order ​Requests)\n                              \n\n                               Returns the Prime Contract for the specified Project and associated Order Requests.\n                              \n\n\n\n                               ​​Prime ​Contract (​Payment ​Received)\n                              \n\n                               Returns the Prime Contract for the specified Project and associated Payments Received.\n                              \n\n\n\n                               ​​Programs\n                              \n\n                               Returns a list of Programs associated to the specified Company.\n                              \n\n\n\n                               ​​Project ​Dates\n                              \n\n                               Returns a list of Project Dates.\n                              \n\n\n\n                               ​Project ​Details\n                              \n\n                               Returns details of the specified Project.\n                              \n\n\n\n                               ​​Project ​Details (​Budget)\n                              \n\n                               Returns the budget specific information to the Project Details report.\n                              \n\n\n\n                               ​​Project ​Folders\n                              \n\n                               Returns a list of Folders and Files for a specified Project.\n                              \n\n\n\n                               ​​Project ​Insurances\n                              \n\n                               Returns a list of all Insurances associated with the specified Project.\n                              \n\n\n\n                               ​​Project ​Roles\n                              \n\n                               Returns a list of all defined Project Roles in a specified Project.\n                              \n\n\n\n                               ​​Project ​Users\n                              \n\n                               Returns a list of Users associated with a Project.\n                              \n\n\n\n                               ​​Project ​Vendors\n                              \n\n                               Returns a list of Vendors associated with a specified Project.\n                              \n\n\n\n                               ​​Projects\n                              \n\n                               Returns a list of active Projects.\n                              \n\n\n\n                               ​Property Damages\n                              \n\n                               Returns a list of Property Damage records for a given project.\n                              \n\n\n\n                               ​​Punch ​Item ​Types\n                              \n\n                               Returns a list of all Punch Item Types on a specified Project.\n                              \n\n\n\n                               ​​Purchase ​Order ​Contract\n                              \n\n                               Returns a list of all Purchase Order Contracts.\n                              \n\n\n\n                               ​​Quantity ​Logs\n                              \n\n                               Returns all Quantity Logs for the current date.\n                              \n\n\n\n                               ​​Recently ​Updated ​Photos\n                              \n\n                               Returns a list of the most recently updated photos for a specified Project.\n                              \n\n\n\n                               ​​RFIs\n                              \n\n                               Returns all RFIs in a specified Project.\n                              \n\n\n\n                               ​​Standard ​Cost ​Code ​Lists\n                              \n\n                               Returns a list of all Standard Cost Code Lists at the Company level.\n                              \n\n\n\n                               ​​Standard ​Cost ​Codes\n                              \n\n                               Returns a list of all Standard Cost Codes in a specified Standard Cost Code list.\n                              \n\n\n\n                               ​​Submittals\n                              \n\n                               Returns a list of all Submittals from a specified Project.\n                              \n\n\n\n                               ​​Time​Card ​Entries\n                              \n\n                               Returns a list of all Timecard Entries for the current date.\n                              \n\n\n\n                               ​​Time​Card ​Time ​Types\n                              \n\n                               Returns a list of all Timecard Time Types for a specified Project.\n                              \n\n\n\n                               ​​Trades\n                              \n\n                               Returns a list of all Trades associated with a Company.\n                              \n\n\n\n                               ​​Visitor ​Logs\n                              \n\n                               Returns all Visitor Logs for the current date.\n                              \n\n\n\n                               ​​Waste ​Logs\n                              \n\n                               Returns all Waste Logs for the current date.\n                              \n\n\n\n                               ​​Work ​Logs\n                              \n\n                               Returns all Work Logs for the current date.\n                              \n\n\n\n                               ​​Work ​Order ​Contract\n                              \n\n                               Returns a list of all Work Order Contracts of a specified Project.\n                              \n\n\n\n\n\n\n\n\n                            Company\n                           \n\n\n\n                            Select the company you want to retrieve information for.\n                           \n\n\n\n\n\n                            Sub Report\n                           \n\n\n\n\n                             Choose the sub list to flatten.\n                            \n\n\n\n\n\n\n                            Project Filter\n                           \n\n\n\n                            Specify whether you want to retrieve data for all projects, active projects only, or inactive projects only.\n                           \n\n\n\n\n\n                            Project\n                           \n\n\n\n                            Select the project you want to retrieve information for.\n                           \n\n\n\n\n\n\n                             Contract\n                            \n\n\n\n\n                            Select the contract you want to retrieve information for.\n                           \n\n\n\n\n\n\n                             Contract Selection Method\n                            \n\n\n\n\n                            Choose the method to select contracts. This discovery will return a list of contracts. Manual entry will allow you to enter a Contract ID.\n                           \n\n\n\n\n\n\n                             Contract ID\n                            \n\n\n\n\n                            Enter the Contract ID.\n                           \n\n\n\n\n\n                            PCO Id Selection Method\n                           \n\n\n\n\n\n\n\n                            Choose the method to select PCO Ids. Selecting \"All\" will returns data for all PCO Ids. Selecting \"Manual\" will return a list of PCO Ids for entered contract Id.\n                           \n\n\n\n\n\n                            PCO ID\n                           \n\n\n\n                            Select PCO Id to run the report for.\n                           \n\n\n\n\n\n                            COR ID Selection Method\n                           \n\n\n\n                            Choose the method to select COR Ids. Selecting \"All\" will returns data for all COR Ids. Selecting \"Manual\" will return a list of COR Ids for entered contract Id.\n                           \n\n\n\n\n\n                            COR ID\n                           \n\n\n\n                            Select COR Id to run the report for.\n                           \n\n\n\n\n\n                            Company Vendor\n                           \n\n\n\n                            Select the vendor you want to retrieve information for.\n                           \n\n\n\n\n\n                            Drawing Area\n                           \n\n\n\n                            Select the drawing area you want to retrieve information for.\n                           \n\n\n\n\n\n                            Meetings\n                           \n\n\n\n                            Select the meeting you want to retrieve information for.\n                           \n\n\n\n\n\n                            Album\n                           \n\n\n\n                            Select the album you want to retrieve information for.\n                           \n\n\n\n\n\n                            Standard Cost Code\n                           \n\n\n\n                            Select the standard cost code list you want to retrieve information for.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n\n                             Number of photos\n                            \n\n\n\n\n\n                             Enter the numbers of recent photos you want to retrieve.\n                            \n\n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043435013", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003409", "Archived Date": "", "Language": "English", "Primary Version": "Procore Connector", "Article Total View Count": "4,728", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Procore Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}