{"file_path": "../../raw_kb_v2\\article\\360042931954\\index.html", "content": {"Title": "DataSet via Email Connector", "Article Body": "Intro\n                       \n\n\n                         The Dataset via Email connector enables you to get your data into Domo quickly and easily by capturing and processing .xls, .xlsx, and .csv files that have been included as attachments to an email message. Additionally, the DataSet via Email Connector can parse through a Gzip or Zip file to return a .csv or .xlsx file. When you configure this connector, it generates a unique email address that corresponds to your Dataset via Email DataSet in Domo. Once the email address is created, you can send the spreadsheet as an attachment to that email address. The connector will then process the email and update your data accordingly.\n                        \n\n                         Please note that this connector currently pulls in data from only one attachment. If your email message includes more than one attachment, data is pulled from the first listed attachment.\n                        \n\n\n                        Note that each time you configure this connector, you do so for an attachment with a fixed set of characteristics. For instance, if you create a configuration for CSV files with specific parameters, you cannot then send XLS spreadsheets to the email address that is generated unless you go back into the connector interface and switch the file type to XLS. If you want to change the attachment file type, it is highly recommended that you create a new connection with its own email address.\n                       \n\n                        You configure settings for your DataSet via Email connection in the Data Center. This topic discusses the fields and menus that are specific to the DataSet via Email connector user interface. General information for adding DataSets and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                           The maximum size of emails you can pull into Domo is 25 MB.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                             Video - DataSet Via Email Connector\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n                        Prerequisites\n                       \n\n                        None. No credentials are required.\n                       \n\n                        Configuring Your DataSet via Email Connection\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Details\n                         \n                         pane in the DataSet via Email connector page. The components\n                        \n\n                         of the other pane in this page,\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and\n                        \n                        are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains various options for configuring your DataSet via Email connection.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Email\n                           \n\n\n\n                            Automatically generates the email address you will send your attachments to. Click\n                            \n                             Copy Email\n                            \n                            to copy this email address to your clipboard.\n                           \n\n\n\n\n                           File Location\n                          \n\n\n                            Select a file location option:\n                           \n\n\n\n\n                               Email Attachment\n                              \n                              . Indicates that the DataSet file is attached to the email or in the body of the email you are connecting to.\n                             \n\n\n\n\n                               Download directly from link in email\n                              \n                              . Indicates that the email contains a direct download link to the DataSet file.\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 If there are multiple links in the message, the connector will use the first link that appears in the message.\n                                \n\n\n\n\n\n\n\n\n\n                               Download from link to page\n                              \n                              . Indicates that the email contains a URL leading to a page with a download link to the DataSet file.\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n\n                                  To find the download page, look for the first link in which the URL or link label contains the file type. If a link with the file type cannot be not found, the connector will look for a link that contains \"report\" or \"download\".\n                                 \n\n                                  After retrieving the download page, the connector will look for the actual data link the same way (matching against the file type). Note that the URLs on the download page cannot be generated by JavaScript.\n                                 \n\n\n\n\n\n\n\n\n\n\n\n                            File Type\n                           \n\n\n\n                            Select the file type for your attachments:\n                           \n\n\n\n\n                               Email body as one row\n                              \n                              . Use if the data you want to import is found in the body of the email (rather than as an attachment) and should be imported into Domo as a single row of data in a DataSet.\n                             \n\n\n\n\n                               Email body as HTML\n                              \n                              . Use if the data you want to import is found in the body of the email (rather than as an attachment) and should be imported into Domo as HTML. You\n                              \n                               must\n                              \n                              set\n                              \n                               File Attachment\n                              \n                              to\n                              \n                               Email Attachment\n                              \n                              when using this option.\n                             \n\n\n\n\n                               CSV\n                              \n                              . Use if your DataSet is contained within an attached CSV file.\n                             \n\n\n\n\n                               XLS\n                              \n                              . Use if your DataSet is contained within an attached XLS file.\n                             \n\n\n\n\n                               XLSX\n                              \n                              . Use if your DataSet is contained with an attached XLSX file.\n                             \n\n\n\n\n\n\n\n\n\n\n\n                                  Notes:\n                                 \n\n\n\n\n\n\n                                   The file size limit of your chosen email provider dictates the file size limit for this connector.\n                                  \n\n\n\n\n                                  The connector is not able to determine your extension file type if the email does not use TLS 1.2 or above.\n                                 \n\n\n\n\n\n\n\n\n\n\n\n                            From Email Address\n                           \n\n\n\n                            Enter the email address you will be sending attachments from. Emails sent from other email addresses will be rejected. Enter\n                            \n                             NONE\n                            \n                            to accept emails from any email address.\n                           \n\n\n\n\n\n\n\n\n                                 Note:\n                                \n                                Make sure that the email in the configurations matches the email you are sending the file to!\n                               \n\n\n\n\n\n\n\n\n\n                            Email Subject Expression\n                           \n\n\n\n                            Enter a regular expression that will be used to validate the subject of the email you send. Emails with a subject that do not fully match the expression will be rejected. Enter\n                            \n                             NONE\n                            \n                            to accept any email subject.\n                            \n\n                            Here is an example of a full match:\n                           \n\n\n                             Subject = 1900 Audit Report for Domo\n                             \n                             Regex = .*Audit_Report.*\n                            \n\n\n\n\n\n\n                            Email Body Expression\n                           \n\n\n\n                            Enter a regular expression that will be used to validate the body of the email you send. Emails with body content that do not fully match the expression will be rejected. Enter\n                            \n                             NONE\n                            \n                            to accept anything included in the body.\n                           \n\n                            Here is an example of a full match:\n                           \n\n\n                             Body = Here is the Audit Report file to upload to Domo.\n                             \n                             Regex = .*Audit\\sReport.*\n                            \n\n\n\n\n\n\n                            Attachment Name Expression\n                           \n\n\n\n                            Enter a regular expression that will be used to validate the filename of the attachment. Attachments that do not fully match the expression will be rejected. Enter NONE to accept any filename.\n                           \n\n                            Here is an example of a full match:\n                           \n\n\n                             Attachment = 1.audit_report_1.1.1900.1.00AM.xlsx\n                             \n                             Regex = .*audit_report.*\n                            \n\n\n\n\n\n\n                            Show Advanced Options\n                           \n\n\n\n                            Check the box to show advanced configuration options.\n                           \n\n\n\n\n\n                            Header Row (Optional)\n                           \n\n\n\n                            Enter the header row number. If you do not enter a number, the first row is considered the header row.\n                           \n\n\n\n\n\n                            Skip Footer Rows (Optional)\n                           \n\n\n\n                            If there are one or more rows at the bottom of the file you do not want to import, enter the number of rows to skip.\n                           \n\n\n\n\n\n                            Starting Data Row (Optional)\n                           \n\n\n\n                            Enter the starting data row number. If you do not enter a number, the first row after the header row is considered the starting row.\n                           \n\n\n\n\n                           Delimiter\n                          \n\n                           Select the delimiter used to parse your CSV file. If you select\n                           \n                            Detect the delimiter\n                           \n                           , the appropriate delimiter is determined automatically.\n                          \n\n\n\n                           Escape Character\n                          \n\n                           Select whether or not to use an escape character.\n                          \n\n\n\n                           Quote Character\n                          \n\n                           Select whether to use double quotes or single quotes as a quote character, or no quote character at all.\n                          \n\n\n\n                           Detect Encoding\n                          \n\n                           Check this box if you want Domo to detect your encoding type automatically; leave it unchecked if you want to enforce UTF-8 encoding.\n                          \n\n\n\n\n                            Excel Sheet Name\n                           \n\n\n\n                            Enter the sheet name of the Excel file you want to create a DataSet from.\n                           \n\n\n\n\n\n                            Excel Sheet Tab Number\n                           \n\n\n\n                            Enter the tab number of the Excel sheet you want to create a DataSet from.\n                           \n\n\n\n\n\n                            Raw Headers\n                           \n\n\n\n                            If you select\n                            \n                             Yes\n                            \n                            , the connector will use the headers in the sent file. If you select\n                            \n                             No\n                            \n                            , the connector will modify any special characters found in the header text.\n                           \n\n\n\n\n\n                            Date Format\n                           \n\n\n\n                            Select the date format used in the attachment. If you want dates to be represented as text, select\n                            \n                             Show Dates as Strings\n                            \n                            .\n                           \n\n\n\n\n\n                            Data Contains Header Row\n                           \n\n\n                           Set this to true if the data contains a row containing column headers. Set this to false if the data does not contain a header row.\n                          \n\n\n\n\n                            Number As Strings Columns\n                           \n\n\n                           Selecting yes will add a column for all columns that are numbers and format them as strings to preserve their original format including any leading zeros.\n                          \n\n\n\n\n                            Ignore Decoding Errors\n                           \n\n\n                           Select 'yes' to ignore decoding errors.\n                           \n                           Only data that is processed before the decoding error will be retrieved.\n                           \n                           This is recommended if there are extraneous characters at the end of the email file that are corrupt.\n                          \n\n\n\n                           Allow Leading Digit in Column Name\n                          \n\n                           Select if you want to allow column names to begin with a digit. Otherwise, every column name that starts with a digit will have the letter 'C' prefixed, i.e. 'C123'.\n                          \n\n\n\n                           Skip Empty Rows\n                          \n\n                           Select this checkbox to avoid adding empty rows to the dataset.\n                          \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling,\n                       \n\n                        retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n                         Data is parsed incorrectly, such as having more rows or columns than expected.\n                        \n\n\n                        Ensure any literal quote character in a field's data is escaped to avoid it being parsed as one of the quote characters that enclose the field. A quote character can be escaped by the following ways:\n                       \n\n\n                         Using backslash ( \\ ): \"dimensions\", \"two-by-four: 2\\\" x 4\\\"\"\n                        \n\n                         Using the quote character twice: \"dimensions\", \"two-by-four: 2\"\" x 4\"\"\"", "Preview Article": "Click here to preview", "URL Name": "360042931954", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003940", "Archived Date": "", "Language": "English", "Primary Version": "DataSet via Email Connector", "Article Total View Count": "6,325", "": "", "Article Created Date": "10/24/2022, 9:17 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              DataSet via Email Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               File Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaowGAC"}]}