{"file_path": "../../raw_kb_v2\\article\\360058529233\\index.html", "content": {"title": "\n\n\n Contact Tracing\n\n\n", "article_body": "\n\nIntro\n-------\n\nOur Contact Tracing app is what you will use to visualize and analyze the data points that are captured as your employees use the\n\nTemperature Scanning\n\napps. The Contact Tracing app allows you to accurately monitor and respond to incidents as they occur.\n\n\n This is a dynamic app that is drillable so that you may look at your company on any level you desire, whether that is internationally, or by national, state, building, floor, or even room. The drill-ability is determined by your data, but you should be able to click into an individual campus and see only the cohorts within that location.\n\n*Note:**\n This app is part of the\n\nGet Back to Work Solution\n\nand is available\n *on-demand and paid*\n .\n\nTo request this feature be enabled,\n\n Reach out to your Domo Customer Success Manager or Account Executive.\n* If you do not have contact information for your CSM or AE, contact Domo Support. For information on how to contact Support, please see:\n\nGetting Help\n\nMap view\n----------\n\nContact Tracing's main map view, including a sidebar with incidents, takes data points from both the\n\nTemperature Scanning\n\napps to show how individuals have been interacting with each other based upon those who have incidents started. The map is dynamic and can be drilled down to a selected location and can be as granular as desired. Click on a location to begin drilling down to an individual cohort.\n\nLeft-side panel\n-----------------\n\nThe left-side panel in the Contact Tracing app shows both automatic and manual Incidents. Automatic Incidents occur when someone has either failed a\n\nTemperature Scanning\n\ncheck-in. The left-side bar will filter down according to the individual location you've selected from the map. Select the filter button while in Active incidents so see those assigned to you. See the number of people potentially exposed and those that have been notified from that incident. Orange incidents indicate a Failed Safe Worker or Temperature Scanning check-in or Potentially Exposed case. Red incidents indicate a Confirmed Incident. The filter icon can be used to filter to incidents assigned to you.\n\n\n###\n Manually created Incidents\n\nIncidents can be manually created by selected the\n **+**\n icon from the left-side panel. Manual Incidents are created when someone has not failed a check-in but has instead been reported as being in contact with someone else with symptoms or contacted HR. When an Incident has been opened, it remains open until the Incident has been addressed by an authorized member of the organization. This prevents people from entering the office until they've been cleared. Choose an employee, select the individual type (Employee or Guest), select the Flagged Reason (Failed Check In - Entrance Assessment, Failed Check In - Safe Worker, Potential Incident, and Confirmed Incident), and choose the incident date.\n\n\n###\n Templates\n\nCreate a new notification Template by selecting the gear icon from the left-side panel. Once in the Template screen, you'll see a list of your created Templates with the option to either edit or delete each one. Your screen will be paused while creating new Templates.\n\nSelect\n **Create Template**\n to start creating a new Template. Create an\n **Email**\n ,\n **SMS**\n ,\n **SafeWorker**\n , or\n **Call**\n Template. Include a\n **Title**\n and\n **Body text**\n for the Template. Once you've saved your Template, you'll be able to use them to notify potentially exposed individuals within an Incident.\n\nView impact\n-------------\n\nWithin an Incident, you are able to select the\n **View Impact**\n button to see interactions within multiple cohort views. The individual's Incident is shown as a red dot on the map, and anyone they've come in contact with (by location) will appear in yellow. The timeline at the bottom of the screen allows you to scrub across a 14-day range to see who the individual has come in contact with. The Incident Subject will appear in the left-side bar as either orange or red, depending upon their Flagged Reason type and any potentially exposed individuals will appear as yellow. Each exposed individuals' risk level will also appear as Low, Medium, or High risk (determined by the\n\nKontakt.io\n\ndevices).\n\nClick into a day on the playback bar and view exposures by day.\n\nStart Incident\n----------------\n\nIncidents can be started within the left side panel in the Contact Tracing app. Starting an Incident will take you to the Incident Tracing screen and shows each individual who has come in contact with the reported individual within the past 14 days. The stage for each individual indicates whether or not they have been notified.\n\n\n###\n Action items\n\nThe three dots at the top of the left-side panel allows you to either close an incident or assign the incident to someone in the GBTW Incident Managers Group, you'll need to add everyone that you want to be able to assign and be assigned incidents to this group.\n\nTo close an incident, you'll need to include a reason for closing. Once an incident has been closed, it will appear in the 'Closed' tab on the main screen.\n\n\n###\n Flagged reason\n\nThe flagged reason, cohort, current location from Safe Worker, and who the incident is assigned to all appears in the Incident Tracing profile.\n\n\n###\n Safety actions\n\nTake safety actions by viewing the incident log and comments made on the incident.\n\n\n###\n Notify (All)\n\nNotify potentially exposed persons using the notify button and include messaging within the notification.\n\n\n###\n Exposures\n\nAdd a new exposure to an Incident’s list (either an employee or guest) or start a new Incident from a potentially exposed person. Export the exposure list in the individual case to a .CSV file.\n\n\n###\n Add comment\n\nAdd comments to an Incident and view them in the incident log.\n\n\n####\n FAQ\n\n\n#####\n Do most customers plan to use beacons in their facilities?\n\nIt turns out that many organizations may need only to track at a Building or Floor level, because their employees flow freely in that space. Extremely large facilities such as factories or warehouses may benefit from beacon technology so they can selectively trace employee movement in sections of an open space.\n\n####\n We have concerns that you will follow employee activities outside of the office if they opt-in to be contact traced. How do you handle this privacy issue?\n\nWe do not track or trace employees' activities outside of the office. Our apps only relay the location data to the beacons located in the office. Once you are out of range, we no longer track your location.\n\n####\n If a person has been flagged as a potential risk for COVID-19, can the app tell me the employees who should get tested?\n\nYes. Our Contact Tracing App will be able to tell you the employee cohorts who have been in the same office location, conference room, lunchroom, etc. and will automatically flag these employees as\n **at risk**\n so you can send communication to get tested.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360058529233\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004137\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nContact Tracing\n\n", "article_total_view_count": "\n\n\n 4,668\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:24 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "contact_tracing", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}