{"file_path": "../../raw_kb_v2\\article\\360042926274\\index.html", "content": {"title": "\n\n\n Adding a DataSet Using a Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can add a DataSet using a data Connector. A data Connector (similar to an alias or DSN) lets you define connection information to a DataSet. While adding a DataSet using a Connector, you can specify the connection information for the specific data provider. Afterwards when you power up Cards you can use the DataSet by selecting the Connector by name.\n\n\n This topic discusses the interface components common to all third-party Connectors. For detailed information about connecting to all of Domo's 500+ public Connectors, see\n\nAPI Connectors\n\n.\n\n\n For information about the Data Center, see\n\nData Center Layout\n\n.\n\n*Notes:**\n\n\n* Domo does not store or transmit user passwords, but stores connector account credentials.\n* If you experience issues connecting to Connectors, ensure that appropriate IP addresses have been whitelisted. For more information, see\n\nWhitelisting IP Addresses for Connectors\n\n.\n\n\n**Video - Connectors Overview**\n\n\n Adding a DataSet using a Connector\n------------------------------------\n\nWhen you add a DataSet using a Connector, it is stored in Domo where you can use it to power multiple Cards without having to specify connection information to that DataSet in each Card.\n\n\n When you add a DataSet, you are automatically assigned as the DataSet owner. For information about changing the owner of a DataSet, see\n\nChanging the Owner of a DataSet\n\n.\n\n\n You can access the interface for adding Connector DataSets via the Appstore, the Data Center, or the\n\nmenu.\n\n\n**To add a DataSet using a Connector,**\n\n. Choose one of the following:\n\n* (Conditional) If you want to connect to data via the APPSTORE, do the following:\n\n\t1. Select\n\t\t **Appstore**\n\t\t in the toolbar at the top of the screen.\n\t\t2. Click the\n\t\t **Search**\n\t\t tab.\n\t\t3. Click the\n\t\t **Connector**\n\t\t checkbox under\n\t\t **Capability**\n\t\t .\n\t\t4. Use the search bar or page navigation to locate the Connector you want to connect to, then click it to open its details view.\n\t\t5. Click\n\t\t **Get the Data**\n\t\t .\n\n\n\t\t Alternatively, for some of the most popular Connectors, a\n\t\t **Get the Cards**\n\t\t button is available. This allows you to power up several prebuilt, live Cards based on your own data, without having to configure advanced options. This is a great way to \"preview\" the Connector to make sure it provides the data you want. If you choose this option, you are asked to select the desired account or input your account information if you haven't created an account for this Connector yet.\n\t* (Conditional) If you want to connect to data via the DATA CENTER, do the following:\n\n\t1. Select\n\t\t **Data**\n\t\t in the toolbar at the top of the screen.\n\t\t2. In the\n\t\t **Connect Data**\n\t\t area at the top of the screen, select\n\t\t **Connectors**\n\t\t ,\n\t\t **File**\n\t\t , or\n\t\t **Database**\n\t\t , depending on the connection type.\n\n\n\t\t You can use the following table to learn more about these Connector types:\n\n\n\t\t|\n\t\t Connector Type\n\t\t  |\n\t\t Description\n\t\t  |\n\t\t| --- | --- |\n\t\t|\n\t\t Connectors\n\t\t  |\n\t\t A Connector for a third-party app in which data is stored in the cloud. Most of Domo's Connectors fall into this category. Examples include Facebook, Salesforce, Adobe Analytics, and so on.\n\t\t  |\n\t\t|\n\t\t File\n\t\t  |\n\t\t A Connector used to pull files into Domo. Examples include Excel, Google Sheets, and Box.\n\t\t  |\n\t\t|\n\t\t Database\n\t\t  |\n\t\t A Connector in which you write a query to pull data from a database into Domo. Examples include MySQL, Amazon Redshift, and MongoDB.\n\t\t  |\n\n\n\t\t The other two icons in this area denote other non-Connector methods for bringing data into Domo.\n\t\t **Federated**\n\t\t refers to federated DataSets, and\n\t\t **API**\n\t\t refers to Domo's development environment, where you can build your own custom Connectors. For more information on Federated DataSets, see\n\n\t Connecting to Data Using Workbench 5\n\n\t .\n\t\t3. Select the Connector type you want.\n\t\t4. Click the desired Connector tile.\n\n\t**Note:**\n\t\t Popular Connectors are marked with a Preferred tag. This is also used when there are several different Connectors to the same data, such as Facebook. The most commonly used option will display the Preferred tag.\n\t* (Conditional) If you want to connect to data via the\n\n menu, do the following:\n\n\t1. Select\n\n\t**> Data**\n\t\t .\n\t\t2. Select\n\t\t **Connectors**\n\t\t ,\n\t\t **File**\n\t\t , or\n\t\t **Database**\n\t\t .\n\n\n\t\t For more information about these Connector types, see the above table.\n\t\t3. Click the desired Connector tile.\n2. Specify the settings in each section.\n\n\n Refer to the general information included in this topic and to the help in the specific data Connector.\n\n\n For more information about configuring specific data Connectors, see Configuring Each Connector.\n\n\n As applicable, click\n **Connect**\n ,\n **Next**\n , or\n **Save**\n and open the next section.\n3. When finished, click\n **Save**\n .\n\n\n You are taken to the details view for the DataSet in the Data Center. For more information about this view, see\n\nData Center Layout\n\n.\n\nConnector settings\n--------------------\n\nAll Connector types in Domo have different options for setting up a DataSet. Most Connectors require you to enter login credentials, an API key, a server URL, or a combination of these to access the Connector. If you cannot connect after entering your credentials, you have most likely entered incorrect credentials. For information about finding credentials, see the documentation for your specific Connector. You can find this under\n\nAPI Connectors\n\n.\n\n\n After you connect, you are usually asked for information about the data you want to pull and the desired format. Most Connectors have two or more associated report types. In addition, many Connectors request a timeframe for the data to be retrieved. You may also be asked to submit a query for retrieving data. For example, when connecting to JIRA you can enter a JQL query to retrieve data for a specified search filter.\n\n\n For most Connectors, you are also asked to schedule data updates. You can use basic scheduling, in which you select a single, specific unit of time (such as \"Every hour\") and enter the time of day when the update is to occur, if required. Or you can use advanced scheduling, in which you can select multiple update times.\n\n\n The information in this section is general and may or may not be required for a certain Connector. For specific requirements for Connectors, see\n\nAPI Connectors\n\n.\n\n##\n Credentials\n\nIf required, specify the credentials for connecting to the data provider. If available, you can select an account or create an account to use in connecting. For more information about accounts, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n Some Connectors, such as Google Drive, use OAuth to connect. This means that you only need to enter your credentials once for a given account. In the future, when you go to create a DataSet using this Connector account, your credentials are passed in automatically. Other Connectors do not use OAuth, so you must enter your credentials each time you create a DataSet using this Connector account.\n\n##\n Details\n\nMost Connectors include a\n **Details**\n settings category. Here you usually specify options like the report to run, the timeframe for the data, a data query for pulling specific information from a database, and so on. If a query is required, the type of query you need to use depends on the Connector type and the source data in your system.\n\n\n Click\n **Load Preview**\n to verify that your data is accessible. If connection errors occur, verify the specified connection information.\n\n##\n Scheduling\n\nIn the\n **Scheduling**\n settings category, you can specify the update schedule, retry settings, and update method you want for this DataSet.\n\n\n You can use either basic or advanced scheduling for connectors.\n\n###\n Basic scheduling\n\n\n#####\n Update\n\nIn the\n **Basic Scheduling**\n tab, you can create a basic update schedule in which you specify a predefined update interval for this DataSet (such as \"every Monday at 10:00 AM\").\n\n\n By default, schedules are set from the current time. Update intervals include every hour, day, weekday, week, month, and manually. Schedule times are based on UTC and will also show what time that is for you based on your Company Time Zone setting.\n\n\n For hour, day, and week options, you can specify the interval (every # hours/days/weekdays) and the start period.\n\n*Note:**\n If you set a Connector schedule using the hourly method, the end time is not inclusive. For example, if the schedule is set to hourly with the active hours set to run 8 AM UTC to 7 AM UTC it will skip the 7 AM UTC run because the end hour is not treated as inclusive.\n\nIf you select\n **Manually**\n for your update interval, you can instruct Domo to send you a notification when the data has not been updated for a given period of time. Time periods range from one hour to three months.\n\n\n**Note:**\n If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n\n\n####\n Update Method\n\nWhen creating or editing a DataSet, you can specify whether to append or replace data when updates occur. The update options are found at the bottom of the\n **Basic Scheduling**\n and\n **Advanced Scheduling**\n tabs.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Replace\n  |\n Replace the current version of the data with a new version of the data. Previous versions are preserved.\n  |\n|\n Append\n  |\n Add data to the current version of the data, increasing the size of the DataSet.\n  |\n|\n Upsert\n  |\n Update DataSets with restated data to ensure you have the most up-to-date information. Available for selected connectors only. For a list of available connectors, see\n\nDataSet Update Methods\n\n.\n  |\n|\n Partition\n  |\n Select a rolling window of data to keep, making it easier to focus on relevant data. Available for selected connectors only. For a list of available connectors, see\n\nDataSet Update Methods\n\n.\n  |\n\n\n####\n Advanced Scheduling\n\nIn the\n **Advanced Scheduling**\n tab, you have more control over when data is updated than you do when using basic scheduling. You can create schedules by month, day of the month, or day of the week. You can even specify which days of the week out of the month you want to update (for example, every second and fourth Sunday).\n\n\n You can indicate whether updates are done on a set interval (such as \"every 15 minutes,\" \"every 8 hours,\" etc.) or at a specified time. You can also set the start time (based on the current minute). If you want, you can set the update schedule to start immediately.\n\n*Note:**\n If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n\nSchedule times are based on UTC but can be seen in your timezone.\n\n\n**Delay start**\n : If you would like to delay when the schedule starts, you can do that in the\n **Delay start**\n section. Select\n **Start schedule: Later**\n , then choose a date and time when you would like your schedule to start. Your DataSet will run once and then wait until the selected time to begin following the schedule.\n\n###\n Error handling\n\nRetry settings determine whether Domo should attempt to retry if updates fail for this DataSet and, if so, the frequency and maximum number of retries. These settings apply only to scheduled runs, not manual runs. You access the retry options dialog by selecting\n **Always retry when an update fails**\n .\n\nThe options in this dialog are as follows:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Always retry when an update fails\n  |\n Domo retries to update the DataSet. After retrying the specified number of times, Domo sends a notification if the update attempt is unsuccessful.\n  |\n|\n Do not retry when update fails\n  |\n Domo sends a notification if the update attempt is unsuccessful, and no retries are made.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042926274\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003962\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAdding a DataSet Using a Connector\n\n", "article_total_view_count": "\n\n\n 19,793\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "adding_a_dataset_using_a_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "general_connect_info", "url": "/s/topic/0TO5w000000ZaoyGAC"}]}