{"file_path": "../../raw_kb_v2\\article\\360042924134\\index.html", "content": {"title": "\n\n\n Formatting Values in Your Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nBy default, values in a chart do not display with formatting such as currency or percent symbols, even if such formatting is used in the original DataSet. You can add value formatting in the Analyzer in the following ways:\n\n Specifying formatting in the column options dialog for the value column.\n\n\n You open this dialog by clicking the column name in the fields region above the chart. Any formatting you apply in this dialog is applied to\n *all*\n values in the chart—scale labels, data labels, hover text, and legends. Summary numbers are\n *not*\n affected. For more information about summary numbers, see\n\nConfiguring Your Chart Summary Number\n\n.\n* Setting the appropriate format in\n\nChart Properties\n\n.\n\n\n In contrast to the column options dialog, which allows you to apply the same change to all numbers in the chart with a single click,\n **Chart Properties**\n lets you make changes to individual properties. These changes override any column options settings you have selected.\n\nBecause you can set formatting for all numbers in the column options dialog and individual properties in\n **Chart Properties**\n , it may be useful to use a combination of these when designing your charts. For example, you could select\n **Type > Currency**\n in the column options dialog to affix dollar signs to all of the values in your chart. Then you could go into\n **Chart Properties**\n and change the currency symbol. The new symbol would replace all of the dollar signs in your chart.\n\n*Note:**\n In chart types with dual y-axes, it is possible to have different number formatting on both axes. For example, you could have percent symbols affixed to the values on one axis and currency symbols on the other. You can set the different number formatting by setting different formatting for both the value and series. However, this only works when you add a value column as a series, as described in\n\nApplying DataSet Columns to Your Chart\n\n. If your series data consists of text, you can still format the axes separately, but you must use the\n **Chart Properties**\n to do so.\n\nFormatting values using the column options dialog\n---------------------------------------------------\n\nThe column options dialog contains various options for formatting values in a chart. Different options appear depending on what you select in the\n **Type**\n menu.\n\nThe following table describes the formatting options available:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Display as\n  |\n Lets you choose how values appear in your chart. Options include the following:\n\n\n**Number**\n - Values appear as is, with no currency or percent symbols\n\n\n**Currency -**\n Values appear with currency symbols affixed. You can change the currency symbol in the\n **$**\n menu that appears. If the\n **$**\n dropdown does not contain the currency symbol you want, you can enter your desired symbol in\n **Chart Properties**\n (\n **Number Format > Currency Symbol**\n ). By default, the currency symbols are affixed to the front of values (for example,\n `$10`\n ). You can change this default behavior in\n **Chart Properties**\n (\n **Number Format > Currency Symbol Position**\n ).\n\n\n**Percentage -**\n Values appear as percentages. If you check the\n **Multiply by 100**\n box that appears when this option is selected, values are multiplied by 100 (for example, the value \".1\" would appear in your chart as\n `10%`\n ). If you leave this box unchecked, values in your chart appear as-is—no multiplication occurs (for example, the value \".1\" would appear as\n `.1%`\n ).\n  |\n|\n Decimals\n  |\n Lets you choose the number of decimal places in values in your chart, either 0, 1, or 2. If you want values to contain more than 2 decimal places, you can specify up to 5 in\n **Chart Properties**\n (\n **Value Scale > Decimal Places**\n ). By default, decimals are indicated by periods (.). You can specify the desired decimal separator in\n **Chart Properties**\n (\n **Number Format > Decimal Separator**\n ).\n  |\n|\n Use Thousands Separator\n  |\n By default, commas (,) are used as the thousands separator. You can specify the desired thousands separator in\n **Chart Properties**\n (\n **Number Format > Thousands Separator**\n ).\n  |\n|\n Preview\n  |\n Shows you a preview of how your chart values will look with your settings applied.\n  |\n\n*To format values using the column options,**\n\n. Open the Analyzer for the chart you want to edit.\n2. Click the value column name in the fields region above the chart preview.\n\n\n The column options dialog opens.\n\n\n For information about applying a value column to a chart, see\n\nApplying DataSet Columns to Your Chart\n\n.\n3. Select the desired formatting options in the dialog.\n\nFormatting values using Chart Properties\n------------------------------------------\n\n*Chart Properties**\n contains countless options for formatting values in charts. As mentioned previously, any changes you make in\n **Chart Properties**\n override the universal formatting that is applied when you select an option in the column options dialog.\n\n\n This section lists and describes some of the chart properties commonly used for formatting numbers. This list is by no means exhaustive.\n\n##\n Value Scale properties\n\nThese properties pertain to the values that appear along the measuring scale in most chart types. For example, in a vertical Bar graph, these are the values found on the vertical axis on the left side of the graph.\n\n\n Property\n  |\n Description\n  |\n| --- | --- |\n|\n Label Format\n  |\n Determines the type of number formatting found in scale values. You can customize the actual symbols used in values in the\n **Number Format**\n properties (see the next section for more information).\n\n\n**Number**\n — Numbers appear without currency or percentage symbols. (Default)\n\n\n**Currency**\n — Affixes a \"$\" to scale values.\n\n\n**Percentage**\n — Affixes a \"%\" to scale values.\n  |\n|\n Divide Scale By\n  |\n Refers to the number that values in the value scale are to be divided by if any. This option is useful when the numbers on your value scale are very large and you want to abbreviate them by dividing by a common number. For example, if all of the numbers on the value scale represented millions of dollars, you could choose to divide by millions—all of the numbers on the scale would then be reduced to more manageable single digits. When you choose to divide by\n **Percentage**\n , the numbers in the value scale are multiplied by 100. This is especially useful when your values are in decimal format and you want them to appear as percentages.\n  |\n|\n Decimal Places\n  |\n Determines the number of decimal places used in decimal values. You can choose from\n **Default**\n ,\n **None**\n , and options for numbers of decimal places (from \".0\" to \".00000\").\n  |\n|\n Negative Numbers\n  |\n Determines the format for negative numbers. If you select\n **-100**\n , all negative numbers have a minus symbol affixed. If you select\n **(100)**\n , all negative numbers are enclosed in parentheses.\n  |\n\n\n###\n Number Format properties\n\nThese properties pertain to the actual symbols used in values in your chart. Changes you make here are applied to all of the values in the chart.\n\n\n Property\n  |\n Description\n  |\n| --- | --- |\n|\n Currency Symbol\n  |\n The symbol or group of symbols used to denote currency in values in your chart. The default currency symbol is \"$.\"\n\n*Note:**\n If you use a close parenthesis as part of your currency symbol, you\n *must*\n pair it with an open parenthesis.\n\n|\n|\n Currency Symbol Position\n  |\n Determines whether currency symbols appear before or after their values.\n  |\n|\n Decimal Separator\n  |\n Determines the symbol for separate decimal values. The default decimal separator is a period.\n  |\n|\n Thousands Separator\n  |\n Determines the symbol used to separate thousands in large numbers. The default thousands separator is a comma.\n  |\n\n\n###\n Data Label Settings\n\nThese properties pertain to the data labels that appear in a chart when you enter text into the\n **Data Label Settings > Text**\n field. For more information about data labels, see\n\nFormatting Data Label and Hover Text in Your Chart\n\n.\n\n\n Property\n  |\n Description\n  |\n| --- | --- |\n|\n Use Scale Format\n  |\n When this box is checked, data labels use the same number formatting set for scale values in the chart.\n  |\n|\n Percent Value Decimal Places\n  |\n Determines the number of decimal places used in data labels. The default is none.\n  |\n\n\n###\n Hover Text Settings\n\nThese properties pertain to text that appears when you mouse over an element in a chart. For more information about hover text, see\n\nFormatting Data Label and Hover Text in Your Chart\n\n.\n\n\n Property\n  |\n Description\n  |\n| --- | --- |\n|\n Use Scale Format\n  |\n When this box is checked, hover text uses the same formatting set for scale values in the chart.\n  |\n|\n Hover Format\n  |\n Determines the type of number formatting found in scale values. You can customize the actual symbols used in values in the\n **Number Format**\n properties (see the next section for more information).\n\n\n**Number**\n — Numbers appear without currency or percentage symbols. (Default)\n\n\n**Currency**\n — Affixes a \"$\" to scale values.\n\n\n**Percentage**\n — Affixes a \"%\" to scale values.\n  |\n|\n Divide Value By\n  |\n Refers to the number that values in hovers are to be divided by, if any. This option is useful when the values in your chart are very large and you want to abbreviate them by dividing by a common number. For example, if all of the values in the chart represented millions of dollars, you could choose to divide by millions—all of the values in hovers would then be reduced to more manageable single digits. When you choose to divide by\n **Percentage**\n , values in hovers are multiplied by 100. This is especially useful when your values are in decimal format and you want them to appear as percentages.\n  |\n|\n Decimal Places\n  |\n Determines the number of decimal places used in decimal values in hovers. You can choose from\n **Default**\n ,\n **None**\n , and options for numbers of decimal places (from \".0\" to \".00000\").\n  |\n|\n Negative Numbers\n  |\n Determines the format for negative numbers in hovers. If you select\n **-100**\n , all negative numbers have a minus symbol affixed. If you select\n **(100)**\n , all negative numbers are enclosed in parentheses.\n  |\n\n*To format values in Chart Properties,**\n\n. Open the Analyzer for the chart you want to edit.\n2. In\n **Chart Properties**\n , mouse over the desired category to display the options in that category.\n3. Make the changes you want.\n\n*Tips for converting numbers into percentages:**\n\n The easiest way to convert numbers into percentages is by selecting the desired percentage option in the column options dialog. This converts\n *all*\n values in your chart (except for summary numbers) into percent format. You can choose whether percent values appear as is (for example, \"10\" becomes \"10%\") or the values are first multiplied by 100 (for example, \".1\" becomes \"10%\"). You can then make any property changes to your percent values in\n **Chart Properties**\n .\n* If you plan to use\n **Chart Properties**\n entirely, without applying universal value formatting in the column options dialog, the following tips may be of use:\n\n+ Ensure that your data column values use a \"x.xx\" format. For example, if you wanted a number on your value scale to read \"40%,\" that value would read as \".40\" in your DataSet.\n\t+ Convert your data label values into percentages by selecting\n\t **Percentage**\n\t under\n\t **Label Format**\n\t in the Chart Properties.\n\t+ Convert decimal values into percentages by selecting\n\t **Percentage**\n\t under\n\t **Divide Scale By**\n\t in Chart Properties You can then append percent values by changing the number format to a percentage, as described above. However, it is\n\t *not*\n\t recommended that you perform these steps in reverse order.\n\t+ Use Beast Mode to transform column values into percentages. You can use the calculation\n\n CASE WHEN `value2` > 0 THEN `value1` / `value2` ELSE 0 END\n\n to prevent zero values being divided by zero. For more information about Beast Mode, see Transforming Data Using\n\n Beast Mode\n\n .\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924134\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004642\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFormatting Values in Your Chart\n\n", "article_total_view_count": "\n\n\n 13,492\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:18 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "formatting_values_in_your_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "analyzer", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}