{"file_path": "../../raw_kb_v2\\article\\360043428793\\index.html", "content": {"Title": "Creating a Map with Regions", "Article Body": "Intro\n                       \n\n                        Using Domo's Custom Regions tool, you can set up a map with regional groupings that match your business regions.\n                       \n\n                        For example, let's say you manage a number of time share properties in the United States. These properties are divided across five distinct regions—West, Southwest, Midwest, Southeast, and Northeast. You want to be able to see at a glance the revenue gained from each region, something like the following:\n                        \n\n\n\n\n                        However, Domo does not include a preinstalled map for regions of the United States (and if it did, the states in each grouping would probably not exactly correspond to the states in the regions in your company).\n                       \n\n                        The solution is to set up custom regional groupings. There are two ways to do this in Domo:\n                       \n\n\n\n                          Customize an SVG map of the United States by adding grouping tags, as discussed in detail in\n                          \n                           Custom Charts\n                          \n                          . This requires a rudimentary knowledge of XML.\n                         \n\n\n\n                          Use the Custom Regions tool to upload a DataSet that includes a column for the new custom regions matched with the sub-regions within them. This solution requires a simple understanding of\n                          \n                           Domo dataset structure\n                          \n                          ; however, knowledge of XML is not required.\n                         \n\n\n\n                        This topic discusses the second option, including how to set up your DataSets properly. For an in-depth discussion of building custom charts from scratch, see\n                        \n                         Custom Charts\n                        \n                        .\n                       \n\n\n\n                          Video - Custom Map Regions\n                         \n\n\n\n\n\n\n\n\n\n                        Setting Up Your DataSet\n                       \n\n                        Before you can incorporate regions into a map, you must first ensure that your DataSet is set up properly. The DataSet\n                        \n                         must\n                        \n                        contain the following columns for regions to work:\n                       \n\n\n\n                          A column with the names of the regions (i.e. the larger geographical areas your sub-regions will be divided between). For example, in the U.S. map shown above, there are 5 regions—a Southwestern region that includes Arizona, New Mexico, Texas, and Oklahoma; a Western region with California, Nevada, Idaho, etc.; and so on.\n                         \n\n\n\n                          A column with the names of the sub-regions (i.e. the smaller geographical areas that will be divided across the larger areas). Sub-regions in the above map include individual states such as California, Texas, Alaska, etc.\n                         \n\n\n\n                        So the DataSet used to divide the above U.S. map into regions would include columns that look something like the following:\n                       \n\n\n\n\n                        As another example, here is a portion of a DataSet used to divide a map of Canada into western, central, and eastern regions:\n                       \n\n\n\n\n                        This DataSet matches regions with three-digit FSA codes, though you could also use provinces if you wanted.\n                       \n\n                        The resulting map would look as follows (with shading based on a value column applied afterward in the Analyzer):\n                        \n\n\n\n\n\n                        Adding Regions to a Map\n                       \n\n                        Once you have all of the necessary columns in your DataSet, you are ready to create a new regional map in your Domo instance. You must have an \"Admin\" default security profile or a custom role with \"Manage All Company Settings\" to add maps to Domo. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            If you want to regionalize a map for a country\n                           \n\n                            not available in Domo, you must first upload an SVG map for that country. Y\n                           \n                           ou can download SVG country maps from any of a number of websites, such as\n                           \n                            http://www.amcharts.com/svg-maps/\n                           \n                           and\n                           \n                            https://simplemaps.com/resources/svg-maps\n                           \n                           . These sites also include maps for overseas territories such as French Guiana, Aruba, and so on.\n                           \n                            For more information about downloading SVG maps, see\n                            \n                             Obtaining an SVG Chart\n                            \n                            .\n                            \n\n\n\n\n\n\n\n\n                         To regionalize a map,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Admin\n                          \n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          In Admin Settings, select\n                          \n                           Company Settings > Custom Charts\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Add Chart\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Create regions\n                          \n                          .\n                         \n\n\n\n                          Click on the map you want to add regions to, then click\n                          \n                           Next\n                          \n                          .\n                          \n\n                          If the map you want to regionalize has been added to Domo using the Custom Charts tool, you can find it by switching to \"Custom Charts\" in the menu at the top of the dialog.\n                          \n\n\n\n\n                          If the country map you want is not in Domo, you must first upload it. (See the note at the top of this section.)\n                         \n\n\n\n                          In the DataSet dialog, use the search and filter options to locate the DataSet with your regions data, then click\n                          \n                           Select DataSet\n                          \n                          .\n                          \n\n                          If the DataSet you need is not yet available in Domo, you can upload it by clicking\n                          \n                           Add DataSet\n                          \n                          then configuring the connector you want to use to pull data. For more information, see\n                          \n                           Adding a DataSet Using a Data Connector\n                          \n                          .\n                          \n\n                          After you click\n                          \n                           Select DataSet\n                          \n                          , a new window opens in which you can select your region and sub-region columns.\n                         \n\n\n\n                          In the\n                          \n                           Select new custom region\n                          \n                          menu, select the name of the column containing your regions (i.e. the larger geographical areas your sub-regions will be divided between).\n                          \n\n\n\n\n\n\n                          In the\n                          \n                           Select column for subregions\n                          \n                          menu, select the name of the column containing your subregions (i.e. the smaller geographical areas that will be divided across the larger areas).\n                          \n\n\n\n\n                          After you make selections in both menus, your map should update to show the new regional areas.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                          \n\n                          A new window now opens in which you can choose from two configuration options.\n                         \n\n\n\n                          Uncheck the\n                          \n                           Show lines separating sub-regions\n                          \n                          box if you want to remove the borders between your subregions; otherwise leave this box checked.\n                          \n\n                          The following screenshot shows an example of this, in which the lines bordering the U.S. states have been removed:\n                          \n\n\n\n\n\n\n                          Uncheck the\n                          \n                           Show sub-regions not included in DataSet\n                          \n                          box if you want to hide regions not included in the DataSet; otherwise leave this box checked.\n                          \n\n                          The following screenshot shows an example of this, in which the \"Northeastern\" and \"Southeastern\" regions do not appear because there is no data for them in the DataSet. This is an excellent option to use when you want to show map data only for specific regions of a given country.\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          In the new window that appears, enter a name for the map.\n                          \n                          This is the name of the map as it will appear in the Chart Picker.\n                         \n\n\n\n                          (Optional) Enter a description for the map if desired.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        The map should now be available in the Chart Picker in Analyzer, under\n                        \n                         Custom Charts\n                        \n                        .\n                       \n\n                        Building Your Map in Analyzer\n                       \n\n                        After you upload your map to Domo, you can build a card from it in Analyzer just as you would any other country map. You can access the new map in\n                        \n                         Custom Charts\n                        \n                        in the Chart Picker. For instructions about building country maps, see\n                        \n                         Country Map\n                        \n                        .\n                       \n\n                        Chart properties for custom maps are the same as those used in most other geographical maps. For a list of these properties, see\n                        \n                         Properties for Maps\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043428793", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004632", "Archived Date": "", "Language": "English", "Primary Version": "Creating a Map with Regions", "Article Total View Count": "5,484", "": "", "Article Created Date": "10/24/2022, 10:17 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Creating a Map with Regions\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Analyzer\n              \n", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}