{"file_path": "../../raw_kb_v2\\article\\360043428553\\index.html", "content": {"title": "\n\n\n Understanding Pages\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn Domo,\n *Pages*\n are screens where you can view Cards.\n\nPages can be\n *system*\n Pages or\n *Card*\n Pages. System Pages have special properties (discussed in the next section) and are included by default in every Domo instance; you cannot copy, delete, or modify these. Card Pages are Pages you add yourself to your instance. These comes in two types, as will be explained later.\n\n\n For more information about Cards, see\n\nUnderstanding Cards\n\n.\n\n\n For information about personalizing the layout of Cards in Pages, see\n\nManaging Cards and Pages\n\n.\n\n\n For more information about Domo Stories, see\n\nCreating Domo Stories\n\n.\n\n\n System Pages\n--------------\n\nDomo contains several system Pages available by default in every instance.\n\n\n Page Name\n  |\n Description\n  |\n| --- | --- |\n|\n Getting Started\n  |\n Provides a default landing page with access to Cards and Pages, Buzz, and Alerts. Admin-level users can hide the\n **Getting Started**\n page for their instance by going into\n **Admin > Company Settings > Company page settings**\n and checking\n ****Hide \"Getting Started\" page from everyone****\n .\n\n\n This Page is currently in BETA.\n  |\n|\n Business in a Box\n  |\n Provides access to pre-installed best practice dashboards that allow you to quickly bring the power of Domo to your whole company. For more information, see\n\nBusiness in a Box\n\n.\n  |\n|\n Overview\n  |\n Contains Cards based on the default overview content specified for the groups you are a member of. In Admin Settings, administrators can specify the Cards that users see in this Page when they sign in to Domo. For more information, see\n\nSpecifying Default Overview Content for Users\n\n.\n  |\n|\n Favorites\n  |\n Contains Cards you have designated as Favorites. You receive daily status reports for all Cards designated as Favorites. For more information, see\n\nAdding Cards as Favorites\n\n.\n  |\n|\n Shared\n  |\n Contains Cards that other users have shared with you. For more information, see\n\nControlling Access to Cards and Pages\n\n.\n  |\n\n\n**Video - Understanding Default Pages**\n\nCard Pages\n------------\n\nCard Pages are Pages you add yourself to your instance. These comes in two types:\n\n Standard Card Pages. Users can personalize these basic Pages by rearranging and resizing Cards and creating Collections. Other functionality such as borders and headers, background colors, drill-in-place, etc. is available only in Domo Stories Pages, not standard Pages.\n* Domo Stories Pages. These Pages can only be personalized within a special Edit view, ensuring that all users see the same thing in a Page. Cards in a Domo Stories Page also appear the same no matter what device or platform you are using. These Pages also provide many more personalization options than standard Pages, such as headers, borders, background colors. You can also specify what actions occur when Cards are clicked (drill-in-place, opening an external URL, etc.). For more information about Domo Stories, see\n\nCreating Domo Stories\n\n.\n\nNavigating to Pages and Subpages\n----------------------------------\n\nYou can find all of the Pages and Subpages you have access to on the left side of the screen in a scrollable \"Dashboards\" list. You can collapse this list by clicking the\n\nicon, giving more space when you want to focus on important dashboard content. You can still show the list when it is in its collapsed state by mousing over the\n\nicon, or \"repin\" the list by clicking\n\n.\n\nYou can search for Pages and Subpages in your instance by entering the name in the\n **Filter by name**\n box, allowing you to quickly filter down the list of Pages as you type.\n\nIf you have added Pages as Favories, you can jump to them quickly by clicking\n **Favorites**\n at the top of the Pages list and selecting the Page you want to open.\n\n\n You can add, rename, reorder, and hide Pages in the\n **Manage Pages**\n dialog, which you access by clicking\n **Manage Pages**\n at the bottom of the left-hand Pages navigation list. For more information, see\n\nManaging Pages\n\n.\n\nAdding Pages to your Domo instance\n------------------------------------\n\nYou can add Pages and Subpages to your Domo instance in the\n **Manage Pages**\n dialog. For more information about this dialog, see\n\nManaging Pages\n\n.\n\n\n Sharing Pages\n---------------\n\nBy default, when you add a Page or Subpage to Domo, you are the only user who can access that Page. You can share access to Pages and Cards using sharing controls. For more information, see\n\nSharing Access to Content\n\n.\n\nViewing or changing the Page owner\n------------------------------------\n\nYou can view the owner of a Page. The owner's user photo appears at the top of the Page to the left of the \"Shared\" information.\n\nWhen you click the owner's photo, an avatar Card appears that contains contact information, the user's most frequently and recently viewed Cards, a\n\nFollowing a Card or User in Buzz\n\n.\n\n\n You can change the owner of a Page by clicking the\n **Change**\n link and selecting the new owner in the menu. This link only appears if...\n\n you have an \"Admin\" default security role,\n* you have a custom role with the \"Manage Cards and Pages\" privilege enabled, or\n* you are the Page owner.\n\nFor more information about default security roles, see\n\nManaging Roles\n\n.\n\n\n Adding Cards to Pages\n-----------------------\n\nClicking\n\nin the upper right corner of a Page (or selecting\n\n*> Card**\n ) displays options for adding a Card. For more information, see\n\nAdding Cards to Domo\n\n.\n\n\n Options for Pages\n-------------------\n\nOptions for working with Pages can be found under the three icons in the top right corner of the Page view. These can be divided up as follows: \"Add Page\" options (found under the\n\nmenu), \"Share Page\" options (found under the\n\nmenu), and \"Configure Page\" options (found under the\n\nmenu).\n\n##\n \"Add Pages\" options\n\nClick\n\nin the upper right corner of a Page to access options for adding Pages.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Add Existing Card\n  |\n Lets you select a Card that has already been created in Domo and add it to this Page. For more information, see\n\nAdding an Existing Card to a Page\n\n.\n  |\n|\n Create New Card\n  |\n Lets you create a new Card in Domo using one of a number of different options, including uploading an Excel or CSV file, creating a Notebook Card, building a Card using existing data, and so on. For more information, see\n\nAdding Cards to Domo\n\n.\n  |\n|\n Assign Card Creation\n  |\n Lets you assign another user in your organization to create a Card. For more information, see\n\nAssigning Users to Power Up Template KPI Cards\n\n.\n  |\n|\n New Collection (standard Pages only)\n  |\n Allows you to create a new Card collection on this Page. For more information, see\n\nCreating and Managing Card Collections\n\n.\n  |\n|\n View App Details\n  |\n Displays the\n **Details**\n view of the QuickStart App in use for the Page and the Cards. For more information, see\n\nThe Appstore\n\n.\n  |\n\n\n###\n \"Share Page\" options\n\nClick\n\nin the upper right corner of a Page to access options for sharing a Page.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Share\n  |\n Lets you share access to this Page with other users in your organization. For more information, see\n\nSharing Content in Domo\n\n.\n  |\n|\n View Page as Slideshow\n  |\n Plays Cards in the Page as a temporary slideshow. For more information, see\n\nViewing a one-time slideshow of Cards on a Page\n\n.\n  |\n|\n Publish as Slideshow\n  |\n Adds Cards in the Page as slides in a slideshow that you can save. For more information about creating and managing slideshows, see\n\nSharing Content Using Slideshows\n\n.\n  |\n|\n Export as PowerPoint\n  |\n Downloads all of the Cards in this Page to Microsoft PowerPoint. For more information, see\n\nExporting KPI Cards\n\n.\n  |\n|\n Export as PDF (Domo Stories Pages only)\n  |\n Exports this Page and all of the Cards in it as a PDF. For more information, see\n\nExporting Domo Stories Pages to PDF\n\n.\n  |\n|\n Publish to Store\n  |\n Lets you publish this Page to the Appstore. For more information about the App publication process, visit\n\nhttps://developer.domo.com/domo-apps\n\n.\n  |\n|\n Schedule as Report\n  |\n Lets you set a schedule for this Page to be sent to users as a Scheduled Report. For more information, see\n\nScheduling Reports\n\n.\n  |\n|\n Send Now\n  |\n Sends a Scheduled Report for this Page to the users in the recipient list immediately instead of having to wait for the scheduled time. For more information, see\n\nScheduling Reports\n\n.\n  |\n\n\n###\n \"Configure Page\" options\n\nClick\n\nin the upper right corner of a Page to access options for configuring this Page.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Design Dashboard (Standard Pages only)\n  |\n Lets you convert a Standard Page into a Domo Stories Page. If the Page is already a Domo Stories Page, this option is replaced by\n **Edit Dashboard**\n . For more information, see\n\nCreating Domo Stories\n\n.\n  |\n|\n Edit Dashboard (Domo Stories Pages only)\n  |\n Opens the Editor mode for a Domo Stories Page so you can make changes to the layout, Cards, interactions, and so on. For more information, see\n\nCreating Domo Stories\n\n.\n  |\n|\n Convert to Standard Page (Domo Stories Pages only)\n  |\n Reverts this Domo Stories Page back to a Standard Page. For more information, see\n\nCreating Domo Stories\n\n.\n  |\n|\n Add to Favorites\n  |\n Adds this Page to your list of favorited Pages. Once a Page is added as a Favorite, you can open it quickly by clicking\n **Favorites**\n in the left-hand navigation panel and choosing the Page you want. For more information, see\n\nAdding Pages as Favorites\n\n.\n  |\n|\n Remove from Favorites\n  |\n Removes this Page from your favorited Pages. For more information, see\n\nAdding Pages as Favorites\n\n.\n  |\n|\n Edit Scheduled Reports\n  |\n Opens the Scheduled Report Editor mode for this Page. For more information, see\n\nScheduling Reports\n\n.\n  |\n|\n Expand All Collections (Standard Pages only)\n  |\n Opens all Collections on this Page. For more information, see\n\nCreating and Managing Card Collections\n\n.\n  |\n|\n Collapse All Collections (Standard Pages only)\n  |\n Collapses all Collections on this Page. For more information, see\n\nCreating and Managing Card Collections\n\n.\n  |\n|\n Save As\n  |\n Lets you save this Page as a new version. For more information, see\n\nDuplicating Pages\n\n.\n  |\n|\n Full Screen (Domo Stories Pages only)\n  |\n Opens the full-screen mode for a Domo Stories Page. For more information, see\n\nCreating Domo Stories\n\n.\n  |\n|\n Size options (Standard Pages only)\n  |\n Allow you to change the size of all of the Cards in this Page. For more information, see\n\nChanging the Size of Cards in a Page\n\n.\n  |\n|\n Connect/Update Data (App Pages only)\n  |\n Lets you connect data to this App Page or update the data source being used to power the Cards. For more information, see\n\nDeploying Apps from the Appstore\n\n.\n  |\n\nPage Filters\n--------------\n\nYou can use Page Filters to apply data filters that affect all of the KPI, Sumo, and Domo App cards powered by a specified DataSet in a page. You turn on Page Filters by clicking the\n\nicon in the upper right area of the Page then setting Filters as desired. For more information, see\n\nApplying Page-Level Filters with Filter Views\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428553\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004054\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUnderstanding Pages\n\n", "article_total_view_count": "\n\n\n 6,818\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "understanding_pages", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "consuming_data_in_domo", "url": "/s/topic/0TO5w000000ZamnGAC"}, {"text": "interacting_with_cards_and_dashboards", "url": "/s/topic/0TO5w000000ZansGAC"}]}