{"file_path": "../../raw_kb_v2\\article\\360043428133\\index.html", "content": {"Title": "Creating a Recursive/Snapshot SQL DataFlow", "Article Body": "A \"recursive\" or \"snapshot\" DataFlow is a DataFlow that uses itself as an input.\n                       \n\n                        DataFlows (neither SQL nor ETL types) cannot append data natively like connectors. However, if you need to create a DataFlow that appends data, you can do so by running it once and then using the output as part of the input for the next run. This way, every time the DataFlow runs, it includes the data from before and also appends the new data onto itself.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            If a recursive DataFlow is edited incorrectly, you could lose ALL historical data. To avoid this any time you are editing, create an additional DataSet that is a copy of your historical DataSet. This DataSet will remain static. If anything happens to your historical DataSet, you will have a backup from before you began editing.\n                           \n\n\n\n\n\n\n\n                          Video - What is a Recursive DataFlow?\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                         To create a recursive SQL DataFlow,\n                        \n\n\n\n\n                          Create and run an SQL DataFlow.\n                          \n                          The query for the output DataSet will be\n                          \n                           SELECT * FROM\n                           \n                            your-input-DataSet\n                           \n\n\n\n\n\n\n\n\n                          Once the DataFlow has finished running, load the output DataSet as an input DataSet.\n                          \n                          The DataSet name will show the output DataSet name followed by \"1.\"\n                          \n\n\n\n\n                          You should now have two DataSets in the DataFlow—the updating original DataSet and the historical DataSet.\n                         \n\n\n\n                          Locate a column to use as a constraint. This helps determine when to replace data in your historical DataSet with new data. Constraint columns are normally ID columns or date columns or have other unique identifiers. In this example we use the `Date` column as a constraint.\n                          \n                          Your query should look similar to the following:\n                          \n\n\n\n\n\n\n                          Filter your data so you are pulling historical data where it does not exist in the original DataSet.\n                         \n\n\n\n                          Combine your new and historical DataSets.\n                          \n\n\n\n\n\n\n\n                          Append the new data with the historical DataSet.\n                         \n\n\n\n                          Output the data using the same output you created back in Step 1. You don't need to create a brand new output.", "Preview Article": "Click here to preview", "URL Name": "360043428133", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004605", "Archived Date": "", "Language": "English", "Primary Version": "Creating a Recursive/Snapshot SQL DataFlow", "Article Total View Count": "5,168", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Creating a Recursive/Snapshot SQL DataFlow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Transformation Tips And Tricks\n              \n", "url": "/s/topic/0TO5w000000ZaoJGAS"}]}