{"file_path": "../../raw_kb_v2\\article\\4409542407063\\index.html", "content": {"Title": "Resource Library", "Article Body": "Intro\n                       \n\n                        The Resource Library lets you quickly access additional information to answer your Domo questions. It also stores all of the pop-up guides and walkthroughs of new features so that you can review them again once you have closed the window.\n                       \n\n                        To access the Resource Library, click the\n                        \n                        icon in the bottom corner of your screen. The Resource Library consists of three parts:\n                       \n\n\n\n                          Guides and walkthroughs\n                         \n\n\n\n                          Resources\n                         \n\n\n\n                          Product announcements\n                         \n\n\n\n\n\n\n                        Guides and walkthroughs\n                       \n\n                        The Guides and walkthroughs section contains all of the information in the pop-up windows when you first log into Domo. These can now be re-triggered to go over the information again.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The list will only display features that are relevant to the current Page you are on. For example, if a Guide is for something in the Data Center, you will need to be on the Data Center Page for the Guide to display in the list.\n                          \n\n\n\n\n\n\n\n                        Resources\n                       \n\n                        The Resources section has quick links to:\n                       \n\n\n\n                          Help Center\n                         \n                         - Takes you to the Help Center page that has additional resource links to Domo University, Videos, Knowledge Base, and the Community Forum.\n                        \n\n\n                          Developer Portal\n                         \n                         - Takes you to the Domo Developer site.\n                        \n\n\n                          New feature releases\n                         \n                         - Takes you to the New Features site.\n                        \n\n\n\n\n\n                        Product announcements\n                       \n\n                        The Product announcements section shows any new product features that are available along with the current release notes.", "Preview Article": "Click here to preview", "URL Name": "4409542407063", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004329", "Archived Date": "", "Language": "English", "Primary Version": "Resource Library", "Article Total View Count": "4,834", "": "", "Article Created Date": "10/24/2022, 9:40 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Resource Library\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Getting Started\n              \n", "url": "/s/topic/0TO5w000000ZanlGAC"}]}