{"file_path": "../../raw_kb_v2\\article\\360043431113\\index.html", "content": {"Title": "Dotmailer Connector", "Article Body": "Intro\n                       \n\n                        dotmailer is a\n                        \n                         scalable email marketing and marketing automation solution\n                        \n                        . To learn more about the dotmailer API, visit their page (\n                        \n                         https://developer.dotmailer.com/\n                        \n                        ).\n                        \n\n\n\n                        You connect to your dotmailer account in the Data Center. This topic discusses the fields and menus that are specific to the dotmailer connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your dotmailer account and create a DataSet, you must have a dotmailer username and password.\n                       \n\n                        Connecting to Your dotmailer Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the dotmailer Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your dotmailer account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter the username for your dotmailer account.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter the password for your dotmailer account.\n                           \n\n\n\n\n\n\n                         Once you have entered valid dotmailer credentials, you can use the same account any time you go to create a new dotmailer DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the dotmailer report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Address Books\n                               \n\n\n\n                                Retrieves a list of all address books in the account.\n                               \n\n\n\n\n\n                                Address Books for Campaign\n                               \n\n\n\n                                Retrieves a list of address books and segments that a campaign has been sent to.\n                               \n\n\n\n\n\n                                Address Book for Contact\n                               \n\n\n\n                                Retrieves a list of address books containing a contact with a specified email address.\n                               \n\n\n\n\n\n                                Campaign Activities\n                               \n\n\n\n                                Retrieves a list of contacts associated with a campaign, along with their activity, after a given date.\n                               \n\n\n\n\n\n                                Campaign Clicks\n                               \n\n\n\n                                Retrieves the number of link clicks for a given campaign.\n                               \n\n\n\n\n\n                                Campaign Contact Activities\n                               \n\n\n\n                                Retrieves a list of activities for a given campaign and email address.\n                               \n\n\n\n\n\n                                Campaign Contact Clicks\n                               \n\n\n\n                                Retrieves a list of clicks for a given campaign and email address.\n                               \n\n\n\n\n\n                                Campaign Contact Opens\n                               \n\n\n\n                                Retrieves a list of opens for a given campaign and email address.\n                               \n\n\n\n\n\n                                Campaign Contact Page Views\n                               \n\n\n\n                                Retrieves a list of page views for a given campaign and email address.\n                               \n\n\n\n\n\n                                Campaign Contact Replies\n                               \n\n\n\n                                Retrieves a list of replies for a given campaign and email address.\n                               \n\n\n\n\n\n                                Campaign Contact ROI Details\n                               \n\n\n\n                                Retrieves ROI information for a given campaign and email address.\n                               \n\n\n\n\n\n                                Campaign Contact Social Bookmark Views\n                               \n\n\n\n                                Retrieves a list of social bookmark views for a given campaign and email address.\n                               \n\n\n\n\n\n                                Campaign Hard Bouncing Contacts\n                               \n\n\n\n                                Retrieves a list of contacts who hard-bounced when sent the specified campaign\n                               \n\n\n\n\n\n                                Campaign Opens\n                               \n\n\n\n                                Retrieves a list of campaign opens after a given date.\n                               \n\n\n\n\n\n                                Campaign ROI Details\n                               \n\n\n\n                                Retrieves campaign ROI details after a given date.\n                               \n\n\n\n\n\n                                Campaign Page Views\n                               \n\n\n\n                                Retrieves a list of campaign page views after a given date.\n                               \n\n\n\n\n\n                                Campaigns\n                               \n\n\n\n                                Retrieves all existing campaigns in the account.\n                               \n\n\n\n\n\n                                Campaigns for Address Book\n                               \n\n\n\n                                Retrieves a list of campaigns that have been sent to the given address book.\n                               \n\n\n\n\n\n                                Campaign Social Bookmark Views\n                               \n\n\n\n                                Retrieves a list of social bookmark views for the given campaign.\n                               \n\n\n\n\n\n                                Campaign Summary\n                               \n\n\n\n                                Retrieves a summary of reporting information for the selected campaign.\n                               \n\n\n\n\n\n                                Contacts\n                               \n\n\n\n                                Retrieves a list of contacts in the account.\n                               \n\n\n\n\n\n                                Contacts in Address Book\n                               \n\n\n\n                                Retrieves a list of contacts in the selected address book.\n                               \n\n\n\n\n\n                                Custom From Addresses\n                               \n\n\n\n                                Retrieves a list of all \"custom from\" addresses which can be used in a campaign.\n                               \n\n\n\n\n\n                                Enrolments by Status\n                               \n\n\n\n                                Retrieves a list of program enrolments by status (processing or finished).\n                               \n\n\n\n\n\n                                Modified Contact\n                               \n\n\n\n                                Retrieves a list of contacts modified after a given date.\n                               \n\n\n\n\n\n                                Modified Contact in Address Book\n                               \n\n\n\n                                Retrieves a list of contacts in a given address book modified since a given date.\n                               \n\n\n\n\n\n                                New Contact\n                               \n\n\n\n                                Retrieves a list of contacts who are new since a given date.\n                               \n\n\n\n\n\n                                Programs\n                               \n\n\n\n                                Retrieves a list of programs for the account.\n                               \n\n\n\n\n\n                                Segments\n                               \n\n\n\n                                Retrieves a list of segments for the account.\n                               \n\n\n\n\n\n                                Sent Campaign with Activity\n                               \n\n\n\n                                Retrieves a list of all sent campaigns that have had activity since a specified date.\n                               \n\n\n\n\n\n                                Suppressed Contacts\n                               \n\n\n\n                                Retrieves a list of suppressed contacts after a given date along with the reason for suppression.\n                               \n\n\n\n\n\n                                Survey Field\n                               \n\n\n\n                                Retrieves a list of pages for the selected survey, each containing a list of the fields on that page.\n                               \n\n\n\n\n\n                                Survey Responses\n                               \n\n\n\n                                Retrieves the list of responses for a selected survey.\n                               \n\n\n\n\n\n                                Survey Responses with Activity\n                               \n\n\n\n                                Retrieves response activity for a specified survey since a specified date.\n                               \n\n\n\n\n\n                                Surveys\n                               \n\n\n\n                                Retrieves a list of surveys in the account.\n                               \n\n\n\n\n\n                                Surveys with Activity\n                               \n\n\n\n                                Retrieves activity for a specified survey since a specified date.\n                               \n\n\n\n\n\n                                Templates\n                               \n\n\n\n                                Retrieves a list of templates for the account.\n                               \n\n\n\n\n\n\n\n\n\n                            Campaigns\n                           \n\n\n\n                            Select the campaign you want to retrieve data for.\n                           \n\n\n\n\n\n                            Date Since\n                           \n\n\n\n                            Select whether this report contains data for a specific date or a given number of past days (relative).\n                           \n\n\n\n\n\n                            Specific Date\n                           \n\n\n\n                            Select the date you want to retrieve data for.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days you want to retrieve data for. For example, if you entered\n                            \n                             7\n                            \n                            , data would be pulled for the last week every time you ran this report.\n                           \n\n\n\n\n\n                            Address Book\n                           \n\n\n\n                            Select the address book you want to retrieve data for.\n                           \n\n\n\n\n\n                            Survey\n                           \n\n\n\n                            Select the survey you want to retrieve information for.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043431113", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003781", "Archived Date": "", "Language": "English", "Primary Version": "Dotmailer Connector", "Article Total View Count": "2,365", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Dotmailer Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}