{"file_path": "../../raw_kb_v2\\article\\360047231334\\index.html", "content": {"title": "\n\n\n Programmatic Revenue\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Programmatic Revenue App provides you with the ability to manage and oversee your programmatic business using advanced capabilities and aggregated analytics. Set quarterly, monthly, or yearly revenue goals and view how your business is managing by comparing to past periods. View your biggest winners and biggest losers according to their total revenue brought in. Make the most of your programmatic data and stay on top of private marketplace revenue changes using alerts. Use any type of data source or dataset to fully visualize your programmatic data using the Enterprise Stacker.\n\n\n###\n Parts of the Programmatic Revenue App\n\nThe Programmatic Revenue app is one singular app, but comes with a slew of important Domo cards to fully flush out your programmatic data.\n\n####\n SmartSummary\n\nThe SmartSummary section provides you with a quick insight into how your goal pacing is going and your average CPM for your selected time period.\n\n\n#####\n Total Revenue\n\nThe Total Revenue section shows your total revenue for your selected time period, as well as where you’re at according to your set goals using both a percentage and dollar amount. A running total line graph displays your time to date total revenue and compares that to your previous time to date.\n\n\n#####\n Pacing\n\nThe Pacing section uses filled gage graph to display how close you are to reaching your revenue goal for your selected time period. A target percentage is also displayed in the bottom right corner, letting you know where you should be revenue-wise in order to meet your goal.\n\n\n#####\n CPM\n\nThe CPM section displays your total CPM for your selected time period, as well as a line graph showing how your CPM has changed over time and in comparison, to your last time to date. This section also allows you to see how your CPM has increased or decreased over time according to your average CPM.\n\n\n#####\n Biggest Winners\n\nThe Biggest Winners section displays your top three performers for your selected time period along with how much added revenue they have brought in as compared to your last time period.\n\n\n#####\n Biggest Losers\n\nThe Biggest Losers section displays your bottom three performers for your selected time period along with how much subtracted revenue they have brought in as compared to your last time period.\n\n\n#####\n Cards\n\nThe Programmatic Revenue app includes four sections of cards:\n *Revenue, Impressions, and eCPM Trends*\n ,\n *Top Revenue Opportunities, Discrepancies,*\n and\n *Private Marketplaces.*\n Each section contains a collection of cards that reflects your programmatic data, as well as important metrics that aren’t displayed in the app itself. Important cards include\n *Daily Revenue by Partner | Last 30 Days*\n ,\n *Daily Impressions & eCPM | Last 30 Days,*\n and\n *Partner Discrepancies | Last 90 Days.*\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360047231334\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004142\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nProgrammatic Revenue\n\n", "article_total_view_count": "\n\n\n 2,373\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:24 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "programmatic_revenue", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}