{"file_path": "../../raw_kb_v2\\article\\360043438013\\index.html", "content": {"Title": "> Appstore Layout", "Article Body": "Intro\n                       \n\n                        In the Appstore, you can select apps to add to your Domo instance, view information on all installed apps, and remove installed apps. The Appstore is composed of a main page divided into several tabs, as follows:\n                       \n\n\n\n\n                           Name\n                          \n\n                           Icon\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Home\n                          \n\n\n\n\n                           Shows you featured apps, QuickStarts, new and trending apps, and connectors.\n                          \n\n\n\n                           Search\n                          \n\n\n\n\n                           Lets you search for specific Appstore content using a variety of filters and search options.\n                          \n\n\n\n                           Installed\n                          \n\n\n\n\n                           Shows all apps that have been installed in your Domo instance.\n                          \n\n\n\n                           Asset Library\n                          \n\n\n\n\n                           Shows both pending and live apps you have created as well as custom app designs.\n                          \n\n\n\n                           Store Manager\n                          \n\n\n\n\n                           Allows you to see all apps that have been pushed to publication and choose whether to grant or deny publication for apps in this list. You must have a default security role of \"Admin\" or a custom role with the \"Manage Appstore\" grant enabled to access this tab. For more information about security roles, see\n                           \n                            Managing Custom Roles\n                           \n                           .\n                          \n\n\n\n\n\n\n                        You can switch between tabs by clicking the icon for the desired tab in the left-hand navigation pane. If the pane is not visible, you can click\n                        \n                        to open it.\n                       \n\n                        If you click a thumbnail for an app or connector in the\n                        \n                         Home\n                        \n                        or\n                        \n                         Search\n                        \n                        tab, a Details/install page opens for the app or connector. For more information about connectors, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        You are not limited to one version of an app per company Domo instance. For example, multiple users could each have their own version of the Facebook QuickStart app. Each user's individual version of the Facebook QuickStart app would contain cards powered up by his or her personal Facebook data.\n                       \n\n                        ​Appstore tabs\n                       \n\n                        This section discusses each of the tabs in the Appstore.\n                       \n\n                        Home tab\n                       \n\n                        The\n                        \n                         Home\n                        \n                        tab contains a carousel of recommended apps you can navigate through. It also contains cards for all apps available to be installed in your Domo, as well as all connectors. This is the default tab that appears when you open the Appstore. If you navigate to another tab, you can return here by clicking the\n                        \n                        icon in the left-hand navigation pane.\n                       \n\n                        The following screenshot points out the most important parts of the\n                        \n                         Home\n                        \n                        tab:\n                       \n\n\n\n\n                        You can learn about the components in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Categories filter\n                           \n\n\n\n                            Lets you filter to locate apps belonging to a specific category. When you click a filter, the\n                            \n                             Search\n                            \n                            tab opens with your category filter already applied.\n                           \n\n\n\n\n\n                            Search bar\n                           \n\n\n\n                            Lets you search for specific apps by typing keywords. When you search in this way, the\n                            \n                             Search\n                            \n                            tab then opens with your search already applied. Keywords are matched to both names and descriptions. So if you typed \"mail\" as a keyword, the MailChimp QuickStart app would appear, as well as any apps or connectors with the word \"mail\" in their descriptions.\n                           \n\n\n\n\n\n                            Featured apps carousel\n                           \n\n\n\n                            Displays featured apps in Domo. Click an app in the carousel to display the details view for that app. You can scroll through the previews by mousing over the carousel and clicking the\n                            \n                            and\n                            \n                            buttons that appear.\n                           \n\n\n\n\n\n                            QuickStarts pane\n                           \n\n\n\n                            Displays featured QuickStart apps. Click a QuickStart to open its details view. You can see all QuickStart apps in the\n                            \n                             Search\n                            \n                            tab by clicking\n                            \n                             View All\n                            \n                            .\n                           \n\n\n\n\n\n                            New and trending apps pane\n                           \n\n\n\n                            Displays new and trending apps (with \"trending\" status based on metadata such as the number of times the app has been deployed). Click an app to open its details view. You can see all new and trending apps in the\n                            \n                             Search\n                            \n                            tab by clicking\n                            \n                             View All\n                            \n                            .\n                           \n\n\n\n\n\n                            Connectors pane\n                           \n\n\n\n                            Shows Domo connectors. By default, only a few connectors are shown; click\n                            \n                             View All\n                            \n                            to show all connectors in the\n                            \n                             Search\n                            \n                            tab. Click a connector to open the details view for that connector. For more information about connectors, see\n                            \n                             Adding a DataSet Using a Data Connector\n                            \n                            .\n                           \n\n\n\n\n\n                            Capabilities filter\n                           \n\n\n\n                            Lets you filter to locate data science apps, enterprise apps, writeback connectors, or DataFlow-related apps. When you click a filter, the\n                            \n                             Search\n                            \n                            tab opens with your capability filter already applied.\n                           \n\n\n\n\n\n                        Search tab\n                       \n\n                        In the\n                        \n                         Search\n                        \n                        tab you can see previews for all apps that are available to be installed in your Domo. You can access this tab in the Appstore by clicking\n                        \n                        in the left-hand navigation pane.\n                       \n\n                        The following screenshot points out all of the parts of this tab:\n                       \n\n\n\n\n                        You can learn about the components in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Filter pane\n                           \n\n\n\n                            Lets you filter the apps in the\n                            \n                             Search\n                            \n                            pane using a variety of criteria, such as by category, by publisher, by data source, and more. For many of these, you can expand the available filter criteria by clicking\n                            \n                             Show More\n                            \n                            .\n                           \n\n\n\n\n\n                            Search bar\n                           \n\n\n\n                            Lets you type keywords to filter the apps in the\n                            \n                             Search\n                            \n                            tab. Keywords are matched to both app names and descriptions. So if you typed \"mail\" as a keyword, the MailChimp QuickStart app would appear, as well as any apps with the word \"mail\" in their descriptions.\n                           \n\n\n\n\n                           Search results\n                          \n\n                           Shows all of the results of your current search. If you have not searched, this area shows all of the apps in your instance. Click on a result to open the details view for the app.\n                          \n\n\n\n\n                            Sort menu\n                           \n\n\n\n                            Lets you choose a sort option for the apps in the Appstore. You can sort ascending or descending alphabetically or by relevance.\n                           \n\n\n\n\n\n                        Installed tab\n                       \n\n                        The Installed tab shows apps installed in your Domo, divided into two sections—those installed by you and those installed by others. You can click any app to open the Details view for that app. You can open this tab in the Appstore by clicking the\n                        \n                        icon in the left-hand navigation pane.\n                       \n\n                        Asset Library tab\n                       \n\n                        The\n                        \n                         Asset Library\n                        \n                        tab shows you all of the apps you have pushed to publication along with your custom designs. This tab has three quick filters that can be applied—\n                        \n                         My\n                        \n\n                         Apps\n                        \n                        ,\n                        \n                         Shared With\n                        \n\n                         Me\n                        \n                        , and\n                        \n                         All Apps\n                        \n                        . In the\n                        \n                         My Apps\n                        \n                        filter, you can view all of your apps or filter to see those that are pending or live. In\n                        \n                         Shared With Me\n                        \n                        , you can view all apps that have been shared with you. In the\n                        \n                         All Apps\n                        \n                        filter, if you are an Admin, you can see all the apps in your instance. For more information about the Asset Library, see\n                        \n                         Asset Library\n                        \n                        . For more information about the app-building process, visit the developer portal at\n                        \n                         developer.domo.com\n                        \n                        .\n                       \n\n                        Store Manager tab\n                       \n\n                        In the Store Manager, you can manage the publication process for apps that have been published in your company Domo instance. You access this tab by clicking\n                        \n                        in the Appstore in the left-hand navigation pane. This tab consists of three subtabs—\n                        \n                         Pending\n                        \n                        , which shows apps that have been pushed to the Appstore in your company Domo instance but have not been approved or denied;\n                        \n                         Live\n                        \n                        , which shows all apps that have been approved for publication by an administrator; and\n                        \n                         Denied\n                        \n                        , which shows apps that have been denied publication.\n                       \n\n                        You must have a default security role of \"Admin\" or a custom role with the \"Manage Appstore\" grant enabled to access this tab. For more information about security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n                        The following screenshot points out the most important parts of the\n                        \n                         Store Manager\n                        \n                        tab:\n                       \n\n\n\n\n                        You can learn about the components in the following table:\n                       \n\n\n\n\n                           Name\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Tabs\n                          \n\n                           Let you switch between the\n                           \n                            Pending\n                           \n                           ,\n                           \n                            Live\n                           \n                           , and\n                           \n                            Denied\n                           \n                           subtabs in the\n                           \n                            Store Manager\n                           \n                           tab.\n                          \n\n\n\n                           Apps\n                          \n\n                           Shows all apps in the selected subtab (\n                           \n                            Pending\n                           \n                           ,\n                           \n                            Live\n                           \n                           , or\n                           \n                            Denied\n                           \n                           ).\n                          \n\n\n\n                           Search box\n                          \n\n\n                            Lets you type keywords to filter the apps in the\n                            \n                             Store Manager\n                            \n                            tab. Keywords are matched to both app names and descriptions. So if you typed \"mail\" as a keyword, the MailChimp QuickStart app would appear, as well as any other apps with the word \"mail\" in their descriptions.\n                           \n\n\n\n\n                           Sort menu\n                          \n\n                           Lets you choose a sort option for the apps in the selected subtab. You can sort ascending or descending alphabetically or by ascending or descending date.\n                          \n\n\n\n\n                        App Details view\n                       \n\n                        You can open the details view for an app card in the Appstore by clicking the app OR by selecting\n                        \n\n                         > View App Details\n                        \n                        in a QuickStart app page in your Domo.\n                       \n\n                        The following screenshot points out the most important components of the app details view. Note that this screenshot is specific to a connector, so several of these options are connector-specific, such as the tabs and option buttons.\n                       \n\n\n\n\n                        You can learn about the components of the details view in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Tabs\n                           \n\n\n                           Let you change the view in the left-side pane to see different information about this app or connector. Details views for apps include only one tab,\n                           \n                            Overview\n                           \n                           , which includes a screenshot of the app and descriptive information. Details views for connectors (shown in the example) include three other tabs—\n                           \n                            DataSets\n                           \n                           , which lists all of the DataSets you can pull into Domo using this connector;\n                           \n                            FAQ\n                           \n                           , which lists frequently asked questions about the connector; and\n                           \n                            Reviews\n                           \n                           , in which you can see the average rating of the connector and rate it yourself if you want.\n                          \n\n\n\n\n                            Option buttons\n                           \n\n\n\n                            Let you perform various actions related to this app or connector. Different options are available depending on whether the details view is for an app or a connector and which tab you are viewing it in.\n                           \n\n                            General options for apps include the following:\n                           \n\n\n\n                              Get\n                             \n                             . Deploys this app to your Domo instance.\n                            \n\n\n                            Options for connectors include the following:\n                           \n\n\n\n                              Get the Data\n                             \n                             . Opens the \"Create DataSet\" page for this connector so you can configure it and pull data into Domo. For more information, see\n                             \n                              Adding a DataSet Using a Data Connector\n                             \n                             .\n                            \n\n\n                              Get the Cards\n                             \n                             . Lets you deploy cards for the Sample App for this connector, if one is available. This allows you to power up several prebuilt, live cards based on your own data, without having to configure advanced options. This is a great way to \"preview\" the connector to make sure it provides the data you want. If you choose this option, you are asked to select the desired account or input your account information if you haven't created an account for this connector yet.\n                            \n\n\n                            Options for apps in the\n                            \n                             Installed\n                            \n                            tab include the following:\n                           \n\n\n\n\n                               Open\n                              \n                              . Opens this app in your Domo instance.\n                             \n\n\n\n\n                               Uninstall\n                              \n                              . Uninstalls this app from your Domo instance.\n                             \n\n\n\n                            Options for apps in the\n                            \n                             Store Manager\n                            \n                            tab include the following:\n                           \n\n\n\n\n                               Approve\n                              \n                              (\n                              \n                               Pending\n                              \n                              tab only). Lets you approve this app for publication to Domo's Appstore. Approved apps are shown in the\n                              \n                               Live\n                              \n                              tab.\n                             \n\n\n\n\n                               Deny\n                              \n                              (\n                              \n                               Pending\n                              \n                              tab only). Lets you deny publication of this app. Denied apps are shown in the\n                              \n                               Denied\n                              \n                              tab.\n                             \n\n\n\n\n                               Test\n                              \n                              (\n                              \n                               Live\n                              \n                              and\n                              \n                               Denied\n                              \n                              tabs). Lets you run a test-deploy of the app.\n                             \n\n\n\n\n                               Remove from Store\n                              \n                              (\n                              \n                               Live\n                              \n                              tab only). Removes this app from the Appstore.\n                             \n\n\n\n\n\n\n\n                            App information\n                           \n\n\n\n                            Provides information about the app, such as a description, usage requirements, last update, and license information.\n                           \n\n                            If you have installed this app, a status indicator also appears. This shows the current state of this app. It contains an\n                            \n                             Edit\n                            \n                            button. Click the button to open a dialog where you can see other installed versions of the app and add new connections.\n                           \n\n\n\n\n\n                            Preview and Ratings tabs\n                           \n\n\n\n                            Let you switch between the\n                            \n                             Preview\n                            \n                            and\n                            \n                             Ratings\n                            \n                            panes at the bottom of the window.\n                            \n                             Preview\n                            \n                            shows you a preview of this app.\n                            \n                             Ratings\n                            \n                            shows the average rating for the app. In addition, if you have installed this app, you can rate the app by clicking\n                            \n                             Rate This app\n                            \n                            .", "Preview Article": "Click here to preview", "URL Name": "360043438013", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004119", "Archived Date": "", "Language": "English", "Primary Version": "> Appstore Layout", "Article Total View Count": "4,771", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              > Appstore Layout\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Explore the Appstore\n              \n", "url": "/s/topic/0TO5w000000ZaoMGAS"}]}