{"file_path": "../../raw_kb_v2\\article\\1500009258802\\index.html", "content": {"title": "\n\n\n Google BigQuery High Bandwidth OAuth Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGoogle BigQuery is a serverless, highly scalable, and cost-effective cloud data warehouse designed to help you make informed decisions quickly, so you can transform your business with ease. It’s a cloud-based big data analytics web service for processing very large read-only data sets. With this connector you can securely pull large data from a specified project into Domo. Google BigQuery queries are written using a variation of the standard SQL SELECT statement. Once your BigQuery data is in Domo, you can combine it with other data sources, find new insights, and collaborate your data. Use Domo's Google BigQuery High Bandwidth OAuth Connector to securely pull large data from a specified project and analyze it using SQL queries. To learn more about the BigQuery API, go to\n\nhttps://cloud.google.com/bigquery/docs/reference/v2/\n\n.\n\n\n The Google BigQuery High Bandwidth OAuth Connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n This topic discusses the fields and menus that are specific to the Google BigQuery High Bandwidth OAuth connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\n\n To connect to BigQuery you must have your Google credentials (email address and password). Your Google account must have permissions to access the tables and data needed for the query.\n\n\n Connecting to BigQuery\n-------------------------\n\n\n This section enumerates the options in the\n\n*Credentials**\n\nand\n\n*Details**\n\npanes in the Google BigQuery High Bandwidth OAuth Connector page.\n\nThe components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\n\n The Domo Google BigQuery High Bandwidth OAuth connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n\n*Connect**\n\n(or select\n\n*Add Account**\n\nif you have existing Google accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google BigQuery High Bandwidth OAuth DataSet.\n\nYou can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\nIf you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n\n*Add account**\n\n. If you want to connect to an account that is different from the one you are logged into, you must first log out of the current Google account.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n\nSelect the Google BigQuery High Bandwidth OAuth report you want to run.\n\nThe following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Query\n  |\n Runs a BigQuery SQL query and returns results upon query completion.\n  |\n\n|\n|\n Project ID\n  |\n Select a project from the available list of projects.\n  |\n|\n DataSet ID\n  |\n Select the BigQuery dataset id for your data.\n\n\n For more information about the BigQuery datasets, see\n\nhttps://cloud.google.com/bigquery/docs/datasets-intro\n\n.\n  |\n|\n Google Cloud Storage Bucket Name\n  |\n Select the Google Cloud Storage bucket name that will be used for temporary storage as the connector transfers your data into Domo.\n  |\n|\n User Query\n  |\n Enter a query to execute. Only standard SQL query is supported.\n  |\n|\n Force To String\n  |\n Enter a comma separated list of fields that needs to be treated as STRING in Domo.\n  |\n|\n Force To Number\n  |\n Enter a comma separated list of fields that needs to be treated as NUMBER in Domo.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n When should I use this connector?\n\nThis connector uses a Domo-defined Google app to allow access to BigQuery. Data imports are optimized by first downloading data to a user-defined Google Storage bucket, and then ingesting the data from Google Storage. To connect, you'll need a BigQuery username and password, and you'll need access to a Google Cloud Storage bucket. Once connected, you'll be able to replace the entire dataset or append data selected from BigQuery to the dataset on every run.\n\n###\n What kind of credentials do I need to power up this connector?\n\nYou need your Google credentials (email address and password). Your Google account must have permissions to access the tables and data needed for the query.\n\n###\n How do I know that my login credentials are secure?\n\nThe login process uses the OAuth process, so your Google credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNone\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500009258802\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003226\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle BigQuery High Bandwidth OAuth Connector\n\n", "article_total_view_count": "\n\n\n 2,374\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "google_bigquery_high_bandwidth_oauth_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}