{"file_path": "../../raw_kb_v2\\article\\360043430993\\index.html", "content": {"Title": "Centro Connector", "Article Body": "Intro\n                       \n\n                        Centro (formerly called SiteScout) is the first and largest self-serve advertising platform for buying online banner ad space (in real time) across the web and on mobile devices. They help advertisers and agencies streamline the digital media buying process.\n                        \n                         For more information about the Centro API, visit their website (\n                        \n\n                         https://www.centro.net/products/dsp-...ic-advertising\n                        \n\n                         ).\n                        \n\n\n\n\n                        The Centro connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                        \n\n\n\n\n                         You connect to your Centro account in the Data Center. This topic discusses the fields and menus that are specific to the Centro connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Prerequisites\n                        \n\n\n                        To connect to your Centro account, you must have the following:\n                       \n\n\n\n                          A Centro client ID, and\n                         \n\n\n\n                          A Centro client secret.\n                         \n\n\n\n                        For information about obtaining these credentials, please visit\n                        \n                         http://www.Centro.com/blog/2013/0...Centro-api/\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                           The authentication and authorization processes are performed in accordance with the OAuth 2 specification. At this time Centro only supports the Client Credentials grant type. This grant type is ideal for API clients that require access to their own resources (as opposed to the client acting as a third party and requesting access on behalf of another user). One of the key advantages of this grant type is a simplified authentication flow that allows the client to proceed directly to token generation with the authorization grant being assumed. It must be noted that the Client Credentials grant type must exclusively be implemented with applications that guarantee the security of their client credentials.\n                           \n\n\n\n\n\n\n\n\n\n                         Connecting to Your Centro Account\n                        \n\n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Centro Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Centro account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n\n                              Field\n                             \n\n\n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n\n\n\n                             Centro Client ID\n                            \n\n\n\n\n                            Enter your Centro Client ID.\n                           \n\n\n\n\n\n                            Centro Client Secret\n                           \n\n\n\n\n                             Enter your Centro Client Secret.\n                            \n\n\n\n\n\n\n\n                         Once you have entered valid Centro credentials, you can use the same account any time you go to create a new Centro DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n                         Details Pane\n                        \n\n\n\n                         This pane contains a primary\n                         \n                          Report\n                         \n                         menu in which you select a report type.\n                        \n\n\n\n\n\n\n\n                             Menu\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n\n                             Report\n                            \n\n\n\n\n\n                             Select a Centro report. The following reports are available:\n                            \n\n\n\n\n\n\n                                Advertiser's Folder Structure\n                               \n\n\n\n                                Returns the top-level folders.\n                               \n\n\n\n\n\n                                All Ad Exchanges\n                               \n\n\n\n                                Returns a list of ad exchanges.\n                               \n\n\n\n\n\n                                All Brand Stats\n                               \n\n\n\n                                Returns statistics for all brands such as clicks, conversions, and impressions won.\n                               \n\n\n\n\n\n                                All Group Stats\n                               \n\n\n\n                                Returns statistics for a specific brand for all groups.\n                               \n\n\n\n\n\n                                Audience Rules\n                               \n\n\n\n                                Returns audience targeting rules for the selected campaigns.\n                               \n\n\n\n\n\n                                Audience Stats\n                               \n\n\n\n                                Returns statistics for the specific audience such as total visitors and new visitors.\n                               \n\n\n\n\n\n                                Campaign\n                               \n\n\n\n                                Returns data about campaigns for a given time frame, such as campaign name, budget amount, number of clicks, etc.\n                               \n\n\n\n\n\n                                Campaign Folder's Statistics\n                               \n\n\n\n                                Returns statistics for the groups and campaign in the selected folder.\n                               \n\n\n\n\n\n                                Campaign, per Site\n                               \n\n\n\n                                Returns site data for campaigns for a given time frame, such as site name, URL, number of clicks, revenue amount, etc.\n                               \n\n\n\n\n\n                                Campaign, per Creative\n                               \n\n\n\n                                Returns creative data for campaigns for a given time frame, such as creative name, number of clicks, revenue amount, etc.\n                               \n\n\n\n\n\n                                Campaign, per Offer\n                               \n\n\n\n                                Returns offer data for campaigns for a given time frame, such as number of clicks, number of conversions, revenue, etc.\n                               \n\n\n\n\n\n                                Contextual Details\n                               \n\n\n\n                                Returns contextual targeting data.\n                               \n\n\n\n\n\n                                Demographic Details\n                               \n\n\n\n                                Returns demographic targeting data.\n                               \n\n\n\n\n\n                                Device Details\n                               \n\n\n\n                                Returns the current device targeting settings for the campaign.\n                               \n\n\n\n\n\n                                Device Report\n                               \n\n\n\n                                Returns data for a given device.\n                               \n\n\n\n\n\n                                Geographic Coordinates\n                               \n\n\n\n                                Returns latitude/longitude rules.\n                               \n\n\n\n\n\n                                Geographic Rules\n                               \n\n\n\n                                Returns geographic targeting rules.\n                               \n\n\n\n\n\n                                Group Campaign Stats\n                               \n\n\n\n                                Returns statistics for campaigns in the group.\n                               \n\n\n\n\n\n                                Page Position\n                               \n\n\n\n                                Returns page position targeting data.\n                               \n\n\n\n\n\n                                Reports\n                               \n\n\n\n                                Returns custom reports.\n                               \n\n\n\n\n\n                                Traffic Type\n                               \n\n\n\n                                Returns traffic type targeting data.\n                               \n\n\n\n\n\n\n\n\n\n                            Custom Report\n                           \n\n\n\n                            Select the Centro CSV report you want to import into Domo.\n                           \n\n\n\n\n\n                            Report Type\n                           \n\n\n\n                            Select the desired report type for your \"Device Report.\"\n                           \n\n\n\n\n\n                            Advertiser ID\n                           \n\n\n\n                            Enter the advertiser ID you want to return data for.\n                           \n\n\n\n\n\n                            Campaign\n                           \n\n\n\n                            Select the campaign you want to return data for.\n                           \n\n\n\n\n\n                            Campaign Selection\n                           \n\n\n\n                            Specify whether you want to pull data for all campaigns or a specific campaign.\n                           \n\n\n\n\n\n                            Audience\n                           \n\n\n\n                            Select all audiences you want to return data for.\n                           \n\n\n\n\n\n                            Folders\n                           \n\n\n\n                            Select the campaign folder you want to return data for.\n                           \n\n\n\n\n\n                            Brand\n                           \n\n\n\n                            Select the brand you want to return data for.\n                           \n\n\n\n\n\n                            Campaign Group\n                           \n\n\n\n                            Select the campaign group you want to return data for.\n                           \n\n\n\n\n\n                            Site Reference\n                           \n\n\n\n                            Enter the URL for the website you want to return data for.\n                           \n\n\n\n\n\n                            Creative ID\n                           \n\n\n\n                            Enter the ID of the creative you want to return data for.\n                           \n\n\n\n\n\n                            Campaign Status\n                           \n\n\n\n                            Select a campaign status to filter your report data by.\n                           \n\n\n\n\n\n                            Filter (Optional)\n                           \n\n\n\n                            Enter a keyword to filter campaign names by in your \"All Campaigns\" report.\n                           \n\n\n\n\n\n                            Granularity\n                           \n\n\n\n                            Select the date grain for your data. For the \"Campaign per Creative\" report, if you select\n                            \n                             Daily\n                            \n                            here, one API call will be made per day per campaign.\n                           \n\n\n\n\n\n                            Backfill Days for Historical Data\n                           \n\n\n\n                            Enter the number of past days you want to retrieve historical data for. This will only occur the first time you run the report.\n                           \n\n\n\n\n\n                            Aggregate By\n                           \n\n\n\n                            Select whether to aggregate data by day or hour, or not at all.\n                           \n\n\n\n\n\n                            Dimensions (Optional)\n                           \n\n\n\n                            Enter a value to filter creative dimensions by, expressed as width x height (e.g.\n                            \n                             300 x 250\n                            \n                            ).\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQs\n                       \n\n                        Can I use the same account to create multiple DataSets?\n                       \n\n                        Yes.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        As often as needed.\n                       \n\n                        Are there any API limits I should be aware of?\n                       \n\n                        No.", "Preview Article": "Click here to preview", "URL Name": "360043430993", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003792", "Archived Date": "", "Language": "English", "Primary Version": "Centro Connector", "Article Total View Count": "2,348", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Centro Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}