{"file_path": "../../raw_kb_v2\\article\\000005179\\index.html", "content": {"Title": "Workflows Tracking", "Article Body": "Intro\n                       \n\n                        Workflows offers tracking capabilities that allow you to monitor and review any workflow that has been deployed. Use these features to access general or specific details about Workflows instances and, if needed, to recover instances that have failed to execute.\n                       \n\n                        This article discusses Workflows tracking details in the following topics:\n                       \n\n\n\n                          Instances List\n                         \n\n\n\n                          Filter panel\n                         \n\n\n\n                          Metrics\n                         \n\n\n\n                          Instances table\n                         \n\n\n\n                          Instance details and playback (in progress)\n                         \n\n\n\n                          Workflow instance recovery\n                         \n\n\n\n                          Cancel workflow instances\n                         \n\n\n\n\n\n                        Instances List\n                       \n\n                        You can use the\n                        \n                         Instances List\n                        \n                        to view and filter Workflows instances that have been deployed. This page shows how many instances have been deployed or executed for a specific period and provides other metrics to facilitate workflow management.\n                       \n\n\n\n\n\n\n                        Filter Panel\n                       \n\n                        There are several ways to narrow your search for an instance. The available filter options are listed below.\n                       \n\n\n\n                          Workflow\n                         \n                         — A list to filter the model. You must select one.\n                        \n\n\n                          Version\n                         \n                         — A list to filter the instance by model versions. The available choices are All Versions or any deployed version by its version number.\n                        \n\n\n                          Status\n                         \n                         — Checkbox options to filter instances by their current status. The available statuses are Complete, In-Progress, Canceled, and Failed. You can use all options in any combination.\n                        \n\n\n                          Time Period\n                         \n                         — A list to filter instances by their Started By\n                         \n\n                         date. The available options are Today, Last 7 Days, Last 30 Days, Year to Date, Lifetime, and Custom. Note that choosing a longer time period may require more time to return results.\n                        \n\n\n\n\n\n\n\n                        Metrics\n                       \n\n                        Below are the six metrics currently available to help admins and editors understand how their instances perform.\n                       \n\n\n\n                          Success\n                         \n                         — The number of instances that completed successfully.\n                        \n\n\n                          In-Progress\n                         \n                         — The number of instances that are currently running.\n                        \n\n\n                          Canceled\n                         \n                         — The number of instances that were canceled in the middle of the flow.\n                        \n\n\n                          Failed\n                         \n                         — The number of instances that have failed.\n                        \n\n\n                          Total\n                         \n                         — The combined number of instances based on the selected Filters.\n                        \n\n\n                          Avg Cycle Time\n                         \n                         — The average runtime of all the instances based on the selected Filter should this be plural.\n                        \n\n\n\n\n                        A pie chart is also available to visually represent the metrics and their statuses as percentages.\n                       \n\n\n\n\n\n\n\n                           Back to top\n                          \n\n\n\n\n\n\n                        Instances Table\n                       \n\n                        The\n                        \n                         Instances\n                        \n                        table displays information about instances and helps you navigate\n                        \n\n                        to the instance\n                        \n\n                        Details page, where you can view the inflight status of a workflow instance.\n                       \n\n\n\n\n                        You can use the search bar to filter the list of instances by ID and other filtering options.\n                       \n\n                        Filter Options\n                       \n\n\n\n                          Completed\n                         \n                         — Similar to the Time Period Filter, this is a list to filter instances by their completion date.\n                        \n\n\n                          Started by\n                         \n                         — A list to filter by the person who initiated the instance.\n                        \n\n\n\n\n\n                        Instance List\n                       \n\n                        You can select any\n                        \n\n                        instance in the list to navigate to the instance\n                        \n\n                        Details\n                        \n\n                        page, where you can view the instance diagram and flight status. Here are some pieces of information the table gives you:\n                       \n\n\n\n                          ID\n                         \n                         — The ID of the instance. This can be used in the\n                         \n                          Instances\n                         \n                         table search bar as a Filter.\n                        \n\n\n                          Version\n                         \n                         — The model version the instance is related to.\n                        \n\n\n                          Status\n                         \n                         — The most recent status of the instance.\n                        \n\n\n                          Started By\n                         \n                         — The person who initiated the instance.\n                        \n\n\n                          Start\n                         \n                         — The date and time the instance initiated.\n                        \n\n\n                          Complete\n                         \n                         — If the instance status is Complete, a date and time displays. If the instance status is In-Progress, Failed, or Canceled, the status displays as N/A.\n                        \n\n\n\n\n\n                           Back to top\n                          \n\n\n\n\n\n\n                        Instance Tracking Details and Playback (in progress)\n                       \n\n                        The Instance Tracking Details\n                        \n\n                        page displays a specific execution of an instance and the data used in that specific instance.\n                       \n\n                        You can navigate to this page by selecting an instance from the\n                        \n                         Instances\n                        \n                        list. Note that you can only access this page if you have the View Instance Details permission for the workflow. Learn more about permissions in the\n                        \n                         Workflows Overview\n                        \n                        .\n                       \n\n\n\n\n                        When you select an instance in the\n                        \n                         Instances\n                        \n                        list, the Details page for that instance displays.\n                       \n\n\n\n\n                        The instance Details page displays the flow path the instance took during its execution and the data values that were passed and produced by\n                        \n\n                        each step. You can see all of the completed steps, and which steps still remain if the instance is still in progress.\n                       \n\n                        Instance Status\n                       \n\n                        The instance status shows the overall status for the execution of a specific instance.\n                       \n\n                        See details about the three possible statuses below.\n                       \n\n\n\n                          Complete\n                         \n                         — The initiated instance has successfully reached one or multiple end shapes.\n                        \n\n\n                          In Progress\n                         \n                         — The initiated instance is currently in progress and has not reached its end shapes.\n                        \n\n\n                          Failed\n                         \n                         — The initiated instance produced an error and failed before it could reach its end shapes.\n                        \n\n\n\n                        Playback Controls\n                       \n\n                        Use the playback controls to start and replay the events of an initiated workflow instance. The controls display in the upper\n                        \n                         -\n                        \n                        right corner of the instance Details page.\n                       \n\n\n\n\n                        The following table describes the playback controls:\n                       \n\n\n\n\n                           Icon\n                          \n\n\n                            Control\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n\n                            Toggle\n                           \n\n\n\n                            Controls whether the instance starts to auto-play or defaults to\n                            \n                             show\n                            \n                            the furthest point of execution.\n                           \n\n\n\n\n\n\n\n\n                            Replay\n                           \n\n\n\n                            Replays the workflow from the first start shape.\n                           \n\n\n\n\n\n\n\n\n                            Play\n                           \n\n\n\n                            Plays or resumes the workflow from the last stopped point.\n                           \n\n\n\n\n\n\n\n\n                            Stop\n                           \n\n\n\n                            Stops/pauses the workflow from playing.\n                           \n\n\n\n\n\n\n\n                           Fast Forward\n                          \n\n                           Increases the speed of playback. There are four speeds, and selecting the button repeatedly cycles through them.\n                          \n\n\n\n\n                        Shape Status\n                       \n\n                        Shapes that were\n                        \n\n                        invoked during\n                        \n\n                        the execution of the instance display with an icon and a corresponding colored border:\n                       \n\n\n\n                          Completed shapes\n                         \n                         — Display with a green check mark and a green border.\n                         \n\n\n\n\n\n                          In Progress shapes —\n                         \n                         Display with a blue spinner icon and a blue border.\n                         \n\n\n\n\n\n                          Failed shapes —\n                         \n                         Display with a red X and a red border.\n                         \n\n\n\n\n\n                        Shape Iterations\n                       \n\n                        For shapes that have been activated multiple times in a workflow instance, the number of iterations display in the lower-right corner of the shape. If the shape has only been activated one time in the instance, no number displays.\n                       \n\n\n\n\n                        Data Panel\n                       \n\n                        You can select a shape on the Details page either during or after the playback to\n                        \n\n                        see the data used in the execution of an instance.\n                       \n\n                        To view the data panel for a shape in the workflow, select a shape.\n                        \n                        The data panel opens at the bottom of the screen and displays the data values used in the shape.\n                       \n\n\n\n\n                        At the top of the data panel is the banner, which includes the title of the shape, the date and time it executed, the date and time it completed, the duration it was active, and the current status of the shape, which corresponds to the shape's playback icon.\n                       \n\n\n\n\n                        The data panel also displays the parameter names and types, along with how they were mapped and the actual values used.\n                       \n\n\n\n\n\n                        User Tasks and Service Tasks shapes display inputs and outputs, while other shapes display what the values of the variables were when the shape was activated.\n                       \n\n                        Data panels for shapes that have been activated multiple times and have more than one iteration include an option to scroll through the different iterations and see the data for each one. If multiple iterations for the shape exist, the option to scroll through them displays on the left side of the data panel, just below the banner.\n                       \n\n\n\n\n\n\n                        Workflow Instance Recovery\n                       \n\n                        The instance Details page offers recovery capabilities if you have the Edit Instance Details permission for the workflow. Recovery means that if a workflow instance fails to complete due to a runtime error,\n                        \n\n                        or if\n                        \n\n                        the instance is still in progress, you can update the data and retry the execution from that point.\n                       \n\n                        If you have access to edit a workflow instance, you can\n                        \n\n                        select\n                        \n                         Edit Instance\n                        \n                        for shapes that have a status of Failed or In Progress. This option displays in the upper\n                        \n                         -\n                        \n                        right corner of the data panel for that shape.\n                       \n\n                        Select\n                        \n                         Edit Instance\n                        \n                        to enter Recovery mode.\n                       \n\n\n\n                        In Recovery mode, a banner displays at the top of the screen. In the banner, you\n                        \n                         have options to\n                        \n\n                         can\n                        \n                        select\n                        \n                         Exit Recovery\n                        \n                        ,\n                        \n                         Retry\n                        \n                        , and\n                        \n                         Cancel Instance\n                        \n                        .\n                       \n\n\n\n\n                        Recovery Options\n                       \n\n                        The recovery options are described below.\n                       \n\n\n\n                          Exit Recovery\n                         \n                         — Returns you to View-only mode on the instance Details page.\n                        \n\n\n                          Retry\n                         \n                         — Attempts to execute\n                         \n\n                         again from where the workflow failed or\n                         \n\n                         is currently in progress.\n                        \n\n\n                          Cancel Instance\n                         \n                         — Stops all execution on a workflow instance and updates the status to Canceled.\n                        \n\n\n                        Edit Workflow Instance Data\n                       \n\n                        While in Recovery mode, you can change input data\n                        \n                         on\n                        \n\n                         at\n                        \n                        the current or last active point in the workflow instance before attempting to retry the instance. To do this, locate the input you want to change in the data panel and select\n                        \n\n                         Edit\n                        \n                        for that input.\n                       \n\n\n\n\n                        Selecting\n                        \n\n                         Edit\n                        \n                        allows you to add or change the data value. When you are finished editing, select\n                        \n\n                         Keep\n                        \n                        or\n                        \n\n                         Discard\n                        \n                        .\n                       \n\n\n\n\n                        Change as many data inputs on the shape as you need to before selecting\n                        \n                         Retry\n                        \n                        as a recovery option in the banner.\n                       \n\n                        Note that you can only enter Recovery mode when as error has occurred or when the workflow instance is waiting for a shape in an In Progress status to complete. The only shapes that have an In Progress status long enough for you to apply Recovery capabilities are a User Task or a Timer. The other shapes execute too quickly, and trying to edit them while they are in an In Progress status is not possible. However, you can attempt to recover any shape that has a Failed\n                        \n\n                        status.\n                       \n\n\n\n                        Cancel Workflow Instances\n                       \n\n                        If you have a workflow instance in an In Progress status that you know will never reach a Completed status, it is best practice to cancel that instance so that it displays properly in the logs and doesn't get\n                        \n\n                        updated by mistake.\n                       \n\n                        If a workflow instance that generates a task in a queue (from a User Task) updates to Canceled, the task in the queue updates to a status of Void.", "Preview Article": "Click here to preview", "URL Name": "000005179", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005179", "Archived Date": "", "Language": "English", "Primary Version": "Workflows Tracking", "Article Total View Count": "550", "": "", "Article Created Date": "4/6/2023, 7:48 PM", "First Published Date": "4/6/2023, 8:05 PM"}, "title": "\n              Workflows Tracking\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Workflows\n              \n", "url": "/s/topic/0TO5w000000ZkAMGA0"}]}