{"file_path": "../../raw_kb_v2\\article\\360043436753\\index.html", "content": {"title": "\n\n\n Microsoft OneDrive for Business Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMicrosoft OneDrive for Business is an online file sharing and personal cloud content management service for businesses. For more information about the OneDrive API, see\n\nhttps://msdn.microsoft.com/en-us/lib.../dn659752.aspx\n\n.\n\n\n You connect to your OneDrive for Business account in the Data Center. This topic discusses the fields and menus that are specific to the OneDrive for Business connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your OneDrive for Business account and create a DataSet, you must have the following:\n\n A OneDrive for Business client secret\n* A Microsoft username and password\n\nIf you are using the Microsoft Graph, you will need to set your redirect\\_uri to a different URL depending on whether you are using a newly registered or existing app.\n\n If you are using a\n *newly registered*\n app, set your redirect\\_uri to\n\nhttps://oauth.domo.com\n\n/api/data/v1/oauth/providers/onedrive-business/exchange\n\n\n .\n* If you are using an\n *existing*\n app, set your redirect\\_uri to\n\nhttps://oauth.domo.com\n\n/api/data/v1/oauth/providers/microsoft-onedrive-business/exchange\n\n\n .\n\nFor instructions about obtaining a OneDrive for Business client ID, client secret, and registering your app using SharePoint Server 2016, see\n\nhttps://dev.onedrive.com/app-registration-server.htm\n\n.\n\n\n For instructions about registering your app for Microsoft Graph, see\n\nhttps://docs.microsoft.com/en-us/onedrive/app-registration.htm\n\nConnecting to Your OneDrive for Business Account\n--------------------------------------------------\n\nThis section enumerates the\n **Permission**\n settings within Microsoft needed for Domo access as well as options in the\n **Credentials**\n and\n **Details**\n panes in the OneDrive for Business Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Microsoft Permissions\n\nHaving the correct permissions within Microsoft allows Domo to effectively access your data using the Microsoft OneDrive for Business connector. The steps required for setting these permissions depend on when your app was registered. Newly registered apps\n *cannot*\n access the Office 365 discovery service. Existing apps can use this service until November 1st, 2019.\n\n###\n Setting Permissions for Existing Apps\n\nThese steps pertain only to already existing apps. You must follow these steps for each API:\n\n. In your Microsoft Azure portal, navigate to Required permissions under API Access. Select Office 365 SharePoint Online under API, then in Delegated Permissions, check the boxes for\n **Read and write user files**\n and\n **Read user files**\n .\n\n\n 2. Next, under API, select Windows Azure Active Directory. Under Delegated Permissions, check the box for\n **Read directory data**\n .\n\n3. Lastly, under API, select Microsoft Graph. Under Delegated Permissions, check the box for\n **Read all files that user can access**\n .\n\n\n####\n Setting Permissions for New Apps\n\nThese steps pertain only to new apps.\n\n. Navigate to\n\nhttps://apps.dev.microsoft.com/\n\nand sign in.\n2. Click\n **Add an app**\n .\n3. Name the app.\n4. Click\n **Create**\n .\n\nThe APP ID that appears is the ClientID.\n5. Click\n **Generate new password**\n .\n\n\n Be sure to SAVE THIS—you will not see it again. This is your Secret.\n6. Click\n **OK**\n .\n7. Click\n **Add platform**\n .\n8. Select\n **Web**\n .\n9. In the\n **Redirect URLs**\n field, enter the URL\n\nhttps://oauth.domo.com/api/data/v1/oauth/providers/microsoft-onedrive-business/exchange\n\n.\n10. Click\n **Save**\n .\n11. Add permissions for\n\nFiles.Read.All\n\n.\n12. Click\n **Save**\n .\n13. Go to Domo and use the ClientID and Secret to connect.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your OneDrive for Business account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Client ID\n  |\n Enter your OneDrive for Business client ID.\n  |\n|\n Client Secret\n  |\n Enter your OneDrive for Business client secret.\n  |\n\n\n Once you have entered these credentials, you are taken to the Microsoft login screen, where you can enter the username and password for your Microsoft account. After you successfully connect, you can use the same account any time you go to create a new OneDrive for Business DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the OneDrive for Business report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Children\n  |\n Lists the children of the item with the specified folder or path.\n  |\n|\n Default Drive\n  |\n Returns metadata about the authenticated user's default drive in OneDrive\n  |\n|\n Download File\n  |\n Downloads a file into Domo as a DataSet. You specify the file type and file/folder or path, along with other information.\n  |\n|\n Download Shared File\n  |\n Downloads a Shared file into Domo as a DataSet. You specify the file type and file/folder or path, along with other information.\n  |\n|\n Drive By Id\n  |\n Lists drives for a selected drive ID.\n  |\n|\n Drives\n  |\n Lists the available drives for the authenticated user.\n  |\n|\n Properties\n  |\n Returns properties for the item with the specified file/folder or path.\n  |\n|\n Recent Items\n  |\n Returns a list of items that have been recently used by the authenticated user. This list includes items that are in the user's drive as well as items they have access to from other drives.\n  |\n|\n Shared Items\n  |\n Lists items that are shared with the authenticated user.\n  |\n\n|\n|\n Addressing\n  |\n Specify whether the addressing for the item is ID-based (in which case, you specify a file or folder name) or path-based (in which case, you specify the file path).\n  |\n|\n Path\n  |\n Enter the relative path of the file or folder you want to retrieve a report for. For example:\n\n/Documents/test.csv\n  |\n|\n File/Folder Name\n  |\n Enter the name (or a portion of the name), without extension, of the MS OneDrive file/folder to retrieve. The connector returns the most recently created or modified file matching the name, based on what you have selected in the\n **Date Field**\n menu.\n  |\n|\n Match Type\n  |\n Specify whether the retrieve file starts with or contains the name you have entered in\n **File Name**\n .\n  |\n|\n Parent Folder/Parent Folder Name\n  |\n Enter a complete folder name (not case-sensitive) to limit the file search to a specific folder's root contents. Subfolders are ignored. If you leave this blank, the search includes all files in all folders for which you have access.\n  |\n|\n Date Field\n  |\n Specify whether to retrieve a file based on its creation or last modified date. This is useful when there are multiple files containing the name you have entered in\n **File Name**\n .\n  |\n|\n File Type\n  |\n Select the file type for the data file you want to retrieve.\n  |\n|\n Is Password Protected?\n  |\n Select whether the file is password-protected.\n  |\n|\n Sheet Name\n  |\n Enter the sheet name you want to retrieve in the specified spreadsheet.\n  |\n|\n File Name or Portion of File Name to Search For in ZIP\n  |\n Enter the name of the zipped file to retrieve. Leave blank to retrieve the first zipped file.\n  |\n|\n Zipped File Type\n  |\n Select the file type for the zipped data file you want to retrieve.\n  |\n|\n Drive ID\n  |\n Select the drive you want to retrieve information for.\n  |\n\nFAQ\n-----\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the client id and client secret of your OneDrive App.\n\n###\n Where can I find my client id and client secret?\n\nYou can find instructions about obtaining the client ID and client secret\n\nhere\n\n.\n\n###\n How often can the data be updated?\n\nDatasets should be set to update no more than once per hour.\n\n###\n Are there any API limits that I need to be aware of?\n\nMicrosoft limits API calls on a per user/per app basis. To prevent rate limiting, reduce the number of datasets scheduled to run at the same time.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436753\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003920\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft OneDrive for Business Connector\n\n", "article_total_view_count": "\n\n\n 5,083\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "microsoft_onedrive_for_business_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}