{"file_path": "../../raw_kb_v2\\article\\360043437633\\index.html", "content": {"Title": "Connecting to Sage 300 Data in Domo", "Article Body": "Sage 300 (formally Timberline) uses a database that is accessed via a Sage ODBC driver. To connect to Sage data, you must use SQL to query and process the data via Workbench, which then sends it to Domo.\n                       \n\n                        You can access Sage 300 by doing either of the following:\n                       \n\n\n\n                          Connecting directly to the database using the ODBC driver (which has been reported as slow). You can learn more about the ODBC connector in Workbench here:\n                          \n                           Connecting to ODBC data\n                          \n                          .\n                         \n\n\n\n                          Using a product called Anterra Data Center, which basically copies the Sage data over to a SQL-based database. You can then connect to that database using Workbench. Most users prefer Anterra, as it is provides a much faster means of accessing Sage data.\n                         \n\n\n\n                        To get access to the Sage 300 ODBC driver, contact your Sage rep. To use the Anterra Data Center method instead, you can reach out to Anterra here:\n                        \n                         http://www.constructionsa.com/anterra-datacenter.html", "Preview Article": "Click here to preview", "URL Name": "360043437633", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003165", "Archived Date": "", "Language": "English", "Primary Version": "Connecting to Sage 300 Data in Domo", "Article Total View Count": "2,413", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Connecting to Sage 300 Data in Domo\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}