{"file_path": "../../raw_kb_v2\\article\\360042928414\\index.html", "content": {"title": "\n\n\n QuickBooks Online Reports Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nQuickBooks Online is the most commonly used small business accounting and financial management software. It allows users to track sales and customer information and provide reports for managing the business and serving their customers. Use Domo's QuickBooks Online Reports connector to retrieve data about all financial aspects of your business. To learn more about the QuickBooks Online Reports API, visit their page (\n\nhttps://developer.intuit.com/app/developer/qbo/docs/api/accounting/most-commonly-used/account\n\n).\n\n\n**Note:**\n The user interface for building this connector is not yet available in our Connectors listing in the Data Center, meaning you will not be able to configure the connector on your own. However, we at Domo are more than happy to configure the connector for you so you can begin using it to pull your data into Domo. Please don't hesitate to reach out to your CSM or Domo Support. For contact information, see\n\n\n Getting Help\n\n\n .\n\n\n You connect to your QuickBooks Online account in the Data Center. This topic discusses the fields and menus that are specific to the QuickBooks Online Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n You can also pull on-premise QuickBooks Online data using Workbench, a secure, client-side solution for uploading your data in Domo. In addition to QuickBooks, you can use Workbench to upload data from other systems using CSV, JIRA, JSON, Microsoft Excel, ODBC, OLAP, and XML. For more information, see\n\nConnecting to Quickbooks Data in Workbench 5\n\n\n|  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Pulling financial accounting reports.\n  |\n| **Primary Metrics**  | * Revenue\n* Costs\n* P&L line items\n* Balance sheet items\n |\n|\n**Primary Company Roles**\n | * Accountants\n* Purchasers\n* CFOs\n* Controllers\n |\n|\n**Average Implementation Time**\n |\n The advanced version of the QuickBooks Online connector usually runs longer due to broader date controls. Longer date ranges will make the connector run longer.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 7\n  |\n\nBest Practices\n----------------\n\nThe advanced QuickBooks Online connector has many additional configuration controls over the standard version. Limit the requested date limits to reasonable amounts. For example, if the customer only needs data for the last quarter, don't request the entire year.\n\n\n Prerequisites\n---------------\n\nTo connect to a QuickBooks Online account and create a DataSet, you must have the following:\n\n The email address or user ID you use to connect to QuickBooks Online.\n* The password you use to connect to QuickBooks Online.\n\nPrerequisites\n---------------\n\nTo connect to your QuickBooks Online account and create a DataSet, you must have the following:\n\n The email address or user ID you use to connect to QuickBooks Online\n* Your QuickBooks Online password\n\nConnecting to Your QuickBooks Online Account\n----------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the QuickBooks Online Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo QuickBooks Online connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing QuickBooks Online accounts in Domo) to open the QuickBooks Online OAuth screen where you can enter your QuickBooks Online credentials. Once you have entered valid QuickBooks Online credentials, you can use the same account any time you go to create a new QuickBooks Online DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into QuickBooks Online when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of QuickBooks Online.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the QuickBooks Online report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account List\n  |\n Shows the name, type, and balance for each account for the specified company.\n  |\n|\n A/P Aging Detail\n  |\n Provides a detailed report for unpaid bills in accounts payable for the specified company.\n  |\n|\n A/P Aging Summary\n  |\n Summarizes the status of unpaid bills in accounts payable for the specified company.\n  |\n|\n A/R Aging Detail\n  |\n Provides a detailed report for unpaid bills in accounts receivable for the specified company.\n  |\n|\n A/R Aging Summary\n  |\n Shows accounts receivable for the specified company, along with the amount of time the amounts have been outstanding.\n  |\n|\n Balance Sheet\n  |\n Summarizes a specified company's assets, liabilities, and shareholders' equities.\n  |\n|\n Customer Balance Detail\n  |\n Shows a detailed report for customer balances for the specified company.\n  |\n|\n Customer Balance Summary\n  |\n Shows a summary of customer balances for the specified company.\n  |\n|\n Expenses by Vendor\n  |\n Shows expenses by vendor for the specified company.\n  |\n|\n General Ledger\n  |\n Shows all transactions that have occurred in each account for the specified company, with the beginning balance and total for each account.\n  |\n|\n Income by Customer Summary\n  |\n Shows income by customer for the specified company.\n  |\n|\n Inventory Valuation Summary\n  |\n Shows the monetary value of items that make up the inventory for the specified company.\n  |\n|\n Profit and Loss\n  |\n Summarizes income and expenses for the specified company.\n  |\n|\n Profit and Loss Detail\n  |\n Provides a detailed profit and loss report for the specified company.\n  |\n|\n Sales by Class Summary\n  |\n Shows sales by class for the specified company.\n  |\n|\n Sales by Customer Summary\n  |\n Shows sales by customer for the specified company.\n  |\n|\n Sales by Department Summary\n  |\n Shows sales by department for the specified company.\n  |\n|\n Sales by Product/Service Summary\n  |\n Shows sales by product or service for the specified company.\n  |\n|\n Statement of Cash Flows\n  |\n Returns a cash flow statement for the specified company.\n  |\n|\n Tax Summary\n  |\n Provides a tax summary for the specified agency.\n  |\n|\n Trial Balance\n  |\n Returns credit and debit information for all accounts for the specified company.\n  |\n|\n Vendor Balance Detail\n  |\n Lists vendor balances for the specified company.\n  |\n|\n Vendor Balance Summary\n  |\n Shows a summary of vendor balances for the specified company.\n  |\n\n|\n|\n Company ID\n  |\n Enter the numerical ID of the company you want to retrieve data for.\n  |\n|\n Accounting Method\n  |\n Select the accounting method for your data, either cash or accrual.\n  |\n|\n Aging Period\n  |\n Enter the number of days in the aging period.\n  |\n|\n Class\n  |\n Enter a comma-separated list of class IDs to retrieve data for.\n  |\n|\n Customer\n  |\n Enter a comma-separated list of customers to retrieve data for.\n  |\n|\n Department\n  |\n Enter a comma-separated list of departments to retrieve data for.\n  |\n|\n Item\n  |\n Enter a comma-separated list of items to retrieve data for.\n  |\n|\n Number of Periods\n  |\n Enter the number of periods to be shown in the report.\n  |\n|\n Past Days\n  |\n Enter the number of past days that should be represented in the report. For example, if you entered\n\n30\n\n, the report would contain data for the last 30 days.\n  |\n|\n Query\n  |\n Enter a query to filter your data.\n  |\n|\n Breakdown\n  |\n Select how you want the data in the report to be broken down. For example, if you selected\n **Week**\n , data in your report would be broken down by week.\n  |\n|\n Vendor\n  |\n Enter a comma-separated list of vendors to retrieve data for.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nThe QuickBooks Online connector retrieves reports from Quickbooks exactly as they appear. If you change a report for an ad-hoc analysis inside Quickbooks, that change will be reflected in the report. Using a system user that has standard reports in Quickbooks is a good alternative to this problem.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928414\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003614\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nQuickBooks Online Reports Advanced Connector\n\n", "article_total_view_count": "\n\n\n 2,402\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "quickbooks_online_reports_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}