{"file_path": "../../raw_kb_v2\\article\\Current-Release-Notes\\index.html", "content": {"Title": "Current Release Notes", "Article Body": "Dojo Becomes the Community Forums\n                        \n\n\n                        With the March 2023 release, we introduce the\n                        \n                         Community Forums\n                        \n                        , replacing what was known as the Dojo.\n                       \n\n                        You can find the Community Forums located within Help in Domo Central. With this rebrand, we've refreshed the UI and UX to make it easier to find\n                        \n\n                        the content you're looking for.\n                        \n                         Social Groups\n                        \n                        and recent\n                        \n                         Event Recordings\n                        \n                        are now available in the Community Forums.\n                       \n\n\n                         New Features\n                        \n\n\n                        These features are part of the March 2023 release.\n                       \n\n                        Microsoft Office Add-ins\n                       \n\n                        The Domo add-ins for Microsoft 365 allow you to integrate your Microsoft Office products with Domo. Instead of manually moving data, you can now efficiently transfer data between Excel, Outlook, PowerPoint, Word, and Domo. For example, you can use the add-ins to import cards and DataSets into a Word document, or you can import data from an Excel spreadsheet into Domo.\n                       \n\n                        You can download\n                        \n                         Domo for Office\n                        \n                        (Excel, PowerPoint, and Word) and download\n                        \n                         Domo for Outlook\n                        \n                        by following these links. For more information, see the\n                        \n                         Domo Add-ins for Microsoft 365 Installation Guide\n                        \n                        and the\n                        \n                         Domo Add-ins for Microsoft 365 Desktop Apps User Guide\n                        \n                        .\n                       \n\n                        Enterprise customers can deploy the new Domo add-ins to their organization, allowing users to access the add-ins directly from their Microsoft 365 apps without having to install them. For more information, see the\n                        \n                         Domo Add-ins for Microsoft 365 Enterprise Installation Guide\n                        \n                        .\n                       \n\n\n\n\n                        Custom Attributes and List Attributes for Groups\n                       \n\n                        In the\n                        \n                         Governance\n                        \n                        section of the\n                        \n                         Admin Settings\n                        \n                        , you can now use attributes to control dynamic group membership, such as assigning all users in a certain department or location to be part of a group that receives access to certain types of content. Domo admins can import the attributes from their organization's IdP to help automatically assign users to the correct groups.\n                       \n\n                        To learn more, see\n                        \n                         Attributes\n                        \n                        .\n                       \n\n                        Table Calculations\n                       \n\n                        Table calculations allow you to display a value in the table as a percent of column total, part of a running total, or how it ranks against other values in the column, all without using Beast Mode calculations or DataFlows. Table calculations are available for Mega Tables and Pivot Tables.\n                       \n\n                        To learn more about table calculations, see\n                        \n                         Table Chart\n                        \n                        .\n                       \n\n\n\n                         New Chart Types\n                        \n\n\n                        Circular Sankey Chart\n                       \n\n                        The circular Sankey chart builds on the original Sankey chart by capturing recursive concepts, which require flows that circle back to previous nodes. For more information, see our\n                        \n                         Circular Sankey Chart\n                        \n                        article.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Slope Chart\n                       \n\n                        A slope chart is a simple line visualization of a time period based on the period’s start and end points. This easy-to-read chart eliminates the clutter of intermediate points, allowing you to focus on the insights that matter. For more information, see our\n                        \n                         Slope Chart\n                        \n                        article.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Variance Chart\n                       \n\n                        Variance charts allow you to highlight the differences between two sets of data. For more information, see our\n                        \n                         Variance Chart\n                        \n                        article.\n                       \n\n\n\n\n\n\n                         New Domo Bricks\n                        \n\n\n                        The following new Domo Bricks (formerly DDX Bricks) are available in the\n                        \n                         Appstore\n                        \n                        :\n                       \n\n\n                         Beast Mode Sample Brick\n                        \n\n                         Calendar with Input\n                        \n\n                         Four Widgets\n                        \n\n                         Gantt Brick\n                        \n\n                         HTML Organization Chart\n                        \n\n                         Phoenix All Columns Mega Table\n                        \n\n                         SugarForce\n                        \n\n                         To-Do Brick\n                        \n\n\n\n\n                         New Premium Features\n                        \n\n\n                        Domo Everywhere\n                       \n\n                        Publications\n                       \n\n\n                         Auto-subscriptions allow subscribing organizations to subscribe to all publications from a specified publishing organization and receive any published content automatically without having to accept publications individually.\n                        \n\n                         In conjunction with auto-subscriptions, new Default Sharing Rules allow a subscribing organization to push all publications from a specified publishing organization automatically to any number of users or groups.\n                        \n\n                         New sorting functionality allows you to see at a glance when you last updated a publication. You can also see if a publication has an error status and for which subscribers.\n                        \n\n                       To learn more, see\n                       \n                        Publish Content to a Subscriber Organization\n                       \n\n                        .\n                       \n\n                        Programmatic DataSet switching is now available. For more information, see\n                        \n                         DataSet Switching\n                        \n                        in the developer portal.\n                       \n\n                        Domo Everywhere now supports publishing Domo Bricks.\n                       \n\n                        Cloud Amplifier\n                       \n\n                        Cloud Amplifier (formerly Multi-Cloud) now integrates with the following third-party data warehouses at the listed levels:\n                       \n\n\n                         Snowflake - Read/Write\n                        \n\n                         Dremio - Read only\n                        \n\n                       See\n                       \n                        Cloud Amplifier\n                       \n                       in the Beta Features section below to see which other platforms we are working to integrate.\n                       \n                        For more information about Cloud Amplifier and how to integrate Domo with your data warehouse, see the following articles:\n                       \n\n\n\n                          Cloud Amplifier Overview\n                         \n\n\n\n                          Register Snowflake with Cloud Amplifier\n                         \n\n\n\n                          Register Dremio with Cloud Amplifier\n                         \n\n\n\n\n\n\n                         Beta Features\n                        \n\n\n                        These features are in beta as of the March 2023 release.\n                       \n\n                        Subset Processing\n                       \n\n                        Subset Processing is in open beta. This feature is inside of Magic ETL and allows you to update only certain subsections of your data when needed, instead of the whole DataSet, saving time and increasing efficiency. You can create partitions in your data and select which partitions to update during processing.\n                       \n\n                        To learn more, see\n                        \n                         Subset Processing in Magic ETL\n                        \n                        .\n                       \n\n                        Follow this link to\n                        \n                         join the beta\n                        \n                        .\n                       \n\n                        Workflows\n                       \n\n                        Workflows powerfully leverages other new products, including Code Engine, Queues, and Forms (all in open beta), to allow you to design and implement executable workflow processes with low code capabilities. You can start a workflow manually, through an Alert, through an approval flow, or on a timer. With Workflows, you can act on your data to solve for process automation, intelligent data pipelines, power app actions, and manual task management without relying on developers.\n                       \n\n                        To learn more, see our\n                        \n\n\n                         Workflows Overview\n                        \n                        .\n                       \n\n\n\n\n                        Code Engine\n                       \n\n                        Code Engine is a Domo-native runtime environment that can execute JavaScript or Python code and interact with any feature inside or outside\n                        \n\n                        of Domo. Domo provides a general library of packages and functions for common integrations and services, but you can also create your own functions to use in your Domo instance. You can use a function from Code Engine in Workflows without having to write any code.\n                       \n\n                        To learn more, see\n                        \n                         Code Engine\n                        \n                        .\n                       \n\n\n\n\n                        Forms\n                       \n\n                        The new Form Editor allows you to create and publish forms for customized manual interactions. You can integrate forms with a workflow so that when a workflow requires a manual task, a form generates automatically and renders to an end user. You can also send data to a workflow using a form, which allows you to reference the information on other steps.\n                       \n\n                        To learn more, see\n                        \n                         Forms\n                        \n                        .\n                       \n\n\n\n\n                        Queues\n                       \n\n                        Queues allows you to organize manual tasks into different queues and control who can access them. You can configure a queue to display tasks for an individual or a group. Each task is associated with a form generated by a workflow. You can filter queues to view tasks by assignee or status, monitor queue volume, and customize layouts.\n                       \n\n                        To learn more, see\n                        \n                         Queues\n                        \n                        .\n                       \n\n\n\n\n\n\n                        Cloud Amplifier\n                       \n\n                        In beta, Cloud Amplifier now supports the following third-party data warehouses at the listed levels:\n                       \n\n\n                         BigQuery - Read only\n                        \n\n                         Databricks - Read only\n                        \n\n                         Redshift - Read only\n                        \n\n\n                        Cards DomoStats Report\n                       \n\n                        The new Cards DomoStats report allows you to view information about all cards in your instance including card type, description, whether it is locked, and the date it was last modified. To access the report, contact your CSM or AE to join the beta.\n                       \n\n\n\n                         If you are interested in joining the Beta for a specific feature, please reach out to your Domo Customer Success Manager (CSM) or Account Executive (AE). If you do not have contact information for your representative, contact Domo Support by email at\n                         \n                          support@domo.com\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Depending on the feature, you may be required to complete training before you can use it.\n                          \n\n\n\n\n\n\n\n\n\n                        Need Support?\n                       \n\n                        You can access the following resources:\n                       \n\n\n\n                          Search for a topic in the\n                          \n                           Help Center\n                          \n                          .\n                         \n\n\n\n                          Train in\n                          \n                           Domo University\n                          \n                          .\n                         \n\n\n\n                          Search for training apps in the\n                          \n                           Appstore\n                          \n                          .\n                         \n\n\n\n                          Get answers from the\n                          \n                           Community Forum\n                          \n                          .\n                         \n\n\n\n                          Contact Technical Support by entering a help ticket in the\n                          \n                           Domo Support Portal.\n                          \n\n\n\n\n                          Reach out to your Domo Customer Success Manager (CSM) or Technical Consultant.\n                         \n\n\n\n                        If you have feedback, please send it from within Domo.\n                       \n\n                        In the navigation header, select\n                        \n                         More\n                        \n                        >\n                        \n                         Feedback\n                        \n                        . In the modal that displays, choose\n                        \n                         Product feedback\n                        \n                        .\n                       \n\n\n\n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "Current-Release-Notes", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004968", "Archived Date": "", "Language": "English", "Primary Version": "Current Release Notes", "Article Total View Count": "13,589", "": "", "Article Created Date": "11/1/2022, 10:59 PM", "First Published Date": "11/1/2022, 11:23 PM"}, "title": "\n              Current Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Current Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZanNGAS"}]}