{"file_path": "../../raw_kb_v2\\article\\360042926034\\index.html", "content": {"Title": "Creating a Request Template", "Article Body": "In Approvals, you can create request templates that anyone can use to submit requests. Whether it’s a new budget proposal, a time off request, or something in between, Approvals is designed to allow you to incorporate all of your company’s unique approval processes. When creating a template, you determine the information that must be provided before submitting a request, and the individuals or groups will review it.\n                       \n\n                        This topic discusses the specific steps for configuring a request template. For general information about the layout of Approvals, see\n                        \n                         Submitting a Request for Approval\n                        \n                        .\n                       \n\n\n                         To create a request template,\n                        \n\n\n\n\n                          Select\n                          \n\n                           > Approvals\n                          \n                          .\n                         \n\n\n\n                          In the left-hand navigation pane, click\n                          \n                           Manage templates\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Create New\n                          \n                          in the top-right corner of the screen.\n                         \n\n\n\n                          Enter a unique name for the template in the\n                          \n                           Template title\n                          \n                          area at the top of the screen, also assign it an icon and a tag.\n                          \n\n\n\n\n\n\n\n\n\n\n                          (Optional) If you want to include specific instructions for users filling out this form, enter those instructions in the\n                          \n                           Instructions\n                          \n                          field.\n                         \n\n\n\n                          Click\n                          \n                           Add Field\n                          \n                          to add fields for users to enter information when submitting requests with this template.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              The information that a user provides to the first field will be used as the title of the request.\n                             \n\n\n\n\n\n\n\n\n\n\n                          For each additional field you want to include in this template, do the following:\n                         \n\n\n\n                            In the\n                            \n                             Type\n                            \n                            menu, select the appropriate field type for the desired response.\n                            \n\n                            The following table lists and describes all of the available field types:\n                           \n\n\n\n\n                               Field Type\n                              \n\n                               Description\n                              \n\n                               Example\n                              \n\n\n\n\n\n                               Short Answer\n                              \n\n                               Allows users to enter a single line of text as a response. Also appropriate for times (as we currently do not have a field specific to times).\n                              \n\n\n\n\n\n\n                               Paragraph\n                              \n\n                               Allows users to enter a paragraph (multiple lines of text) as a response. Also appropriate for lists.\n                              \n\n\n\n\n\n\n                               Number\n                              \n\n                               Allows users to enter a string of numbers as a response.\n                              \n\n\n\n\n\n\n                               Currency\n                              \n\n                               Allows users to enter currency values as a response as well as select from four different currency symbols. Note that users do not need to include currency symbols in their responses, as they are applied automatically.\n                              \n\n\n\n\n\n\n                               Email\n                              \n\n                               Allows users to enter an email address as a response.\n                              \n\n\n\n\n\n\n                               Date\n                              \n\n                               Allows users to select a date from a calendar as a response.\n                              \n\n\n\n\n\n\n                               Attachment\n                              \n\n                               Allows users to attach a Domo Card, DataSet, or a file as a response.\n                              \n\n\n\n\n\n\n\n\n\n                            (Optional) If you want this field to be optional for users, turn off the\n                            \n                             Required\n                            \n                            toggle switch. (If a field is required, a user cannot submit the request without providing a response in the field.)\n                           \n\n\n\n                            (Optional) To move a field up or down in the order of fields in the request template, click\n                            \n                            and drag the field to wherever you want.\n                           \n\n\n\n\n\n                          (Optional) If desired, you can remove a field by clicking the trash can icon next to that field.\n                         \n\n\n\n                          Under\n                          \n                           Approval Chain\n                          \n                          , select the individuals or groups that need to review the requests submitted using this template. Requests will be sent to users for approval in the order provided here. For example, if the first user in the chain was \"Brad Storch\" and the second user was \"Betty Symington,\" any requests made using this form would first be sent to Brad for his approval. Once Brad gave his approval, they would then be sent to Betty. If Betty then gave her approval, the submitter would then be notified that the request had been successfully approved at both levels.\n                         \n\n\n\n                            (Optional) If the request will need to be approved by more than one user, click\n                            \n                             Add Approver Step\n                            \n                            and select the new approving user.\n                           \n\n\n\n                            (Optional) If you do not want individuals modifying the approval chain when using this template, use the toggle switch next to Lock Chain. When a template has a locked chain, it means that the user submitting a request with this template cannot add/remove approvers or modify the order.\n                           \n\n\n\n                            (Optional) If desired, change the approver order by clicking\n                            \n                            for a given approver and dragging his/her name up or down in the chain.\n                           \n\n\n\n\n\n                          (Optional) Add observers to this request template. Observers have access to review the request and add comments, but cannot act on the request, such as approving or denying. When adding an observer to a template, the observer will have access to every request submitted with this template.\n                         \n\n\n\n                          When you are satisfied with the layout of your template, click\n                          \n                           Save\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360042926034", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003011", "Archived Date": "", "Language": "English", "Primary Version": "Creating a Request Template", "Article Total View Count": "4,724", "": "", "Article Created Date": "10/24/2022, 8:59 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Creating a Request Template\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Approvals\n              \n", "url": "/s/topic/0TO5w000000Zan5GAC"}]}