{"file_path": "../../raw_kb_v2\\article\\7561566413463\\index.html", "content": {"title": "\n\n\n Migrating from Workbench 4 to Workbench 5: Troubleshooting Guide\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Workbench provides a platform that generally allows users to continue running their Workbench systems on outdated versions. Users can manually upgrade to the latest, most feature-rich version of Workbench. This article addresses the most common issues users have experienced when upgrading from Workbench 4 to the latest version of Workbench (5.1 or newer).\n\nCommon Migration Issues\n-------------------------\n\n\n There are two primary issues users encounter when upgrading to the latest version of Workbench:\n\n\n1. Users try to upgrade to the latest version of Workbench while simultaneously moving their Workbench to a different machine. Domo does NOT support simultaneous migration and upgrading. Complete these tasks separately.\n2. Existing jobs on the \"older\" version of Workbench have encryption errors go unnoticed until the time of migration.\n\n\n**Note:**\n\nJobs with encryption errors will prevent your existing Workbench jobs from successfully executing. These errors typically occur during the upgrade process as the system is attempting to migrate all existing Workbench jobs to the latest version.\n\nTo successfully upgrade, all jobs would ideally be in an error-free state. It is possible that jobs in a bad state have gone unnoticed. Reasons include...\n\n\n* A job hasn't updated or run recently.\n* A job was set up without a schedule.\n* A job was set to run manually.\n* A job came from a previous machine migration.\n\n\n Below is a walk-through to help you be successful in upgrading to the latest version of Workbench.\n\nIdentifying and Resolving Encryption Errors\n---------------------------------------------\n\n\n To ensure a successful migration, Domo recommends auditing the overall health of your existing Workbench machine.\n\n\n Review the steps below:\n\n\n**Step 1:**\n Review all jobs that have not run in that last month. For any jobs that are not in a healthy state or haven’t run recently, ask yourself, “Is this job still needed?” If the answer is no, consider deleting the job and moving on.\n\n\n**Step 2:**\n For any jobs that haven’t run successfully, navigate to that job’s\n **Overview**\n screen, and run a preview. If the preview is successful and pulls up data, the job is in a good state. If it is unsuccessful, then action is needed to address the error. If the job is unneeded, delete from your machine.\n\n\n**Step 3:**\n Fix the jobs in an error state. Typically, this will mean navigating to the\n **Configuration**\n tab and updating fields per the identified error. If there is an encryption error, then you will likely need to update any password, keys, or login information, then save the job. Saving the job will encrypt any sensitive data with the right encryption key on the Workbench machine.\n\n\n**Step 4:**\n Repeat steps 2 and 3 for any older jobs that haven’t run recently.\n\n\n Upgrading to a newer version of Workbench is a perfect opportunity to audit and clean up your data pipeline. Domo highly recommends performing a general audit and review of all Workbench jobs to ensure they are still relevant and applicable to your business needs—not only the jobs that are in an error state.\n\n\n Reviewing and removing irrelevant jobs will he\n\nlp overall machine performance, reduce clutter in your Domo instance, and ensure a successful migration to Workbench 5\n\n. The ideal candidate eligible for migration from a Workbench 4 version to a Workbench 5 version will have all jobs able to run in a successful state.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 7561566413463\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004765\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMigrating from Workbench 4 to Workbench 5: Troubleshooting Guide\n\n", "article_total_view_count": "\n\n\n 2,448\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:30 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "migrating_from_workbench_4_to_workbench_5_troubleshooting_guide", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_4", "url": "/s/topic/0TO5w000000ZapSGAS"}]}