{"file_path": "../../raw_kb_v2\\article\\360043884674\\index.html", "content": {"title": "\n\n\n Flex Map v1 Implementation Guide\n\n\n", "article_body": "\n\nWelcome to the Flex Map app! This guide will help you prepare and connect your data to the app. The Flex Map app is designed to help users map locations and territories to get geographical insights into their data, and discover relations between locations and important metrics. Follow the steps below to prepare your data for the app.\n\n##\n\nData\n------\n\nThis app requires a handful of datasets to be prepared to power four main parts of its functionality: mapping locations, displaying heatmap data, displaying data powered shapes on the map, and uploading custom KML or .shp files to display. The datasets for each part of the app breakdown the following way:\n\n\n Locations Data (2 datasets):\n\n Main locations dataset: rows of locations data mapped by latitude and longitude\n* Locations Search and Display: a configuration dataset for the locations\n\nHeatmap Data (2 datasets):\n\n Main Heatmap dataset: rows of data by region to display as numerical or categorical heatmaps\n* Heatmap Metric Mapping: a configuration to map which columns from the heatmap data to use as metrics\n\nFile Mapping Data (1 dataset):\n\n File Mapping Metadata: a dataset with file names and ids of files that have been uploaded to the Domo Files API to use with the FlexMap\n\nData-Powered Shapes (2 datasets):\n\n Flattened GeoJson data: a dataset extracted from a GeoJson file that has been flattened so that each latitude/longitude coordinate pair from the file is represented on its own row in the dataset\n* GeoJson Metric mapping: a configuration dataset to choose which fields from the GeoJson properties will be displayed when hovering over the shapes on the map.\n\nFollow the instructions below to prepare each of these datasets.\n\n##\n\n\n###\n Locations Data\n\nThe app requires the following fields for the locations dataset. The required fields are case sensitive, so make sure you add these columns to your data with these exact names:\n\n\n Location Id\n\n\n Latitude\n\n\n Longitude\n\n\n Location Name\n\n\n Address\n\n\n SearchCache\n\n\n Any additional columns\n\n Location Id is a unique number/letter number combination for a location.\n* Latitude: the latitude of a location\n* Longitude: the longitude of a location\n* Location Name is the name of the location and should be a one-to-one relation with the location id for the location. You can have multiple rows for a single location and the app will group the data for the location together by the id and name.\n* Address: the address of a location\n* SearchCache: A comma separated list of terms you want to use for the app to be able to use to find the location when searching using the main search bar of the app.\n* Additional Columns: Add any additional columns for data and metrics for the locations you want to display with your mapped pins. Examples would be things like Region, any other address data, certain metrics, etc.\n\n\n###\n Location Search and Display Preferences:\n\nThis is the schema for the configuration dataset (The column headers for this configuration dataset):\n\n\n ColumnName\n\n\n SearchInclude\n\n\n DisplayInclude\n\n\n DisplayOrder\n\n\n Description\n\n\n TooltipInclude\n\n\n TooltipOrder\n\n\n DisplayType\n\n ColumnName is the name of the column from your locations data that you would like to display in either the search or display details for a location.\n* SearchInclude: Enter a 1 in this column if you would like to include the column in the search options and leave blank otherwise\n* DisplayInclude: Enter a 1 in this column if you would like to include the column in the display details for a location pin.\n* DisplayOrder: Enter sequential numbers in this column with the order you would like to display the columns in the location pin details. Ex. put a number 1 on the first column you’d like to see, then 2 for the second, etc.\n* Description: A description of the column. This column needs to have at least one value for the app to function.\n* TooltipInclude: Enter a 1 into this column on any row if you would like to include the data from that column in the tooltip when clicking on a mapped location.\n* TooltipOrder: Enter sequential numbers in this column on any row where you have set TooltipInclude to 1 with the order you would like to use for the fields to be displayed in the tooltip.\n* DisplayType: This setting is applied to both the tooltip and the display panel. Enter the word ‘image’ if the field represented on that row contains image urls. Enter ‘URL’ if the field represented on that row contains links to external sites. Otherwise, leave this blank.\n\n\n###\n Heatmap Data:\n\nThis data is used to map metrics to regions for the heatmaps in the app. The most important columns from this data are the RegionCode and RegionType columns. The app uses statistical regions to create the heatmaps, so you will need to map your metric data to the region types that the app needs. For example, if you are in the USA and you have metric data based on zip code, you will need to map your zip codes to CBSA codes in order for the map to use your data. You can easily find data to map your data to these codes online. The app supports the following region codes/types: CBSA for the USA, CMA for Canada, SA3 for Australia, and NUTS 2 for Europe. Reach out to your Domo Admin if you need regions beyond what is available.\n\n\n Here is the schema of the heatmap data. These three required fields are case sensitive, so make sure you add them to your data named as seen below:\n\n\n RegionCode\n\n\n RegionName\n\n\n RegionType\n\n\n Your Metric Columns...\n\n\n Additional Metadata Columns...\n\n RegionCode: This is the code for the area that matches what you have listed in the RegionType column. For example, your region code on a row might be 30030 and your region type would be ‘CBSA’.\n* RegionName: The name of the region if applicable, this column is optional.\n* RegionType: One of the following values: CBSA, CMA, NUTS 2, or SA3. It should match the type of region code you are using in the RegionCode column.\n* Your Metric Columns: Any columns with the metrics that you would like to use to build your heatmaps. You may add as many of these as you would like, but you will need at least one to use the heatmaps.\n* Additional Metadata Columns: Any columns with metadata about the regions you would like to map that you could use Domo Page filters to filter down the data, these columns are optional.\n\n\n###\n Heatmap Metric Mapping:\n\nThis dataset is used to choose the columns from your heatmap dataset that you would like to use in the app, and rename the columns for display in the app if needed.\n\n\n Here is the schema of the mapping dataset:\n\n\n ColumnName\n\n\n Label\n\n ColumnName: List the name of the metric column from your heatmap dataset that you would like to use as a heatmap metric in the app.\n* Label: Enter what you would like the metric’s display name to be in this column. For example, if your column name is something like ‘populationAverage’ then you might enter ‘Population Average’.\n\n\n###\n Dataset Powered Shapes Dataset:\n\nThis dataset is a flattened import of a GeoJson file. The data must be flattened so that each latitude/longitude coordinate pair from the file from each shape is represented on its own row in the dataset. See the bottom of this section for the suggested method of importing a GeoJson file into Domo.\n\n\n The purpose of this feature is to bring in a GeoJson file from a Domo dataset that may be frequently updated so that the map always shows the latest shapes and related data on the map. These are updated in real-time. This functionality is also optional. If you do not wish to use this feature, prepare the two datasets below with just the column headers and leave the datasets blank.\n\n\n The required schema for this dataset follows. The required fields are case sensitive, so make sure they are named accordingly in your data:\n\n\n Geo Id\n\n\n Geo Name\n\n\n Latitude\n\n\n Longitude\n\n\n Type\n\n\n Geometry\n\n\n Type\n\n\n (Any additional properties you want to use from GeoJson)\n\n Geo Name: A name for the shape that must be distinct to the shape. Can be created in a dataflow or pulled from one of the properties of the GeoJson.\n* Latitude: The latitude from a coordinate pair on the shape. Pulled from the geometry -> coordinates property of the GeoJson feature.\n* Longitude: The longitude from a coordinate pair on the shape. Pulled from the geometry -> coordinates property of the GeoJson feature.\n* Type: From the type property, likely the value will be ‘Feature’.\n* Geometry Type: From the geometry -> type property on your GeoJson. Two values are compatible here, either ‘Polygon’ or ‘LineString’ for drawing polygons or lines on the map respectively.\n* Additional properties: Include any additional columns that you would like to use to display information or metrics when hovering over these shapes.\n\n**Note on preparing your GeoJson data:***\n There is a connector available that can be used to import and flatten your GeoJson data. GeoJson can be imported using an HTTP request, from an SFTP connection or locally from your computer. Look for the “JSON no code” beta connector when creating a new dataset in the Domo data center and follow these steps:\n\n. The connector asks for a username and password if using SFTP or basic connection. Enter these or leave them blank if doing local upload and then click “Connect”.\n2. Under “Data selection” choose your connection type and enter the required information, including the URL to your file if using SFTP or HTTP request. If choosing local upload, choose the file you would like to upload.\n3. For the “Parsing” section, after it finishes loading, click the dropdown arrow on the right to open the parsing interface.\n\t1. Click your features column, then click the “Unnest column as root” option at the top.\n\t2. Click your properties column and click “Flatten Object as columns”\n\t3. Click your geometry column and click “Flatten Object as columns”\n\t4. Find your geometry\\_coordinates column. If your shapes are polygons, you will need to click this column then “Expand array as columns”, then click the resulting column and click “Expand array as rows. If your shapes are lines, you will only need to click “Expand array as rows”\n\t5. Scroll to the bottom and click “Next”\n4. Set whatever schedule frequency you would like in the “schedule” section then name and save your dataset.\n\nAt this point dataflow this resulting dataset to get it into the schema explained above for this dataset and it should be ready to use.\n\n##\n GeoJson Metric Mapping:\n\nThis dataset indicates which columns from the previous dataset will be used to populate the tooltip that appears when one of these shapes is hovered over in the app.\n\n\n The schema is as follows:\n\n\n ColumnName\n\n\n Label\n\n\n Aggregation\n\n ColumnName: The name of the column from the previous dataset that you would like to use to display in the shape’s hover tooltip.\n* Label: Enter the value you would like to use as the label for the column that was entered under ColumnName.\n* Aggregation: This can be either blank, ‘sum’, or ‘average’. Use this if you need to aggregate the column of a numerical column you are using in your data, because of the nature of importing GeoJson, in most cases you will likely leave this blank.\n\n\n###\n File Mapping Dataset:\n\nThe final dataset that needs to be prepared is the file mapping dataset. The purpose of this dataset is to point the app to KML or .shp files that have been uploaded to the Domo Files API that the app can then bring in and use as custom territories in the app.\n\n\n These following are the required fields, though only File Name and File Id need values for this feature to work:\n\n\n File Name\n\n\n File Id\n\n\n Folder Name\n\n\n Folder Type\n\n\n Last Run\n\n\n Domo Data File Id\n\n File Name: The name of the file\n* File Id: The Domo Files API id indicating the location of the file that has been uploaded.\n* Folder Name: (Optional, can be left blank) If uploaded using the Automated File Upload utility app, the Folder name.\n* Folder Type: (Optional, can be left blank) If uploaded using the Automated File Upload utility app, the Folder Type.\n* Last Run: (Optional, can be left blank) The dateTime the file was last uploaded.\n* Domo Data File Id: (Optional, can be left blank) If uploaded using the Automated File Upload utility app, the Domo Data File Id.\n\nAs soon as these seven datasets are prepared, you should be ready to connect your data to the app.\n\n\n Admin and View-Only Users:\n----------------------------\n\nThis app supports different user levels including admin, standard, and view only users. Have an admin in the Domo instance navigate to the admin portal within Domo and create two Domo Groups. Name the first group “\\_FlexMap\\_Admins” and name the second group “\\_FlexMap\\_ViewOnly”. Users that are added to the Admin group will be able to share items they have created in the app with members of Domo groups, and use buttons at the bottom of the app to set a default map and a default center. Standard users aren’t added to either of those groups, and will get the standard functionality of the app, be able to create their own items, be able to see things that Admin users share with them, but won’t be able to share items or set defaults. View only users cannot create anything in the app, they can only view items that admin users have shared with them.\n\n\n Wiring Your Data to the App:\n------------------------------\n\nAfter the data is ready for the app, you can now deploy the app and connect your data. If you have access to the asset of the app, deploy the asset from the asset library to a page in Domo. If the app has been deployed for you with sample data, navigate to the app, click on the wrench in the top right corner of the app and click “edit card.”\n\n\n On the edit card screen that you get to from these two methods, you may re-name the app at the top of the screen if desired. After that, scroll down below the app and you will see a series of tabs that represent each of the datasets that the app needs. The first tab will say SCHEMA. Click that tab and then select the dataset you prepared as the search and display preferences dataset. Check the column dropdowns you see after selecting the dataset and re-map any columns to the correct columns if needed. Next, click the LOCATIONS tab and choose your locations dataset. Next, click the HEATMAP tab and select the heatmap dataset that you prepared. Last, click the METRICLABELS tab and choose the heatmap metric mapping dataset that you prepared. Click GEOJSON and upload the GeoJson dataset, then click GEOJSONMAPPING and upload the GeoJson Metric Mapping dataset you prepared, making sure that the columns are mapped correctly. Finally, click the FILEMAPPING tab and upload the file mapping dataset you prepared, mapping the appropriate columns. Click save and finish at the top of the page and your app should be ready to go!\n\n##\n Using the App:\n\nUse the button at the top left of the app to open up the app’s menu. In this menu, you can choose a handful of options to map out your data. Searches will allow you to search for a subset of your locations data to map as pins on your map. Territories will allow you to use predefined options to create territories on the map, as well as draw custom territories freehand to display. Here, admin users will also find the custom territories button where you can configure which of your mapped files you would like to use in the app.\n\n\n When you have any combination of pins and territories displayed on the map, you can click the save map button on the bottom right of the app to save your view as a saved map. You can navigate back to your saved maps using the saved maps tab in the menu. You can also favorite saved maps to appear in the favorites tab in the app as well. Using the heatmap tab will allow you to choose a heatmap metric to display on the map. Clicking on dynamic shapes will allow you to see the GeoJson shapes you uploaded to the app.\n\n\n Enjoy getting new geographical insights from your data!\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043884674\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004154\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFlex Map v1 Implementation Guide\n\n", "article_total_view_count": "\n\n\n 2,530\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:26 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "flex_map_v1_implementation_guide", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}