{"file_path": "../../raw_kb_v2\\article\\360056653514\\index.html", "content": {"Title": "Temperature Scanning", "Article Body": "Intro\n                       \n\n                        The Temperature Scanning App is an app that is downloaded and installed by staff located at each office entry point to ensure that guests and employees are safe to enter into the office. Anyone attempting to access the building will be stopped and go through a simple check-in process where they answer a few questions and have their temperature taken. According to their responses, they will be either allowed or denied access to the premises.\n                       \n\n                        This check-in consists of questions that are fully customizable by you and deemed necessary to ensure the safety of everyone in your unique office environment. Once the temperature of the employee or guest is taken, the person scanning at the entry point to the office will mark whether the temperature is above or below a certain temperature determined by you. This will be the primary deciding factor on whether the person is allowed to enter or not.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This app is part of the\n                             \n                              Get Back to Work Solution\n                             \n                             and is available\n                             \n                              on-demand and paid\n                             \n                             .\n                            \n\n\n\n\n                            To request this feature be enabled,\n                           \n\n\n\n                              Reach out to your Domo Customer Success Manager or Account Executive.\n                             \n\n\n\n\n                               If you do not have contact information for your CSM or AE, contact Domo Support. For information on how to contact Support, please see:\n                               \n                                Getting Help\n                               \n\n\n\n\n\n\n\n\n\n\n\n\n                        Employee check-in\n                       \n\n                        An employee check-in directs the employee to either scan their QR code from their\n                        \n                         Safe Worker App\n                        \n                        or enter their QR code manually.\n                       \n\n\n\n\n                        Guest check-in\n                       \n\n                        The guest check-in process prompts the guest to enter their first and last name, email address, and the badge number they've been assigned.\n                       \n\n\n\n\n                        Safe worker questions\n                       \n\n                        The Temperature Scanning App uses the\n                        \n                         Safe Worker\n                        \n                        questions will be included in the Temperature Scanning check-in process and whether guests or employees can see them, this is done within the initial data set-up. Each of these appears as a yes or no question, a yes triggers a failed check-in, while a no will trigger a passed check-in.\n                       \n\n\n\n\n                        Temperature question\n                       \n\n                        The temperature question within the app is unique to the Temperature Scanning App. The temperature threshold is set by you and the individual checking in will either be marked as being above or below the set temperature threshold. Like the Safe Worker questions, a yes indicates a failed check-in while a no indicates a passed check-in.\n                       \n\n\n\n\n                        Admin settings\n                       \n\n                        Those who are authorized to use and configure the app will be able to set the devices check-in location, the temperature threshold, the accepted entry message, and the denied entry message.\n                       \n\n                        Device location\n                       \n\n                        The device's location is unique to each individual device, so you can have as many devices as you want for each of your business' entrances. Use the drop-downs to select where exactly the device is set to be, the granularity for these drop-downs is set in the initial app set-up.\n                       \n\n\n\n\n                        Accepted entry\n                       \n\n                        Admins can also set the app's messaging for an accepted entry. Include a title and an optional description. Please note that you must confirm that you understand that the messaging will be set for the entire company, meaning that every device will have the same messaging.\n                       \n\n\n\n\n                        Denied entry\n                       \n\n                        Admins can also set the app's messaging for a denied entry. Include a title and an optional description. Please note that you must confirm that you understand that the messaging will be set for the entire company, meaning that every device will have the same messaging.\n                       \n\n\n\n\n                        FAQ\n                       \n\n                        Do you have to use Temperature Scanning at office entrances if employees are already sharing their temperature in Safe Worker?\n                       \n\n                        No. It is still a best practice to confirm the temperature of all people who actually come to the office (especially guests without access to Safe Worker). However, if a company decides that the temperature questions in Safe Worker check-ins are enough, they can modify the QR code scan to merely confirm presence at specific entrances in the office. That is important for identifying cohorts for contact tracing.\n                       \n\n                        What happens if an employee failed the Temperature Scanning, how will you notify us?\n                       \n\n                        Our entrance assessment app will notify a person or group of admins in charge of the Get Back to Work Solution that a person has been flagged a potential risk so that you can take the corrective next steps.", "Preview Article": "Click here to preview", "URL Name": "360056653514", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004140", "Archived Date": "", "Language": "English", "Primary Version": "Temperature Scanning", "Article Total View Count": "2,365", "": "", "Article Created Date": "10/24/2022, 9:24 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Temperature Scanning\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}