{"file_path": "../../raw_kb_v2\\article\\360042927654\\index.html", "content": {"title": "\n\n\n Base CRM Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nBase CRM provides a web-based all-in-one sales platform that features tools for email, phone dialing, pipeline management, forecasting, and reporting. Use Domo's Base CRM connector to retrieve data gathered by Base CRM, including lists of contacts, deals, leads, orders, notes, and so on. To learn more about the Base CRM API, visit their page (\n\nhttps://developers.getbase.com/\n\n).\n\n\n You connect to your Base CRM account in the Data Center. This topic discusses the fields and menus that are specific to the Base CRM connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Base CRM account and create a DataSet, you must have a Base CRM username and password.\n\n\n Connecting to Your Base CRM Account\n-------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Base CRM Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Base CRM connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Base CRM accounts in Domo) to open the Base CRM OAuth screen where you can enter your Base CRM credentials. Once you have entered valid Base CRM credentials, you can use the same account any time you go to create a new Base CRM DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Base CRM when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Base CRM.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Base CRM report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Associated Contacts\n  |\n Returns all contacts associated with a given deal.\n  |\n|\n Calls\n  |\n Returns all available calls of the user.\n  |\n|\n Call Upsert\n  |\n This report returns a stream of historical calls and data for both leads and contacts on the first run, and then every subsequent run will Upsert the last 72 hours of call data.\n  |\n|\n Call Outcomes\n  |\n Returns all available call outcomes of the user.\n  |\n|\n Contacts\n  |\n Returns all contacts of the authenticated user.\n  |\n|\n Collaborations\n  |\n Returns all available collaborations of the user.\n  |\n|\n Deals\n  |\n Returns all of the authenticated user's deals.\n  |\n|\n Deals And Stages\n  |\n Returns all available deals and stages data to the user.\n  |\n|\n Deal Sources\n  |\n Returns all deal sources for the authenticated user.\n  |\n|\n Leads\n  |\n Returns all of the authenticated user's leads.\n  |\n|\n Lead Sources\n  |\n Returns all of the authenticated user's lead sources.\n  |\n|\n Line Items\n  |\n Returns all line items associated with a given order.\n  |\n|\n Loss Reasons\n  |\n Returns a list of loss reasons for the authenticated user.\n  |\n|\n Notes\n  |\n Returns all of the authenticated user's notes.\n  |\n|\n Orders\n  |\n Returns all of the authenticated user's orders.\n  |\n|\n Pipelines\n  |\n Returns all of the authenticated user's pipelines.\n  |\n|\n Products\n  |\n Returns all products from the catalog.\n  |\n|\n Stages\n  |\n Returns all of the authenticated user's stages.\n  |\n|\n Tags\n  |\n Returns a list of tags available to the authenticated user.\n  |\n|\n Tasks\n  |\n Returns all of the authenticated user's tasks.\n  |\n|\n Text Messages\n  |\n Returns available text messages of the user.\n  |\n|\n Users\n  |\n Returns a list of users.\n  |\n|\n Visits\n  |\n Returns information about the visit.\n  |\n|\n Visit Outcomes\n  |\n Returns information about the outcomes of the visit.\n  |\n\n|\n|\n Deal ID\n  |\n Enter the ID of the deal you want to retrieve information for.\n  |\n|\n Customer Status (Optional)\n  |\n Select a customer status to filter your results by.\n  |\n|\n Prospect Status (Optional)\n  |\n Select a prospect status to filter your results by.\n  |\n|\n Deal Hot Status (Optional)\n  |\n Select a deal hot status to filter your results by.\n  |\n|\n Status (Optional)\n  |\n Enter a lead status to filter your results by.\n  |\n|\n Organization Name (Optional)\n  |\n Enter an organization name to filter your results by.\n  |\n|\n Last Name (Optional)\n  |\n Enter the last name of a lead to filter your results.\n  |\n|\n Order ID\n  |\n Enter the ID of the order you want to retrieve information for.\n  |\n|\n Resource Type\n  |\n Select the resource type you want to retrieve information for.\n  |\n|\n Active Record Status\n  |\n Select\n **Yes**\n to retrieve only active records; otherwise select\n **No**\n .\n  |\n|\n Tasks Type\n  |\n Select whether you want to retrieve data for floating or related tasks.\n  |\n|\n Completed Tasks\n  |\n Select\n **Yes**\n to retrieve data only for completed tasks; otherwise select\n **No**\n .\n  |\n|\n Overdue Tasks\n  |\n Select\n **Yes**\n to retrieve data only for overdue tasks; otherwise select\n **No**\n .\n  |\n|\n Tasks Reminders\n  |\n Select\n **Yes**\n to retrieve data only for tasks with reminders; otherwise select\n **No**\n .\n  |\n|\n User Status\n  |\n Select whether to pull data for active or inactive users.\n  |\n|\n User Role\n  |\n Select\n **Admin**\n to pull data for only Admin-level users; otherwise select\n **User**\n .\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042927654\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003684\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nBase CRM Connector\n\n", "article_total_view_count": "\n\n\n 3,718\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "base_crm_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}