{"file_path": "../../raw_kb_v2\\article\\360043435093\\index.html", "content": {"title": "\n\n\n Workfront Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nWorkfront (formerly called AtTask) develops web-based work management and project management software. Use Domo's Workfront Advanced connector to retrieve data relating to customers, work assignments, projects, milestones, documents, and so on. To learn more about the Workfront API, visit their page (\n\nhttps://developers.attask.com/api-docs/\n\n).\n\n\n You connect to your Workfront account in the Data Center. This topic discusses the fields and menus that are specific to the Workfront Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Workfront account and create a DataSet, you must have the following:\n\n The username and password for your Workfront account.\n* The URL for your AtTask/Workfront server (for example,\n\nhttps://yourcompany.attask.ondemand.com\n\n).\n\nConnecting to Your Workfront Account\n--------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Workfront Advanced Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Workfront account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into your Workfront account.\n  |\n|\n Password\n  |\n Enter the password you use to log into your Workfront account.\n  |\n\n\n Once you have entered valid Workfront credentials, you can use the same account any time you go to create a new Workfront Advanced DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a menu in which you select a report. Two fields also appear in which you can specify custom and reference columns for your report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Workfront Advanced report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Approval\n  |\n Returns a list of approvals for the account.\n  |\n|\n Assignment\n  |\n Returns a list of assignments, including assigner and assignee, average work per day, project, current status, etc.\n  |\n|\n Baseline\n  |\n Returns a list of project baselines, including project ID, start and completion dates, customer ID, budget, planned hours, etc.\n  |\n|\n Category\n  |\n Returns a list of categories (custom data forms).\n  |\n|\n Group\n  |\n Returns a list of groups, including group ID, customer ID, description, etc.\n  |\n|\n Hour\n  |\n Returns the number of hours entered for users in the account.\n  |\n|\n Hour Type\n  |\n Returns a list of hour types used in the account, with  name, description, etc.\n  |\n|\n Issue\n  |\n Returns a list of issues, including start date, assignee, current status, description, planned hours, responsible team, etc.\n  |\n|\n Job Role\n  |\n Returns a list of job roles used in the account, with name, description, cost per hour, etc.\n  |\n|\n Milestone\n  |\n Returns a list of milestones, including name, description, customer ID, etc.\n  |\n|\n Milestone Path\n  |\n Returns a list of milestone paths, including name, description, customer ID, etc.\n  |\n|\n Note\n  |\n Returns a list of notes, including note subject, note text, project, owner, etc.\n  |\n|\n Parameter\n  |\n Returns a list of parameters (fields in custom data forms).\n  |\n|\n Portfolio\n  |\n Returns a list of portfolios, including name, customer, entry date, etc.\n  |\n|\n Program\n  |\n Returns a list of programs, including name, owner, description, etc.\n  |\n|\n Project\n  |\n Returns a list of projects, including name, budget, actual costs, hours worked, status, owner, etc.\n  |\n|\n Project User\n  |\n Returns a list of project users, including customer ID, project ID, and user ID.\n  |\n|\n Resource Allocation\n  |\n Returns information about resource allocation for given projects and customers, including scheduled hours, budgeted hours, etc.\n  |\n|\n Resource Pool\n  |\n Returns a list of available resource pools, including customer ID and description.\n  |\n|\n Schedule\n  |\n Returns a list of schedules in the account.\n  |\n|\n Task\n  |\n Returns a list of tasks, including start date, assignee, current status, description, planned hours, responsible team, etc.\n  |\n|\n Team\n  |\n Returns a list of teams in the account.\n  |\n|\n Template\n  |\n Returns a list of templates in the account.\n  |\n|\n Timesheet\n  |\n Returns timesheet information for all users in the account.\n  |\n|\n Users\n  |\n Returns information for all users in the account, including name, title, email address, billing information, etc.\n  |\n|\n Work\n  |\n Returns information about work done, including expense and labor cost, duration, revenue, etc.\n  |\n|\n Work Item\n  |\n Returns a list of work items, including task ID, user ID, status, scope, etc.\n  |\n\n|\n|\n Custom Fields\n  |\n Enter a comma-separated list of custom fields you want to appear in your report.\n  |\n|\n Reference Fields\n  |\n Enter a comma-separated list of reference fields you want to appear in your report. This must use the format\n\nreference object:reference field\n\n. For example, to retrieve the customer name reference field, you would enter\n\ncustomer:name\n\n.\n  |\n\n\n###\n Advanced Pane\n\nIn this pane, you can build up to three specialized filters. The options in this pane allow you to specify a filter name, a modifier, and, in most cases, a field value. For example, if you wanted to filter tasks to show only those with an \"Hours\" value of 5 or under, you would enter\n\nHours\n\nin\n **Filter 1 - Field Name**\n , set\n **Filter 1 - Modifier**\n to\n **Less Than or Equal**\n , and enter\n\n5\n\nin\n **Filter 1 - Field Value**\n .\n\n\n When In is selected as your modifier, you can specify a series of field values using a specified delimiter. For example:\n\nUT,WY,ID\n\nAdditional menus may display, depending on the selected modifier. The following table lists and describes these additional menus:\n\n\n Menu\n  |\n Selected Modifier(s)\n  |\n Description\n  |\n| --- | --- | --- |\n|\n Case-Sensitive\n  |\n Equals, Not Equals, Contains\n  |\n Lets you specify whether filter results are case-sensitive.\n  |\n|\n Field Value 2\n  |\n Between\n  |\n Lets you create a range of values by specifying an additional field value.\n  |\n|\n Delimiter\n  |\n In\n  |\n Lets you select the delimiter for a series of values.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043435093\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003410\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nWorkfront Advanced Connector\n\n", "article_total_view_count": "\n\n\n 2,383\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "workfront_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}