{"file_path": "../../raw_kb_v2\\article\\360042934734\\index.html", "content": {"Title": "Entering Status Updates", "Article Body": "A status update in Domo is similar to that found in Facebook. When you enter a status update, you are telling other users in your company what you are working on. You can choose to attach a status update to a particular task in your\n                        \n                         Projects & Tasks\n                        \n                        page.\n                       \n\n                        You enter a status update in your personal\n                        \n                         Profile\n                        \n                        page in the long field at the top of the page.\n                       \n\n\n\n\n                        Status updates appear in Buzz. You can also view a user's log of status updates by going to his or her\n                        \n                         Profile\n                        \n                        page. Status updates are arranged chronologically from newest to oldest.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can change another user's status only if you have sufficient permissions in Domo. For more information about permissions, see\n                           \n                            Default Security Role Reference\n                           \n                           .\n                          \n\n\n\n\n\n                         To enter a status update,\n                        \n\n\n\n\n                          Open your\n                          \n                           Profile\n                          \n                          page by clicking your photo in the top right corner of the screen.\n                         \n\n\n\n                          Click in the status field at the top of the\n                          \n                           Profile\n                          \n                          page.\n                         \n\n\n\n                          Enter your status update in the field.\n                         \n\n\n\n                          (Optional) To attach this update to a task, click\n                          \n\n                            Attach to Task\n                           \n\n                          , then select the desired project and task.\n                         \n\n\n\n                          Press Enter to save your new status update.\n                         \n\n\n\n                        You can enter a new status update at any time by deleting the old one from this field and entering the new one.\n                       \n\n\n                         To view a user's log of status updates,\n                        \n\n\n\n\n                          Open the user's\n                          \n                           Profile\n                          \n                          page by doing either of the following:\n                         \n\n\n\n                            Clicking on their profile photo anywhere it appears.\n                           \n\n\n\n                            Searching for the user and clicking on their name. For more information about searching, see\n                            \n                             Searching in Domo\n                            \n                            .\n                           \n\n\n\n\n\n                          Click the\n                          \n\n                            Status Updates\n                           \n\n                          tab, which is found in the row of tabs under the user stats.\n                          \n\n\n\n\n\n                        You can \"like\" a status by clicking the\n                        \n                        icon next to the status. You can do this in the status field at the top of the user's\n                        \n                         Profile\n                        \n                        page or in his or her\n                        \n\n                          Status Updates\n                         \n\n                        tab. A count of all of the \"likes\" a status has received appears next to the status in the\n                        \n\n                          Status Updates\n                         \n\n                        tab.", "Preview Article": "Click here to preview", "URL Name": "360042934734", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004392", "Archived Date": "", "Language": "English", "Primary Version": "Entering Status Updates", "Article Total View Count": "4,693", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Entering Status Updates\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}