{"file_path": "../../raw_kb_v2\\article\\360043431993\\index.html", "content": {"title": "\n\n\n Sprinklr Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSprinklr is a company that develops and markets a social software platform, also called Sprinklr, that provides social media marketing, social advertising, content management, collaboration, advocacy and social media monitoring for large enterprises. Use Domo's Sprinklr connector to retrieve information about post insights, bootstrap info, profiles, and more. For more information about the Sprinklr API, visit their website. (\n\nhttps://developer.sprinklr.com/\n\n).\n\n\n The Sprinklr connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Sprinklr account in the Data Center. This topic discusses the fields and menus that are specific to the Sprinklr connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Sprinklr allows an organization to aggregate their various social platform accounts into one place and track social media KPIs.\n  |\n|\n**Primary Metrics**\n | * Engagements (ie, Facebook Likes, Twitter Loves, LinkedIn Shares)\n* Reach\n* Impressions\n |\n|\n**Primary Company Roles**\n |\n Social marketers\n  |\n|\n**Average Implementation Time**\n |\n Application process to access the API could take 2 weeks. Actual implementation time once authenticated takes about 5 hours.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 7\n  |\n\nBest Practices\n----------------\n\nMany of the report options require manual configuration. More information about these options can be found in the API documentation. For example, the \"Account Insights,\" \"Post Insights,\" and \"Paid Ad Stats Insights\" reports require you to fill in a\n\ngroupby\n\nfield. Whatever you enter in this field becomes the dimensions in the report. Available columns that can be used in the\n\ngroupby\n\nare listed in the API documentation. The connector tool tips demonstrate the appropriate format that is required for each configuration step.\n\n\n Prerequisites\n---------------\n\nTo connect to your Sprinklr account and create a DataSet, you must have a Sprinklr client ID and client secret.\n\n\n To get access to the API, you must submit an application and be approved by Sprinklr. Steps to complete this application process can be found here:\n\nhttps://developer.sprinklr.com/apps/myapps\n\nYou must also set up a redirect\\_uri to\n\n\n*https://oauth.domo.com/api/data/v1/oauth/providers/sprinklr/exchange*\n\n\n when creating the API key.\n\n\n Once access is confirmed, you will be able to authenticate using your client ID and client secret.\n\n\n Connecting to Your Sprinklr Account\n-------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Sprinklr Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n**Credentials Pane**\n\n\n This pane contains fields for entering credentials to connect to your Sprinklr account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Environment\n  |\n Select the Sprinklr environment you want to pull data from, either production or sandbox.\n  |\n|\n Client ID\n  |\n Enter your Sprinklr client ID.\n  |\n|\n Client Secret\n  |\n Enter your Sprinklr client secret.\n  |\n\nFor more information about authentication, see \"Prerequisites,\" above.\n\n\n Once you have entered valid Sprinklr credentials, you can use the same account any time you go to create a new Sprinklr DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu in which you select a report type, along with various other menus and fields which may appear depending on the selected report type.\n\n\n**Menu**\n |\n**Description**\n |\n| --- | --- |\n|\n Report\n  |\n Select a Sprinklr report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account Insights\n  |\n Returns account-level information.\n  |\n|\n Bootstrap Info\n  |\n Returns static data for various resources.\n  |\n|\n Custom Metric Information\n  |\n Returns information about user-defined custom metrics.\n  |\n|\n Dashboard Column\n  |\n Returns details on the requested monitoring dashboard column.\n  |\n|\n Paid Ad Stat Insights\n  |\n Returns statistics about paid ads.\n  |\n|\n Post Insights\n  |\n Returns insights for the published brand posts.\n\n\n For a list of acceptable columns for this report, see\n\nhttps://developer.sprinklr.com/docs/read/developr/objects/reports/Post\\_Insights\\_Report\n\n.\n  |\n|\n Profile Conversion Data\n  |\n Returns messages in a conversation for a given user ID.\n  |\n|\n Profile Details\n  |\n Returns the profile details of the requested social profile.\n  |\n|\n Listening Stream\n  |\n Returns the message stream associated with each messag.e\n  |\n|\n Listening Topic Configuration\n  |\n Returns the list of all available configured topic groups and topics. The API returns the minimal information on topic groups and topics.\n  |\n|\n Listening Widget\n  |\n Returns information about a single widget. (Widgets are graphs or charts intended to show listening data and analytics.)\n  |\n|\n Stream Feed\n  |\n Returns the messages for the requested\n **Stream ID**\n . Note that since the column can be defined with various filtering options, the API returns only the filtered messages if the column was configured with filters. The Stream Feed API is generic where the column can represent different types of feed including inbox, workflow or outbound messages.\n  |\n\n|\n|\n Aggregate Function\n  |\n Select how you would like the data in the report to be aggregated.\n  |\n|\n Measurement Names\n  |\n Select all the measurements you want to retrieve data for.\n  |\n|\n Group By Options\n  |\n Enter the desired\n\ngroupby\n\noptions in the format\n\n(columnName,dimensionName,groupType,detail=value)\n\n.\n\n\n For example:\n\n(\"MyAccountId\",ACCOUNT\\_ID,FIELD),(date,DATE\\_HISTOGRAM,interval=1w)\n\n|\n|\n Filter Options\n  |\n Enter the desired filter options in the format\n\n(dimensionName,filterType,[value1,value2],detail=value).\n\nFor example:\n\n(SN\\_TYPE,IN,[FACEBOOK]),(CLIENT\\_ID,IN,[62]),(ACCOUNT\\_ID,IN,[3051,553,565])\n\n|\n|\n Measurement Options\n  |\n Select measurement options for additional result calculations.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Select Resources\n  |\n Select all resources you want to retrieve data for.\n  |\n|\n Select Reports\n  |\n Select all reports you want to retrieve custom metric information for.\n  |\n|\n Dashboard Name\n  |\n Enter the dashboard name (e.g.\n\nAutoDashboard\n\n).\n  |\n|\n Column Name\n  |\n Enter the column name (e.g.\n\nfbinbox\n\n).\n  |\n|\n Channel Type for the Profile\n  |\n Enter the channel type for the profile (e.g.\n\nFACEBOOK\n\n).\n  |\n|\n Profile ID of Social Channel\n  |\n Enter the unique profile ID of the social channel (e.g.\n\n215244391952058\n\n).\n  |\n|\n Stream\n  |\n Enter the ID for the stream you want to retrieve data for.\n  |\n|\n Widget Type\n  |\n Select the type of listening widget you want to retrieve data for (distribution, trend, etc.).\n  |\n|\n Columns to Expand (Optional)\n  |\n Enter a comma-separated list of columns you want to expand into multiple columns. These are columns normally returned as \"List\" or \"Object.\"\n  |\n|\n Dimension\n  |\n Select the first dimension you want to show in your \"Listening Widget\" report.\n  |\n|\n Custom Field Name\n  |\n Enter the custom field name for your selected dimension.\n  |\n|\n Other Dimension\n  |\n Select the second dimension you want to show in your \"Listening Widget\" report.\n  |\n|\n Subtype\n  |\n Select the subtype of users you want to retrieve data for in your \"Listening Widget\" report.\n  |\n|\n Expand Lists\n  |\n Choose whether you want to expand columns that contain lists. If you choose this option, your DataSet may contain multiple rows for a single post.\n  |\n\nThe following screenshot shows an example configuration for the \"Post Insights\" report:\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nThe most commonly occurring issue with this connector relates to filters. Each report in Sprinklr is filtered and run on a separate query that cleans the Sprinklr data displayed in the reports on the Sprinklr website. When setting up the connector, you\n *must*\n use these same filters; otherwise, data will be duplicated or missing. To do this, you must use the API call that is in the backend of a Sprinklr Report.\n\n\n To access this code or to find the filters and backend report to pull from the connector, do the following:\n\n. Open the Chrome browser.\n2. Right-click in the browser and select\n **Inspect**\n .\n3. In the developer screen, navigate to the\n **Network**\n tab.\n4. Refresh your screen on the Sprinklr report page.\n\n\n This causes several elements to appear under the\n **Name**\n column.\n5. Search through the queries and find the corresponding report or data you want to replicate.\n6. Select the query and search under\n **requests**\n to find all the inputs you need to enter into the Domo Connector.\n7. Connect to the Sprinklr connector to Domo using your credentials.\n8. Select the report used in the Sprinklr report.\n\n\n In Sprinklr this is found under\n **requests >**\n**parameter**\n . In the sample it is called “Post Insights.”\n9. For\n **Aggregation Function**\n , select the function used in the Sprinklr report.\n\n\n In Sprinklr this is found under\n **groupBys >**\n**p**\n**rojections**\n . In the sample it is called\n **SUM**\n .\n10. For\n **Measurement**\n**Name**\n , select the function used in the Sprinklr report.\n\n\n In Sprinklr this is found under\n **groupbys > projections > measurement**\n .  In the sample it is called\n **TOTAL\\_ENGAGEMENT**\n .\n11. For\n **Group By Options,**\n enter the\n **groupby**\n fields found in the Sprinklr report under the\n **Requests**\n dropdown menu in the\n **Network**\n tab, using the syntax\n\n(columnName,dimensionName,groupType,detail=value).\n\nFor example, if I had the “Client\\_ID” field listed in the group, I would use the following syntax for\n **Group By Options**\n :\n\n(Client\\_ID,Client\\_ID, field)\n\n.\n\n\n We also recommend you use a date group by even though the Sprinklr report may not contain that information, so the Domo cards will render the data in the needed format. For example:\n\n(date,DATE\\_HISTOGRAM,interval=1h)\n\nor\n\n(POST\\_PUBLISHED\\_DATE,FIELD)\n12. For\n **Filters**\n , enter the filters used in the Sprinklr report.\n\n\n In Sprinklr these are found under\n **requests > filters**\n .  Use the syntax under ? that you find by the\n **Filters**\n box.\n13. (Conditional) If the query code in the Sprinklr report states that\n **Columns to Expand**\n and\n **Measurement**\n**Options**\n are being used, enter the info that is included in the “request” data.\n14. When configuring the time frame, use the time frame stated in the actual Sprinklr report/graph or the one needed for your card visualization. For most Sprinklr reports in Domo, no time frame is provided in the actual Sprinklr report . You can see in the backend that the time stated in the\n\n\n**Time**\n\n\n filter is in a format that is not database friendly or recognizable as a date.\n\nBuilding Drilldown\n--------------------\n\nTo create drilldown in your Sprinklr data, design or find the type of drilldown you wish to see in your card and create a new Sprinklr DataSet that shows that data. For the drilldown to work, you will need to pull or rename the same field names in a DataFlow that correspond with the top level Sprinklr data source.\n\n\n FAQs\n------\n\n\n#####\n How often can the data be updated?\n\nDataSets should be set to update once a day.\n\n####\n Are there any API limits I should be aware of?\n\nSprinklr limits calls to Production instances to 5 calls per second and 500 per hour. Calls to Sandbox instances are limited to 2 calls per second and 100 per hour. Note that a single DataSet run may require multiple calls.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431993\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003700\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSprinklr Connector\n\n", "article_total_view_count": "\n\n\n 4,870\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "sprinklr_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}