{"file_path": "../../raw_kb_v2\\article\\4420447636887\\index.html", "content": {"title": "\n\n\n Microsoft SQL SSH Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Microsoft SQL is a widely used relational database management system. You can use Domo's Microsoft SQL SSH Connector to pull data from your Microsoft SQL database. The Microsoft SQL SSH connector creates a secure, encrypted connection with your Microsoft SQL database to bring your data into Domo and start making better decisions. Use Domo's prebuilt Microsoft SQL SSH connector to get data into Domo.\n\nFor more information about the Microsoft SQL Server API, visit their website. (\n\nhttps://technet.microsoft.com/en-us/library/aa174556(v=sql.80).aspx\n\n).\n\n\n The Microsoft SQL\n\nSSH\n\nconnector is a \"Database\" connector, meaning it retrieves data from databases using a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n **Database**\n in the toolbar at the top of the window.\n\n\n You connect to your Microsoft SQL Server in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft SQL\n\nSSH\n\nconnector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Best Practices\n----------------\n\nMake sure you use a read-only account that has access only to the databases and tables you need to access.\n\n\n Prerequisites\n---------------\n\nTo connect to a Microsoft SQL Server database and create a DataSet, you must have all of the following:\n\n The user name and password of your Unix account\n* The\n\nThe UNIX Server host name to SSH tunnel through\n* The SSH port number\n* The SSH private key\n\no\n\nf your UNIX account\n\n(DES or RSA), in PEM format\n* And, the Host name, Database name, User name, Password, and Port number of your Microsoft SQL Server\n\n*Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys (in PEM format) generated by OpenSSL.**\n\n\n Before you can connect to your SQL server, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses for Connectors\n\n.\n\n\n Connecting to Your Microsoft SQL Server Database\n--------------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Microsoft SQL SSH Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your database. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n SSH Hostname\n  |\n\nEnter the UNIX Server hostname to SSH tunnel through.\n\n|\n|\n SSH Username\n  |\n Enter the\n\nUNIX account username.\n\n|\n|\n SSH Password\n  |\n\nEnter the UNIX account password.\n\n|\n|\n SSH Port\n  |\n Enter the port number for t\n\nhe UNIX port.\n\n|\n|\n SSH Private Key\n  |\n\nEnter the SSH private key (DES or RSA), in PEM format.\n\n|\n|\n Microsoft SQL Server Host\n  |\n\nEnter Microsoft SQL Server host name.\n\n|\n|\n Microsoft SQL Server Database\n  |\n\nEnter Microsoft SQL Server database name.\n\n|\n|\n Microsoft SQL Server Username\n  |\n\nEnter Microsoft SQL Server username.\n\n|\n|\n Microsoft SQL Server Password\n  |\n\nEnter Microsoft SQL Server password.\n\n|\n|\n Microsoft SQL Server Port\n  |\n\nEnter Microsoft SQL Server database port number.\n\n|\n\nOnce you have entered valid Microsoft SQL Server credentials, you can use the same account any time you go to create a new Microsoft SQL SSH DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nIn this pane you create an SQL query to pull data from your database.\n\n  |  |\n| --- | --- |\n|\n Menu\n  |\n Description\n  |\n|\n SQL Query\n  |\n Enter the Structured Query Language (SQL) query to use in selecting the data you want. For example:\n\n\n`Select GeneralManager from Sales WHERE GeneralManager = 'jane';`\n |\n|\n Fetch Size\n  |\n\nEnter the fetch size for memory performance. The default value will be 1000, if this field is left blank. Try decreasing the fetch size, if it throws an 'out of memory for a value' error.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Ensure the port is open on the Windows server and that it is open and forwarded in the firewall.\n* Make sure you can connect from a workstation in the client network.\n* Network protocols must be enabled for remote connections to occur.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4420447636887\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003848\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft SQL SSH Connector\n\n", "article_total_view_count": "\n\n\n 4,791\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "microsoft_sql_ssh_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}