{"file_path": "../../raw_kb_v2\\article\\360042926054\\index.html", "content": {"Title": "Managing User Accounts for Connectors", "Article Body": "Intro\n                        \n\n\n\n                        In the\n                        \n                         Accounts\n                        \n                        tab in the Data Center, you can add, remove, share, and edit the accounts associated with DataSets through connectors. Each account appears as an item in the list, with the name and logo of the connector, the email addresses associated with the account, and the number of DataSets being powered from this account. You can see and manage only your own accounts and the accounts that are shared with you; however, you can transfer DataSets to other users' accounts or change the accounts associated with DataSets. You can also share connector accounts with others so they can also create DataSets using that connector.\n                       \n\n                        When the OAuth token for an account is about to expire, you receive notifications in Domo and via email/SMS. For information about setting notification preferences, see\n                        \n                         Customizing Notification and Alert Settings\n                        \n                        .\n                       \n\n                        If you delete a user from Domo and reassign his/her DataSets to another user, the permissions for the DataSet accounts\n                        \n                         is not\n                        \n                        passed to the new user. The account ownership must be transferred manually. For more information, see\n                        \n                         Removing Users from Domo\n                        \n                        .\n                       \n\n                        For more information about the layout of this tab, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n                        Accessing the Accounts tab\n                       \n\n                        You access the\n                        \n                         Accounts\n                        \n                        tab from the Data Center.\n                       \n\n\n                         To access the Accounts tab,\n                        \n\n\n                        1. Click\n                        \n                         Data\n                        \n                        in the toolbar at the top of the screen.\n                        \n                        The Data Center opens, with the\n                        \n                         DataSets\n                        \n                        tab opened by default.\n                       \n\n\n\n\n                        2. Click the\n                        \n                        icon from the left pane of the screen to open the\n                        \n                         Accounts\n                        \n                        tab.\n                       \n\n\n\n                          Adding an account\n                         \n\n\n\n                        You can add an account to Domo by doing either of the following:\n                       \n\n\n\n                          By adding a DataSet to Domo and entering new account information (as opposed to selecting an existing account). An entry for the new account appears automatically in the\n                          \n                           Accounts\n                          \n                          view. This method is discussed in more detail in\n                          \n                           Adding a Dataset Using a Data Connector\n                          \n                          .\n                         \n\n\n\n                          By clicking\n                          \n                           Add Account\n                          \n                          in the\n                          \n                           Accounts\n                          \n                          view and following the steps in the wizard.\n                         \n\n\n\n\n                         To add an account to Domo from the Accounts view,\n                        \n\n\n\n\n                          In\n                          \n                           Accounts\n                          \n                          , click\n                          \n                           Add Account\n                          \n                          .\n                         \n\n\n\n                          Select the desired connector.\n                         \n\n\n\n                          Click the\n                          \n                           Connect to\n                          \n                          button.\n                         \n\n\n\n                          Enter your connection information.\n                         \n\n\n\n                          Click\n                          \n                           Done\n                          \n                          .\n                         \n\n\n\n                        An entry for the new account appears in the\n                        \n                         Accounts\n                        \n                        view listing.\n                       \n\n                        Deleting an account\n                       \n\n                        You can disconnect (delete) any account listing from the\n                        \n                         Accounts\n                        \n                        view. Any DataSets that use this account are unassociated and stop updating.\n                       \n\n\n                         To delete an account in the Accounts view,\n                        \n\n\n\n\n                          Mouse over the account you want to delete.\n                         \n\n\n\n                          Click\n                          \n                          and select\n                          \n                           Delete Account\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Delete Account\n                          \n                          to confirm.\n                         \n\n\n\n                        Viewing DataSets associated with accounts\n                       \n\n                        In the\n                        \n                         Accounts\n                        \n                        view, you can see a listing of DataSets associated with each account. You can see any DataSet in more detail by clicking a DataSet's name in the list.\n                       \n\n\n                         To view DataSets associated with an account,\n                        \n\n\n\n\n                          In\n                          \n                           Accounts\n                          \n                          , on a listed account, mouse over the\n                          \n                           DataSets\n                          \n                          column item.\n                          \n                          A list of the associated DataSets appears.\n                         \n\n\n\n                          Click the name of a DataSet to see the Details page for that DataSet.\n                         \n\n\n\n                        Reconnecting connectors for accounts\n                       \n\n                        For connectors that use OAuth to authenticate, you can reconnect, if necessary in the\n                        \n                         Accounts\n                        \n                        tab. If an OAuth token has expired, you may have to re-enter your credentials to reconnect.\n                       \n\n\n                         To reconnect a connector for an account,\n                        \n\n\n\n\n                          Mouse over the account you want to reconnect.\n                         \n\n\n\n                          Click\n                          \n                          and select\n                          \n                           Re-connect\n                          \n                          .\n                         \n\n\n\n                          (Conditional) Enter your credentials or grant account access to Domo, if you are asked to do so.\n                         \n\n\n\n                        Renaming accounts\n                       \n\n                        When you create accounts, either by adding them in the\n                        \n                         Accounts\n                        \n                        tab or entering credentials for a new DataSet, those accounts take the name of the connector. For example, if you add an account for Facebook, that account is called \"Facebook Account.\" Subsequently added accounts for the same connector share this name. This can make it confusing to differentiate between accounts for the same connector. You can eliminate this confusion by giving unique names to accounts in the\n                        \n                         Accounts\n                        \n                        tab.\n                       \n\n\n                         To rename accounts in the Accounts tab,\n                        \n\n\n\n\n                          Click the account name. (You can also select\n                          \n                           Edit account\n                          \n                          in the gear menu.)\n                          \n                          The account name and credentials open for editing.\n                         \n\n\n\n                          Enter a new name for the account.\n                         \n\n\n\n                          Click\n                          \n                           Save Changes\n                          \n                          .\n                         \n\n\n\n                        Editing connector account credentials\n                       \n\n                        For connectors that require you to enter account credentials manually (as opposed to using OAuth), you can edit the credentials as necessary in the\n                        \n                         Accounts\n                        \n                        tab.\n                       \n\n\n                         To edit connector information in the Accounts tab,\n                        \n\n\n\n\n                          Click the account you want to edit. (You can also select\n                          \n                           Edit account\n                          \n                          in the gear menu.)\n                         \n\n\n\n                          Enter the required credentials in the necessary fields.\n                         \n\n\n\n                          Click\n                          \n                           Save Changes\n                          \n                          .\n                         \n\n\n\n                        Sharing a connector account\n                       \n\n                        You can share connector accounts with others so they can build DataSets using that connector. Users you share accounts with cannot see or edit the account information when configuring a DataSet using the connector; only the account owner can see or edit the account information.\n                       \n\n                        You can see accounts that have been shared with you in the\n                        \n                         Accounts\n                        \n                        tab. Shared accounts appear grayed out. You can only use shared accounts to access the system through the connector.\n                       \n\n\n                         To share an account with another user,\n                        \n\n\n                        1. Mouse over the account you want to share.\n                       \n\n                        2. Click\n                        \n                        and select\n                        \n                         Share account\n                        \n                        .\n                       \n\n\n\n\n                        3. A Share Account access dialog for the the selected account appears, listing the users with access to the DataSets from this account.\n                       \n\n                        4. Click the \"Add a person...\" search bar to search for the user name you want to share the account with.\n                       \n\n\n\n\n                        5. Select the desired user and click\n                        \n                         Add\n                        \n                        .\n                       \n\n                        6. The newly added user will appear in the\n                        \n                         Shared with\n                        \n                        section. Repeat the same process to add multiple users you want to share the account with.\n                       \n\n                        The users you select have access to the DataSets associated with this account.\n                       \n\n                        Removing a user account\n                       \n\n                        You can remove a user from the account that you added earlier. The removed user will no longer have the access to your datasets.\n                       \n\n\n                         To remove a user's account access,\n                        \n\n\n                        1. Mouse over the account you want to remove access from.\n                       \n\n                        2. Click\n                        \n                        and select\n                        \n                         Share account\n                        \n                        .\n                       \n\n                        3. A dialog appears listing the users with access to DataSets from this account in the\n                        \n                         Shared with\n                        \n                        section.\n                       \n\n                        4. Click the cross (\n                        \n                        ) in front of the the user name that you want to remove the access for.\n                       \n\n\n\n\n                        5. You can remove the account access with multiple users in the same attempt just by clicking the cross (\n                        \n                        ) in front of the the user names that you want to remove the access for.\n                       \n\n                        The user(s) no longer have access to the DataSets associated with this account.\n                       \n\n                        Transferring ownership of multiple DataSets\n                       \n\n                        You can bulk transfer ownership (and management) of multiple DataSets from one user to another user. This may be useful when a user leaves the company or you need to consolidate users.\n                       \n\n                        Transferring ownership lets another user manage DataSets but continue to let associated users connect with the credentials specified in the connection account until or unless the owner or admin configures the DataSet to use another connection account.\n                       \n\n                        After transferring ownership, both users can view the associated DataSets in the\n                        \n                         Accounts\n                        \n                        tab, but only the user with ownership can manage the associated DataSets. If you want to configure the DataSet to use credentials in a different connection account when connecting to the third-party system to get data, change the connection account. For more information, see\n                        \n                         Changing the connection account of multiple DataSets\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Transferring ownership of multiple DataSets requires the following:\n                           \n\n\n                             You\n                             \n                              must\n                             \n                             be the owner of all the DataSets or have an \"Admin\" default security role or a custom role with the \"Manage DataSets\" privilege enabled.\n                             \n                             Users with a default security role of \"Privileged\" or \"Editor\" can only assign ownership for their user-associated DataSets to another user. Users with a default security role of \"Admin\" can assign ownership for any user-associated DataSets. For more information about default security roles, see\n                             \n                              Managing Roles\n                             \n                             .\n                            \n\n                             When transferring ownership in bulk, you\n                             \n                              must\n                             \n                             assign ownership for\n                             \n                              all\n                             \n                             DataSets of the associated user.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           You can change ownership of a single DataSet in the Details view for the DataSet. For more information, see\n                           \n                            Changing the Owner of a DataSet\n                           \n                           .\n                          \n\n\n\n\n\n                         To transfer ownership of DataSets associated with a user,\n                        \n\n\n                        1. In\n                        \n                         Accounts\n                        \n                        , on a listed account, mouse over the\n                        \n                         DataSets\n                        \n                        column item. A list of the associated DataSets appears.\n                       \n\n                        2. Click\n                        \n                         Change Owner\n                        \n                        .\n                       \n\n\n\n\n                        3.\n                        \n                         Transfer DataSets\n                        \n                        window pops up. Click\n                        \n                         Transfer Ownership\n                        \n                        .\n                       \n\n                        4. A\n                        \n                         Transfer Ownership\n                        \n                        dialog appears.\n                       \n\n                        5. Enter the name of the user to whom you want to transfer ownership of the DataSets and click\n                        \n                         Transfer Ownership\n                        \n                        .\n                       \n\n\n\n\n                        An entry for the user is added to the user's\n                        \n                         Accounts\n                        \n                        tab.\n                       \n\n                        Changing the connection account of multiple DataSets\n                       \n\n                        You can bulk change the credentials that multiple DataSets use in connecting to a third-party system to get data by changing from one connection account to another connection account. This is useful for situations such as the following:\n                       \n\n\n\n                          when the connection account was for use in development but not production\n                         \n\n\n\n                          when you need to consolidate accounts\n                         \n\n\n\n                          when permissions are insufficient in the connection account\n                         \n\n\n\n                          when you need to change the credentials in the connection account (which requires creating a new connection account and adding DataSets to it)\n                         \n\n\n\n                        Changing the connection account configures the associated DataSets to use the credentials of the connection account when connecting to the third-party system to get data.\n                       \n\n                        After changing the connection account, the previous connection account is disconnected and removed if no DataSets are associated.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Changing the connection account of multiple DataSets, requires the following:\n                            \n\n\n\n\n\n                               You\n                               \n                                must\n                               \n                               be the owner of all the DataSets or have an \"Admin\" default security role or a custom role in which the \"Manage DataSets\" privilege is enabled.\n                               \n                               Users with an \"Admin,\" \"Privileged,\" or \"Editor\" default security role can only change the connection account for their user-associated DataSets from one of their connection accounts to another of their connection accounts. For more information about default security roles, see\n                               \n                                Managing Roles\n                               \n                               .\n                               \n                               If you need to consolidate account ownership\n                               \n                                before\n                               \n                               changing the connection account used for multiple DataSets, first transfer ownership before changing accounts. For more information, see\n                               \n                                Transferring ownership of multiple DataSets\n                               \n                               .\n                              \n\n\n\n\n\n                               When changing the connection account in bulk, you\n                               \n                                must\n                               \n                               change the connection account for\n                               \n                                all\n                               \n                               DataSets of the associated user.\n                              \n\n\n\n\n\n                               Both connection accounts\n                               \n                                must\n                               \n                               use the same data connector.\n                              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           You can change the connection account associated with a single DataSet in the Details view for the DataSet.\n                          \n\n\n\n\n\n                         To change the connection account of multiple DataSets,\n                        \n\n\n\n\n                          Ensure that you are using the correct OAuth information for an account for a third-party system.\n                          \n                          Typically, each account for a data provider would contain the same access permissions in the third-party system, except when you intentionally want to use DataSets that depend on user access.\n                          \n                          You can sign in to the third-party system in a new tab or window using the same Web browser before creating the credential account in Domo.\n                         \n\n\n\n                          In\n                          \n                           Accounts\n                          \n                          , on a listed account, mouse over the\n                          \n                           DataSets\n                          \n                          column item.\n                          \n                          A list of the associated DataSets appears.\n                         \n\n\n\n                          Click\n                          \n                           Change Owner\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Change Account\n                          \n                          .\n                          \n                          This option is available\n                          \n                           only\n                          \n                          when you have more than one account for this connector. Only you can see your accounts.\n                         \n\n\n\n                          Select the account you want to move the DataSets to.\n                         \n\n\n\n                          Click\n                          \n                           Change Account\n                          \n                          .\n                         \n\n\n\n                        After changing the connection account for DataSets, verify that the appropriate data comes into Domo. If not, verify the permissions of the account in the third-party system.", "Preview Article": "Click here to preview", "URL Name": "360042926054", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004907", "Archived Date": "", "Language": "English", "Primary Version": "Managing User Accounts for Connectors", "Article Total View Count": "8,022", "": "", "Article Created Date": "10/24/2022, 10:35 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Managing User Accounts for Connectors\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Data Center Overview\n              \n", "url": "/s/topic/0TO5w000000ZanRGAS"}]}