{"file_path": "../../raw_kb_v2\\article\\1500009771882\\index.html", "content": {"Title": "Apple Search Ads OAuth Connector", "Article Body": "Intro\n                       \n\n                        Apple Search Ads allows larger advertisers or agencies to create and manage many campaigns programmatically and to run reports for customer insights and trends. The Apple Search Ads OAuth connector allows to pull the data about the performance metrics for your campaigns and ad groups from your Apple Search Ads system into Domo. Use Domo's Apple Seach Ads OAuth connector to combine your Apple Search Ads data with the data from other systems securely for more insights than ever. To learn more about the Apple Search Ads API, visit their page (\n                        \n                         https://searchads.apple.com/advanced...gn-management/\n                        \n                        ).\n                       \n\n                        You connect to your Apple Search Ads OAuth account in the Data Center. This topic discusses the fields and menus that are specific to the Apple Search Ads OAuth connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Apple Search Ads OAuth account and create a DataSet, you must have the following:\n                       \n\n\n\n                          Your Apple Ads client ID\n                         \n\n\n\n                          Your Apple Ads team ID\n                         \n\n\n\n                          Your Apple Ads key ID\n                         \n\n\n\n                          The private key, including begin and end EC private key tags.\n                         \n\n\n\n                        You get your client ID, team ID, and key ID after uploading your public key to Apple Search Ads.\n                       \n\n                        Visit\n                        \n\n\n                         Apple Search Ads OAuth documentation\n                        \n\n\n                        to learn about obtaining your credentials.\n                       \n\n                        Connecting to Your\n                        \n                         Apple Search Ads OAuth\n                        \n                        Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n\n\n                          Credentials\n                         \n\n\n                         and\n                         \n\n\n                          Details\n                         \n\n\n                         panes in the\n                         \n\n\n\n                         Apple Search Ads OAuth\n                        \n\n\n\n                         Connector page.\n                        \n                        The components of the other panes in this page,\n                        \n                         Scheduling\n                        \n                        and\n                        \n                         Name & Describe Your DataSet\n                        \n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your\n                        \n                         Apple Search Ads OAuth\n                        \n                        account. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Client ID\n                          \n\n                           Enter your Apple Search client ID that you get after uploading your public key to Apple Search Ads. Visit\n                           \n\n\n                            Apple Search Ads OAuth documentation\n                           \n\n\n                           to learn more.\n                          \n\n\n\n                           Team ID\n                          \n\n                           Enter your Apple Search team ID that you get after uploading your public key to Apple Search Ads. Visit\n                           \n\n\n                            Apple Search Ads OAuth documentation\n                           \n\n\n                           to learn more.\n                          \n\n\n\n                           Key ID\n                          \n\n                           Enter your Apple Search key ID that you get after uploading your public key to Apple Search Ads. Visit\n                           \n\n\n                            Apple Search Ads OAuth documentation\n                           \n\n\n                           to learn more.\n                          \n\n\n\n                           Private Key\n                          \n\n                           Enter the private key, including begin and end EC private key tags. Visit\n                           \n\n\n                            Apple Search Ads OAuth documentation\n                           \n\n\n                           to learn more.\n                          \n\n\n\n\n\n                         Once you have entered valid\n                         \n\n\n\n                         Apple Search Ads OAuth\n                        \n\n\n\n                         credentials, you can use the same account any time you go to create a new\n                         \n\n\n\n                         Apple Search Ads OAuth\n                        \n\n\n\n                         DataSet.\n                         \n\n\n                        You can manage Connector accounts in the\n                        \n                         Accounts\n                        \n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n                         Reports\n                        \n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the\n                            \n                             Apple Search Ads OAuth\n                            \n\n\n\n\n                            report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Campaign Report (New)\n                              \n\n                               Returns metadata and performance metrics of all the campaigns for selected org.\n                              \n\n\n\n                               AdGroup Report (New)\n                              \n\n                               Returns metadata and performance metrics of all the adgroups for a selected campaign.\n                              \n\n\n\n\n\n\n\n\n                            Org ID\n                           \n\n\n\n                            Select the org you want to retrieve data for.\n                           \n\n\n\n\n\n                            Granularity\n                           \n\n\n\n                            Select the desired date granularity for your report.\n                           \n\n\n\n\n\n                            Campaign IDs\n                           \n\n\n\n                            Select the campaign IDs you want to retrieve data for.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n\n                              End Date\n                             \n\n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n\n                              Start Date\n                             \n\n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n\n                              Days Back to End At\n                             \n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n                              Days Back to Start From\n                             \n\n                            and 5 for\n                            \n\n                              Days Back to End At\n                             \n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n\n                              Days Back to Start From\n                             \n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n                              Days Back to Start From\n                             \n\n                            and 5 for\n                            \n\n                              Days Back to End At\n                             \n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQs\n                       \n\n                        What version of the Apple Search Ads API does this connector use?\n                       \n\n                        This connector uses version 3 of the Apple Search Ads API (\n                        \n                         https://api.searchads.apple.com/api/v3\n                        \n                        ).\n                       \n\n                        Which endpoint(s) does each report call in this Connector?\n                       \n\n\n\n\n                           Report Name\n                          \n\n                           Endpoint URL(s)\n                          \n\n\n\n                           AdGroup Report\n                          \n\n                           /reports/campaigns/{CAMPAIGN_ID}/adgroups\n                          \n\n\n\n                           Campaign Report\n                          \n\n                           /reports/campaigns\n                          \n\n\n\n\n\n                         What kind of credentials do I need to power up this Connector?\n                        \n\n\n                        You need the client ID, team ID, key ID, and private key associated with your Apple Search Ads account. You get your client ID, team ID, and key ID after uploading your public key to Apple Search Ads. You need to enter your private key including the begin and end EC private key tags.\n                        \n                        Visit the\n                        \n\n\n                         Apple Search Ads OAuth documentation\n                        \n                        to learn about obtaining your credentials.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        As often as needed.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        No\n                       \n\n                        Troubleshooting\n                       \n\n\n                         Make sure your authentication remains valid.\n                        \n\n                         Review the configuration to make sure that all required items have been selected.\n                        \n\n                         Review the Connector history for error messages.\n                        \n\n                         In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.", "Preview Article": "Click here to preview", "URL Name": "1500009771882", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003223", "Archived Date": "", "Language": "English", "Primary Version": "Apple Search Ads OAuth Connector", "Article Total View Count": "4,636", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Apple Search Ads OAuth Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}