{"file_path": "../../raw_kb_v2\\article\\7750206953495\\index.html", "content": {"title": "\n\n\n Amazon public datasets Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo's\n\nAmazon public datasets Connector\n\n\n you can easily deploy any of a number of public DataSets directly to your Domo instance.\n\nTo learn more about the\n\nAmazon public datasets connector\n\nAPI, visit their page (\n\n\n AWS Public Datasets | AWS Public Sector Blog (amazon.com)\n\n\n The\n\nAmazon public datasets\n\nConnector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n\n\n**Cloud App**\n\n\n in the toolbar at the top of the window.\n\nPublic DataSets are also available from the\n\n*Connectors**\n\ntab in the Appstore as well as from the Data Center.\n\nGeneral information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n| **Primary Use Cases**  |\n This Connector lets you retrieve data about\n\n[insert general explanation of items that can be seen]\n\n.\n  |\n| **Primary Metrics**  | * [Create a bullet list of each metric that is available.]\n* [Metric 2]\n* [Metric 3]\n* [Metric 4]\n* [Metric 5]\n |\n| **Primary Company Roles**  | * [Create a bullet list of roles that would use this feature, such as:]\n* [Director of marketing]\n* [Social media manager]\n* [CMO]\n* [Sales and marketing teams]\n |\n| **Average Implementation Time**  |\n [State the amount of time it will take to set up, such as: “Typically less than an hour, but may take longer to get the right data in.”]\n  |\n| **Ease of Use (on a 1-to-10 scale with 1 being easiest)**  |\n [Enter number]\n  |\n\nBest Practices\n----------------\n\n\n* [Create a bullet list of the general information about when to use this connector.]\n* [Reason 2.]\n* [Reason 3.]\n\nPrerequisites\n---------------\n\nTo connect to your Amazon public datasets Connectors account and create a DataSet, you must have the following:\n\n Your AWS access key. You can find this in the\n\n\n**Security Credentials**\n\n\n section of the AWS Console. Alternatively, if you are using IAM, you can find it under\n\n\n**Users**\n .\n* Your AWS secret key was provided when you created your access key. You can generate a new secret key in the AWS Console.\n* The name of the AWS S3 Bucket you want to retrieve files from.\n\n\n###\n Creating a User with the Proper Permissions\n\nYou must create a user with the proper permissions in the IAM Amazon Console before you can connect to S3 data in Domo.\n\n\n**To configure your user in the IAM Amazon Console,**\n\n. Add a new user, setting options as follows:\n\n1. In the\n\n\n\t**Details**\n\n\n\t pane, check the box for\n\n\n\t**Programmatic Access**\n\n\n\t under\n\n\n\t**Select AWS access type**\n\t .\n\t2. In the\n\n\n\t**Permissions**\n\n\n\t pane, select\n\n\n\t**Attach existing policies directly**\n\t , then check the box for either\n\n\n\t**AmazonS3FullAccess**\n\n\n\t or\n\n\n\t**AmazonS3ReadOnlyAccess**\n\t .\n\n\n\t Customer-managed policies\n\n\n\t*do not work*\n\t .\n\t3. In the\n\n\n\t**Review**\n\n\n\t pane, click\n\n\n\t**Create User**\n\t .\n2. After you create your user, copy the access and secret keys to use in the\n\n\n**Credentials**\n\n\n pane in Domo.\n\nConnecting to Your Amazon S3 Account\n--------------------------------------\n\n\n This section enumerates the options in the\n\n\n**Credentials**\n\n\n and\n\n\n**Details**\n\n\n panes in the Amazon S3 Connector page. The components of the other panes in this page,\n\n\n**Scheduling**\n and\n\n\n**Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Amazon S3 account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter your AWS access key. For information about finding your access key, see \"Prerequisites,\" above.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. For information about finding your secret key, see \"Prerequisites,\" above.\n  |\n|\n Bucket\n  |\n Enter the Amazon S3 Bucket you want to pull files from.\n  |\n\n\n Once you have entered valid Amazon S3 credentials, you can use the same account any time you go to create a new Amazon S3 DataSet. You can manage connector accounts in the\n\n\n**Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\nConnecting to Your\n\nAmazon public datasets Connectors\n\nAccount\n----------------------------------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the [insert Connector name here] Connector page. The components of the other panes in this page,\n\n\n**Scheduling**\n\n\n and\n\n\n**Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Amazon S3 account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter your AWS access key. For information about finding your access key, see \"Prerequisites,\" above.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. For information about finding your secret key, see \"Prerequisites,\" above.\n  |\n|\n Bucket\n  |\n Enter the Amazon S3 Bucket you want to pull files from.\n  |\n\n\n Once you have entered valid Amazon S3 credentials, you can use the same account any time you go to create a new Amazon S3 DataSet. You can manage connector accounts in the\n\n\n**Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n**Note:**\n\n\n If you are already logged into\n\nAmazon public datasets connector\n\nwhen you connect in Domo, you are authenticated automatically when you click\n\n\n**Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of\n\nAmazon public datasets connector\n\n.\n\n\n###\n Details Pane\n\nThis pane contains various menus for locating and configuring the file you want to pull into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n S3 Bucket Region\n  |\n Select the S3 Bucket Region where your file is located.\n\n\n |\n|\n File Type to Import\n  |\n Select the type of file you want to import into Domo, either CSV, JSON, or XML.\n  |\n|\n How Would You Like to Choose Your Filename?\n  |\n Select how you want Domo to identify your file. Options are as follows:\n\n\n|  |  |\n| --- | --- |\n|\n Complete Filename\n  |\n You enter the complete path to the file.\n  |\n|\n Partial Filename\n  |\n You enter a partial file name and specify whether the file to retrieve starts with or contains the name you have entered.\n  |\n|\n FilesDiscovery\n  |\n A list of files in the selected bucket appears and you choose the one you want. This option is available\n\n\n*only*\n\n\n when your selected S3 bucket contains fewer than 100 files.\n  |\n\n|\n|\n Prefix (Optional)\n  |\n Enter a prefix to filter results by. A prefix limits results to only those keys that begin with the given prefix. Note that with this standard version of the connector, only the latest modified file will be imported. The advanced version of the connector retrieves all files with the same prefix, provided they have the same schema. For more information, see\n\nAmazon S3 Advanced Connector\n\n.\n  |\n|\n Enter Complete Filepath\n  |\n Enter the complete path for the desired file.\n  |\n|\n File Name\n  |\n Enter the name of the file you want to import, with or without the file path. For example:\n\nfolder\\_name/file\\_name*\n\n|\n|\n File Name Match Type\n  |\n Specify whether the file you want to retrieve starts with or contains the text you entered under\n\n\n**File Name**\n .\n  |\n|\n File Compression Type\n  |\n Select the compression type for the file you want to retrieve. If the file is not compressed, select\n\n\n**None**\n .\n  |\n|\n Are Headers Present in CSV File?\n  |\n Select\n\n\n**Yes**\n\n\n if the CSV file you are importing contains headers; otherwise select\n\n\n**No**\n .\n  |\n|\n List of Files\n  |\n Select the file you want to retrieve.\n  |\n|\n Select the Delimiting Character\n  |\n Select the delimiter used in the CSV file you want to retrieve. If your delimiter is not listed, select\n\n\n**Other**\n .\n  |\n|\n Quote Character\n  |\n Select a quote character to parse the CSV file you want to retrieve. A double quote (\") is the CSV standard.\n  |\n|\n Escape Character\n  |\n Select an escape character to parse the CSV file you want to retrieve. A backslash (\\) is the CSV standard.\n  |\n|\n Enable Parsing for Large JSON Files?\n  |\n Specify whether parsing is enabled for large JSON files.\n  |\n|\n Does Your JSON Text Require a Line Reader?\n  |\n Specify whether the text in your JSON file includes multiple lines that should be read.\n  |\n|\n Should the Backslash be Escaped?\n  |\n Specify whether the text in your JSON file contains backslash characters that should be escaped.\n  |\n|\n Enter Your Data Tag\n  |\n Enter the tag for the data in your JSON or XML file.\n  |\n|\n Enter Fields to Exclude\n  |\n Provide a comma-separated list of fields to exclude in your JSON/XML import.\n  |\n|\n Enter Your Header Tag\n  |\n Enter the tag for the header in your JSON or XML file.\n  |\n|\n Do You Require Attributes in Data?\n  |\n Specify whether you require attributes values as part of your XML data.\n  |\n|\n Enter XPath Expression\n  |\n Enter your XPath expression.\n  |\n|\n Is Password Protected?\n  |\n Select\n\n\n**Yes**\n\n\n if the file you are retrieving is password-protected; otherwise select\n\n\n**No**\n .\n  |\n|\n Header Start Row\n  |\n Enter the number of the header row in the Excel file you are retrieving.\n  |\n|\n Data Start Row\n  |\n Enter the number of the first data row in the Excel file you are retrieving.\n  |\n|\n Footer\n  |\n Enter the number of the footer row in the Excel file you are retrieving.\n  |\n|\n Blank Rows\n  |\n Select the action that should be taken if blank rows are encountered. If you select\n\n\n**Skip blank rows**\n , any blank rows are skipped; if you select\n\n\n**Stop at the first blank column**\n , the data import stops when a column with a blank row is encountered.\n  |\n|\n Empty Column Headers\n  |\n Specify what should happen if empty column headers are encountered. If you choose\n **Add blank columns**\n , column names are automatically generated for the new columns. If you select\n\n\n**Stop at the first blank column**\n , the data import stops when an empty header is encountered.\n  |\n\n\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n\nWhat kind of credentials do I need to power up this Connector?\n\nYou need the email address and password associated with your\n\nAmazon public datasets connectors\n\naccount.\n\n###\n How do I know my\n\nAmazon public datasets Connector\n\ncredentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n Why is the connector unable to pull the data?\n\n\n Ensure that the file is present in the S3 bucket and specify the correct file type in the connector settings. Also, remove null columns to allow the connector to retrieve the data.\n\n\n####\n Are there any API limits I should be aware of?\n\n\n You may encounter a limit of 100 Amazon S3 buckets per account.\n\nTroubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 7750206953495\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003842\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon public datasets Connector\n\n", "article_total_view_count": "\n\n\n 2,409\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "amazon_public_datasets_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}