{"file_path": "../../raw_kb_v2\\article\\4402058407191\\index.html", "content": {"title": "\n\n\n Analyzer and DataSet Views Integration\n\n\n", "article_body": "\n\nIntro\n-------\n\nDataSet Views have been integrated inside of Analyzer, allowing for light-weight ETL data changes while visualizing the data. You can now do the following, all without leaving Analyzer:\n\n Join another DataSet.\n* Clean up the data by renaming columns, removing columns, and changing the data type.\n* Create nested Beast Modes.\n\nFor more information on Analyzer, see\n\nDataSet Views\n\n.\n\n\n Using DataSet Views inside of Analyzer\n----------------------------------------\n\n\n1. Edit an existing Card or create a new Card.\n2. Open the Analyzer.\n3. Click the\n **Data**\n tab.\n4. Make the desired changes to the DataSet.\n5. Click the\n **Visualize**\n tab.\n6. Design the Card with the updated DataSet.\n7. When finished with the Card, select\n **Save and Close**\n from the drop-down menu.\n\nViews Custom Grant\n--------------------\n\nTo help Admins and Major Domo’s with Data Governance in their instance we’ve added a new custom grant to give them more control on who can create DataSet Views in Analyzer.\n\n\n We’ve now added a new grant in the Admin > Roles section, which allows for Admins to enable or disable users' capabilities to create DataSet Views in Analyzer.\n\n\n When any user in your instance has \"Edit Data\" they have permissions to create a DataSet View in Analyzer. By deselecting this new grant you will remove users' permission from being able to create new DataSet Views in Analyzer. Users will only be able to view the DataSet in Analyzer and not make any changes to it.\n\n\n This new grant is tied with \"Edit Data\", when users have \"Edit Data\" enabled, the new grant to create DataSet views will also be enabled. You must disable it to remove the permission.\n\n\n Analyzer DataSet Tags\n-----------------------\n\nTo help with tracking DataSet Views created in Analyzer, we also auto-tag any DataSet View that is now created in Analyzer. You can easily filter to this tag in the Data Center.\n\nFAQs\n------\n\n\n####\n How do Custom Roles work with DataSet Views in Analyzer?\n\nUser grants apply to DataSet Views the same as other Domo features. A user must have \"Can Edit\" DataSet to be able to create or make edits to a DataSet View in Analyzer. If they do not have the \"Edit Data\" grant then the user will have view only permission to the DataSet Data tab in Analyzer. They will not be able to make any edits or changes to the DataSet, only view it.\n\n###\n How does PDP work with DataSet Views in Analyzer?\n\nPDP works the same way it does on other DataSets. When row level security is applied users will only be able to see the rows they have access to in the Data tab in Analyzer. When they create a DataSet View from a DataSet that has PDP applied to it then the PDP automatically gets applied to the new DataSet View.\n\n###\n Are creation and edits to DataSet Views in Analyzer tracked in the Audit Log?\n\nYes, when a new DataSet View is created in Analyzer, an Audit Log event is added to the Activity Log. The log indicates the creation of a new DataSet and who created it. When edits are made to the DataSet View an additional audit event is added to the audit log.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4402058407191\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004566\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAnalyzer and DataSet Views Integration\n\n", "article_total_view_count": "\n\n\n 5,062\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "analyzer_and_dataset_views_integration", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "transforming_data_in_domo", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "dataset_views", "url": "/s/topic/0TO5w000000ZanWGAS"}]}