{"file_path": "../../raw_kb_v2\\article\\360043428733\\index.html", "content": {"Title": "Sorting the Data in Your Chart", "Article Body": "Intro\n                        \n\n\n\n                        In the Analyzer, you can reorder the data in your chart. You can do this in two different ways:\n                       \n\n\n\n                          By using the quick sort tool. This is available for bar and line charts in both the Details and Analyzer views. It does not provide as many options as the\n                          \n                           Sorting\n                          \n                          box (described next) but is quick and easy to use.\n                          \n\n\n\n\n\n\n                          By dragging columns you want to sort by into the\n                          \n                           Sorting\n                          \n                          field, which is located on the left side of the chart. This is available for all chart types.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Sorting may not work as desired if NULL values in your chart are not set to 0. You can change NULL values to 0 using Beast Mode. For more information, see\n                            \n                             Beast Mode FAQs: How do I deal with NULL values when adding columns?\n                            \n\n\n\n\n\n\n\n                         Quick sort\n                        \n\n\n\n\n                        For most bar and line charts, you can quickly change the sort method just by clicking an icon, without having to open the Analyzer. This icon appears when you mouse over either the x- or y-axis of the chart. Five versions of this icon appear in a cycle; clicking any version sorts the chart accordingly, and the icon changes to the next version in the cycle.\n                       \n\n                        The following table lists and describes the sort methods associated with each version of the icon:\n                       \n\n\n\n\n                           Icon\n                          \n\n                           Description\n                          \n\n\n\n\n\n\n\n\n                           Sorts the data items in the chart using the default sort (i.e. the same way they were sorted when the chart was created).\n                          \n\n\n\n\n\n\n                           Sorts the data items in the chart in order of ascending values.\n                          \n\n\n\n\n\n\n                           Sorts the data items in the chart in order of descending values.\n                          \n\n\n\n\n\n\n                           Sorts the data items in the chart in ascending alphanumeric category order.\n                          \n\n\n\n\n\n\n                           Sorts the data items in the chart in descending alphanumeric category order.\n                          \n\n\n\n\n                        Sorting field\n                       \n\n                        This option is available in the Analyzer for all chart types.\n                       \n\n\n                         To add a sort\n                        \n\n                         using the Sorting Field,\n                        \n\n\n\n\n                          Determine which column(s) you want to sort by. For example, if you wanted your values to go from high to low, you would sort by your values column.\n                         \n\n\n\n                          Drag the sort column from the\n                          \n                           Dimensions/Measures\n                          \n                          area into the\n                          \n                           Sorting\n                          \n                          box.\n                          \n                          A panel with sort options for the column appears.\n                          \n\n\n\n\n\n\n                          Specify whether the column data is to be sorted in an ascending or descending order.\n                         \n\n\n\n                          (Optional) In the\n                          \n                           Aggregation\n                          \n                          menu, choose how you want the data to be aggregated.\n                         \n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          .\n                         \n\n\n\n                        You can add additional sorts by clicking repeating the above steps. You can remove a sort by mousing over the sort indicator bar and clicking\n                        \n                        .\n                       \n\n                        Sorting in charts and maps\n                       \n\n                        Sorting in charts and maps can be complex, depending on your chart type, the data used to power the chart, and whether you choose to sort by value, category, or series, or have no sort at all. In the event that you are not able to sort your data the way you want using Domo's built-in sort options, you can force a sort order using Beast Mode.\n                       \n\n                        Value-based sorting\n                       \n\n                        When you choose to sort by a value column, categories are sorted in ascending or descending order based on their values.\n                       \n\n                        In the chart shown in the following example, the categories are in ascending order, from least sales to most sales.\n                       \n\n\n\n\n                        By selecting\n                        \n                         Descending\n                        \n                        in the sorting dialog, the order of categories is reversed, from most sales to least sales.\n                       \n\n\n\n\n                        Value sorting is not recommended in charts that contain series data.\n                       \n\n                        Category- and series-based sorting\n                       \n\n                        When you choose to sort by a category column, categories are sorted in ascending or descending order alphanumerically, based on their names. In the chart in the following example, the user has chosen a descending category-based order, so the categories are shown in reverse alphabetical order.\n                       \n\n\n\n\n                        When you choose to sort by a series column, series are sorted alphanumerically in ascending or descending order in their respective categories, and the categories themselves, by default, are sorted alphanumerically in ascending order. You can change the default sort behavior for categories in this case by adding a second sort. For more information, see the next section.\n                       \n\n                        Many types of bar charts allow you to apply two additional category/series-based sorts using Chart Properties. These sorts are as follows:\n                       \n\n\n\n                          Sort on Totals\n                         \n                         . When you select this option for a multi-series bar chart, categories are sorted by the totals of all of their series, regardless of the ranking of the individual series. In the following example, the category with the highest total was \"Customer Service,\" even though several departments had higher values for \"Voluntary Resignation\":\n                         \n\n\n\n\n\n                          Sort Each Category\n                         \n                         . When you select this option for a multi-series bar chart, series are sorted in ascending or descending order within each category. In the following example, the series in all categories are sorted from higher to lower value:\n                         \n\n\n\n\n\n                        Sorting by date\n                       \n\n                        When you apply a sort to a date column, the dates\n                        \n                         should\n                        \n                        sort in correct chronological order as long as they are formatted as dates (not strings) in your data source. If you find your dates are not sorting in chronological order, check your original data source to make sure the dates are being formatted as dates. For example, if you are using Excel, you would right-click in the date column, select\n                        \n                         Format Cells\n                        \n                        , and check to make sure a date format is being used.\n                       \n\n                        There are many ways dates can be displayed. Most often, they are represented as a date such as 'MM-DD-YYYY'. However, they can also be visualized as a string, such as 'January' if you are showing data by month. Because string sorting is alphanumeric, it is important to think about how you want any date type data sorted.\n                       \n\n                        Example\n                       \n\n                        You're currently showing total sales by month and you want the months sorted in the proper date order. Sorting months, ascending, by a column that actually contains the month name values, will output a chart where April is first.\n                       \n\n\n\n\n                        Because we want January first, we will instead change our sort to the date type column we are using in the card. The card continues to stay at a month grain but the logic used to sort the data is done by a date rather than alphanumerically.\n                       \n\n\n\n\n                        In the event that you only have month data and not a full date, you can force a sort order using Beast Mode.\n                       \n\n                        Multiple sorts\n                       \n\n                        You can add multiple sorts to a chart or map. This is useful when you have both category and series data and you want to specify a non-default sort method for both.\n                       \n\n                        In the following example, both the category and series data are sorted alphabetically in descending order. This effect is only possible using a second sort; otherwise the column you didn't specify would default to using ascending alphanumerical order.\n                       \n\n\n\n\n                        When doing a multiple sort, you should only sort on values present in the card (x-axis, y-axis, and series). If you are sorting based on the x- or y-axis and series, the series should come first.\n                       \n\n                        Sorting in pie charts\n                       \n\n                        In pie charts, slices are automatically arranged from highest to lowest value. By default you\n                        \n                         cannot\n                        \n                        use the\n                        \n                         Sorting\n                        \n                        box to change the order in which slices appear. However, if you check the\n                        \n                         Unsorted Data\n                        \n                        box in\n                        \n                         Chart Properties\n                        \n                        , you can use the\n                        \n                         Sorting\n                        \n                        box to change the sort order.\n                       \n\n\n                         To enable sorting in pie charts,\n                        \n\n\n\n\n                          Open the Analyzer for the pie chart you want to enable sorting in.\n                         \n\n\n\n                          In\n                          \n                           Chart Properties\n                          \n                          , mouse over\n                          \n                           General\n                          \n                          .\n                         \n\n\n\n                          Check\n                          \n                           Unsorted Data\n                          \n                          .\n                         \n\n\n\n                        You can now use the\n                        \n                         Sorting\n                        \n                        box to sort the chart slices the way you want them.\n                       \n\n                        For more information about pie charts, see\n                        \n                         Applying and Resetting Chart Properties\n                        \n                        .\n                       \n\n                        Sorting in funnel charts\n                       \n\n                        You can sort the sections in a standard funnel chart using the options in the\n                        \n                         Sorting\n                        \n                        box just as you can for other chart types. However, you\n                        \n                         cannot\n                        \n                        change the default sorting in funnel bars and folded funnel charts. For more information about these chart types, see\n                        \n                         Funnel chart\n                        \n                        .\n                       \n\n                        Applying a custom sort\n                       \n\n                        You can apply a custom sort to your data using Beast Mode. For more information, see\n                        \n                         Sample Beast Mode Calculations\n                        \n                        .\n                       \n\n\n                         Video - Applying a Custom Sort", "Preview Article": "Click here to preview", "URL Name": "360043428733", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004639", "Archived Date": "", "Language": "English", "Primary Version": "Sorting the Data in Your Chart", "Article Total View Count": "13,402", "": "", "Article Created Date": "10/24/2022, 10:18 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Sorting the Data in Your Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Analyzer\n              \n", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}