{"file_path": "../../raw_kb_v2\\article\\360043430413\\index.html", "content": {"Title": "Using the Data Warehouse to Manage Data", "Article Body": "Intro\n                       \n\n                        The Data Warehouse in Domo provides a three-dimensional visual representation of all DataSets in your Domo, broken down by connector, along with data currently flowing into and between them. DataSets for each connector type are represented as stacks on a rotating palette. You can configure the order and height of the connector stacks to indicate different metrics. For example, you could sort the connector stacks by number of rows but have the height of the individual stacks represent the number of DataSets.\n                       \n\n                        You open The Data Warehouse by selecting\n                        \n                         Data\n                        \n                        in the toolbar at the top of Domo. The\n                        \n                         Data Warehouse\n                        \n                        tab is open by default. If you switch to another tab, you can return to the\n                        \n                         Data Warehouse\n                        \n                        tab by clicking\n                        \n                        in the left-hand navigation pane.\n                       \n\n                        For more information about connecting to data in Domo, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n\n\n                          Video - Introducing The Data Warehouse\n                         \n\n\n\n\n\n\n\n\n\n                        Manipulating the palette\n                       \n\n                        Mousing over a stack causes the palette to stop rotating. You can click and drag the panel to move it manually. The panel can be moved in three dimensions. Dragging it left or right rotates it, but you can also drag it up or down. If you drag it all the way up, the view changes as if you were seeing it from the front. If you drag it all the way down, the view changes as if you were seeing it from above.\n                       \n\n                        When you mouse over a stack, an information panel appears for the connector. This panel contains the following information:\n                       \n\n\n\n                          Number of DataSets\n                         \n\n\n\n                          Total number of rows of data in DataSets for the connector\n                         \n\n\n\n                          Number of cards built using the connector\n                         \n\n\n\n                        Understanding the stack and line colors\n                       \n\n                        Stacks are colored differently depending on their type and current activity. Colors are as follows:\n                       \n\n\n\n                          Green indicates a standard, fully functional data source connector such as MySQL or Adobe Analytics. These stacks appear closer to the edge of the palette.\n                         \n\n\n\n                          Blue indicates a Magic ETL DataFlow connector, i.e. a connector built up of multiple data sources. These stacks appear closer to the center of the palette.\n                         \n\n\n\n                          Orange indicates a warning state for one or more DataSets or DataFlows for a given connector.\n                         \n\n\n\n                          Red indicates that one or more DataSets or DataFlows for a given connector is broken and needs immediate attention.\n                         \n\n\n\n                        Stacks may be accompanied by green or blue lines. These colors indicate the following:\n                       \n\n\n\n                          Green lines run from outside of the palette to data source connector stacks, indicating that data is currently being funneled to these connectors.\n                         \n\n\n\n                          Blue lines connect Magic stacks with the data source connector stacks used to power them. These lines appear only when you mouse over Magic stacks.\n                         \n\n\n\n                        Understanding stack sorting and height\n                       \n\n                        The arrangement of stacks around the palette and the height of the individual stacks indicate specified metrics. By default, stack arrangement indicates connector status and stack height indicates the number of rows of data found in all DataSets for the connector or all DataFlows. This is the case in the following example:\n                        \n\n\n\n\n\n                        Sorting on the palette begins to the right of the long gray line and continues counter-clockwise around the palette, ending to the left of the gray line. So, in this example, connector stacks are sorted from the right side to the left side of the line by the connector status of the DataSets/DataFlows, with the broken (red) stacks appearing first, the orange (warning) stacks next, and so on. The height of the individual stacks represents the number of rows in the DataSets/DataFlows. However, you can change the criteria determined by the sorting and height. Sort position for a connector stack can represent any of the following:\n                       \n\n\n\n                          Connector status (default)\n                         \n\n\n\n                          Connector name (alphabetically)\n                         \n\n\n\n                          Number of cards built using the connector\n                         \n\n\n\n                          The number of DataSets for this connector\n                         \n\n\n\n                          Number of rows of data\n                         \n\n\n\n                        Height of a connector stack can represent any of the following:\n                       \n\n\n\n                          The number of cards built using the connector\n                         \n\n\n\n                          Number of rows of data (default)\n                         \n\n\n\n                          The number of DataSets for this connector\n                         \n\n\n\n                          The number of issues for the connector\n                         \n\n\n\n                        You can change the sort and height configuration in the\n                        \n                         Sort by\n                        \n                        and\n                        \n                         Height by\n                        \n                        filter menus, respectively.\n                       \n\n                        Searching in the Data Warehouse\n                       \n\n                        You can search for a specific connector or DataSet using the Search bar. When you click in the bar, you can access scrollable lists of all data sources, Magic connectors, and DataSets. If you select an item in the Search view, information specific to that item appears on the screen.\n                       \n\n                        Understanding the Data Source view\n                       \n\n                        When you click a connector stack, the view changes to show three-dimensional rectangular representations for all of the data sources for the connector. As with the connector-level view, you can move the panel to change the view, change the options in the\n                        \n                         Sort by\n                        \n                        and\n                        \n                         Height by\n                        \n                        menus, and perform a search. A panel at the bottom of the screen shows the data sources, number of DataSets, and number of rows for the connector.\n                       \n\n                        If you click a rectangle for a DataSet, the Details view for the DataSet appears.\n                       \n\n                        Troubleshooting WebGL issues\n                       \n\n                        WebGL is a technology used for rendering interactive 3D and 2D graphics online. It is supported by all modern browsers: Google Chrome, Mozilla Firefox, Apple Safari, Microsoft Edge, etc. If you do not have WebGL enabled in your browser, an error message may appear when you try to open The Data Warehouse view.\n                       \n\n                        There are a number of things that can cause this error:\n                       \n\n                        1.     Your browser needs to be updated.\n                       \n\n                        2.     WebGL and hardware acceleration were disabled in your browser. If this is the case, try to enable it for your particular browser.\n                       \n\n                        3.     A browser plug-in has disabled your WebGL.\n                       \n\n                        4.     Your computer’s hardware does not support WebGL.\n                       \n\n                        5.     Your computer is in a low-power mode or battery mode and WebGL has been disabled.\n                       \n\n                        6.     You are running inside a VM, and hardware acceleration has been disabled.\n                       \n\n                        Click the following link to view a list of browsers that support WebGL. If you don’t see your browser listed, please update your browser to one on this list.\n                       \n\n\n                         https://caniuse.com/#feat=webgl\n                        \n\n\n                        If you still can't get WebGL to work, check to see if your hardware is WebGL compatible.\n                       \n\n                        WebGL uses the graphics card in your computer so it will not interfere with your main CPU to slow down your computer. If your computer does not have a capable graphics card, you will not be able to view anything in WebGL. In this case, you will need to upgrade your graphics card.", "Preview Article": "Click here to preview", "URL Name": "360043430413", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004908", "Archived Date": "", "Language": "English", "Primary Version": "Using the Data Warehouse to Manage Data", "Article Total View Count": "5,155", "": "", "Article Created Date": "10/24/2022, 10:35 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Using the Data Warehouse to Manage Data\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Data Center Overview\n              \n", "url": "/s/topic/0TO5w000000ZanRGAS"}]}