{"file_path": "../../raw_kb_v2\\article\\360042934634\\index.html", "content": {"Title": "PDP and Alerts", "Article Body": "An alert's PDP (Personalized Data Permissions) policies filter the alert data and control which users can subscribe. You can set alerts for policies you are a member of. Only those who are also members of those policies can view and subscribe to those alerts.\n                       \n\n                        You configure PDP for alerts in Step 1 of the\n                        \n                         Alert Wizard\n                        \n                        for the desired card. PDP options appear for a card only when one or more PDP policies have been applied to a DataSet for that card. You can choose from the following options for configuring PDP for a card alert:\n                       \n\n\n\n\n                           Contextual\n                          \n                          . Anyone permitted to view the DataSet(s) powering the card will be able to view this alert. This option works best with percentage and statistical alerts. This is the default setting.\n                         \n\n\n\n\n                           All Rows\n                          \n                          . The alert is applied to all rows of the DataSet (i.e. no filtering occurs).\n                         \n\n\n\n\n                           Select Policies\n                          \n                          . You choose the specific policy or policies to which the alert is applied.\n                         \n\n\n\n                        As an example, suppose user \"Bob\" owns a DataSet called \"Marketo Opportunities.\" Bob's marketing team is broken up by industry, and he is assigned to both Advertising as well as Business Services. Bob wants to set up an alert to notify him when opportunities drop by more than 10%.\n                       \n\n                        When Bob goes to create an alert on this card, as the DataSet owner he is given the option to apply the alert to the \"Advertising,\" to \"Business Services,\" or to all of the data in the DataSet (unfiltered). He can also leave the default\n                        \n                         Contextual\n                        \n                        option selected, in which case the alert conditions are evaluated against both the Advertising and Business Services policies.\n                       \n\n                        The following screenshot shows the default view of the alert options dialog with\n                        \n                         Contextual\n                        \n                        selected:\n                        \n\n\n\n\n                        Bob then chooses to apply the \"Advertising\" PDP policy to the alert. He does this by clicking\n                        \n                         Modify >\n                        \n\n                         Select Policies\n                        \n                        , then selecting \"Advertising\" as the policy.\n                        \n\n\n\n\n\n                        From here, Bob continues creating his alert as explained in\n                        \n                         Creating an Alert for a Visualization Card\n                        \n                        . Because the \"Advertising\" PDP policy was chosen and not the \"Business Services\" policy, only users in that group can see the alert, subscribe to it, and receive notifications for it. However, Bob could then create a second alert for this card that applied only to the \"Business Services\" policy.\n                       \n\n                        Members of PDP policies can also create alerts on cards powered by PDP-affected DataSets. Because the data in the card is already filtered due to PDP policies in place, these users can create alerts\n                        \n                         only\n                        \n                        around the data available to them through their policies. Only users with the creator's same PDP policies are able to see the alert, subscribe to it, and receive notifications for it.\n                       \n\n                        For example, suppose that user \"Tessa\" is a policy member for both the \"Advertising\" and \"Business Services\" regions. When she goes to create an alert, she does\n                        \n                         not\n                        \n                        have the option to set an\n                        \n                         All Rows\n                        \n                        rule because her policies do not allow this. However, she can choose whether to build the alert around Advertising data, Business Services data, or both.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Social users cannot be added to an Alert created from a DataSet that has PDP enabled on it.\n                          \n\n\n\n\n\n\n                          Video - Setting Alerts in Personalized Data Permissions(PDP)\n                         \n\n\n\n\n\n\n\n\n                         To modify PDP settings for an alert,\n                        \n\n\n\n\n                          Open the alert create/edit dialog by doing one of the following:\n                         \n\n\n\n                            In the Alerts Management page (which you access by clicking\n                            \n                             Alerts\n                            \n                            in the toolbar at the top of the screen), locate the alert, click the top portion with alert information, and click\n                            \n                             Edit\n                            \n                            .\n                           \n\n\n\n                            Click the card to open the Details view and click the\n                            \n                            icon. Then...\n                           \n\n\n\n                              If creating a new alert, click\n                              \n                               New Alert\n                              \n                              .\n                             \n\n\n\n                              If modifying an existing alert, click the alert to open its info dialog, then click\n                              \n                               Edit\n                              \n                              .\n                             \n\n\n\n\n\n\n\n                          Click\n                          \n                           Modify\n                          \n                          .\n                         \n\n\n\n                          Choose one of the following:\n                         \n\n\n\n                            If you want this alert to apply to all users with access to the DataSet, click\n                            \n                             Contextual\n                            \n                            .\n                           \n\n\n\n                            If you want this alert to revolve around all data in the DataSet and not be limited by PDP policies, select\n                            \n                             All Rows\n                            \n                            , then click\n                            \n                             Apply\n                            \n                            . (This option is not available for users limited by PDP policies.)\n                           \n\n\n\n                            If you want to apply specific policies to the alert, click\n                            \n                             Select Policies\n                            \n                            then select all policies you want to be applied to this alert.\n                           \n\n\n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          .\n                         \n\n\n\n                          Continue creating or modifying your alert as desired. For help, see\n                          \n                           Creating an Alert for a Visualization Card\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360042934634", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004910", "Archived Date": "", "Language": "English", "Primary Version": "PDP and Alerts", "Article Total View Count": "5,534", "": "", "Article Created Date": "10/24/2022, 10:35 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              PDP and Alerts\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Personalized Data Permissions (PDP)\n              \n", "url": "/s/topic/0TO5w000000Zao2GAC"}]}