{"file_path": "../../raw_kb_v2\\article\\360042934294\\index.html", "content": {"Title": "Creating and Managing User Groups", "Article Body": "Intro\n                       \n\n                        In the Admin Settings, you can create and manage groups of Domo users. Groups are useful because you can grant access to specified content to all members of a group. For example, you might create a \"Marketing\" group whose members have access to marketing-related cards. Or, you could create a \"Financial\" group with access to cards from various departments. You can also create dynamic groups in which members are determined automatically based on whether they meet specified criteria. For example, you could create a dynamic group that includes all members of the \"Marketing\" department with the title of \"Manager.\" If one of your marketing managers later left the company and was replaced by a new manager, this person would be added to the group automatically.\n                       \n\n                        In\n                        \n                         More >\n                        \n\n                         Admin > Governance > Groups\n                        \n                        , you can do all of the following:\n                       \n\n\n\n                          Create and delete groups\n                         \n\n\n\n                          Add and remove members of groups\n                         \n\n\n\n                          Change the name of a group\n                         \n\n\n\n                          Send a Buzz message to all members of a group\n                         \n\n\n\n                          Share a Card or Page with all members of a group\n                         \n\n\n\n                          Assign owners to a group\n                         \n\n\n\n                          Change a group type\n                         \n\n\n\n                          Change other group settings\n                         \n\n\n\n                          Change the avatar for the group\n                         \n\n\n\n                        Most of these actions are only available if you are a group owner. For more information about default roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            When you enable SSO, two different type of groups are created—Ad Hoc groups and Directory groups. Ad Hoc groups are created within your Domo instance, while Directory groups are created within your IDP. Directory groups must be managed from within your SSO provider's website.\n                           \n\n\n\n\n\n\n                         Video - Creating and Managing User Groups\n                        \n\n\n\n\n\n\n\n\n                        Parts of the Groups interface\n                       \n\n                        The following screenshot points out the most important parts of the\n                        \n                         Groups\n                        \n                        page in\n                        \n                         Admin Settings:\n                        \n\n\n\n\n\n                        You can use the following table to find out more about these components:\n                       \n\n\n\n\n                           Component\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Dashboard\n                          \n\n\n                            Shows the number of groups of a certain type in your Domo instance, and allow lets you filter the groups listing to only show groups of that type. The following filters are available:\n                           \n\n\n\n\n                               Groups created\n                              \n                              . Shows all groups sorted by creation date in ascending order (newest to oldest).\n                             \n\n\n\n\n                               Dynamic groups\n                              \n                              . Shows all groups with dynamic rules for determining members (for example, such a group may include all members of the \"Corporate Sales\" department; if a new hire is added to this department, they are automatically added to the group).\n                             \n\n\n\n\n                               Closed groups\n                              \n                              . Shows all groups with \"Closed\" status, meaning only the group owners are allowed to invite new members.\n                             \n\n\n\n\n                               Directory groups\n                              \n                              . Shows all \"Directory\" groups, i.e. those that have been generated through an\n                              \n                               SSO provider\n                              \n                              .\n                             \n\n\n\n\n                               System groups\n                              \n                              . Shows all groups generated within the Domo instance, usually associated with a\n                              \n                               custom security role\n                              \n                              .\n                             \n\n\n\n\n                               Empty groups\n                              \n                              . Shows all groups with no members.\n                             \n\n\n\n\n\n\n                           Refresh icon\n                          \n\n                           Refreshes the groups listing.\n                          \n\n\n\n                           Settings icon\n                          \n\n\n                            Opens the\n                            \n                             Group settings\n                            \n                            subtab, in which you can toggle the following options:\n                           \n\n\n\n\n                               Add the admin group [selected group] as an owner automatically during all groups creations\n                              \n                              . When checked, any user in the group selected in\n                              \n                               Admin group\n                              \n                              is added as an owner to all new groups. This is set to the \"Manage all groups\" grant by default. For more information about grants, see\n                              \n                               Managing Custom Roles\n                              \n                              .\n                             \n\n\n\n\n                               [Selected group] can be removed as owner during group creation or after by any owner\n                              \n                              . When checked, any user added as a group owner through the selected group may be removed as an owner by any other owner.\n                             \n\n\n\n\n                               Hide system groups in the group management pages\n                              \n                              . When checked, system groups are not shown in the groups listing in\n                              \n                               Admin Settings > Groups\n                              \n                              .\n                             \n\n\n\n\n\n\n                           New group icon\n                          \n\n                           Lets you add a closed, open, or dynamic group to your Domo instance using the group creation wizard.\n                          \n\n\n\n                           Your group filters\n                          \n\n                           Lets you filter the group listing to show all groups in your instance, those of which you are an owner, or those of which you are a member.\n                          \n\n\n\n                           Group listing\n                          \n\n\n                            Shows all groups in your instance that pass the filters you have applied (if any). For any group, you can see the group name, owners, group type (open, ad hoc, directory, closed, dynamic, or system), the people in the group, and the amount of time since the group was last modified. For all columns, you can apply sorts and filters by clicking the\n                            \n                            or\n                            \n                            icon in the column header.\n                           \n\n\n\n                              For the \"Group\" column, you can click\n                              \n                              to sort the group names alphabetically or reverse-alphabetically.\n                             \n\n\n\n                              For the \"Owners\" column, you can click\n                              \n                              to select a specific owner to filter on.\n                             \n\n\n\n                              For the \"Group Type\" column, you can click\n                              \n                              to choose a different group type to filter on.\n                             \n\n\n\n\n                                 Open\n                                \n                                groups are those in which any member can invite another person to the group.\n                               \n\n\n\n\n                                 Closed\n                                \n                                groups are those in which only owners can invite other members.\n                               \n\n\n\n\n                                 Dynamic\n                                \n                                groups are those that use dynamic rules to determine members.\n                               \n\n\n\n\n                                 Ad hoc\n                                \n                                groups are \"legacy groups\" created within Domo (not through a third-party SSO system) before open, closed, and dynamic groups were released.\n                               \n\n\n\n\n                                 Directory\n                                \n                                groups are those that have been generated through a third-party SSO system.\n                               \n\n\n\n\n                                 System\n                                \n                                groups are groups generated automatically within the Domo instance, usually associated with a\n                                \n                                 custom security role\n                                \n                                .\n                               \n\n\n\n\n\n                              For the \"People\" column, you can choose people from a list to filter to see just their groups.\n                             \n\n\n\n                              For the \"Modified\" column, you can set up a date filter to see groups modified on a given date, between two specified dates, or before or after a certain date.\n                             \n\n\n\n                            When you check the box for one or more groups, a number of additional icons appear in the top right corner of the\n                            \n                             Groups\n                            \n                            page. These allow you to perform bulk actions on the groups. The following options are available:\n                           \n\n\n\n\n                              . Lets you add users from your Domo instance to this group as new members. (Owners only.)\n                             \n\n\n\n\n                              . Lets you send a\n                              \n                               Buzz message\n                              \n                              to all members of this group.\n                             \n\n\n\n\n                              . Lets you share a selected Page or Card with all members of this group.\n                             \n\n\n\n\n                              . Lets you choose to either change the group types for or add owners to multiple groups. (Owners only.)\n                             \n\n\n\n\n                              . Lets you delete all of the selected groups. (Owners only.)\n                             \n\n\n\n                            If you click within the cell for a group name, a details view for the group appears. Here you can do all of the following:\n                           \n\n\n\n                              View a listing of the members of the group.\n                             \n\n\n\n                              Change the name of the group.\n                             \n\n\n\n                              Add a description, or edit it if one already exists.\n                             \n\n\n\n                              Change the group type (open, closed, and dynamic groups only).\n                             \n\n\n\n                              View the SSO settings for a directory group.\n                             \n\n\n\n                              Set or change the owners.\n                             \n\n\n\n                              Add members to the group.\n                             \n\n\n\n                              Send a\n                              \n                               Buzz message\n                              \n                              to all members of this group.\n                             \n\n\n\n                              Share a selected Page or Card with all members of this group.\n                             \n\n\n\n                              Delete members from the group.\n                             \n\n\n\n\n\n\n                           Show only groups I can manage checkbox\n                          \n\n\n                            When toggled, filters the group listing to show only those groups you have rights to manage.\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               Some functions are only available when this checkbox is checked. For example, when disabled, you see these options in the blue bar:\n                               \n\n\n\n\n                               When enabled you’ll see these options:\n                               \n\n\n\n\n\n\n\n\n\n\n                           Search field\n                          \n\n                           Lets you search the group listing to show only specific groups.\n                          \n\n\n\n\n                        Understanding group ownership\n                       \n\n                        Open, closed, and dynamic groups can have one or more owners, who have the responsibility of managing groups. Most group management actions are available only to owners. These actions include the following:\n                       \n\n\n\n                          Assigning other owners to the group or removing owners.\n                         \n\n\n\n                          Adding and removing members to/from the group.\n                         \n\n\n\n                          Deleting the group from Domo.\n                         \n\n\n\n                          Changing the group type.\n                         \n\n\n\n                          Changing the settings for the group.\n                         \n\n\n\n                          Changing the avatar for the group.\n                         \n\n\n\n                          Changing membership criteria for a dynamic group.\n                         \n\n\n\n                        Owners can be individual Domo users or other groups; in the latter case, all members of the group are considered owners.\n                       \n\n                        Understanding group types\n                       \n\n                        There are a number of different group types available in Domo.\n                       \n\n                        Closed groups\n                       \n\n                        Closed groups are considered \"full accountability groups\" in Domo and are designed to function as \"anchor groups\" for departments. Only group owners may invite new members to a closed group. Owners must be named individuals or groups, and members must be named individuals. Any changes made to closed groups are reflected in the\n                        \n                         Activity Logs\n                        \n                        .\n                       \n\n                        Closed groups may be assigned as owners of other groups and Domo assets (Cards and Pages).\n                       \n\n\n                         Closed groups cannot be changed to any other group type, once a group is created as a closed group, it cannot be changed.\n                        \n\n\n                        Open groups\n                       \n\n                        Open groups are \"social groups\" within Domo. In these groups, the group owns itself. This means that every member is an owner and may invite other users to join. These groups are ideal for generating Buzz conversations and broadly sharing content, or organizing contact groups. Open groups cannot own other groups.\n                       \n\n                        Dynamic groups\n                       \n\n                        Dynamic groups provide scalable, flexible administration based on policy-based membership. You create membership policies that reference trusted attributes; thereafter, Domo does the work of maintaining the membership. For example, you could create a dynamic group with a rule stating that all members must belong to the \"Marketing\" department. From then on, if anyone joins that department, or if anyone in said department leaves the company, the group membership is adjusted automatically.\n                       \n\n                        Dynamic groups may contain individuals or groups (\n                        \n                         not\n                        \n                        other dynamic groups) as owners.\n                       \n\n                        For attributes to be available for use in dynamic groups, you must first lock them in\n                        \n                         More >\n                        \n\n                         Admin > Governance > Trusted attributes.\n                        \n                        This can be done only by users with \"Admin\" security privileges. Locked attributes can only be unlocked by Admin users and only when they are not being used in any dynamic groups or PDP policies. For example, if user Fred creates a dynamic group that filters on the \"Department\" attribute, and Admin user Barney then goes into Admin Settings to unlock that attribute, he would not be able to do so. Fred or Barney would first need to remove the policy from the group.\n                       \n\n                        In continuation, we describe how to enable/lock attributes in the Admin Settings. For information about adding dynamic PDP policies on a DataSet, see\n                        \n                         Creating PDP Policies\n                        \n                        .\n                       \n\n\n                         To enable user attributes for dynamic groups,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Admin > Governance > Trusted attributes\n                          \n                          .\n                          \n                          You must have an \"Admin\" security profile or a role with the \"Edit all users\" grant to access this screen. For more information about security profiles, see\n                          \n                           Security Role Reference\n                          \n                          .\n                         \n\n\n\n                          Check the boxes for all attributes you want to enable for use in dynamic groups.\n                          \n                          Grayed out boxes indicate attributes already being used in dynamic groups or PDP policies.\n                         \n\n\n\n                          Click\n                          \n                           Save Changes\n                          \n                          when done.\n                         \n\n\n\n\n                         To disable user attributes for dynamic groups,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Admin > Governance > Trusted attributes\n                          \n                          .\n                          \n                          You must have an \"Admin\" security profile or a role with the \"Edit all users\" grant to access this screen. For more information about security profiles, see\n                          \n                           Security Role Reference\n                          \n                          .\n                         \n\n\n\n                          Clear the boxes for all attributes you want to disable for use in dynamic groups.\n                          \n                          Grayed out boxes indicate attributes already being used in dynamic groups or PDP. You\n                          \n                           cannot\n                          \n                          disable these attributes until they have been disabled in the groups or PDP policies.\n                         \n\n\n\n                          Click\n                          \n                           Save Changes\n                          \n                          when done.\n                         \n\n\n\n                        Directory groups\n                       \n\n                        Directory groups are \"imported\" into Domo through SSO. These groups cannot have owners and their membership cannot be managed from within Domo, though you can delete them if you have the \"Manage all groups\" grant. These groups can own other groups.\n                       \n\n                        Ad hoc groups\n                       \n\n                        Ad hoc groups are \"legacy groups\" created within Domo (not through a third-party SSO system) before open, closed, and dynamic groups were released. As with directory groups, they cannot have owners. They can be managed by users with the \"Manage all groups\" or \"Edit users\" grant. Ad hoc groups cannot own other groups.\n                       \n\n                        System groups\n                       \n\n                        These are groups owned and maintained by Domo. These include role groups and grants. They cannot be managed or deleted and do not have owners, though they can own other groups. You are able to hide system groups by clicking the gear icon in the top right-hand corner of the Groups page and check the box that states:\n                        \n                         Hide system groups\n                        \n                        .\n                       \n\n                        Creating a group\n                       \n\n                        You can create a new open, closed, or dynamic group in the\n                        \n                         Groups\n                        \n                        sub-tab in the Admin Settings by clicking\n                        \n                         New Group\n                        \n                        and following the steps in the wizard. As part of this process, you will do the following:\n                       \n\n\n\n                          Name the group and give it a description (optional).\n                         \n\n\n\n                          Select the group type (open, closed, or dynamic).\n                         \n\n\n\n                          Select members of the group, OR, if it is dynamic, configuring the rules for membership.\n                         \n\n\n\n                          Choose an avatar to represent the group throughout your Domo instance.\n                         \n\n\n\n                          Specify owners of the group.\n                         \n\n\n\n                          Review your settings and save.\n                         \n\n\n\n                        Group creation applies to open, closed, and dynamic groups only. You cannot create any of the following group types within Domo:\n                       \n\n\n\n                          Directory (these are created through SSO)\n                         \n\n\n\n                          System\n                         \n\n\n\n                          Ad hoc\n                         \n\n\n\n\n                         To create a group,\n                        \n\n\n\n                         In\n                         \n                          More >\n                         \n\n                          Admin > Governance > Groups\n                         \n                         , click\n                         \n                          New Group\n                         \n                         in the top right corner of the tab.\n                         \n\n\n\n\n\n\n                          Enter a name for the group.\n                         \n\n\n\n                          (Optional) Enter a description for the group so you and other users can more easily identify it later, then click\n                          \n                           Next\n                          \n                          .\n                          \n\n\n\n\n\n                         Select the desired group type.\n                         \n\n                         Group types are as follows:\n                         \n\n\n                            With an\n                            \n                             Open\n                            \n                            group, you select all group members, and any member of the group can invite anyone to join the group.\n                           \n\n\n\n                            With a\n                            \n                             Closed\n                            \n                            group, you select all group members, but only group owners can invite new users to join the group.\n                           \n\n\n\n                            With\n                            \n                             Dynamic\n                            \n                            groups, you do\n                            \n                             not\n                            \n                            select specific members of the group; rather, membership is based on adherence to dynamic rules. For example, you might have dynamic groups for all of your sales regions. If a new sales rep is hired within the \"West\" region, that person would automatically be added to the \"West\" group in your Domo instance because it matches the sales region he was hired into.\n                           \n\n\n\n\n\n                          (Conditional) Do one of the following:\n                         \n\n\n\n                            If you chose\n                            \n                             Open\n                            \n                            or\n                            \n                             Closed\n                            \n                            in the previous step, select all desired members of the group from the list of users. You can search for users by name or filter using the filter options available in each column. Once you are done, click\n                            \n                             Next\n                            \n                            .\n                           \n\n\n\n                            If you chose\n                            \n                             Dynamic\n                            \n                            in the previous step, do the following:\n                           \n\n\n\n                              In the first dropdown menu, select\n                              \n                               Any\n                              \n                              if group membership is only dependent on a single rule being met (an OR statement), or select\n                              \n                               All\n                              \n                              if all of the selected rules must be met (an AND statement). For example, you may have a case where group members may be members of the \"Sales\" department OR have a title of \"Account Development Manager\"; if either condition is met, they are included in the group. Alternatively, you may have a group where members must be in the \"Sales\" department AND have a title of \"Account Development Manager\"; if both conditions are not met, the user is not included in the group.\n                             \n\n\n\n                              In the\n                              \n                               Add criteria\n                              \n                              field, select a trusted attribute to filter on. For more information about setting trusted attributes, see\n                              \n                               Creating and Deleting PDP Policies\n                              \n                              .\n                             \n\n\n\n                              Select all values within the attribute that meet the conditions of group membership.\n                              \n\n                              For example, if you selected \"Department\" as the attribute in step 5ii, here you would choose all departments whose members should have membership in this group.\n                              \n\n\n\n\n\n\n                              (Optional) Add additional OR statements to the membership criteria by clicking the\n                              \n                               + OR\n                              \n                              button under the criteria box and repeating steps 5i through 5iii above.\n                             \n\n\n\n                              (Optional) View the members who pass the filters by clicking\n                              \n                               Preview Membership\n                              \n                              .\n                             \n\n\n\n                              Click\n                              \n                               Next\n                              \n                              when done.\n                             \n\n\n\n\n\n\n\n                          Choose an avatar by doing one of the following options, then click\n                          \n                           Next\n                          \n                          when done.\n                         \n\n\n\n                            Edit the standard text avatar (a bubble with two or three initial letters) by clicking\n                            \n                             Edit Text Avatar\n                            \n                            then choosing a background color and text color and entering the desired text (limit three characters).\n                           \n\n\n\n                            Upload an image from your computer by clicking\n                            \n                             Upload Photo\n                            \n                            , selecting your image file (the image does not need to be a photo, only a standard image file such as a JPEG or PNG), then rotating and cropping as desired.\n                           \n\n\n\n                            Taking a picture of yourself using your webcam.\n                           \n\n\n\n\n\n                          Specify all owners of the group, then click\n                          \n                           Next\n                          \n                          .\n                          \n\n                          By default, you as the group creator are assigned as an owner. You cannot change this here, though you can remove yourself as an owner later, as discussed in\n                          \n                           Assigning owners to a group\n                          \n                          . Members of the default group selected in the Group Settings screen are also automatically assigned as owners (unless you unchecked the box reading\n                          \n                           Add the admin group [Selected group] as an owner automatically during all groups creations\n                          \n                          in the Group Settings screen (accessible by clicking the gear icon in\n                          \n                           Admin Settings > Groups\n                          \n                          )).\n                         \n\n\n\n                          Review your settings in the final screen, then click\n                          \n                           Save\n                          \n                          when ready.\n                         \n\n\n\n                        Sharing content with a group or group members\n                       \n\n                        Once you have created a group, a good next step is sharing Pages and Cards that pertain to the group members' roles and responsibilities. You do\n                        \n                         not\n                        \n                        need to be a group owner to share content with members.\n                       \n\n\n                         To share content with a group,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            In the groups listing in\n                            \n                             More >\n                            \n\n                             Admin > Governance > Groups\n                            \n                            , check the box(es) for the group(s) you want to share content with, then click\n                            \n                            in the upper right corner of the window. (Use this option if you want to BULK-SHARE the same content with multiple groups.)\n                           \n\n\n\n                            Open the details view for the group by clicking on the group name, check the names of all users you want to share the content with, then click\n                            \n                            in the upper right corner of the window. (Use this option if you want to share content with INDIVIDUAL MEMBERS of a group.)\n                           \n\n\n\n\n\n                          Choose the Cards and Pages you want to share with the group, groups, or individual users.\n                          \n                          You can search by keyword in the\n                          \n                           Search Cards and Pages\n                          \n                          field or filter to show just Cards or Pages by choosing\n                          \n                           Cards\n                          \n                          or\n                          \n                           Pages\n                          \n                          in the\n                          \n                           Add Filter\n                          \n                          field.\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Share\n                          \n                          to confirm.\n                         \n\n\n\n                        Adding members to a group\n                       \n\n                        In the Admin Settings, you can add members to an open or closed group, meaning that those users have access to all Pages and Cards assigned to that group. You can do this in the following ways:\n                       \n\n\n\n                          You can add users to the group (in the\n                          \n                           Groups\n                          \n                          sub-tab of the Admin Settings), or\n                         \n\n\n\n                          You can assign existing groups to the list of groups of which a user is a member (in the\n                          \n                           People\n                          \n                          sub-tab of the Admin Settings).\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You cannot add members to a dynamic group in this way, since membership in these groups is determined based on preconfigured rules.\n                          \n\n\n\n\n                        To add users to a closed group, you must be an owner of that group.\n                       \n\n                        Users added to a group gain access to all past Buzz conversations for that group. For more information, see\n                        \n                         Chatting in Buzz\n                        \n                        .\n                       \n\n\n                         To add users to an open or closed group,\n                        \n\n\n\n\n                          In\n                          \n                           More >\n                          \n\n                           Admin > Governance > Groups\n                          \n                          , locate the group you want to add members to.\n                         \n\n\n\n                          Click on the group name to open the details view for the group.\n                         \n\n\n\n                          Click the\n                          \n                           Add People\n                          \n                          button in the upper right corner.\n                          \n                          If the group is a closed group and you are not the owner, this button does not appear.\n                         \n\n\n\n                          Check the boxes next to the names of all the users you want to add.\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        The added users are now added to the group and have access to the content assigned to the group.\n                       \n\n\n                         To assign a group membership to a specific user,\n                        \n\n\n\n\n                          In the user list in\n                          \n                           More >\n                          \n\n                           Admin > Governance >\n                          \n\n                           People\n                          \n                          , select the user for whom you want to assign a group membership.\n                         \n\n\n\n                          The information panel for the user appears.\n                         \n\n\n\n                          Click\n                          \n                           Add Group\n                          \n                          .\n                          \n\n\n\n\n                          A field appears in which you can search for existing groups in Domo.\n                         \n\n\n\n                          Enter the name of a group into the field.\n                          \n                          The top results of your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n                          \n\n\n\n\n\n\n                          Select a group from the list.\n                          \n                          The name of the group appears in the field.\n                         \n\n\n\n                          (Optional) Add additional group memberships to this user by repeating the previous two steps.\n                         \n\n\n\n                          (Optional) Remove a group name from the field by clicking the \"x\" to the right of the name.\n                         \n\n\n\n                          Click\n                          \n                           Add\n                          \n                          to add all groups appearing in the field into the user's group membership listing.\n                         \n\n\n\n                        The user now belongs to the added groups and has access to the content assigned to the groups.\n                       \n\n                        Removing users from a group\n                       \n\n                        When you remove users from an open or closed user group, they can no longer access content for that group (unless they are members of another group with access OR they have been granted access to the same content in the\n                        \n                         People\n                        \n                        sub-tab). You can remove a user from a group by doing either of the following:\n                       \n\n\n\n                          Removing the user from the group (in the\n                          \n                           Group\n                          \n                          sub-tab of the Admin Settings)\n                         \n\n\n\n                          Removing the group from the user's group membership listing (in the\n                          \n                           People\n                          \n                          sub-tab of the Admin Settings)\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You cannot add members to a dynamic group in this way, since membership in these groups is determined based on preconfigured rules.\n                          \n\n\n\n\n                        To remove users from a group, you must be an owner of the group.\n                       \n\n                        Users removed from a group lose access to all past Buzz conversations for that group. For more information, see\n                        \n                         Chatting in Buzz\n                        \n                        .\n                       \n\n\n                         To remove a user from a group,\n                        \n\n\n\n\n                          In\n                          \n                           More >\n                          \n\n                           Admin > Governance > Groups\n                          \n                          , locate the group you want to remove members from.\n                         \n\n\n\n                          Click on the group name to open the details view for the group.\n                         \n\n\n\n                          Check the boxes for all users you want to remove from the group.\n                         \n\n\n\n                          Select\n                          \n                           Remove from group\n                          \n                          in the gear menu in the upper right corner of the window. (If you are not an owner and/or the group is not an open or closed group, the gear icon does not appear.)\n                         \n\n\n\n\n                         To remove a group from a user's group membership listing,\n                        \n\n\n\n\n                          In the user list in\n                          \n                           More >\n                          \n\n                           Admin > Governance >\n                          \n\n                           People\n                          \n                          , select the user from whom you want to remove a group membership.\n                         \n\n\n\n                          The information for the user appears in the rightmost panel.\n                         \n\n\n\n                          Click\n                          \n                           Remove\n                          \n                          for the group you want to remove in the\n                          \n                           Group Memberships\n                          \n                          list.\n                          \n                          A confirmation dialog appears.\n                         \n\n\n\n                          Click\n                          \n                           Remove\n                          \n                          to confirm.\n                         \n\n\n\n                        Removing groups from Domo\n                       \n\n                        You can remove user groups from Domo in the Admin Settings. You must be an owner of a group to remove it. If you remove a group, all members of that group who had access to Cards and Pages assigned to the group lose their access to those Cards and Pages.\n                       \n\n\n                         To remove a group from Domo,\n                        \n\n\n\n\n                          In\n                          \n                           More > Admin > Governance > Groups\n                          \n                          , check the boxes for all groups you want to remove.\n                         \n\n\n\n                          Click the trash can icon that appears in the top right corner of the window.\n                         \n\n\n\n                          Click\n                          \n                           Delete\n                          \n                          to confirm the decision.\n                         \n\n\n\n                        The group is removed, and any users who were in this group are no longer able to access content that was accessible by the group's members (unless they are members of another group with access to the same content OR they have been granted access to the same content in the\n                        \n                         People\n                        \n                        sub-tab).\n                       \n\n                        Changing the name and description for a group\n                       \n\n                        You can change the name and description of a user group in the Admin Settings. You do\n                        \n                         not\n                        \n                        need to be an owner in the group to make these changes.\n                       \n\n\n                         To change the name of a group,\n                        \n\n\n\n\n                          In\n                          \n                           More > Admin > Governance > Groups\n                          \n                          , click on the group name to open the details view for the group.\n                         \n\n\n\n                          Mouse over the name or description of the group, click the pencil icon, then enter the new desired group name or description.\n                         \n\n\n\n                        Assigning owners to a group\n                       \n\n                        As a group owner, you can take many actions that are not available to regular group members. For a list of these actions, see\n                        \n                         Understanding group ownership\n                        \n                        .\n                       \n\n                        You are assigned automatically as a group owner when you create the group. In the details view for the group, you can change the present owners (including yourself, if desired).\n                       \n\n                        Group ownership is available only for open, closed, and dynamic groups.\n                       \n\n\n                         To change the ownership for a group,\n                        \n\n\n\n\n                          In\n                          \n                           More > Admin > Governance > Groups\n                          \n                          , click on the group name to open the details view for the group.\n                         \n\n\n\n                          Mouse over the \"Owners\" area then click the\n                          \n                           Edit\n                          \n                          link that appears.\n                          \n\n\n\n\n\n\n\n                          Add or remove owners as necessary in the\n                          \n                           Set owners\n                          \n                          field.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        Changing a group type\n                       \n\n                        As the owner of an open, dynamic, or ad hoc group, you can change the group type to be open, dynamic, or closed. Once a group is closed, you cannot change the group type. You cannot change the group type for directory or system groups (though directory groups may be nested within dynamic groups).\n                       \n\n\n                         To change the group type for a group,\n                        \n\n\n\n\n                          In\n                          \n                           More > Admin > Governance > Groups\n                          \n                          , click on the group name to open the details view for the group.\n                         \n\n\n\n                          Mouse over the \"Group Type\" area then click the\n                          \n                           Edit\n                          \n                          link that appears.\n                          \n\n\n\n\n\n\n                          Click the\n                          \n                          button then select the desired group type.\n                          \n\n\n\n\n                          Keep in mind all of the following when making your selection:\n                         \n\n\n\n                            Changing a DYNAMIC group to an OPEN or CLOSED group will stop dynamic addition of users to the group. In the case of an OPEN group, any member of the group will be able to manage its content and membership.\n                           \n\n\n\n                            Changing a DYNAMIC or OPEN group to a CLOSED group is irreversible. Once a group is closed, it remains closed.\n                           \n\n\n\n                            Changing an OPEN group to a DYNAMIC group will require that you set membership criteria for the group, as explained in steps 5i-5vi in\n                            \n                             Creating a group\n                            \n                            , above.\n                           \n\n\n\n                            You can change an AD HOC group to be DYNAMIC, OPEN, or CLOSED, but you cannot change it back to AD HOC afterwards.\n                           \n\n\n\n\n                         Once you have made your changes, click\n                         \n                          Save\n                         \n                         .\n                        \n\n\n                        Changing the membership criteria for a dynamic group\n                       \n\n                        Sometimes it may be necessary to update the membership criteria for a dynamic group after that group has already been created. Fortunately you can do this easily without having to go through the group creation wizard again. You must be an owner of the group to be able to do this.\n                       \n\n\n                         To change the membership criteria for a dynamic group,\n                        \n\n\n\n\n                          In\n                          \n                           More > Admin > Governance > Groups\n                          \n                          , click on the group name to open the details view for the group.\n                         \n\n\n\n                          Mouse over the \"Membership Criteria\" area then click the\n                          \n                           Edit\n                          \n                          link that appears.\n                          \n\n\n\n\n\n\n                          Make your changes, as explained in steps 5i-5vi in\n                          \n                           Creating a group\n                          \n                          , above.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          when done.\n                         \n\n\n\n                        Changing your group avatar\n                       \n\n                        You can change the avatar for your group in the details view for the group, without having to go through the group creation wizard again. You must be an owner of the group to be able to do this.\n                       \n\n\n                         To change your group avatar,\n                        \n\n\n\n\n                          In\n                          \n                           More > Admin > Governance > Groups\n                          \n                          , click on the group name to open the details view for the group.\n                         \n\n\n\n                          Mouse over the avatar then click the\n                          \n                           Edit\n                          \n                          link that appears.\n                         \n\n\n\n                          Make your changes, as explained in step 6 of\n                          \n                           Creating a group\n                          \n                          , above.", "Preview Article": "Click here to preview", "URL Name": "360042934294", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004065", "Archived Date": "", "Language": "English", "Primary Version": "Creating and Managing User Groups", "Article Total View Count": "13,380", "": "", "Article Created Date": "10/24/2022, 9:19 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Creating and Managing User Groups\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Controlling Access In Domo\n              \n", "url": "/s/topic/0TO5w000000ZanMGAS"}, {"text": "\n\n               User And Group Management\n              \n", "url": "/s/topic/0TO5w000000ZapJGAS"}]}