{"file_path": "../../raw_kb_v2\\article\\360052122574\\index.html", "content": {"title": "\n\n\n Amazon Aurora Partition Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAmazon Aurora is a MySQL and PostgreSQL compatible relational database built for the cloud that combines the performance and availability of high-end commercial databases with the simplicity and cost-effectiveness of open source databases. Use the Amazon Aurora Partition connector to efficiently and securely bring in the data from your database based on number of past days provided. Once your data is in Domo, you can provide the transparency with real-time and interactive dashboards to the managers and stakeholders. You can set up alerts to be notified of changes in your key data points, and access all your data in real time, from any device. To learn more about the Amazon Aurora API, visit\n\nhttps://aws.amazon.com/rds/aurora/\n\n.\n\n\n You connect to your Amazon Aurora account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon Aurora Partition connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Amazon Aurora account and create a DataSet, you must have the following:\n\n The username and password you use to log into your database\n* The hostname or IP address of your database server\n* The port number for your database\n* The database name or schema name\n\nYou can also include the URL where your SSL CA Certificate is located, though this is optional.\n\n\n Connecting to Your Amazon Aurora Account\n------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the\n\nAmazon Aurora Partition\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your\n\nAmazon Aurora\n\naccount. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter your database username.\n  |\n|\n Password\n  |\n Enter your database password.\n  |\n|\n Host\n  |\n Enter the hostname or IP address of your database server. Example:\n\n\n db.company.com\n\n|\n|\n Port\n  |\n Enter the port number for your database server.\n  |\n|\n Database Name\n  |\n Enter your database name.\n  |\n|\n CA Certificate (optional)\n  |\n Enter the URL where the SSL CA Certificate is located.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to create a new\n\nAmazon Aurora Partition\n\nDataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nIn this pane you create an SQL query to pull data from your database and specify the attributes to partition your data.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Query\n  |\n Enter the SQL query to execute.\n  |\n|\n Database Table\n  |\n Select the database table.\n  |\n|\n Partition Column Name\n  |\n Select partition column name.\n  |\n|\n Past Days\n  |\n Enter the number of past days you want to get data for. Value can be a positive integer. For example: 30.\n  |\n|\n Date Format\n  |\n Select the required date format. By default,\n ********yyyy-MM-dd********\n will be used.\n  |\n|\n TinyInt Values Treated as Bit (Boolean) Values\n  |\n Select Yes if you want the tiny integer values to be treated as boolean values, else select No.\n  |\n|\n Cast Boolean Values To...\n  |\n Select whether the String or Integer boolean values will be cast to within your dataset.\n\nString: False/True\n\nInteger: 0/1\n  |\n\n\n###\n FAQs\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the username, password, hostname or IP address, port number, and database name associated with your database. You can also include the URL where your SSL CA certificate is located, though it is optional.\n\n###\n How to get a Certificate Authority (CA) certificate?\n\nTo get a certificate bundle that contains both the intermediate and root certificates for all AWS Regions, download from\n\n\n https://truststore.pki.rds.amazonaws.com/global/global-bundle.pem\n\n\n .\n\n\n If your application is on Microsoft Windows and requires a PKCS7 file, you can download the PKCS7 certificate bundle. This bundle contains both the intermediate and root certificates at\n\n\n https://truststore.pki.rds.amazonaws.com/global/global-bundle.p7b\n\n\n .\n\n*Note:**\n\n\n Amazon RDS Proxy and Aurora Serverless use certificates from the AWS Certificate Manager (ACM). If you are using RDS Proxy, you don't need to download Amazon RDS certificates or update applications that use RDS Proxy connections. For more information about using TLS/SSL with RDS Proxy, see\n\nUsing TLS/SSL with RDS Proxy\n\n.\n\nIf you are Aurora Serverless, downloading Amazon RDS certificates isn't required. For more information about using TLS/SSL with Aurora Serverless, see\n\nUsing TLS/SSL with Aurora Serverless v1\n\n.\n\n###\n Are there any API limits that I need to be aware of?\n\nLimits depend on your server configuration.\n\n###\n How frequently will my data update?\n\nDatasets can run as often as every 15 minutes. However, depending on the runtime of the query, datasets may need to run less frequently.\n\n###\n What do I need to be aware of while writing a query?\n\nMake sure that all the words, table names, and field names are correctly spelled.\n\n###\n Why can't I connect to my database? Do I need to whitelist any IP addresses?\n\nBefore you can connect to your database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see Whitelisting IP Addresses.\n\n###\n What's the difference between the Amazon Aurora and Amazon Aurora Partition connectors?\n\nIn the Amazon Aurora connector, you need to select a JDBC driver to connect to your database. The Amazon Aurora connector gives you a choice to write an SQL query with or without the query parameter. It allows you to select the database table and table columns. It also provides a Query Helper to guide you in writing an SQL query.\n\n\n The Amazon Aurora Partition connector supports partitioning, thus optimizing your database performance. You need to select the table name and partition column name. You also need to specify the number of past days you want to get data for. It gives you a choice if you want your TinyInt values to be treated as String or Integer, though it's optional. You can select the Date format for your data to be retrieved.\n\n##\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360052122574\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003975\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon Aurora Partition Connector\n\n", "article_total_view_count": "\n\n\n 4,707\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "amazon_aurora_partition_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "partition_connectors", "url": "/s/topic/0TO5w000000ZapAGAS"}]}