{"file_path": "../../raw_kb_v2\\article\\360042930334\\index.html", "content": {"Title": "Basecamp 3 Connector", "Article Body": "Intro\n                       \n\n                        Basecamp 3 is a web-based project management tool developed by Basecamp and launched in 2004. To learn more about the Basecamp 3 API, visit their page (\n                        \n                         https://github.com/basecamp/bc3-api\n                        \n                        ).\n                       \n\n                        You connect to your Basecamp 3 account in the Data Center. This topic discusses the fields and menus that are specific to the Basecamp 3 connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n\n                         To connect to your Basecamp 3 account and create a DataSet, you must have the following:\n                        \n\n\n\n\n\n                           The username or email address you use to log into Basecamp 3\n                          \n\n\n\n\n\n                           The password you use to log into Basecamp 3\n                          \n\n\n\n\n\n                         Alternatively, if you used a Google account to set up your Basecamp 3 account, use the credentials associated with that Google account.\n                        \n\n\n                        Connecting to Your Basecamp 3 Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Basecamp 3 Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n\n                          Credentials Pane\n                         \n\n\n\n\n\n\n                         The Domo Basecamp 3 connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                         \n                          Connect\n                         \n                         (or select\n                         \n                          Add Account\n                         \n                         if you have existing Basecamp 3 accounts in Domo) to open the Basecamp 3 OAuth screen where you can enter your Basecamp 3 username/email address and password. Once you have entered valid Basecamp 3 credentials and authorized Domo to connect to Basecamp 3, you can use the same account any time you go to create a new Basecamp 3 DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Basecamp 3 when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Basecamp 3.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Basecamp 3 report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Basecamps\n                               \n\n\n\n                                Returns a paginated list of active Basecamps visible to the current user, sorted by creation date.\n                               \n\n\n\n\n\n                                Basecamp by Basecamp ID\n                               \n\n\n\n                                Returns the Basecamp with the provided ID.\n                               \n\n\n\n\n\n                                Campfire by Basecamp ID\n                               \n\n\n\n                                Returns the Campfire with the provided Basecamp ID.\n                               \n\n\n\n\n\n                                Campfires\n                               \n\n\n\n                                Returns a paginated list of active Campfires visible to the current user.\n                               \n\n\n\n\n\n                                Client Approvals\n                               \n\n\n\n                                Returns a paginated list of client approvals.\n                               \n\n\n\n\n\n                                Client Correspondence\n                               \n\n\n\n                                Returns a paginated list of client correspondences in Basecamp.\n                               \n\n\n\n\n\n                                Events\n                               \n\n\n\n                                Returns a paginated list of events for the selected Recording type.\n                               \n\n\n\n\n\n                                Forwards\n                               \n\n\n\n                                Returns a paginated list of Forwards for the provided Basecamp ID.\n                               \n\n\n\n\n                               People\n                              \n\n                               Returns a list of all people visible to the authenticated user.\n                              \n\n\n\n                               People by Basecamp ID\n                              \n\n                               Returns a list of people for the provided Basecamp ID.\n                              \n\n\n\n                               Pingable Persons\n                              \n\n                               Returns all people in the account who can be pinged.\n                              \n\n\n\n                               Recordings\n                              \n\n                               Returns a paginated list of Recordings for the provided Recording type.\n                              \n\n\n\n\n                                Templates\n                               \n\n\n\n                                Returns a list of templates for the provided Basecamp ID and status.\n                               \n\n\n\n\n\n\n\n\n                           Status\n                          \n\n                           Select the status you want to retrieve information for.\n                          \n\n\n\n                           Basecamp ID\n                          \n\n                           Select the Basecamp ID you want to retrieve information for.\n                          \n\n\n\n                           Type\n                          \n\n                           Select the Recording type you want to retrieve information for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042930334", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003430", "Archived Date": "", "Language": "English", "Primary Version": "Basecamp 3 Connector", "Article Total View Count": "4,651", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Basecamp 3 Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}