{"file_path": "../../raw_kb_v2\\article\\360042929694\\index.html", "content": {"title": "\n\n\n Zendesk Connector\n\n\n", "article_body": "\n\nIntroduction\n----------------\n\nZendesk provides a cloud-based customer service program that includes ticketing, self-service options, and customer support features. You can pull data based on preexisting queries or write your own customized search queries. To learn more about the Zendesk API, visit their page (\n\nhttps://developer.zendesk.com/rest\\_api/docs/core/introduction\n\n).\n\n\n The Zendesk connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n For information about the Zendesk Chat connector, see\n\nZendesk Chat Connector\n\n.\n\n\n You connect to your Zendesk account in the Data Center. This topic discusses the fields and menus that are specific to the Zendesk connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector.\n\n\n|  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n With Zendesk data in Domo, you can analyze your ticket metrics to ensure timely and quality resolution. Custom fields are also allowed, which enables you to optimize your business even more.\n  |\n|\n**Primary Metrics**\n | * Time to reply\n* First resolution\n* Final resolution\n* Resolution satisfaction\n* Custom fields\n |\n|\n**Primary Company Roles**\n | * COO\n* Customer support manager\n* Support\n* Client services\n |\n|\n**Average Implementation Time**\n |\n 4-8 hours for basic implementations based on the limited scope of Zendesk's platform, the type of data available, and the connector's ease of use.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 4\n  |\n\nBest Practices\n----------------\n\nBe aware that Zendesk's API is rate-limited. See more details under troubleshooting section.\n\n\n To get started quickly, use a predefined Zendesk report (\"Tickets,\" \"Users,\" or \"Tickets with Users\"), a \"General Query\" (ticket status, dates, etc.), write a custom \"Specific Query,\" or do a Search (e.g.,\n\ntags:vip type:user created<2015-05-01\n\nwould return VIP tickets created before May 1, 2015).\n\n\n Prerequisites\n---------------\n\nTo connect to your Zendesk account and create a DataSet, you must have the following:\n\n The username for your Zendesk account\n* The API token OR password for your Zendesk account\n* The Zendesk URL for your company\n\nTo use a password, enable API authentication using an agent's email address and password. This may already be enabled for sign-in to the Zendesk Support mobile apps.\n\n\n Zendesk recommends that you use API tokens to keep your agents' passwords safe. API tokens are managed in the Zendesk Support Admin interface at\n **Admin > Channels > API**\n . The page lets you view, add, or delete tokens. More than one token can be active at the same time. Deleting a token deactivates it permanently.\n\n\n Connecting to Your Zendesk Account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Zendesk Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Zendesk account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into your Zendesk account.\n  |\n|\n Authenticate By\n  |\n Specify whether you want to use your Zendesk API token or password to authenticate.\n  |\n|\n API Token or Password\n  |\n Enter your Zendesk API token or password. This\n *must*\n match what you have selected in the\n **Authenticate By**\n menu. For example, if you selected\n **API Token**\n for\n **Authenticate By**\n , you must enter your API token in this field, not your password.\n  |\n|\n Zendesk URL\n  |\n Enter the URL for your company's Zendesk instance.\n  |\n\nOnce you have entered valid Zendesk credentials, you can use the same account any time you go to create a new Zendesk DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report (Core API)\n  |\n Select the Zendesk Core API report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n General Query\n  |\n Returns general information about the company’s Zendesk instance for a given time period, such as ticket creation and update date, recipient, status, URL, and so on.\n  |\n|\n Search (Ticket Basic)\n  |\n Designed to be faster than the other ticket reports, this report uses Zendesk's search API without loading any additional data.\n  |\n|\n Specify Query\n  |\n Allows you to build a customized report by entering your own Zendesk search query. You can also select from two premade queries—\n **Open Tickets**\n and\n **Closed Tickets**\n . You can use these to return the number of open and closed tickets for your Zendesk instance.\n\n\n The \"Custom\" option lets you specify your own Zendesk search query. For example, the query\n\ntype:user vip\n\nwould return information on all users with the\n\nvip\n\ntag.\n\n\n For more information about entering Zendesk queries, see\n\nhttps://support.zendesk.com/hc/en-us...arch-reference\n\n.\n  |\n|\n Ticket Comments\n  |\n Returns information about tickets comments for a given time period.\n  |\n|\n Ticket Report\n  |\n Returns information about tickets for a given time period.\n  |\n|\n Tickets and Users Report\n  |\n Returns open tickets, tickets that have not been closed for >120 days, and associated users, organizations, groups, and ticket metrics.\n  |\n|\n Users Report\n  |\n Returns information about users of the company’s Zendesk instance, such as name, email, time zone, user role, and so on.\n  |\n\n|\n|\n Report (Talk API)\n  |\n Select the Zendesk Talk API report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account Overview\n  |\n Returns account overview statistics.\n  |\n|\n Agent's Activity\n  |\n Returns statistics for the agent's activity.\n  |\n|\n Available Phone Numbers\n  |\n Returns available phone numbers.\n  |\n|\n Current Queue Activity\n  |\n Returns statistics for the current queue's activity.\n  |\n|\n Get Agent Availability\n  |\n Returns the agent's availability.\n  |\n|\n Get Greeting Categories\n  |\n Returns information about the selected greeting category.\n  |\n|\n Get Greeting\n  |\n Returns information about the specified greeting.\n  |\n|\n Get Phone Number\n  |\n Returns information for a specified phone number.\n  |\n|\n List Greeting Categories\n  |\n Lists all greeting categories.\n  |\n|\n List Greetings\n  |\n Lists all greetings.\n  |\n|\n List Phone Numbers\n  |\n Lists all phone numbers.\n  |\n\n|\n|\n Country Code\n  |\n\nSpecify the ISO country code\n\n|\n|\n Contains\n  |\n\nSpecify the regular expression to search for phone numbers. Valid characters are quotes ('') and [0-9a-zA-Z]. The quotes ('') character will match any single digit.\n\n|\n|\n Number Should be Toll-Free or Local\n  |\n\nSpecify whether the number should be toll-free or local.\n\n|\n|\n Area Code\n  |\n\nSpecify to find phone numbers in the specified area code (US and Canada only).\n\n|\n|\n From Days\n  |\n Enter the number of past days for your report. For example, if you entered\n `30`\n , the report would show data for the past 30 days.\n  |\n|\n To Days\n  |\n Enter the number of past days that should\n *not*\n appear in your report. For example, if you entered\n `3`\n , your report would contain data up until 3 days ago.\n  |\n|\n Agent\n  |\n S\n\nelect an Agent.\n\n|\n|\n Greeting Category\n  |\n select a greeting category.\n  |\n|\n Greeting\n  |\n select a greeting.\n  |\n|\n Phone Number\n  |\n Select a phone number.\n  |\n|\n Search Query\n  |\n Select the desired search query type.\n **Open Tickets**\n and\n **Closed Tickets**\n are premade queries you can use to return the number of open and closed tickets for your Zendesk instance. The Custom option lets you specify your own Zendesk search query. For example, the query\n `type:user vip`\n would return information on all users with the\n `vip`\n tag.\n\n\n For more information about entering Zendesk queries, see\n\nhttps://support.zendesk.com/hc/en-us/articles/203663226-Zendesk-search-reference\n\n.\n  |\n|\n Query Field\n  |\n Select the desired search query type.\n **Open Tickets**\n and\n **Closed Tickets**\n are premade queries you can use to return the number of open and closed tickets for your Zendesk instance. The\n **Custom**\n option lets you specify your own Zendesk search query. For more information about entering Zendesk queries, see\n\n\n https://support.zendesk.com/hc/en-us/articles/203663226-Zendesk-search-reference\n\n\n .\n  |\n|\n Include Attachments\n  |\n Specify whether you would like to include the attachments in the results.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Zendesk's API is rate limited. Zendesk allows only a certain number of requests per minute depending on the customer's plan and the endpoint. If your Zendesk connection in Domo seems slow, consider upgrading your plan to get higher rate limits.\n\n+ Essential plan = 10 requests per minute (RPM)\n\t+ Team plan = 200 RPM\n\t+ Professional = 400 RPM\n\t+ Enterprise = 700 RPM\n\t+ High Volume Add-on = 2,500 RPM\n* If you get a 429 error, this indicates that the rate limit has been exceeded.\n* You can compare your API activity in the last 24 hours against your rate limit using Zendesk's \"Tracking API activity against your rate limit\" article at\n\nhttps://support.zendesk.com/hc/en-us...our\\_rate\\_limit\n\n.\n* If your connection is unsuccessful, check that your API token is active. API tokens are managed in the Zendesk Support Admin interface at\n **Admin > Channels > API**\n . The page lets you view, add, or delete tokens. More than one token can be active at the same time.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929694\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003476\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nZendesk Connector\n\n", "article_total_view_count": "\n\n\n 5,058\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "zendesk_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}