{"file_path": "../../raw_kb_v2\\article\\360043428273\\index.html", "content": {"Title": "Duplicating Dashboards (\"Save As\")", "Article Body": "Intro\n                       \n\n                        When using the Dashboard\n                        \n                         Save As\n                        \n                        feature, you have two options on how to handle the Cards on the Dashboard. The first option is to use the\n                        \n                         Save As\n                        \n                        feature on a Dashboard to duplicate any Dashboard in Domo you have access to, along with all of its Cards. In other words, a copy of the Dashboard and its contents is created that has a new name and is completely independent of the original Dashboard. Any changes you make to the new Dashboard or its Cards has no effect on the original Dashboard or Cards. This is the default behavior when using the\n                        \n                         Save As\n                        \n                        feature on a Dashboard.\n                       \n\n                        The second option is to use the\n                        \n                         Save As\n                        \n                        feature on a Dashboard to duplicate any Dashboard in Domo you have access to, while using the original Cards from the Dashboard. In other words, a copy of the Dashboard is created that has a new name and uses the same Cards of the original Dashboard. Any changes you make to the new Dashboard has no effect on the original Dashboard, however any changes you make to the Cards will effect the Cards on the original Dashboard. In order to not duplicate the Cards on the Dashboard, you must uncheck the box that reads \"Duplicate all Cards.\"\n                       \n\n                        Any user with access to a Dashboard can duplicate it regardless of security role; however, only those elements the user has access to will be copied. So, for example, if a Dashboard contained Cards a certain user was not able to view due to lack of access rights, those Cards would not be copied into the new Dashboard.\n                       \n\n                        When you duplicate a Dashboard, the following elements in the Dashboard are duplicated:\n                       \n\n\n\n\n                           Cards\n                          \n                          (If you check the box that reads \"Duplicate all Cards.\")\n                         \n\n\n\n\n                           Card sizes\n                          \n\n\n\n\n\n                           Filters built into Cards using Analyzer\n                          \n\n\n\n\n\n                           Card Collections\n                          \n\n\n\n\n\n                           Page-level filters\n                          \n\n\n\n\n                        This option does\n                        \n                         not\n                        \n                        copy the following elements from a Dashboard:\n                       \n\n\n\n\n                           Sub-Pages\n                          \n\n\n\n\n\n                           Temporary filters created at the Card Details level\n                          \n\n\n\n\n\n                           Alerts on Cards\n                          \n\n\n\n\n\n                           Scheduled reports\n                          \n\n\n\n\n\n                           Users the original Page was being shared with\n                          \n\n\n\n\n\n\n                          Video - \"Save As\" for Pages\n                         \n\n\n\n\n\n\n\n\n\n\n                         To duplicate a Dashboard,\n                        \n\n\n\n\n                          Navigate to the Dashboard you want to duplicate.\n                         \n\n\n\n                          In the wrench menu in the top right corner of the screen, select\n                          \n                           Save As\n                          \n                          .\n                          \n                          A\n                          \n                           Save as new Dashboard\n                          \n                          dialog appears.\n                          \n\n\n\n\n\n\n                          (Optional) Enter a new name for the Dashboard in the\n                          \n                           New Dashboard title\n                          \n                          field.\n                         \n\n\n                         (Conditional) If you do not want to duplicate the Cards (so that the new Dashboard uses the original Cards) uncheck the box that reads \"Duplicate all Cards.\"\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The default behavior is the \"Duplicate all Cards\" box is checked.\n                            \n\n\n\n\n\n\n                          (Conditional) If you want to open the new Page after you save, check the box that reads \"Go to new Page when done.\"\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360043428273", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004099", "Archived Date": "", "Language": "English", "Primary Version": "Duplicating Dashboards (\"Save As\")", "Article Total View Count": "5,666", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Duplicating Dashboards (\"Save As\")\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Card And Dashboard Management\n              \n", "url": "/s/topic/0TO5w000000ZanDGAS"}]}