{"file_path": "../../raw_kb_v2\\article\\360043435293\\index.html", "content": {"Title": "Alchemer Connector", "Article Body": "Intro\n                        \n\n\n\n\n                         Alchemer (formerly known as SurveyGizmo) is a customer-experience solution that helps you transform to a truly customer-centric organization. It's not always easy to see how the customer feedback opinions correlate with your business decisions. To get at the story behind the surveys, you need context. Domo's cloud-based platform brings all your data sources together in one survey dashboard. See survey results side-by-side with data from marketing, operations, finance, or anywhere else to learn what drove those responses. Use Domo's Alchemer connector to pull data about survey campaigns, statistics, respondents, and responses for all surveys in your account or for a single survey. Get reports on your surveys made to your exact specifications—what you want to see, how you want to see it.\n                        \n                        To learn more about the\n                        \n                         Alchemer\n                        \n                        API, go to\n                        \n                         https://apihelp.surveygizmo.com\n                        \n                        .\n                       \n\n                        The\n                        \n                         Alchemer\n                        \n                        connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        This topic discusses the fields and menus that are specific to the\n                        \n                         Alchemer\n                        \n                        connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector enables you visualize the responses from a survey quickly, instead of having to read through each response. Most users who use this connector pull the \"Survey Response\" report.\n                           \n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n                             Marketing roles\n                            \n\n                             HR roles\n                            \n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            10 minutes\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n                        Set your report to \"Append\" instead of \"Replace\" so that each new run of the DataSet will add onto the data from the previous run.\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your\n                        \n                         Alchemer\n                        \n                        account and create a DataSet, you must have the\n                        \n                         Alchemer\n                        \n                        API key and API secret. You can find these credentials for your account by following these instructions:\n                        \n                         https://apihelp.surveygizmo.com/help/authentication\n                        \n\n\n                        Connecting to Your\n                        \n                         Alchemer\n                        \n                        Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the\n                        \n                         Alchemer\n                        \n                        Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your\n                        \n                         Alchemer\n                        \n                        account. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            API Key\n                           \n\n\n\n                            Enter the API key for your\n                            \n                             Alchemer\n                            \n                            account.\n                           \n\n\n\n\n\n                            API Secret\n                           \n\n\n\n                            Enter the API secret for your\n                            \n                             Alchemer\n                            \n                            account.\n                           \n\n\n\n\n\n                            Domain\n                           \n\n\n\n                            Select the Domain for your Alchemer account.\n                           \n\n\n\n\n\n                        After you have entered valid credentials, you can use the same account in Domo any time you create a\n                        \n                         Alchemer\n                        \n                        DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Report\n                         \n\n                        menu, along with a\n                        \n\n                          Survey ID\n                         \n\n                        menu that appears depending on the selected report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select an\n                            \n                             Alchemer\n                            \n                            report. The following reports are available:\n                           \n\n\n\n\n\n                                Account\n                               \n\n\n\n                                Returns a list of all teams in the account.\n                               \n\n\n\n\n\n                                Contact List\n                               \n\n\n\n                                Returns all contact lists for the account.\n                               \n\n\n\n\n\n                                Surveys\n                               \n\n\n\n                                Returns a list of all surveys for the account.\n                               \n\n\n\n\n\n                                Survey Campaign\n                               \n\n\n\n                                Returns a list of all campaigns and links for the specified survey.\n                               \n\n\n\n\n\n                                Survey Response\n                               \n\n\n\n                                Returns all responses for the specified survey.\n                               \n\n\n\n\n\n                                Survey Statistic\n                               \n\n\n\n                                Returns a list of all statistics for the specified survey.\n                               \n\n\n\n\n\n\n\n\n\n\n\n                            Survey ID\n                           \n\n\n\n                            Select the survey you want to retrieve information for.\n                           \n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Rate Limits\n                       \n\n                        License-based accounts (accounts created on or after 01/17/2017) - 120 calls per minute\n                        \n                        Legacy Basic accounts - 30 calls per minute\n                        \n                        Legacy Professional - 60 calls per minute\n                        \n                        Legacy Team & Enterprise - 120 calls per minute\n                       \n\n                        FAQs\n                       \n\n                        What version of the Alchemer API does this connector use?\n                       \n\n                        This connector uses version 5 of the Alchemer API.\n                       \n\n\n                         US:\n                         \n                          https://api.alchemer.com/v5\n                         \n\n\n                         CA:\n                         \n                          https://api.alchemer-ca.com/v5\n                         \n\n\n                         EU:\n                         \n                          https://api.alchemer.eu/v5\n                         \n\n\n\n                        What kind of credentials do I need to power up the Alchemer connector?\n                       \n\n                        You need the Alchemer API key and API secret to connect to your Alchemer account. You can find these credentials for your account by following these instructions at Alchemer Authentication help.\n                       \n\n                        How frequently will my data update?\n                       \n\n                        The time between the response submission and the data availability via API can be more than 5 minutes.\n                       \n\n                        Is there any API limit that I need to be aware of?\n                       \n\n                        No\n                       \n\n                        Why do I get an error- ‘SOMETHING WENT WRONG GETTING DATA!’ in the SURVEY field? How do I fix that?\n                       \n\n                        This error appears when your account is no longer valid. Please create a new account with your valid credentials and try again.", "Preview Article": "Click here to preview", "URL Name": "360043435293", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003394", "Archived Date": "", "Language": "English", "Primary Version": "Alchemer Connector", "Article Total View Count": "4,733", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Alchemer Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}