{"file_path": "../../raw_kb_v2\\article\\36004740075\\index.html", "content": {"title": "\n\n\n Jupyter Workspaces User Guide\n\n\n", "article_body": "\n\nIntro\n---------\n\nJupyter Workspaces in Domo is a web-based interactive development environment for Jupyter notebooks, code, and data. Workspaces are tightly integrated with Domo to allow users to easily explore their Domo DataSets, leverage instantaneous code execution to develop pipelines for data science and machine learning, document their processes, create custom visualizations, and write transformed data back into Domo.\n\n\n Jupyter Workspaces use the JupyterLab interface. For more information about JupyterLab, see the\n\nJupyterLab\n\n\n Documentation.\n\n\n Jupyter Workspaces is a premium Domo feature. Contact your Customer Success Manager (CSM) or Account Executive (AE) to get access. For help, reach out to\n\nsupport@domo.com\n\n--\n\nThis article provides information on integrating Jupyter Workspaces with Domo in the following topics:\n\n Required grants\n* Enable Jupyter\n\nJupyter Workspaces Tasks\n\n Create a workspace\n* Enable workspace sharing\n* Share a workspace\n* View instances in a shared workspace\n* Run a workspace\n* Edit a workspace\n* Delete a workspace\n\nFile Sharing\n\n Create a File Share\n* Use a File Share\n* Delete a File Share\n\nJupyter Notebooks\n\n Edit Jupyter notebooks\n* Create a notebook\n* Rename a notebook\n* Save a notebook\n* Delete a notebook\n* Schedule a notebook\n* Download notebook output\n* Cells\n* Change cell type\n* Add cells to a notebook\n* Other cell options\n* Add input to cells\n* Execute/run cells\n\n\n Jupyter Basics\n\n\n* Reading data\n* Writing data\n* Use Append, Upsert, and Partition\n* Use accounts\n* Install and use libraries\n* Usage monitoring\n\nFAQ\n\n--\n\nRequired Grants\n-------------------\n\n\n To access Jupyter, you need one of the following two grants enabled: Create Jupyter Workspace or Manage Jupyter Workspace. You can add these grants to a custom Domo role.\n\n\n* **Create Jupyter Workspace —**\n\nAllows a user to create, edit, and delete Jupyter Workspaces to which they have access.\n* **Manage Jupyter Workspace**\n (Jupyter Admin)\n **—**\n\nAllows a user to view, edit, and delete any Jupyter Workspaces in the instance. This grant is needed to enable workspace sharing for other users.\n\nTo use the File Share feature of Jupyter Workspaces, you need one of the following two grants enabled: Create File Share Directories or Manage File Share Directories. You can add these grants to a custom Domo role.\n\n **Create File Share Directories —**\n Allows a user to create, edit, and delete File Share directories to which they have access.\n* **Manage File Share Directories —**\n\nAllows you to view, edit, and delete any File Share directory in this instance.\n\nEnable Jupyter\n------------------\n\nIn order to start using Jupyter, a Jupyter Admin must enable the feature for your instance.\n\n\n 1. In the navigation header, go to\n **More**\n >\n **Admin**\n .\n\n\n 2. In the\n\n\n**Features**\n menu, select\n **Jupyter**\n\n.\n\n3. Activate the feature by adjusting the toggle next to\n\n\n**Jupyter Account Inactive.**\n\n\n Your account is activated.\n\n\n 4. After activating the account, choose the account plan you want:\n\n The Default account plan allows all users access to Jupyter and gives all users unlimited usage.\n* The Manual account plan allows specific users access to Jupyter and gives you the option to configure usage limits.\n\n\n 5. Select a\n **Compute Tier Limit.**\n To learn more about tier limits, contact your CSM/AE.\n\n\n 6. Select\n **Save.**\n\n\n Jupyter is enabled, and workspaces can be created.\n\n\n Back to top\n\n\n Jupyter Workspaces Tasks\n----------------------------\n\nThe next sections describe certain tasks within Jupyter Workspaces, including create a workspace, enable workspace sharing, share a workspace, view instances in a shared workspace, run a workspace, edit a workspace, and delete a workspace.\n\n##\n\n\n Create a Workspace\n\nIn order to create a workspace, Jupyter must be enabled for your instance. See the headings for\n\nRequired Grants\n\nand\n\nEnable Jupyter\n\nfor instructions.\n\n. In the navigation header, select\n **Data**\n .\n2. In the left side rail, select\n\n*More**\n >\n **Jupyter Workspaces**\n .\n3. Select\n **+ New Workspace**\n**.**\n\n\n The\n **Create Jupyter Workspace**\n modal displays.\n4. Customize the workspace by configuring the following:\n\n\n* In the\n **Name**\n and\n **Description**\n fields, enter a workspace name and optional description.\n* Enter values in the\n **Kernel**\n ,\n **Compute Tier Limit**\n ,\n\nand\n **Timeout**\n fields.\n\nYou can read about Compute Tier Limits in our\n\nJupyter Workspace: Compute Tier Limits\n\narticle.\n* (Optional) Select Input DataSets\n* (Optional) Select Output DataSets\n* (Optional) Add an Account.\n\nIn this step, you can add a third-party account, such as your Google account, to reference in your workspace.\n* (Optional) Add a File Share. See\n\nCreate a File Share\n\nfor instructions.\n\n\n**Note:**\n If you share your workspace with other users, they can see third-party accounts referenced in the workspace. However, they cannot read any account keys or values.\n ***To share an account with a user, navigate to Data > Accounts.***\n Input and Output DataSets are also shared with Co-Owners.\n\nThe following table describes options to be configured when creating a new workspace:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n**Name**\n |\n The name of the Jupyter workspace\n  |\n|\n**Description**\n |\n Optional description to provide more details about the workspace\n  |\n|\n**Computer Tier Limit**\n |\n The computer size that is allocated to the workspace and any data flows that are associated with this workspace\n  |\n|\n**Timeout**\n |\n The amount of time with no user activity in the Jupyter UI before the workspace automatically stops.\n  |\n|\n**Kernel**\n |\n Python or R Kernels are available\n  |\n|\n**Start workspace on successful creation**\n |\n Once created, the process to start the workspace will be performed\n  |\n|\n**Input DataSets**\n |\n Optional Domo data sources that are available to use in the Jupyter workspace\n  |\n|\n**Output DataSets**\n |\n Optional DataSets that are available to write data as part of the Jupyter processing\n  |\n|\n**Account**\n |\n Optional third-party account(s) to reference in your workspace\n  |\n| **File Share**  |\n Optional avenue to share files within your workspace. To learn more, see the headings for\n\nCreate a File Share\n\nand\n\nUse a File Share\n\n.\n  |\n\n5. Select\n **Save.**\n\n\n The new workspace is created and added to a list of workspaces on the main Jupyter page.\n\n\n Back to top\n\n##\n\n\n Enable Workspace Sharing\n\nIn order for a workspace to be shared, an Admin or user with the Manage Jupyter Workspace grant must enable sharing.\n\n\n 1. From the Jupyter Workspaces list, navigate to the workspace you wish to share.\n\n\n 2. Hover to the right of the workspace. The\n\n\n**Manage Workspace**\n menu displays.\n\n\n 3. Select the\n\n*Manage Workspace**\n menu and choose\n **Enable Sharing.**\n\n\n The\n **Enable Sharing**\n modal displays.\n\n\n 4. Select\n **Continue**\n and\n **Confirm**\n . By selecting\n **Confirm**\n , you are acknowledging\n\nthe risks associated with sharing notebooks and workspaces.\n\nIn the\n **Workspace Sharing**\n column, the status is\n **Enabled.**\n The workspace can now be shared with other users by admins or the workspace owner.\n\n\n Back to top\n\n##\n\n\n Share a Workspace\n\nIn order for a workspace to be shared, an Admin or user with the Manage Jupyter Workspace grant must enable sharing. See\n\nEnabling Workspace Sharing.\n\n1. From the Jupyter Workspaces list, navigate to the workspace you wish to share.\n\n\n 2. Hover to the right of the workspace. The\n\n*Manage Workspace**\n menu displays.\n\n\n 3. Select the\n\n*Manage Workspace**\n menu and choose\n **Share this Workspace.**\n\n\n The\n **Manage Sharing**\n modal displays.\n\n\n 4. Enter the recipient's name, select the appropriate permissions, and select\n **Add.**\n\n\n 5. Select\n **Save**\n .\n\n\n The workspace is shared with the recipient(s). They can now add instances to the workspace, and the status of those instances can be viewed in the\n **Status**\n column on the main Jupyter page.\n\n*Important:**\n\n\n* Simultaneous editing is not supported. Please check with other users before editing the same file.\n* If you share your workspace with other users, they can see third-party accounts referenced in the workspace. However, they cannot read any account keys or values. Input and Output DataSets are also shared with Co-Owners.\n\nBack to top\n\n##\n\n\n View Instances in a Shared Workspace\n\nWhen a workspace is shared, other users can add an instance to the workspace.\n\n\n In the image below, the workspace has sharing enabled and has been shared with one other user.\n\n\n To see which instances are running in the workspace, select\n **others.**\n\nIn the image below, only one instance is running in the workspace.\n\n\n Back to top\n\n##\n\n\n Run a Workspace\n\n1. From the\n **Jupyter Workspaces**\n list, select the workspace you want to run.\n\n\n The\n **Start this Workspace**\n modal displays.\n\n\n 2. Select\n **Start.**\n\nThe workspace will load for several seconds. This is normal.\n\n3. After the workspace is done loading, select the workspace title.\n\n\n The workspace opens, and the notebook can be edited.\n\nIf two users edit the same file, the\n **File Changed**\n modal displays. You can overwrite changes the other user made or revert your changes.\n\nBack to top\n\n##\n\n\n Edit a Workspace\n\n1. From the\n **Jupyter Workspaces**\n list, locate the workspace you wish to edit.\n\n\n 2. Hover to the right of the workspace. The\n\n*Manage Workspace**\n menu displays.\n\n\n 3. Select the\n\n*Manage Workspace**\n menu and choose\n **Edit.**\n\n\n The\n **Edit Jupyter Workspace**\n modal displays.\n\n\n 4. Add new specifications to the workspace and select\n **Save.**\n\n\n The workspace is updated with new details.\n\n\n Back to top\n\n##\n\n\n Delete a Workspace\n\n1. From the Jupyter Workspaces list, navigate to the workspace you wish to delete.\n\n\n 2. Hover to the right of the workspace. The\n\n*Manage Workspace**\n menu displays.\n\n\n 3. Select\n\n*Manage Workspace**\n menu and choose\n **Delete.**\n\n\n The\n **Delete Test?**\n modal displays.\n\n\n 4. Confirm that you wish to delete the workspace by selecting the\n **Delete**\n button.\n\n\n The workspace is deleted. This action cannot be undone.\n\n\n Back to top\n\n\n File Sharing\n----------------\n\nYou can create and add a File Share to your Jupyter Workspace. The following headings describe how to create a File Share, add it to your workspace, and delete a File Share from your workspace.\n\n##\n\n\n Create a File Share\n\nFollow these steps to create a File Share to use in Jupyter Workspaces. See the heading for\n\nUse a File Share\n\nto learn how to connect a File Share with Jupyter Workspaces.\n\n. In the Domo navigation header, select\n **Data**\n .\n2. In the left side rail, select\n\n*More**\n >\n **File Share**\n .\n3. Select\n **+ New File Share**\n .\n\n\n The\n **Create a File Share**\n modal displays.\n4. Customize the File Share by configuring the following:\n\t* In the\n\t **Name**\n\t and\n\t **Description**\n\t fields, enter a File Share name and optional description.\n\t* In the\n\t **Default Mount Point**\n\t field, enter a\n\t ***path**\n\t .*\n\t This can be whatever you would like.\n5. Select\n **Save**\n to create the new File Share.\n\nBack to top\n\n##\n\n\n Use a File Share\n\nThe process outlined below allows you to use a File Share that you have created. To learn how to make a File Share, see the heading for\n\nCreate a File Share\n\n.\n\n\n While you are creating or editing a Jupyter Workspace, you can add a File Share that you have created.\n\n\n Follow the steps below to add a File Share in the\n **Create Jupyter Workspace**\n or\n **Edit Jupyter Workspace**\n modal. To learn how to access these modals, see the headings for\n\nCreate a Workspace\n\nand\n\nEdit a Workspace\n\n.\n\n. In the\n **File Share**\n section of the modal, select\n **Add File Share**\n .\n2. In the search field, search for and locate the File Share you want to add to the workspace.\n3. Select the File Share.\n4. The File Share displays in the modal. By default, the Mount Point is the default Mount Point, and the checkbox for\n **Use default**\n is checked. To use a different Mount Point, uncheck the\n **Use default**\n checkbox and expand the list to select the Mount Point you want to use.\n5. Select\n **Save Workspace**\n .\n\n\n The File Share is added to the workspace.\n\nBack to top\n\n##\n\n\n Delete a File Share\n\n\n1. Access the\n **Create Jupyter Workspace\n **or**\n Edit Jupyter Workspace\n **modal.****\n To learn how to access these modals, see the headings for\n\nCreate a Workspace\n\nand\n\nEdit a Workspace\n\n.\n2. In the\n **File Share**\n section of the modal, identify the File Share you want to delete and select the\n\nkebab menu.\n3. Select\n **Delete**\n .\n\n\n The File Share is deleted from the workspace.\n\nBack to top\n\n\n Jupyter Notebooks\n---------------------\n\nA Jupyter notebook is a file that consists of one or more cells. In these cells, you can write and format text, as well as write code using Python or R programming languages. When you execute the contents of a cell, the resulting output associated with the text or code displays directly in the notebook. The output can take various forms such as text, figures, tables, and images. You can add, edit, move, duplicate, re-run, and delete cells within a notebook at your discretion. You can also run cells sequentially to perform different phases of your project one after the other. For example, the first cell in your notebook could contain code to read in your DataSet; the second cell could then contain code that specifies what analysis to run on the DataSet.\n\n\n See\n\nCells\n\nto learn about the types of cells, how to add them to a notebook, and how to execute them.\n\n\n Because a Jupyter notebook file can display executable code and the associated code output, along with explanatory text and images, a notebook can serve as a complete record of your interactive session.\n\n\n You can save a Jupyter notebook to your Jupyter workspace, enabling you to access your notebook and its contents in the future. Jupyter notebooks are internally JSON files and are saved with the .ipynb extension.\n\n\n You can also download a notebook from your workspace and save it elsewhere or share it.\n\n*Note:**\n You can create and save multiple Jupyter notebooks within a single Jupyter workspace.\n\nThis image displays an example of a Jupyter notebook.\n\nBack to top\n\n##\n\n\n Edit Jupyter Notebooks\n\n\n**Important:**\n In order to edit a notebook, you first have to create and then start (or run) a workspace. See\n\nCreate a Workspace\n\nand\n\nRun a Workspace\n\nfor more information.\n\n\n####\n\n\n Create a Notebook\n\nFollow these steps to create a notebook:\n\n. In the Jupyter workspace, select\n **File**\n >\n **New**\n >\n **Notebook**\n .\n\n\n The\n **Select Kernel**\n modal displays.\n2. Press\n **Select**\n .\n\n\n A notebook named\n *Untitled.ipynb*\n opens in the main work area. The untitled notebook also displays in the File Browser in the workspace side panel.\n\nBack to top\n\n###\n\n\n Rename a Notebook\n\nYou can rename a notebook either from the main work area or from the File Browser, depending on whether the notebook is open or closed. Select the appropriate option below:\n\n **Notebook open —**\n In the main work area, right-click the title of the notebook to display the notebook options and select\n **Rename Notebook**\n . The\n **Rename File**\n dialog displays. Enter a new name for the notebook and select\n **Rename**\n .\n* **Notebook closed —**\n In the File Browser, right-click the title of the notebook that you want to rename to display the file options, then select\n **Rename**\n . Enter a new name for the notebook.\n\nBack to top\n\n###\n\n\n Save a Notebook\n\nTo save a notebook to your Jupyter workspace, select\n **Save**\n in the main work area.\n\nBack to top\n\n###\n\n\n Delete a Notebook\n\nYou can delete a notebook either from the main work area or from the File Browser, depending on whether the notebook is open or closed. Select the appropriate option below:\n\n **Notebook open —**\n In the main work area, right-click the title of the notebook to display the notebook options and select\n **Delete Notebook**\n . A dialog displays. Select\n **Delete**\n .\n* **Notebook closed —**\n In the left panel, right-click the title of the notebook you want to delete to display the notebook options and select\n **Delete**\n . A dialog displays. Select\n **Delete**\n .\n\nBack to top\n\n###\n\n\n Schedule a Notebook\n\nYou can schedule a Jupyter notebook to run automatically at a set cadence. The available cadence options are listed below:\n\n Once a day at a set time\n* Multiple times a day at set times\n* Every day\n* Specific days of the week\n* Specific days of the month\n* Every month\n* During specific months\n\nYou can also\n\nmanually run a scheduled notebook\n\n.\n\n\n Scheduling a notebook by following the steps below creates an associated Jupyter DataFlow that automatically runs your Jupyter notebook. The Jupyter DataFlow has other useful functionalities, which are also described in this section.\n\n\n Follow these steps to schedule a notebook or make changes to the schedule:\n\n. Open the notebook you want to schedule. In the toolbar, select\n **Schedule Notebook**\n . The\n **Create DataFlow**\n modal displays.\n2. In the modal, fill in the\n **Name**\n and optional\n **Description**\n fields.\n3. Select a\n **Compute Tier**\n .\n4. In the\n **When should this DataFlow be run?**\n menu, select\n **On a Schedule.**\n5. Set the schedule for the notebook.\n6. Select\n **Save**\n .\n\nThe DataFlow now displays in the\n **DataFlows**\n section of your Data Center. To view it, select\n **Data**\n in the navigation header and then select\n\n*DataFlows**\n in the Data Center sidebar. Select your Jupyter DataFlow to see the Details view.\n\nIn the\n **History**\n tab of the Details view, you can see the execution details for the DataFlow. You can also\n\ndownload notebook output\n\n.\n\n\n In the\n **Versions**\n tab, you can see the versions list for the DataFlow.\n\n\n There is no information in the\n **Settings**\n ,\n **DataSets**\n , or\n **Lineage**\n tabs.\n\n\n You can open the Jupyter notebook associated with the DataFlow by selecting\n **Edit in Jupyter**\n from the Details view.\n\n\n####\n\nBack to top\n\n####\n\n\n Download Notebook Output\n\nYou can download notebook output for a specific execution of a Jupyter DataFlow by following these steps:\n\n. Navigate to the\n **History**\n tab of the Details view for that DataFlow\n\n.\n2. Identify the row in the log that represents the run for which you want output information.\n3. Select the\n\naction menu for that row.\n4. Select\n **View Details**\n in the action menu.\n\n\n A dialog displays where you can select to download the output as an IPYNB, HTML, or PDF file.\n\nIn this example, the notebook output was downloaded as a PDF file:\n\nBack to top\n\n####\n\n\n Manually Run a Scheduled Notebook\n\nManually run a scheduled Jupyter notebook by following these steps:\n\n. Locate the Jupyter DataFlow for the scheduled Jupyter notebook in the\n **DataFlows**\n section of the Data Center.\n2. Select\n\n*DataFlow options**\n in the row for the Jupyter DataFlow. In the list of options, select\n **Run**\n .\n\n\n Back to top\n\n##\n\n\n Cells\n\nA Jupyter notebook file consists of one or more gray, rectangular fields called cells.\n\nYou can enter various kinds of input into a cell and then execute it to receive output. What you can enter into a cell, as well the cell's output on execution, is determined by the cell type. There are three types of cells: code cells, markdown cells, and raw cells, described below.\n\n **Code cells —**\n In these cells, you can write and edit code. The programming language that you use to write code depends on the type of kernel (either Python or R) that you selected when creating your Jupyter workspace. After you execute or run a code cells, the output of the code displays directly below the code cell. The output can take various forms such as text, figures, tables, and images.\n* **Markdown cells —**\n In these cells, you can write text. You can also use Markdown language to mark up or format text, including italicizing and bolding, specifying lists, and creating headings. After you execute or run a markdown cell, the text you wrote is formatted into rich text. You can learn about\n\nbasic Markdown synxtax\n\nhere.\n* **Raw cells —**\n In these cells, you can write output directly or save code that you don't want to run.\n\n\n You can determine a cell's type by selecting the cell and viewing the list in the toolbar at the top of the notebook. In this example, the notebook contains a code cell. See\n\nChange Cell Type\n\nfor more information.\n\nBack to top\n\n###\n\n\n Change Cell Type\n\nYou can change a cell's type by selecting the cell and then selecting the cell type menu in the toolbar and choosing the cell type you want: code, markdown, or raw. To learn more about the cell types, see\n\nCells\n\n.\n\n*Note:**\n By default, new cells are code cells.\n\n\n Back to top\n\n###\n\n\n Add Cells to a Notebook\n\nYou can add cells to a notebook using one of these two options:\n\n **Add —**\n Select\n\n*Add**\n in the toolbar. This adds a cell to the end of the notebook.\n* **Insert cell —**\n Select\n\n*Insert cell above**\n or\n\n*insert cell below**\n to add a cell above or below the currently selected cell.\n\n\n**Note:**\n All new cells are code cells. See\n\nCells\n\nfor information about cell types, and see\n\nChange Cell Type\n\nfor how to change a cell's type.\n\n\n Back to top\n\n###\n\n\n Other Cell Options\n\nYou can make other changes to cells such as delete, move, copy, cut, paste, merge, or split.\n\n\n Select\n **Edit**\n in the workspace toolbar and then select the option you want or enter the corresponding keyboard shortcut. You can also use the notebook and cell controls to make changes to cells.\n\nBack to top\n\n###\n\n\n Add Input to Cells\n\nTo add input such as text or code (Python, R, or Markdown) to a cell, select the cell in the notebook and enter your input.\n\n*Note:**\n The content you can put in your cell depends on the cell's type. See\n\nCells\n\nfor more information.\n\n\n####\n\nBack to top\n\n###\n\n\n Execute/Run Cells\n\nWhen you execute or \"run\" the contents of a cell, the resulting output associated with the input text or code displays directly in the notebook. The output can take forms such as text, figured, tables, and images, depending on the input and cell type. See\n\nCells\n\nfor more information. You can execute one or more cells at the same time.\n\n\n To execute an individual cell, select the cell and press\n\n*Play**\n in the toolbar.\n\n\n To execute multiple cells, follow these steps:\n\n. Press\n **Esc**\n on your keyboard.\n2. Press\n **Shift**\n +\n **Up/Down arrow**\n to select the cells you want to execute.\n3. Press\n\n*Play**\n in the toolbar.\n\nTo execute all the cells at the same time, select\n **Run**\n >\n **Run All Cells**\n in the workspace toolbar.\n\n\n If the cell(s) execute successfully, the output displays in the notebook. See examples of a markdown cell and a code cell below.\n\n\n Back to top\n\n\n Jupyter Basics\n----------------\n\nThis section contains information about other features of Jupyter Workspaces.\n\n##\n\n\n Reading Data\n\n\n Data can be read into a Jupyter Notebook using the domojupyter library. This library provides useful functionality to interact with Domo within Jupyter.\n\nBefore data can be read into a Jupyter Notebook using the domojupyter library, your workspace must have an input data source.\n\n\n If you are creating a new workspace, see the earlier section,\n\nCreating a Workspace.\n\nIf your workspace already exists but doesn't have an input data source, follow the steps below:\n\n\n 1. In Jupyter Workspaces, locate your workspace from the list. You can search and filter by owner.\n\n\n 2. Hover over your workspace. The\n\n*Manage Workspace**\n menu displays.\n\n\n 3. Select the\n\n*Manage Workspace**\n menu and choose\n **Edit**\n .\n\n\n The\n **Edit Jupyter Workspace**\n modal displays.\n\n\n 4. In the\n **Edit Jupyter Workspace**\n view, select\n **Add Input DataSet**\n and choose a data source to be read into a Jupyter Notebook.\n\n\n 5. After choosing a DataSet, select\n **Save Workspace.**\n\n\n The workspace has an input DataSet, and data can now be read into a Jupyter Notebook using the domojupyter library. All DataSets used in the workspace are located in\n **Data**\n >\n **DataSets.**\n\n\n 6. Use the\n `domo.read_dataframe`\n command to read data from a Domo data source into your Jupyter Notebook for further processing and analysis.\n\n\n See the example below:\n\nBack to top\n\n##\n\n\n Writing Data\n\nData can be written back to a Domo data source using the domojupyter library. This library provides useful functionality to interact with Domo within Jupyter. Before data can be written into a Jupyter Notebook using the domojupyter library, your workspace must have an output data source.\n\n\n If you are creating a new workspace, see the earlier section,\n\nCreating a Workspace.\n\nIf your workspace already exists but doesn't have an output data source, follow the steps below:\n\n\n 1. In Jupyter Workspaces, locate your workspace from the list. You can search and filter by owner.\n\n\n 2. Hover over your workspace. The\n\n*Manage Workspace**\n menu displays.\n\n\n 3. Select\n\n*Manage Workspace**\n menu and choose\n **Edit**\n .\n\n\n The\n **Edit Jupyter Workspace**\n modal displays.\n\n\n 4. In the\n **Edit Jupyter Workspace**\n view, select\n **Add Output DataSet**\n and choose a data source to be written into a Jupyter Notebook.\n\n\n 5. After choosing a DataSet, select\n **Save Workspace.**\n\n\n The workspace has an output DataSet, and data can now be written into a Jupyter Notebook using the domojupyter library. All DataSets used in the workspace are located in\n **Data**\n >\n **DataSets.**\n\n*Note:**\n\nA new dataset is created for each added output.\n\n\n 6. Use the\n `domo.write_dataframe`\n command to write results back to the Domo Data sources configured for the Jupyter workspace.\n\n\n See the example below:\n\nBack to top\n\n##\n\n\n Use Append, Upsert, and Partition\n\nUse the following commands to update a DataSet:\n\n domo.write\\_dataframe(df, output\\_dataset)\n* domo.write\\_dataframe(df, output\\_dataset, update\\_method=\"APPEND\")\n* domo.write\\_dataframe(df, output\\_dataset, update\\_method=\"UPSERT\", update\\_key=column\\_name)\n* domo.write\\_dataframe(df, output\\_dataset, update\\_method=\"PARTITION\", partition\\_name=’Example Name’)\n\n\n For information on which update method to use, see our\n\nDataSet Update Methods\n\narticle.\n\nBack to top\n\n##\n\n\n Use Accounts\n\n\n Third-party accounts can be referenced in a Jupyter Notebook using the domojupyter library. This library provides useful functionality to interact with Domo within Jupyter.\n\nBefore account keys and values can be accessed, your workspace must have an account.\n\n\n If you are creating a new workspace, see the earlier section,\n\nCreating a Workspace.\n\nIf your workspace already exists but doesn't have a third-party account attached, follow the steps below:\n\n\n 1. In Jupyter Workspaces, locate your workspace from the list. You can search and filter by owner.\n\n\n 2. Hover over your workspace. The\n\n*Manage Workspace**\n menu displays.\n\n\n 3. Select the\n\n*Manage Workspace**\n menu and choose\n **Edit**\n .\n\n\n The\n **Edit Jupyter Workspace**\n modal displays.\n\n\n 4. In the\n **Edit Jupyter Workspace**\n view, select\n **Accounts**\n >\n **Add Account**\n and select a third-party account.\n\n\n 5. After making your selection, select\n **Save Workspace.**\n\n\n The workspace has a third-party account set up. Keys and values can now be read into a Jupyter Notebook using the domojupyter library.\n\n\n 6. The following commands can be used to get account information:\n\n `domo.get_account_property_value('account')`\n\nwill return the specific value assigned to a property on your account.\n* `domo.get_account_property_value('account',account_properties[0])`\n will return all properties that exist in an account.\n\nSee the example below, where 'S3Account' is the account being referenced:\n\n\n###\n\n\n Back to top\n\n\n###\n\n\n Install and Use Libraries\n\nLibraries can be installed in the Jupyter workspace by opening a terminal and executing the appropriate commands. An example command to install the Seaborn library is\n `conda install seaborn -y`\n . Once installed, these libraries can be imported and used within the Jupyter Notebooks.\n\n\n See the example below:\n\nBack to top\n\n##\n\n\n Usage Monitoring\n\nYou can monitor Jupyter usage within Domo. As a prerequisite, you need to be assigned either the default Admin role or a custom role with the View Usage Metrics and Manage Jupyter Workspaces grants.\n\n\n Follow the steps below to create a custom role with usage-based billing access.\n\n. Clone an existing role such as the default Admin role.\n2. Remove any grants from the cloned role that are not needed for a billing admin.\n3. Add the View Usage Metrics and Manage Jupyter Workspaces grants to this role.\n\nYou can learn more about creating custom roles in our article on\n\nManaging Custom Roles\n\n.\n\n\n After you create the role, follow these steps to view your usage:\n\n. In the navigation header, go to\n **More**\n >\n **Admin\n **.****\n2. On the\n **Admin**\n screen in the\n **Company settings**\n menu, select\n **Usage**\n .\n3. Go to the\n **Jupyter Compute**\n tab.\n\nBack to top\n\n\n FAQ\n-------\n\n*Can I install Plugins?**\n\n\n Plugins are not currently supported.\n\n\n**Can I trial the feature?**\n\n\n Please contact your Customer Success Manager (CSM) or Account Executive (AE) for the most up-to-date information on the trial experience of Jupyter.\n\n\n**Does Domo offer data science services?**\n\n\n Yes, we have a team of experienced data scientists ready to help as needed. Please contact your Account Executive (AE) for more information.\n\n\n**How do I change the kernel?**\n\n\n First, you must stop the workspace. You may then change the kernel in the Domo workspace edit view.\n\n\n**Can I reset the kernel?**\n\n\n Yes. When you hover over a workspace, the\n\n*Manage Workspaces**\n menu displays. Choose\n **Restore Kernel Defaults**\n from the options. All instances must be stopped to fulfill this action.\n\n\n**Do I need to know how to code using Python or R programming languages in order to use a Jupyter notebook?**\n\n\n If you want to do any kind of data exploration or analysis (such as load a DataSet, develop data science models or machine learning pipelines, create custom data tables or figures, or write transformed data back into Domo) in a notebook, you need experience with either R or Python.\n\n\n**I'm experiencing issues integrating third-party libraries.**\n\nDomo's Jupyter integration allows users to install third-party libraries. However, Domo does not natively support every third-party library. Some third-party libraries may require more effort on the user's end to install, configure, and troubleshoot.\n\n*Can I integrate Jupyter Workspaces with GitHub?**\n\n\n Domo supports integrating and maintaining git repositories within the Jupyter Workspaces interface. After you complete integration, you can repeatedly push updates (including updated Jupyter notebook files) from Jupyter Workspaces to the GitHub repository you select using standard Git operations. See\n\nUse Jupyter Workspaces with GitHub\n\nfor more information.\n\nExperiencing issues? See the\n\nJupyter Troubleshooting Guide\n\nor contact\n\nsupport@domo.com\n\nfor assistance.\n\nBack to top\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 36004740075\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004975\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nJupyter Workspaces User Guide\n\n", "article_total_view_count": "\n\n\n 7,657\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/1/2022, 11:15 PM\n\n\n", "first_published_date": "\n\n\n 11/1/2022, 11:23 PM\n\n\n"}, "title": "jupyter_workspaces_user_guide", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "other_connection_methods", "url": "/s/topic/0TO5w000000ZanzGAC"}]}