{"file_path": "../../raw_kb_v2\\article\\4425111066903\\index.html", "content": {"Title": "October 2021 Release Notes", "Article Body": "New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        New Magic ETL\n                       \n\n                        The new Magic ETL has many backend and tile improvements as well as new tiles. When you open the edit view of a Magic ETL DataFlow, there is now a toggle switch to enable the new Magic ETL. It is important to note that some of the tiles have changed their functionality. For more information, see\n                        \n                         What's New in the New Magic ETL\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           You MUST read through the following article before switching an existing Magic ETL DataFlow to the new Magic ETL or you risk breaking your DataFlow as several tiles have changed their functionality:\n                           \n                            Upgrading to the New Magic ETL\n                           \n                           .\n                          \n\n\n\n\n\n                         The following is a list of the new Magic ETL features:\n                        \n\n\n\n                         Faster runtimes.\n                        \n\n                         New tile categorizations.\n                        \n\n                         Searchable tooltip text.\n                        \n\n                         Color-coded and curved lines.\n                        \n\n                         Expression support (Add Formula, Filter Rows, and Group By tiles.)\n                        \n\n                         Views as Inputs.\n                        \n\n                         Enhancements to data type classifying.\n                        \n\n                         Enhancements to error handling.\n                        \n\n                         Join tile updates.\n                        \n\n                         Append tile optimizations.\n                        \n\n                         Value Mapper tile updates.\n                        \n\n                         Pivot and Unpivot tiles (renamed from Collapse and Uncollapse Columns.)\n                        \n\n                         New Dynamic Unpivot tile.\n                        \n\n                         Improvements to the Python Script and R Script tiles (dropped required schema tab.)\n                        \n\n                         Selectable text in data previews.\n                        \n\n\n                        Enhanced DataFlow scheduling capabilities\n                       \n\n                        With the enhanced DataFlow scheduling options, you can now schedule a DataFlow to run on a specific schedule, such as:\n                       \n\n\n                         Specific calendar days (1st, 15th, and 28th of the month.)\n                        \n\n                         Specific day of the week (Last Friday.)\n                        \n\n                         Only during active hours (Every 2 hours between 8 AM to 5 PM.)\n                        \n\n                         Annually or Quarterly.\n                        \n\n\n                        You are also able to set the time that it runs in your time zone, instead of the default of UTC. For more information, see\n                        \n                         Scheduling DataFlows\n                        \n                        .\n                        \n\n\n\n\n\n\n                        New Connector wizard in the Data Center\n                       \n\n                        With the new Connector wizard in the Data Center, you are able to easily select the type of Connector you need with filtered tabs to specific Connector types. Preferred Connectors are listed first for easy access to the most popular or recommended Connectors. The wizard includes inline configuration for easy Connector setup. For more information, see\n                        \n                         Adding a DataSet Using a Connector\n                        \n                        .\n                        \n\n\n\n\n\n\n                        New Resource Library\n                       \n\n                        The Guide Center has been updated to the Resource Library. The new Resource Library allows you to view\n                        \n                         Guides and walkthroughs\n                        \n                        , find additional\n                        \n                         Resources\n                        \n                        , and review\n                        \n                         Product announcements\n                        \n                        . For more information, see\n                        \n                         Resource Library\n                        \n                        .\n                        \n\n\n\n\n\n\n                        User-Specific Landing Pages\n                       \n\n                        With User-Specific Landing Pages, both Admins and end-users can set a specific Page or Card to open when they log into Domo. This allows you to customize the view for users in a specific department or to bring up the Page/Card you use the most without extra navigation clicks. For more information, see\n                        \n                         Setting User-Specific Landing Pages\n                        \n                        .\n                       \n\n\n\n\n\n\n                        New DomoStats Reports\n                       \n\n                        The DomoStats Connector now has four new reports to choose from:\n                       \n\n\n\n                          Accounts -\n                         \n                         Shows the Accounts in an instance.\n                        \n\n\n                          Accounts with Permissions -\n                         \n                         Shows the Accounts in an instance as well as who has access to these Accounts and at what permission level.\n                        \n\n\n                          DataSet Access -\n                         \n                         Shows which users or groups have access to which DataSets and what permission level they have.\n                        \n\n\n                          DataSet Tags -\n                         \n                         Shows which tags are assigned to which DataSets.\n                        \n\n\n                        For more information, see\n                        \n                         DomoStats Connector\n                        \n                        .\n                        \n\n\n\n\n\n\n                        Premium features\n                       \n\n                        These features are available on demand and paid. To request these features be enabled, reach out to your Domo Customer Success Manager, Technical Consultant, or Account Executive. If you do not have contact information for your CSM, TC, or AE, contact Technical Support. For information on how to contact Support, please see\n                        \n                         Getting Help\n                        \n                        . Depending on the feature, you may be required to complete training before you can use the feature.\n                       \n\n                        Card Details maximization modal in Dashboard Embed\n                       \n\n                        With the Card Details maximization modal in Dashboard Embed, you can now click on the Expand details icon to see the Card Details view of the Card. In this view, you can now export the visuals to PDF or PowerPoint and it will reflect all Filters and interactions applied to the Card. For more information, see\n                        \n                         Sharing Cards and Dashboards Outside of Domo Using Domo Embed\n                        \n                        .\n                        \n\n\n\n\n\n\n                        Custom Login Screen\n                       \n\n                        Custom Login Screen gives Admins the ability to change the login screen to their desired background image or color. This allows you to display your brand and have a more consistent user experience. This is part of our Brand Kit features. For more information, see\n                        \n                         Custom Login Screen\n                        \n                        .\n                        \n\n\n\n\n\n\n\n\n                        Getting help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n                        in the top navigation bar.\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://domo.com/university/\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n                         More\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "4425111066903", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004416", "Archived Date": "", "Language": "English", "Primary Version": "October 2021 Release Notes", "Article Total View Count": "11,576", "": "", "Article Created Date": "10/24/2022, 9:48 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              October 2021 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}