{"file_path": "../../raw_kb_v2\\article\\360042924034\\index.html", "content": {"title": "\n\n\n Analyzer Layout\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn the Analyzer view for a Visualization card (sometimes called the \"Card Builder\" or \"Edit\" view), you customize the appearance of your charts\n\n\n and apply DataSet columns to a chart. You can also apply and edit filters, chart properties, sorts, chart name and descripti\n\n\n on, as well as view and manipulate the data table for the chart.\n\n\n The Analyzer appears as part of the workflow for creating a Visualization card. For more information, see\n\nVisualization Card Building Part 1: Powering Your Card\n\n.\n\n\n Analyzer is only accessible by users with \"Admin,\" \"Privileged,\" or \"Editor\" default security roles OR a custom security role with the \"Edit Cards\" privilege enabled. For more information about default security roles, see\n\nManaging Roles\n\n.\n\n\n For a high-level overview of the Analyzer, see\n\nAnalyzer Overview\n\n.\n\n*Video - Interface Overview - Analyzer**\n\nAnalyzer Interface\n--------------------\n\nThe following screenshot shows the Analyzer as it might appear for a typical Stacked Bar chart. For more information, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\nYou can learn more about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Data pane\n  |\n Provides access to data configuration options for the chart, including the following:\n * **DataSet picker**\n . Lets you change the DataSet powering this chart.\n* **Column filter**\n . Lets you quickly locate specific columns (dimensions and measures) in the DataSet to use in this chart. If you have created calculated columns for this chart using Beast Mode, you can use the filter to find those columns also.\n* **Available columns**\n . Shows the columns from this DataSet that you can apply to your chart. These are divided into\n **Measures**\n (columns that contain items with a \"value\" data type) and\n **Dimensions**\n (columns that contain items with \"string,\" \"date,\" and \"date-time\" data types). If you have created calculated columns for this chart using Beast Mode, those columns appear here. You apply columns to your chart by dragging and dropping them from this area into the column fields above the chart preview area.\n\n\n If the column names are too long to fit, you can expand the pane by clicking and dragging on the border of the right side of the pane.\n\n\n For more information about data types, see\n\nApplying DataSet Columns to Your Chart\n\n.\n |\n|\n Name & Description fields\n  |\n Lets you change the name/description of the Visualization card that contains this chart (the name of the powering DataSet is used by default). This is the name and description that appears at the top of the Visualization card in the page(s). For more information about naming a Visualization card, see\n\nEditing the Name or Description of a Visualization Card\n\n.\n  |\n|\n Filter & Sort pane\n  |\n Lets you apply filters to filter the data in columns in your chart. For more information, see\n\nSorting the Data in Your Chart\n\n.\n  |\n|\n Toolbar\n  |\n Provides access to buttons that let you show or hide various tools in the Analyzer interface. You can show or hide the Toolbar itself using the ^ button near the top center of the Analyzer window.\n\n\n The buttons in the Toolbar include all of the following:\n\n\n|\n Button\n  |\n Description\n  |\n| --- | --- |\n|\n Data\n  |\n Shows/hides the\n **Data**\n pane for this chart. For more information about the options available in this pane, see the row for \"Data pane\" at the top of this table.\n  |\n|\n Lineage\n  |\n Opens a window showing the lineage of DataSets feeding into the DataSet that powers this chart. For more information, see\n\nViewing the Lineage of a DataSet in Analyzer\n\n.\n  |\n|\n Data Table\n  |\n Shows/hides the data table for this chart. This table shows all of the data powering this chart. You can apply filters and aggregations to columns in the data table; these filters are also applied to your chart preview. You can expand the data table pane by clicking and dragging the border at the top of the pane.\n  |\n|\n Filter & Sort\n  |\n Shows/hides the\n **Filters & Sorting**\n panes for this chart.\n  |\n|\n Properties\n  |\n Shows/hides Chart Properties available for this chart.\n  |\n|\n Quick Filters\n  |\n Enables you to add Quick Filters to your chart. When you enable a Quick Filter, a pane appears for that filter in this card. Users viewing the card Details view can then quickly enable or disable filters for the card just by toggling the desired filters in the pane. For more information, see\n\nAdding Filters to Your Chart - Applying Quick Filters\n\n.\n  |\n|\n Color Rules\n  |\n Shows/hides the Color Rules dialog for the chart. In this dialog you can set colors on specific columns on a chart. For more information, see\n\nSetting Color Rules for a Chart\n\n.\n  |\n|\n Auto Preview\n  |\n Lets you turn off automatic updating of the chart preview when changes are made, which could provide a faster editing experience, especially for very large cards.\n  |\n|\n Tooltips\n  |\n Shows/hides the Tooltip Fields for the chart.\n  |\n|\n Chart Types\n  |\n Shows/hides the chart type picker for this chart. You can expand the chart picker by clicking and dragging the border on the left side.\n  |\n|\n Annotation\n  |\n Allows you to annotate on an item in the x-axis.\n  |\n|\n Beast Mode\n  |\n Shows/hides the Beast Mode window for this chart. For more information, see\n\nBeast Mode\n\n.\n  |\n|\n Segments\n  |\n Shows/hides the Segments window for this chart. For more information, see\n\nCreating Segments in Analyzer\n\n.\n  |\n|\n YOY\n  |\n Shows/hides period-over-period options for this chart. For more information, see\n\nPeriod-over-Period Charts\n\n.\n  |\n\n|\n|\n Column fields\n  |\n Provide the means for applying DataSet columns to your chart. To apply columns, you drag them from the available columns region on the left side of the Analyzer into the appropriate fields in this area. These fields differ between chart types. For example, for a standard vertical Bar chart,\n **X Axis**\n and\n **Y Axis**\n fields would appear. You would drag a value column into the\n **Y Axis**\n field and a category column into the\n **X Axis**\n field. Your chart preview would then update to show how the chart would look with these columns applied. For more information, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n|\n Show/Hide Toolbar\n  |\n Allows you to show or hide the Toolbar menu.\n  |\n|\n Undo/redo buttons\n  |\n Allow you to undo a previous sequence of actions or redo actions you have undone. All actions in Analyzer are available for Undo and Redo, including applying Filters and Chart Properties, making date changes, changing chart types, etc. Keyboard shortcuts for Undo and Redo on Mac and Windows are also available (Command + Z/Command + Shift +Z , respectively, on Mac, and Ctrl + Z/Ctrl + Y on Windows).\n  |\n|\n Summary number\n  |\n Summarizes the data in the chart. Click the dropdown arrow to open an options menu for configuring the summary number. For more information, see\n\nConfiguring Your Chart Summary Number\n\n.\n  |\n|\n Invite button\n  |\n Lets you share this card with specified team members and invite them to join Domo, all in a single action. If you do not have share access for this card, the button only allows you to invite users, not share the card. For more information, see\n\nInviting Others to Join Domo\n\n.\n  |\n|\n Date filter menu\n  |\n Lets you choose a date range and grain for the data in this chart. If you have selected a Period-over-Period chart type, you can find options for configuring your chart here. For more information, see\n\nPeriod-over-Period Charts\n\n.\n  |\n|\n Save button\n  |\n Lets you save changes you have made to this Visualization card.\n\n\n Clicking\n **Save**\n simply saves changes made to the card. If you click the dropdown arrow to the right of the\n **Save**\n button, a few more options are available, as follows:\n * **Save As**\n . Lets you save your changes as a new card. When you choose this option you are prompted to enter a title and description as well as select the page where the new card should reside.\n* **Save And Comment**\n . Lets you enter a comment about your changes when you save. Your comment is viewable with the revision in the\n\nHistory view of the Details view\n\nfor this Visualization card.\n* **Save and Close**\n . Saves your changes and closes the Analyzer, returning you to the Details view for the card.\n\n\n If you choose\n **Save As**\n or\n **Save and Comment**\n for a card that does not have an alert set on the summary number, you are prompted to set an alert on it now. For more information about setting alerts, see\n\nCreating a Custom Alert for a Visualization Card\n\n.\n  |\n|\n Beast Mode button\n  |\n Lets you transform the data in your chart by creating new columns based on existing columns. For more information, see\n\nBeast Mode\n\n.\n  |\n|\n Segment button\n  |\n Lets you create a dynamic segment to compare your segment against another group. For more information, see\n\nCreating Segments in Analyzer\n\n.\n  |\n|\n Data table\n  |\n Shows you the table of all of the data being used in this chart. This table provides various options for manipulating the data; for example, you can filter rows, apply filters, change aggregations, etc. Any changes you make to the data in the data table are reflected in the chart preview. For more information, see\n\nUnderstanding the Data Table in Analyzer\n\n.\n  |\n|\n Chart Properties\n  |\n Displays Chart Properties available for this chart. You can edit various properties of the chart, such as number and date formatting, the number of value scale divisions, scale labels, and so on. For more information about setting chart properties, see\n\nChart Properties\n\n.\n  |\n|\n Chart preview\n  |\n Shows a preview of your chart. Appears only when all required columns have been applied. You can expand the chart preview pane by clicking and dragging any of the borders on the left, right, or bottom. For more information, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n|\n Data table options\n  |\n Provides additional options for working with the data table, including showing and hiding columns, showing totals, showing raw data or data as it appears in the chart, and opening a full-screen mode. For more information, see\n\nUnderstanding the Data Table in Analyzer\n\n.\n  |\n|\n Chart picker\n  |\n Lets you specify or change the chart type. Chart types are divided into categories. For information about available chart types, see\n\nChart Types\n\n.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924034\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004646\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAnalyzer Layout\n\n", "article_total_view_count": "\n\n\n 5,539\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:18 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "analyzer_layout", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "analyzer", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}