{"file_path": "../../raw_kb_v2\\article\\360043429853\\index.html", "content": {"title": "\n\n\n Properties for Maps\n\n\n", "article_body": "\n\nIntro\n-------\n\nRefer to this topic to find information about chart properties available for Maps and Heat Maps, such as those for configuring color themes, ranges, symbol settings, legends, and so on.\n\n\n**Video - Map Charts**\n\n\n \"General\" Properties\n----------------------\n\nThe properties in the following table are found in the\n **General**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Balanced Distribution\n  |\n Adjusts maps and Heat Maps to include a balanced number of items within each range. This is helpful in spreading values across all ranges when your data contains extreme outliers. In the pair of maps shown in the screenshots at right, the values of most of the Canadian provinces are in the range of 100 to 1500. The outlier, Alberta, has a value of 10,000.\n **Balanced Distribution**\n has not been turned on in the top map, so a skewed version of the data is shown—Alberta appears dark and all of the other provinces appear light. In the bottom map, the user has turned on\n **Balanced Distribution**\n , so Alberta is grouped into the same range as the province with the next highest value.\n  |\n\n\n |\n|\n Auto Zoom to Data\n  |\n Zooms in on the region of your map with data. In the example at right, the only states with data are Utah, Arizona, Colorado, and New Mexico, so the map zooms on them automatically. This option will not work if all of the regions in your map with data are not adjacent. For example, if the map at right showed Oregon as having data, the auto-zoom would not work because Oregon is not adjacent to any of the other states with data.\n  |  |\n|\n Hide No Data Items\n  |\n Hides all items in your map without data. In the example at right, the only states with data are Utah, Arizona, Colorado, and New Mexico, so the map hides all other states. Unlike the \"Auto Zoom to Data\" property, this will work even if there are regions not adjacent to other regions.\n  |  |\n|\n Hide Abbreviated Legend\n  |\n Hides the legend shown at the bottom of maps in some views.\n  |\n —\n  |\n|\n Inner Margin\n  |\n Determines the amount of space, in pixels, that separates the cells in a Heat Map. The example shows a heat map with margins set to\n `8`\n .\n  |\n\n|\n|\n Override Maximum Value\n  |\n Lets you specify the maximum value for a map or Heat Map.\n\n\n By default, Domo uses the highest value in the DataSet as the maximum value. However, by setting this property you can override this value.\n  |\n —\n  |\n\n\"Diverging\" Properties\n------------------------\n\nThe properties in the following table are found in the\n **Diverging**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Show\n  |\n When selected, the map will be shown as a diverging map with 2 sets of color ranges, one above and one below the midpoint.\n  |  |\n|\n Number of Ranges\n  |\n The number of ranges to be displayed either above or below the midpoint. (Maximum is 5)\n  |\n —\n  |\n|\n Midpoint Value Type\n  |\n The type or value to be used as the midpoint. The default value is the median value.\n  |\n —\n  |\n|\n Midpoint Value\n  |\n The value used as the midpoint when the value type is set to \"Manual\".\n  |\n —\n  |\n|\n Show Midpoint Range\n  |\n When set, a range will be displayed for the midpoint value in the legend and chart.\n  |  |\n|\n Midpoint Range Color\n  |\n The color to be used for the range representing the midpoint.\n  |\n —\n  |\n|\n Upper Color Theme\n  |\n The colors used for ranges above the midpoint.\n  |\n —\n  |\n|\n Lower Color Theme\n  |\n The color theme used for the colors below the midpoint.\n  |\n —\n  |\n\n\"Hover Legend\" Properties\n---------------------------\n\nThe properties in the following table are found in the\n **Hover Legend**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Hide Legend\n  |\n Hides the legend that normally appears on the right side of a map in the Details view.\n  |\n —\n  |\n|\n Hide Total\n  |\n Hides the \"Total\" section of the legend that appears on the right side of a map in the Details view. The example shows a map in which this has been done.\n  |  |\n|\n Hide Values\n  |\n Hides the value and percent of total value in the legend that appears on the right side of a map in the Details view. The example shows a map in which this has been done.\n  |  |\n\n\"Data Label Settings\" Properties\n----------------------------------\n\nThe properties in the following table are found in the\n **Data Label Settings**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Text\n  |\n Specifies text for the data labels. This property is the \"on switch\" for data labels—you must specify text for them to appear.\n  |\n —\n  |\n|\n Font Size\n  |\n Allows you to increase or decrease the data label font size. The \"Default\" font size falls between the largest and second-smallest font sizes. For more information, see\n\nChanging the Font Size in Your Chart\n\n.\n  |\n —\n  |\n|\n Text Color\n  |\n Lets you determine the text color for your map data labels. If you select \"Default,\" the color will be automatically determined based on the background color. This is shown in the example at right, in which the data labels on darker areas appear white and those on lighter areas appear dark red.\n  |  |\n|\n Value Abbreviation\n  |\n Determines whether data label values are abbreviated (the default being 3 significant digits) or not.\n  |\n —\n  |\n|\n Fill\n  |\n Lets you add a colored fill to your map data labels. The example at right shows a chart in which a pale blue fill color with 60% transparency has been added.\n  |\n\n|\n|\n Fill Color\n  |\n Lets you specify the color for the fill in your map data labels. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Fill Transparency Percent\n  |\n Lets you specify the fill transparency for map data labels. You can specify any number between 0 and 100, in which 0 is completely opaque and 100 is completely transparent. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n\n\"Hover Text\" Properties\n-------------------------\n\nThe properties in the following table are found in the\n **Hover Text**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Hover Text\n  |\n Lets you set the text that appears in map hovers. A variety of macros for showing map values in your hovers is available. For more information and a list of available macros, see\n\nFormatting Data Label and Hover Text in Your Chart\n\n.\n  |\n —\n  |\n|\n Always Show Over Map\n  |\n Specifies whether hover text specified using the\n **Hover Text**\n option is turned on for your chart.\n  |\n —\n  |\n\n\"Values\" Properties\n---------------------\n\nThe properties in the following table are found in the\n **Values**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Label Format\n  |\n Determines the general number format for hover text and legend items in most maps.\n **Number**\n is the default format; when you select this, numbers appear without currency or percentage symbols. Selecting\n **Currency**\n or\n **Percentage**\n affixes a \"$\" or \"%,\" respectively, to numbers in your hover text and legend items. For currency numbers, you can change the default symbol by specifying the desired symbol in the\n **Currency Symbol**\n field (which is found under\n **Number Format**\n ). You can also specify whether currency symbols appear before or after numbers in the\n **Currency Symbol Position**\n menu (they appear before numbers by default).\n  |\n —\n  |\n|\n Decimal Places\n  |\n Determines the number of decimal places used in decimal values in hover text and legend items in most maps. You can choose from\n **Default**\n ,\n **None**\n , and options for numbers of decimal places (from \".0\" to \".00000\"). By default, Domo automatically determines the optimal number of decimal places for each number in the chart. When you select\n **None**\n , all values are rounded to the nearest whole number.\n  |\n —\n  |\n|\n Negative Numbers\n  |\n Determines the format for negative numbers in hover text and legend items in most maps. If you select\n **-100**\n , all negative numbers have a minus symbol affixed. If you select\n **(100)**\n , all negative numbers are enclosed in parentheses.\n  |\n —\n  |\n\n\"Theme\" Properties\n--------------------\n\nThe properties in the following table are found in the\n **Theme**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Theme\n  |\n Allows you to change the color theme for most maps as well as Heat Maps and calendars. For more information about setting colors, see\n\nChanging the Default Colors in Your Chart\n\n.\n  |\n —\n  |\n\n\"Symbols\" Properties\n----------------------\n\nThe properties in the following table are found in the\n **Symbols**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Symbol Color\n  |\n Allows you to set the color for points in a latitude-longitude map. The default is orange. If your map contains a series column, colors are determined automatically—setting this property in this case has no effect.\n  |\n —\n  |\n|\n Symbol Sizes\n  |\n Determines the relative size for points in a latitude-longitude map. The default is medium.\n  |\n —\n  |\n|\n Symbol Transparency\n  |\n Determines the transparency for points in a latitude-longitude map. You can select any value from \"none\" (totally opaque) to 80% (almost transparent). The default is \"none.\" In the first example at right, the transparency has been set to \"none\"; in the second example, it has been set to 80%.\n  |\n\n\n |\n\n\"Routes\" Properties\n---------------------\n\nThe properties in the following table are found in the\n **Routes**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Symbol Color\n  |\n Allows you to set the color for points and connection lines in a latitude-longitude route map. The default is orange. If your map contains a series column, colors are determined automatically—setting this property in this case has no effect.\n  |\n —\n  |\n|\n Straight Routes\n  |\n When checked, route lines in a latitude-longitude route map appear straight instead of curved (which is the default). In the first example at right, route lines appear curved; in the second example they appear straight.\n  |\n\n\n |\n|\n Symbol Transparency\n  |\n Determines the transparency for connection lines in a latitude-longitude route map. You can select any value from \"none\" (totally opaque) to 80% (almost transparent). The default is \"none.\" In the first example at right, the transparency has been set to \"none\"; in the second example, it has been set to 80%.\n  |\n\n\n |\n\n\"Scale\" Properties\n--------------------\n\nThe properties in the following table are found in the\n **Scale**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Use Log Scale\n  |\n Converts the scale in a latitude-longitude map, latitude-longitude route map, or Heat Map Table into a logarithmic scale.\n  |\n —\n  |\n|\n Independent Column Ranges\n  |\n Causes ranges to be applied separately to each column in a Heat Map Table.\n  |\n —\n  |\n\n\"Legend\" Properties\n---------------------\n\nThe properties in the following table are found in the\n **Legend**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Show Series Total in Legend As\n  |\n Lets you choose whether the series totals in a latitude-longitude map are calculated as totals or averages or do not appear at all. The default is \"Total.\"\n  |\n —\n  |\n\n\"Background\" Properties\n-------------------------\n\nThe properties in the following table are found in the\n **Background**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Color\n  |\n Lets you choose the lightness of the background for Latitude-Longitude and Latitude-Longitude Route Maps. The default is\n **Very Light**\n . The example shows a map in which the background lightness has been set to\n **Very Dark.**\n |\n\n|\n\n\"Ranges\" Properties\n---------------------\n\nThe properties in the following table are found in the\n **Ranges**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Show Zero like No-data\n  |\n Determines whether squares in a Heat Map with a value of 0 display in the same gray color as those squares with no data.\n  |\n —\n  |\n|\n Range 1 Minimum Value...Range 9 Maximum Value\n  |\n Let you customize the ranges in a Heat Map. For each of the nine ranges in the Heat Map, you can enter both a minimum and maximum value. You cannot change the number of ranges in a Heat Map, however.\n  |\n —\n  |\n|\n Range 1 Color...Range 9 Color\n  |\n Lets you specify colors for each range in a Heat Map.\n  |\n\n|\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429853\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004654\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nProperties for Maps\n\n", "article_total_view_count": "\n\n\n 5,087\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:18 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "properties_for_maps", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_properties", "url": "/s/topic/0TO5w000000ZaodGAC"}]}