{"file_path": "../../raw_kb_v2\\article\\5005702805271\\index.html", "content": {"title": "\n\n\n Google Ads Connector Deprecation\n\n\n", "article_body": "\n\n\n###\n What is happening?\n\nGoogle will sunset their Adwords API on April 27\n th\n 2022 in favor of their Google Ads API (\n\nhttps://ads-developers.googleblog.com/2021/04/upgrade-to-google-ads-api-from-adwords.html\n\n). As a result, Domo will deprecate its Google Ads connector (com.domo.connector.adwords.oauth) which relies on The Adwords API. Customers will need to recreate their datasets on a new Google Ads connector that uses the Google Ads API before April 27\n th\n 2022 to continue to import Google Ads data.\n\n##\n How do I know if my datasets are affected?\n\nYour Google Ads datasets are affected if they have the following icon:\n\nYour Google Ads datasets are\n **not**\n affected if they have the following icon:\n\nDatasets using the Google Ads Big Query Service Connector, or the Google Ads Big Query connector are\n **not**\n affected.  These connectors have the following icons:\n\n\n###\n What do I need to do?\n\nIf you do not have an affected dataset, you do not need to take any action.\n\n\n If you have an affected dataset, but you no longer need the dataset, you do not need to take any action. However, you may want to disable the dataset before April 27, 2022 to avoid getting dataset update failure notices.\n\n\n If you have an affected dataset and you need to keep pulling data, you will need to do the following before April 27, 2022:\n\n. Recreate your datasets using the version of the Google Ads connector, located at\n *https://<your\n\ndomo instance>.\n\ndomo.com/appstore/connectors/com.domo.connector.googleads*\n2. Update any assets using the older datasets, such as cards, alerts, Beast Modes and dataflows, to use the new datasets you have created.\n\n\n###\n What’s the difference between the two Google Ads connectors?\n\nThe Google Ads connector found at\n *https://<your\n\ndomo instance>.\n\ndomo.com/appstore/connectors/com.domo.connector.adwords.oauth*\n uses the AdWords API which will be sunsetted on April 27\n th\n 2022.\n\n\n The Google Ads connector found at\n *https://<your\n\ndomo instance>.\n\ndomo.com/appstore/connectors/com.domo.connector.googleads*\n uses the Google Ads API instead.\n\n\n Both Google Ads connectors allow you to pull the same data. However, the available report names and the field names differ between the two APIs. The following page contains a mapping of report and field names between the two APIs:\n\nhttps://developers.google.com/google-ads/api/docs/migration/mapping\n\nYou can use the information on the page above to select the appropriate reports and data fields.\n\n##\n Why do I have to recreate my datasets?\n\nDomo makes every effort to make changes in connectors as a result of API updates transparent to its customers. In this case, the schema of the reports differ enough that we cannot migrate datasets.\n\n##\n What happens if I don't recreate my datasets?\n\nOn April 27, 2022, datasets using the API version that will be sunsetted will start failing with an error indicating that the API is no longer available.\n\n##\n How do I find the appropriate Google Ads connector?\n\nYou can find the appropriate connector in one of two ways:\n\n. Access the connector directly at\n *https://<your\n\ndomo instance>.\n\ndomo.com/appstore/connectors/com.domo.connector.googleads*\n , or\n2. Log in to your instance and navigate to the AppStore. Once there, search for “Google Ads,” and select the tile with the following icon:\n\n##\n How do I know which Google Ads datasets need to be recreated?\n\nDatasets using the version of the connector that will be deprecated will have the following icon:\n\n\n###\n How do I know which assets need to be updated?\n\nDomo provides the following features to help you determine which assets need to be updated or may be impacted:\n\n. Beast Mode Manager (BMM) in the Data Center will allow you to determine which Beast Modes have been saved to a Google Ads dataset that needs to be migrated. To find BMM, navigate to the Data Warehouse in the Data Center, and click on the Beast Mode Manager icon on the left. For more information on using BMM, please click\n\nhere\n\n.\n2. The Data Lineage feature will allow you to see all downstream Cards, DataFlows and Alerts attached to a particular dataset. You can access this feature by going to the “Details” view of any dataset, and clicking on the ‘Overview’ card or the ‘Lineage’ card. For more information on how to use the Data Lineage feature, please click\n\nhere\n\n.\n\n\n###\n How do I get help?\n\nIf you need any assistance recreating your dataset or associating new datasets with existing assets, please contact Domo Support.\n\n\n For a mapping of reports and fields from the old connector to the new one, please visit:\n\nhttps://developers.google.com/google-ads/api/docs/migration/mapping\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 5005702805271\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003188\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Ads Connector Deprecation\n\n", "article_total_view_count": "\n\n\n 4,750\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "google_ads_connector_deprecation", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}