{"file_path": "../../raw_kb_v2\\article\\360042925954\\index.html", "content": {"Title": "Receiving and Viewing Notifications", "Article Body": "Intro\n                       \n\n                        You can be notified when certain events occur in Domo. You can receive Notifications via email or text. These event occurrences include the following:\n                       \n\n\n\n                          A Buzz message is posted to a conversation you are a member of.\n                          \n                          For more information, see\n                          \n                           Chatting in Buzz\n                          \n                          .\n                         \n\n\n\n                          You are mentioned in a Buzz discussion using @ (in which case you become a part of the discussion and continue receiving Notifications for comments in that discussion unless you unfollow the discussion).\n                         \n\n\n\n                          An Alert you have created is triggered. For more information, see\n                          \n                           Creating a Custom Alert for a Visualization Card\n                          \n                          .\n                         \n\n\n\n                          A Domo Daily Alert Summary message is sent to you.\n                         \n\n\n\n                          An issue is reported in a card that you own or that you are following. For more information, see\n                          \n                           Reporting Issues with Cards\n                          \n                          .\n                         \n\n\n\n                          Someone \"likes\" a discussion you started or a comment you made in Buzz.\n                         \n\n\n\n                        In addition, you can view all of your Notifications by clicking your user profile photo in the top right corner of the screen.\n                       \n\n                        Configuring Notifications\n                       \n\n                        You can specify how you receive Notifications for certain events in the Notifications Center. For more information, see\n                        \n                         Configuring Notification and Alert Settings\n                        \n                        .\n                       \n\n\n                         Video - Notifications and Settings in Buzz\n                        \n\n\n\n\n\n\n                        Viewing Notifications\n                       \n\n                        You can view Notifications in your user profile panel. You open this panel by clicking your user profile picture in the top right corner of the screen.\n                       \n\n\n\n\n                        The most recent Notification events appear in the panel. You can open a conversation in Buzz by clicking on its message.\n                       \n\n\n\n\n                        You can see all of your Notifications (sorted by date) in an enlarged view by clicking\n                        \n                         View All\n                        \n                        at the bottom of the panel view.\n                       \n\n\n\n\n                        Unfollowing conversations\n                       \n\n                        You can stop receiving Notifications for conversations you are a member of by unfollowing those conversations in Buzz. This is discussed in more detail in\n                        \n                         Unfollowing a Buzz Conversation\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042925954", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004351", "Archived Date": "", "Language": "English", "Primary Version": "Receiving and Viewing Notifications", "Article Total View Count": "4,802", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Receiving and Viewing Notifications\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Notifications And Alerts\n              \n", "url": "/s/topic/0TO5w000000ZanxGAC"}]}