{"file_path": "../../raw_kb_v2\\article\\360043437773\\index.html", "content": {"Title": "Scheduling Reports", "Article Body": "Intro\n                       \n\n                        Using Domo's Scheduled Reports, you can schedule reports to be sent to users and/or groups at specified intervals. You can set a report schedule for a dashboard or for an individual card on a dashboard. You can send reports to users inside or outside your organization; however, users outside your organization must be in your list of authorized domains. For more information, see\n                        \n                         Specifying Authorized Domains for Invited Users\n                        \n                        .\n                       \n\n                        Users receive scheduled reports via email. Reports for a card include an image of that card; reports for a dashboard include images of all cards on that dashboard. You can select a card image to open the card Details view directly in Domo, or a dashboard image to open that dashboard. The image used for a given card is the same as the \"Large\" view of the card in a dashboard; therefore, any information in a card that does not appear in the dashboard view will likewise not appear in the report version (such as the \"Total\" value that appears in the Details for a Pie graph).\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Card descriptions are not supported in scheduled reports. If a description for a card is enabled, that description does not display in a report for the card or for a dashboard that contains the card.\n                          \n\n\n\n\n                        You can access the Scheduled Reports if you have a default security role of Participant or higher or a custom role with the Export from Domo grant enabled. Participant-level users can only create scheduled reports at the dashboard level; they cannot send single cards as reports. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Domo recommends that you do not schedule reports on cards found on the Overview Page, as this can cause issues when the cards are sent automatically. A best practice is to move the cards from the Overview Page before using them in scheduled reports.\n                            \n\n\n\n\n\n\n\n\n\n\n                          Video - Scheduled Reports Overview\n                         \n\n\n\n\n\n\n\n\n\n                        Caveats\n                       \n\n\n\n                          There is a 10 MB limit on email size for standard Pages and a 5 MB limit on Domo dashboards.\n                         \n\n\n\n                          The following email clients are supported (use of any other email client may or may not result in successful rendering or viewing of Scheduled Reports):\n                         \n\n\n\n                            Any web-based email client (i.e. Gmail, Outlook Web App, etc.)\n                           \n\n\n\n                            Microsoft Outlook\n                           \n\n\n\n                            Apple Mail\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Domo only supports the two most recent non-beta versions of email clients.\n                           \n\n\n\n\n\n                        Parts of the Scheduled Reports edit dialog\n                       \n\n                        In the Scheduled Reports edit dialog, you can schedule reports and specify who receives the report emails. You can also edit settings for a report that has already been scheduled.\n                       \n\n                        The following screenshot shows options in this dialog:\n                       \n\n\n\n\n                        You can use the following table to learn more about these options:\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Schedule controls\n                           \n\n\n\n                            Let you set up an interval at which this report is sent to the users and/or groups you specify. You can choose the frequency for the report (daily, weekly, or monthly), the report start and end date, and other options depending on the frequency.\n                           \n\n                            If you select\n                            \n                             Daily\n                            \n                            , you can specify the time when the report is sent out and can also indicate whether weekends are to be included. Daily times are available only in 15-minute increments (for examples, 9:00, 9:15, 9:30, etc.).\n                           \n\n                            If you select\n                            \n                             Weekly\n                            \n                            , you can choose the days of the week and the daily time on those days when the report is sent out. Daily times are available only in 15-minute increments (for examples, 9:00, 9:15, 9:30, etc.).\n                           \n\n                            If you select\n                            \n                             Monthly\n                            \n                            , you can choose from several different options: the first or last day of the month, specific days of the week, or specific dates during the month. For all options, you can choose the daily time when the report is sent out. Daily times are available only in 15-minute increments (for examples, 9:00, 9:15, 9:30, etc.).\n                           \n\n                            The time zone for reports is UTC-based. For more information about time zones, see\n                            \n                             Time Zone Issues FAQ\n                            \n                            .\n                           \n\n\n\n\n\n                            Send list\n                           \n\n\n\n                            Shows all users and groups who receive this report on the specified schedule. You can remove a user or group by clicking the \"x\" to the right of the name.\n                           \n\n\n\n\n\n                            People/group search\n                           \n\n\n\n                            Lets you add individuals and/or groups to the list of people who receive this report on the specified schedule. By default you can add user email addresses from any domain. If you want to limit the domains from which email addresses can be selected, you can specify those domains in the Admin Settings. For more information, see\n                            \n                             Specifying Authorized Domains for Invited Users\n                            \n                            .\n                           \n\n\n\n\n\n\n                           Attachment control (appears for Cards only)\n                          \n\n\n                            Lets you attach a spreadsheet of the underlying data for a card in CSV format. Note the following when using this option:\n                           \n\n\n\n                              This option is available\n                              \n                               only\n                              \n                              for individual cards, not dashboards.\n                             \n\n\n\n                              Only the actual data used in the card is packaged in the CSV file,\n                              \n                               not\n                              \n                              all of the data in the underlying DataSet.\n                             \n\n\n\n                              The attachment has a file size limit of 5MB.\n                             \n\n\n\n\n\n\n\n                            Enable control\n                           \n\n\n\n                            Lets you enable or disable this report. You can also disable a report in the\n                            \n                             Scheduled Reports\n                            \n                            Page clicking the ellipsis (...) next to the report and selecting\n                            \n                             Disable\n                            \n                            .\n                           \n\n\n\n\n\n                        Scheduling reports\n                       \n\n                        Follow the steps below to schedule reports for cards or dashboards in Domo.\n                       \n\n                        1. Navigate to the card or dashboard you want to schedule a report for.\n                        \n                        2. Do the following depending on the type of report:\n                       \n\n\n\n\n                           Card report\n                          \n\n\n                            a) Hover over the card until\n                            \n\n                             Card options\n                            \n                            displays.\n                           \n\n\n                            b) Select\n                            \n                             Card options\n                            \n                            .\n                            \n                            The card options menu displays.\n                           \n\n\n                            c) Select\n                            \n                             Schedule as Report\n                            \n                            .\n                            \n\n                             The schedule report modal displays.\n                            \n\n\n\n\n\n                           Dashboard report\n                          \n\n\n                            a) Select\n                            \n\n                             Sharing\n                            \n                            in the dashboard app bar.\n                            \n\n\n\n                            The sharing menu displays.\n                            \n                            b) Select\n                            \n                             Schedule as Report\n                            \n\n                             .\n                             \n                             The schedule report modal displays.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        3. (Optional) Enter a subject for the report in the\n                        \n                         Subject\n                        \n                        field. This text is the subject line for the report email. The default subject is\n                        \n                         Card Title\n                        \n                        Report.\n                       \n\n                        4. Select a frequency from the\n                        \n                         Send report\n                        \n                        list. The options are daily, weekly, and monthly.\n                       \n\n                        5. Configure the options for your frequency. In this example, after selecting daily, enter the daily send time and check the box if you want to include weekends.\n                       \n\n                        6. Enter the desired start and end dates in the appropriate fields.\n                       \n\n\n\n\n                        7. In the\n                        \n                         Send to people and groups\n                        \n                        field, enter the name of a user or group to receive the report. The top results for your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n                        \n\n\n\n                        8. Select the name of the user or group from the list.\n                        \n\n                         Note:\n                        \n                        You must select at least one user or group.\n                        \n                        The name of the user or group appears in the field.\n                       \n\n                        9. (Optional) Add additional users or groups to the send list for this report by repeating the previous two steps.\n                       \n\n                        10. (Optional) Remove a user or group from the field by clicking\n                        \n                         X\n                        \n                        beside the name.\n                        \n\n\n\n                        11. Select\n                        \n                         Add.\n                        \n\n                        All users and groups whose names appear in the field display in the send list.\n                       \n\n\n\n\n                        12. (Optional) If you are scheduling a report for a card and you would like to send the underlying data for the card as a CSV attachment, check the box for\n                        \n                         Include a spreadsheet of your data as an attachment (5MB limit)\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           This option is not available for reports for dashboards.\n                          \n\n\n\n\n\n                        For a list of caveats when using this feature, please see the entry for\n                        \n                         Attachment control\n                        \n                        in the table earlier in this article.\n                       \n\n                        13. Select\n                        \n                         Schedule\n                        \n                        .\n                        \n                        The modal closes.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can schedule multiple reports for a given card or dashboard. If you schedule more than one such report, all of the versions of your report are available when you select\n                           \n                            Card options\n                           \n                           >\n                           \n                            Edit Scheduled Reports\n                           \n                           for a card or\n                           \n                            Dashboard options\n                           \n                           >\n                           \n                            Edit Scheduled Reports\n                           \n                           for a dashboard.\n                          \n\n\n\n\n                        Unsubscribing from a report\n                       \n\n                        When you are included in the send list for a scheduled report, you receive emails for that report on the specified schedule until the expiration date for the report is passed. You can unsubscribe from any report that you receive to stop receiving the emails.\n                       \n\n                        Follow these steps to unsubscribe from a scheduled report:\n                       \n\n                        1. Open any report email you have received.\n                       \n\n                        2. Scroll to the \"Why am I getting this report?\" panel at the bottom of the email.\n                        \n\n\n\n\n                        3. Select the linked portion of\n                        \n                         Click to unsubscribe from this report\n                        \n                        .\n                        \n                        A dialog displays confirming that you want to unsubscribe from the report.\n                       \n\n                        4. Select\n                        \n                         Confirm\n                        \n                        in the dialog.\n                        \n\n\n                        A message displays confirming that you are unsubscribed from the report. You will no longer receive emails for this report.\n                        \n\n\n\n                        Managing your scheduled reports\n                       \n\n                        In the Scheduled Reports Page you can see all of the reports you've scheduled and those you receive, along with a history of reports that have been sent, both successfully and unsuccessfully. For any report in the Page, a number of options are available, including viewing the send history; editing the report; or unsubscribing from, disabling, or deleting the report. You can also choose to send the report to everyone in its \"Send\" list now, instead of having to wait for the scheduled time.\n                       \n\n                        The Scheduled Reports Page allows you to manage only those reports you send and receive. In the\n                        \n                         Admin Settings\n                        \n\n                         > Scheduled Reports\n                        \n                        tab you can manage all scheduled reports for your company. You must have an \"Admin\" default security role or a custom role of \"Manage All Company Settings\" to access this tab. For more information about managing reports for your company, see\n                        \n                         Managing all scheduled reports for your company\n                        \n                        . For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n                        Viewing the report history\n                       \n\n                        You can see the send history for an individual scheduled report or for all scheduled reports in your Domo. In this history you can see all reports that have been sent, or you can filter to show reports that have been sent successfully or unsuccessfully. You can view the history for an individual scheduled report only if you are the report owner or you have an \"Admin\" default security role or a custom role of \"Manage All Cards and Pages.\" For more information about default security roles, see\n                        \n                         Security Role Reference\n                        \n                        .\n                       \n\n\n                         To see the history for your reports,\n                        \n\n\n\n\n                          Select\n                          \n                           Scheduled Reports\n                          \n                          in the\n                          \n                           More\n                          \n                          menu at the top of the screen.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            To see the history for all reports, click\n                            \n                             History\n                            \n                            .\n                           \n\n\n\n                            To see the history for an individual report, select\n                            \n\n                             > View History.\n                            \n\n                            The\n                            \n                            menu only appears if you are the report owner or a custom role of \"Manage All Cards and Pages.\"\n                           \n\n\n\n\n\n                        Editing a scheduled report\n                       \n\n                        You can open an existing scheduled report for editing in a number of different ways. You can choose to edit either the report schedule or the actual content of the report.\n                       \n\n                        You can edit the settings for the report if you are the owner of the report or you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n                        Editing the schedule for a report\n                       \n\n                        When you choose to edit the schedule for a report, the edit dialog for the report opens. You can then make changes to the name, schedule, and recipients as described in\n                        \n                         Scheduling a report\n                        \n                        , above.\n                       \n\n\n                         To edit the schedule for a report,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            In the Card Page, select the\n                            \n                             Schedule as a Report\n                            \n                            option for the Card or Page.\n                            \n\n                            Because a scheduled report has already been created for the Card or Page, the edit dialog appears with all of the information already entered in, ready for editing. If no scheduled report had been created, the dialog would appear as a \"blank slate,\" with all of the default options selected. If you select\n                            \n                             Schedule as a Report\n                            \n                            for a Card or Page you do not own, and you do not have an \"Admin\" default security profile or a custom role with \"Manage All Cards and Pages\" enabled, the dialog appears with the default options selected.\n                           \n\n\n\n                            In the Scheduled Reports Page (which you access by selecting\n                            \n                             Scheduled Reports\n                            \n                            in the\n                            \n                             More\n                            \n                            menu at the top of the screen), click the ellipsis (...) for the report you want to edit then select\n                            \n                             Edit Schedule\n                            \n                            .\n                           \n\n\n\n\n\n                          Make your desired edits.\n                          \n                          For more information about report scheduling options, see\n                          \n                           Scheduling a report\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Schedule\n                          \n                          when finished.\n                         \n\n\n\n                        Editing the content for a report\n                       \n\n                        When you choose to edit the content for a report, a special view of the Card Page or Card Details view appears (depending on whether the report is for a Page or Card). In this view you can apply Filters to the Page or Card, just as you could normally. You can then save these changes right to the report. All recipients of the report will then see the content with your Filters applied. However, since the Filters were applied only to the report itself and not to the actual Page or Card, other users viewing the Page or Card cannot see the changes.\n                       \n\n                        The following screenshot shows an example of this special Filter view for a Card called \"Customer Satisfaction.\" Two buttons are unique to this view—\n                        \n                         Save Filters to Report\n                        \n                        and\n                        \n                         Close Report\n                        \n                        . The first button saves Filter changes you have made to this report. The second button closes this view, returning to the regular Details view for the Card.\n                        \n\n\n\n\n\n                        For information about applying Filters to a Page, see\n                        \n                         Filtering Data in a Card Details View\n                        \n                        .\n                       \n\n\n                         To edit the content for a report,\n                        \n\n\n\n\n                          In the Scheduled Reports Page (which you access by selecting\n                          \n                           Scheduled Reports\n                          \n                          in the\n                          \n                           More\n                          \n                          menu at the top of the screen), click the ellipsis (...) for the report you want to edit then select\n                          \n                           Edit Report\n                          \n                          .\n                         \n\n\n\n                          Apply Filters to the Page or Card as desired.\n                         \n\n\n\n                          Click\n                          \n                           Save Filters to Report\n                          \n                          when finished.\n                         \n\n\n\n                          Click\n                          \n                           Close Report\n                          \n                          to close this view.\n                         \n\n\n\n                        Unsubscribing from a scheduled report\n                       \n\n                        When you unsubscribe from a report, you no longer receive emails for that report. However, this does not disable the report for other users; any other subscribed users will continue to receive the report. You can also re-subscribe to a report from which you have unsubscribed.\n                       \n\n\n                         To unsubscribe from a report,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Scheduled Reports.\n                          \n\n\n\n\n                          Click\n                          \n                           Subscribed\n                          \n                          .\n                         \n\n\n\n                          (Optional) To re-subscribe to the report, click\n                          \n                           Subscribe\n                          \n                          .\n                         \n\n\n\n                        You can also unsubscribe from a report in the edit dialog by clicking the\n                        \n                         Enabled\n                        \n                        button at the bottom of the dialog.\n                       \n\n                        Disabling a scheduled report\n                       \n\n                        When you disable a report, that report is disabled for all users in the recipient list. This action does\n                        \n                         not\n                        \n                        remove the scheduled report from Domo. You can disable a report\n                        \n                         only\n                        \n                        if you are the owner of the report or you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n                         To disable a report,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Scheduled Reports.\n                          \n\n\n\n\n                          Select\n                          \n\n                           > Disable\n                          \n                          .\n                          \n                          The\n                          \n                          menu only appears if you are the report owner or you have an \"Admin\" security profile or a custom role with \"Manage All Cards and Pages\" enabled.\n                         \n\n\n\n                        Deleting a scheduled report\n                       \n\n                        Deleting a report removes it from Domo entirely. You can delete a report\n                        \n                         only\n                        \n                        if you are the owner of the report or you have an \"Admin\" security role or a custom role with \"Manage All Cards and Pages\" enabled. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n                         To delete a report,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Scheduled Reports..\n                          \n\n\n\n\n                          Select\n                          \n\n                           > Delete\n                          \n                          .\n                          \n                          The\n                          \n                          menu only appears if you are the report owner or you have an \"Admin\" security profile or a custom role with \"Manage All Cards and Pages\" enabled.\n                         \n\n\n\n                        Sending a scheduled report immediately\n                       \n\n                        You can send a scheduled report to the users in the recipient list immediately instead of having to wait for the scheduled time. You do this in the\n                        \n                         Scheduled Reports\n                        \n                        Page. This option is available\n                        \n                         only\n                        \n                        if you are the owner of the report or you have an \"Admin\" security role or a custom role with \"Manage All Cards and Pages\" enabled. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n                         To send a scheduled report immediately,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Scheduled Reports.\n                          \n\n\n\n\n                          Select\n                          \n\n                           > Send Now\n                          \n                          .\n                          \n                          The\n                          \n                          menu only appears if you are the report owner or you have an \"Admin\" security profile or a custom role with \"Manage All Cards and Pages\" enabled.\n                         \n\n\n\n                        Managing all scheduled reports for your company\n                       \n\n                        In the\n                        \n                         Admin Settings\n                        \n\n                         > Scheduled Reports\n                        \n                        tab you can manage all scheduled reports for your company. You can edit, disable, or delete any schedule version for any report. You can also see the send history for all reports. You can enable or disable the sending of all reports in your company in the\n                        \n                         Settings\n                        \n                        tab using the\n                        \n                         Enable scheduled reports\n                        \n                        toggle. You can also choose to block Scheduled Reports from being sent to external email addresses by disabling the\n                        \n                         Allow scheduled reports for people outside your instance\n                        \n                        toggle.\n                       \n\n\n\n\n                        You must have an \"Admin\" default security role or a custom role with \"Manage All Company Settings\" enabled to access the Scheduled Reports\n                        \n\n                        tab in the Admin Settings. For more information about security roles, see\n                        \n                         Security Role Reference\n                        \n                        .\n                       \n\n                        You can manage your own reports (i.e. those you send as well as those you receive) in the\n                        \n                         Scheduled Reports\n                        \n                        Page in Domo. You do not need Admin-level privileges to access this Page.\n                       \n\n                        For information about the Admin Settings interface, see the\n                        \n                         Admin Settings Overview\n                        \n                        .\n                       \n\n\n\n                          Video - Scheduled Reports Admin Features\n                         \n\n\n\n\n\n\n\n                        Editing a scheduled version of a report\n                       \n\n                        In the\n                        \n                         Admin Settings > Scheduled Reports > Reports\n                        \n                        tab, you can open any schedule version of a report in your company's Domo for editing. You can edit the schedule or recipients, or enable or disable the report version.\n                       \n\n\n                         To edit a scheduled version for a report,\n                        \n\n\n\n\n                          Click\n                          \n                           More\n                          \n\n                           >\n                          \n\n                           Admin\n                          \n                          .\n                          \n                          The Admin Settings appears.\n                         \n\n\n\n                          Click Scheduled Reports.\n                          \n                          The Scheduled Reports panel appears.\n                         \n\n\n\n                          In the list of scheduled reports in the middle pane, locate the report you want to edit and click on it.\n                          \n                          You can do this by scrolling through the list or entering a report name to filter in the\n                          \n                           Search Scheduled Reports\n                          \n                          box.\n                         \n\n\n\n                          In the rightmost pane, locate the schedule version of the report you want to edit.\n                         \n\n\n\n                          In the ellipsis (...) menu, select\n                          \n                           Edit Schedule\n                          \n                          .\n                          \n                          You can also select\n                          \n                           Edit Report\n                          \n                          to open the special Filters view for the report (as described in\n                          \n                           Editing the content for a report\n                          \n                          above).\n                         \n\n\n\n                          Make your desired edits.\n                          \n                          For more information about report scheduling options, see\n                          \n                           Scheduling a report\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Schedule\n                          \n                          (or\n                          \n                           Save Filters to Report/Close Report\n                          \n                          if you chosen to edit the report content).\n                         \n\n\n\n                        Your changes to the schedule version of the report are saved.\n                       \n\n                        Disabling a scheduled version of a report\n                       \n\n                        In the\n                        \n                         Admin Settings >\n                        \n                        Scheduled Reports\n                        \n                         > Reports\n                        \n                        tab, you can disable a schedule version of a report. When you disable a schedule version of a report, that report version is disabled for all users in the recipient list. This action does\n                        \n                         not\n                        \n                        remove the report version from Domo.\n                       \n\n\n                         To disable a scheduled version of a report,\n                        \n\n\n\n\n                          Click\n                          \n                           More\n                          \n\n                           >\n                          \n\n                           Admin\n                          \n                          .\n                          \n                          The Admin Settings appears.\n                         \n\n\n\n                          Click Scheduled Reports.\n                          \n                          The Scheduled Reports panel appears.\n                         \n\n\n\n                          In the list of scheduled reports in the middle pane, locate the report you want to disable and click on it.\n                          \n                          You can do this by scrolling through the list or entering a report name to filter in the\n                          \n                           Search Scheduled Reports\n                          \n                          box.\n                         \n\n\n\n                          In the rightmost pane, locate the schedule version of the report you want to disable.\n                         \n\n\n\n                          Click the ellipsis (...) and select\n                          \n                           Disable\n                          \n                          .\n                         \n\n\n\n                        The schedule version of the report is disabled for all users in the recipient list.\n                       \n\n                        Deleting a scheduled version of a report\n                       \n\n                        In the\n                        \n                         Admin Settings >\n                        \n                        Scheduled Reports\n                        \n                         > Reports\n                        \n                        tab, you can delete a schedule version of a report. Deleting a version of a report removes it from Domo entirely.\n                       \n\n\n                         To delete a scheduled version of a report,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           >\n                          \n\n                           Admin\n                          \n                          .\n                          \n                          The Admin Settings appears.\n                         \n\n\n\n                          Click Scheduled Reports.\n                          \n                          The Scheduled Reports panel appears.\n                         \n\n\n\n                          In the list of scheduled reports in the middle pane, locate the report you want to delete and click on it.\n                          \n                          You can do this by scrolling through the list or entering a report name to filter in the\n                          \n                           Search Scheduled Reports\n                          \n                          box.\n                         \n\n\n\n                          In the rightmost pane, locate the schedule version of the report you want to delete.\n                         \n\n\n\n                          Click the ellipsis (...) and select\n                          \n                           Delete\n                          \n                          .\n                         \n\n\n\n                        The schedule version of the report is deleted from Domo.\n                       \n\n                        Viewing the history for all scheduled reports\n                       \n\n                        In the\n                        \n                         Admin Settings >\n                        \n                        Scheduled Reports\n                        \n                         > History\n                        \n                        tab, you can see the send history for all scheduled reports in your Domo. In this history you can see all reports that have been sent, or you can filter to show reports that have been sent successfully or unsuccessfully.\n                       \n\n\n                         To see the history for your reports,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           >\n                          \n\n                           Admin.\n                          \n\n                          The Admin Settings appears.\n                         \n\n\n\n                          Click Scheduled Reports.\n                          \n                          The Scheduled Reports\n                          \n\n                          panel appears.\n                         \n\n\n\n                          Click the\n                          \n                           History\n                          \n                          tab.\n                          \n                          The send history list appears for all scheduled reports in your Domo. You can filter to show successfully or unsuccessfully sent reports by clicking the\n                          \n                           Successful\n                          \n                          or\n                          \n                           Unsuccessful\n                          \n                          subtab.\n                         \n\n\n\n                        Enabling or disabling all scheduled reports\n                       \n\n                        In the\n                        \n                         Admin Settings >\n                        \n                        Scheduled Reports\n                        \n                         > Settings\n                        \n                        tab, you can enable or disable all scheduled reports in your Domo just by clicking a toggle switch.\n                       \n\n\n                         To enable or disable all scheduled reports in Domo,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           >\n                          \n\n                           Admin.\n                          \n\n                          The Admin Settings appears.\n                         \n\n\n\n                          Click Scheduled Reports.\n                          \n                          The Scheduled Reports\n                          \n\n                          panel appears.\n                         \n\n\n\n                          Click the\n                          \n                           Settings\n                          \n                          tab.\n                         \n\n\n\n                          Click the toggle switch in the upper left corner of the right panel.\n                         \n\n\n\n                        All reports in your Domo are enabled or disabled.", "Preview Article": "Click here to preview", "URL Name": "360043437773", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004263", "Archived Date": "", "Language": "English", "Primary Version": "Scheduling Reports", "Article Total View Count": "7,817", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Scheduling Reports\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Scheduled Reports\n              \n", "url": "/s/topic/0TO5w000000ZaoBGAS"}]}