{"file_path": "../../raw_kb_v2\\article\\360043431293\\index.html", "content": {"title": "\n\n\n Google Ads via Google BigQuery Connector\n\n\n", "article_body": "\n\n*Important:**\n\nDue to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. All pre-existing DataSets will continue to run normally. Current Connectors that rely on Google OAuth authentication will no longer be able to power up new DataSets. These connectors include the following:\n * Google BigQuery\n* Google Ads via Google BigQuery\n* DoubleClick Campaign Manager via Google Cloud Storage (DTV2)\n* Google Cloud Storage\n* Google Contacts\n* Google Drive\n* Google Gmail\n* Google Admin SDK Reports\n\nIf you need to change a pre-existing Google OAuth DataSet, please use the corresponding Service Account connector. The following Service Account connectors are now available:\n\n Google BigQuery Service\n* Google Ads (formerly AdWords) via Google BigQuery Service\n* Google Drive Service\n* Google Cloud Storage Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Admin SDK Reports Service\n\nAll other equivalent Google Service Account connectors are currently in development. Domo will communicate when these connectors become available. You will need to look for the Service Account equivalent connector in Data Center or the App Store and use that connector to get their data.\n\n\n Domo recommends that you proactively repower existing Google connections by creating new DataSets utilizing the new Service Account Key connectors as the connectors become available.  Domo will notify you if any further migration changes should arise.\n\n\n Intro\n-------\n\nGoogle Ads is an online advertising service. Use Domo's Google Ads via BigQuery connector to transfer and pull data from a specific project into Domo. To successfully configure this connector, you must first configure a Google BigQuery script within your Google Ads account. The steps for doing this are provided later in this article.\n\n\n For more information about the Ads API, see\n\nhttps://developers.google.com/adword...s/guides/start\n\n.\n\n\n This topic discusses the fields and menus that are specific to the Google Ads via Google BigQuery connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to Ads data using this connector,\n\nyou must have your Google credentials (email address and password). After you authenticate using your credentials, you must configure a BigQuery script within your Ads account using the script provided in the\n **Details**\n pane for the connector. You must do this\n *before*\n you run the connector.\n\n\n**Notes:**\n\n\n* Do not use a Manager account.\n* Ensure that a project is already set up and Billing is activated for that project. (Note that this may mean you will become subject to other charges based on your BigQuery contract.)\n\n\n###\n Configuring a BigQuery Script in Google Ads\n\nThis section explains how to configure a BigQuery script in Google Ads. After you have configured the script, you should be able to use the connector to pull in data just as you would any other connector.\n\n\n**To configure a BigQuery script in Google Ads,**\n\n. Open the Google Ads via Google BigQuery connector page in Domo.\n2. Authenticate to Google using your Google credentials.\n3. Scroll to the bottom of the\n **Details**\n pane.\n4. Copy the script from the\n **Script**\n box.\n5. Now, sign into your account in Google Ads.\n6. Make sure to switch your account to the\n **Expert Mode**\n by clicking the wrench (\n **Settings**\n ) icon in the top right corner of the screen.\n7. Click the wrench (\n **Tools & Settings**\n ) icon in the top right corner of the screen to expand the menu.\n8. Click\n **Scripts**\n under \"Bulk Actions\".\n9. Click the plus button to create a new script.\n\n10. Provide a name for the script in the \"script name\" area and click\n **Authorize**\n .\n\n11. Select\n **Advanced APIs**\n .\n\n\n 12. Check the\n **Bigquery**\n box and click\n **Save**\n .\n\n13. Now, paste the script you copied in step 4 into the script text box.\n\n*Note:**\n\nScripts make changes on a user's behalf. You must authorize scripts before they can make any changes.\n\n\n 14. Click\n **Preview**\n button at the bottom right corner of the screen.\n\n\n 15. (Conditional) If any error messages appear after you preview, follow their instructions. For example, you may be prompted to click on another link to authorize BigQuery or reauthorize.\n\n\n 16. Click\n **Run**\n when your configuration is successful.\n\n\n 17. Google Ads now takes you to the\n **Script History**\n section where you can view your script details.\n\n18. Now, click on\n **Scripts**\n to switch to the scripts section to set up how often your script runs.\n\n\n 19. Click the pencil icon under \"Frequency.\"\n\n20. Set the schedule for your script.\n\n21. Now, return to the Google Ads via BigQuery connector page in Domo and continue configuring the connector.\n\n\n Connecting to Google Ads via Google BigQuery\n----------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Ads via BigQuery Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google Ads via BigQuery connector uses OAuth to connect to Google. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google Ads via BigQuery accounts in Domo) to open the Google OAuth screen where you can select the account you want to connect to. After selecting an account, specify the password for that account. After you have entered a valid password, you can use the same account in Domo any time you create a Google Ads via BigQuery DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of the currently active Google account.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields and menus you can use to configure your report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Project ID\n  |\n Enter the name of the specific project you want to add your DataSet to. You can find this in your Google Cloud Console in the project info.\n  |\n|\n DataSet ID\n  |\n Enter a name for your DataSet. You can choose any name you want.\n  |\n|\n Report\n  |\n Select the AdWords report type to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account Performance\n  |\n Returns all statistics aggregated by default at the account level.\n  |\n|\n Ad Performance\n  |\n Returns all statistics aggregated at the ad level.\n  |\n|\n Ad Group Performance\n  |\n Returns all statistics aggregated by default at the ad group level.\n  |\n|\n Budget Performance\n  |\n Returns all statistics aggregated by default at the budget level.\n  |\n|\n Keywords Performance\n  |\n Returns all statistics aggregated at the keyword level.\n  |\n|\n Campaign Performance\n  |\n Returns all statistics aggregated by default at the campaign level.\n  |\n|\n Placement Performance\n  |\n Returns all statistics aggregated at the placement level.\n  |\n\n|\n|\n Date Range\n  |\n Select the date range for the data in your report.\n  |\n|\n Fields\n  |\n Check the boxes for all fields you want to import into your report.\n  |\n|\n Segments\n  |\n Check the boxes for all segments you want to import into your report.\n  |\n|\n Script\n  |\n Copy this script and paste it into Google Ads as explained in\n\nConfiguring a BigQuery Script in Google Ads\n\n.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* If the data doesn't seem to be updating, make sure your Google Ads script runs before the connector runs. Otherwise, the same data will be pulled again.\n\nPresentation - Google Sheets vs. BigQuery\n-------------------------------------------\n\nThe following presentation takes you through the differences between pulling Google Ads data using Google Sheets and BigQuery, along with the steps for each:\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431293\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003763\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Ads via Google BigQuery Connector\n\n", "article_total_view_count": "\n\n\n 4,734\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_ads_via_google_bigquery_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}