{"file_path": "../../raw_kb_v2\\article\\360043427393\\index.html", "content": {"title": "\n\n\n Searching in Domo\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can perform a global (Domo-wide) search to locate any of the following:\n\n Pages\n\n(referred to as \"Dashboards\" in the UI) (includes subPages)\n* Cards\n* People\n* Groups\n* DataSets\n\n(searches names as well as row values)\n* DataFlows\n* Connectors\n* Buzz conversations\n\n(including group conversations, public and private channels, message threads, and Card and Page conversations)\n* Available Appstore apps\n* Projects and tasks\n* Alerts\n* Knowledge Base articles\n* Community Forum posts\n* \"Quick Links\" to various Domo tools\n\nYou can also search specifically for Pages and Subpages in the\n **Filter by name**\n field at the top of the left-hand navigation pane.\n\n\n Performing a global search\n----------------------------\n\n\n You can perform a Domo-wide search to locate any of the entities listed above. This is a keyword-specific search, so searching for \"sales\" would return only those items. You can use quotation marks around search terms when you want to search for the term as a whole instead of the individual words. Boolean operators and wildcards are supported.\n\n\n Your search returns only those items that you have sufficient access rights to view. For more information about security roles, see\n\nDefault Security Role Reference\n\n.\n\n\n Search results are usually accompanied by helpful metadata. For example, search results for Cards show you the Card type and the owner and the number of views. Search results for people show you their contact information (if it has been entered in their Profile Page). Clicking a search result usually opens the associated item in Domo. For example, clicking a Buzz message opens the parent conversation in Buzz with that message selected; clicking a Card opens the Card Details view; and so on.\n\n##\n Performing a basic search\n\nTo perform a basic global search in Domo, you simply open the Search interface by clicking the magnifying glass icon\n\nin the toolbar at the top of the screen, then enter your search term into the\n **Search Domo**\n field. All results matching your query are then returned, grouped by category, including Pages, Cards, Buzz, People, DataSets, Groups, etc. The category bar at the top of the screen shows the number of search results within each category. Any categories that do not fit in your category bar can be found in the\n **More**\n menu, on the right side of the bar.\n\n\n###\n Filtering and sorting search results\n\nThere are many ways to filter and sort your search results to better find what you're looking for, including the following:\n\n Filtering on a specific category of search results by clicking the category name under the search bar.\n\n\n In the following example, the user has first entered \"marketing\" as a search term. He then clicks on the\n **People**\n category, which filters the search results to show all people whose title or department includes the keyword \"marketing.\"\n* Choosing a filter from the pane on the left-hand side of the screen.\n\n\n This pane is context-sensitive, meaning options appear depending on the currently selected search category. For example, if you select\n **Buzz**\n as the search category, you get \"Date created\" options for filtering by creation date, along with Buzz-specific filters, including\n **Message from**\n ,\n **Message @mentions**\n ,\n **In conversation**\n , and\n **Conversation type**\n ; you can also specify whether the message contains attachments or links. If the default\n **All Domo**\n category is selected, all filter options are available.\n\n\n Continuing with the previous example, the user wants to filter the search results to show only those individuals with \"Marketing Automation\" in their title. Clicking in the\n **Search job titles**\n field opens a list of marketing-related job titles in your Domo instance. The user locates \"Marketing Automation\" in the list and clicks on it.\n\nThis filters the results to show only \"Lowry Akers\" and \"Jeff Cullimore,\" the two people in the instance with \"Marketing Automation\" in their titles.\n* Sorting the results by selecting a sort option in the dropdown menu above the search results. You can choose to sort by relevance, by newest or oldest creation date, or by newest or oldest updated date. \"Relevance\" in this case returns search results based on how frequently the provided query occurs in a given search result.  In addition, certain fields are deemed more relevant than others (for example, \"User Name\" is considered more relevant than \"User Department\").\n* Combinations of all of the above.\n\n\n###\n Save search results\n\nOnce you have filtered and sorted your search results to better find what you're looking for, you can now save those results and easily come back to your common searches—no matter how complex they are.\n\n. Click the Star icon in the search bar to favorite a filter.\n2. Name the filter and click Save.\n3. It will now display under the Saved Filters section so that you can easily pull up the results.\n\n\n###\n Clearing search results\n\nYou can clear the results of the latest search by clicking\n **Clear search**\n in the left-hand pane.\n\nSearching for a Page or Subpage\n---------------------------------\n\nIn the\n **Filter by name**\n field at the top of the left-hand navigation pane in the\n **Dashboards**\n tab, you can filter to show the desired Page(s) or Subpage(s). You can then click a Page or Subpage to open it. Subpages in search results will include the name of the parent Page or Subpage above them.\n\n*To search for a Page or Subpage,**\n\n. (Conditional) Click\n **Dashboards**\n in the top left corner of Domo if it is not open already.\n2. In the\n **Filter by name**\n field, enter the name of the desired Page or Subpage.\n\n\n The Pages and Subpages matching your query are filtered as you add or remove letters.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043427393\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004341\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSearching in Domo\n\n", "article_total_view_count": "\n\n\n 5,192\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:41 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "searching_in_domo", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "getting_started", "url": "/s/topic/0TO5w000000ZanlGAC"}]}