{"file_path": "../../raw_kb_v2\\article\\360042929734\\index.html", "content": {"title": "\n\n\n Foursquare Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nFoursquare is a local search and discovery\n\n\n service mobile app which provides a personalized local search experience for its users.  To learn more about the Foursquare API, visit their page (\n\nhttps://developer.foursquare.com/\n\n).\n\n\n The Foursquare connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Foursquare account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the Foursquare connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Use this connector to find out what your friends are doing, learn about new places, and check on mayorships and venues.\n  |\n|\n**Primary Metrics**\n |\n Engagements\n  |\n|\n**Primary Company Roles**\n |\n Social media reps\n  |\n|\n**Average Implementation Time**\n |\n ~1 hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\nBest Practices\n----------------\n\nThis connector works best when the update mode is set to \"Replace.\"\n\n\n Prerequisites\n---------------\n\nTo connect to your Foursquare account and create a DataSet, you must have the following:\n\n The email address or phone number you entered when you signed up for Foursquare\n* Your Foursquare password\n\nAlternatively, you can log into your Foursquare account using your Facebook credentials.\n\n\n Connecting to Your Foursquare Account\n---------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Foursquare Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Foursquare connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Foursquare accounts in Domo) to open the Foursquare OAuth screen where you can enter the email address or phone number you entered when you signed up for Foursquare, along with your Foursquare password. You can also connect using Facebook credentials. Once you have entered valid credentials, you can use the same account any time you go to create a new Foursquare DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Foursquare when you connect in Domo, you are authenticated automatically when you click Add account. If you want to connect to an account that is different from the one you are logged into, you must first log out of Foursquare.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select a Foursquare report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Checkins\n  |\n Returns a history of checkins for the authenticated user.\n  |\n|\n Checkin Likes\n  |\n Returns friends and a total count of users who have liked each checkin.\n  |\n|\n Friends\n  |\n Returns a list of the authenticated user's friends.\n  |\n|\n List Followers\n  |\n Returns information about users following a given list.\n  |\n|\n Lists\n  |\n Returns details about lists.\n  |\n|\n List Saves\n  |\n Returns friends and a total count of users who have saved a given list.\n  |\n|\n List Suggest Venues\n  |\n Returns suggested venues for a given list.\n  |\n|\n Mayorships\n  |\n Returns mayorships for the authenticated  user.\n  |\n|\n Next Venues\n  |\n Returns venues that users often check in to after the current venue.\n  |\n|\n Page Updates\n  |\n Returns page update details.\n  |\n|\n Page Venues\n  |\n Returns the venues for a given page.\n  |\n|\n Photos\n  |\n Returns information about photos for the authenticated user.\n  |\n|\n Requests\n  |\n Shows pending friend requests for the authenticated user.\n  |\n|\n Search\n  |\n Returns information for provided names, email addresses, phone numbers, Twitter handles, or Facebook IDs.\n  |\n|\n Specials List\n  |\n Returns a list of available specials.\n  |\n|\n Specials Search\n  |\n Returns a list of specials for a given latitude and longitude.\n  |\n|\n Tips\n  |\n Returns details about tips, including which users have marked a given tip as to-do.\n  |\n|\n Tips Likes\n  |\n Returns friends and a total count of users who have liked a given tip.\n  |\n|\n Tips Listed\n  |\n Returns lists in which a given tip appears.\n  |\n|\n Tips Saves\n  |\n Returns  friends and a total count of users who have saved a given tip.\n  |\n|\n Venue Categories\n  |\n Returns a list of categories applied to venues.\n  |\n|\n Venue Events\n  |\n Returns information about events taking place at a given venue.\n  |\n|\n Venue Explore\n  |\n Returns a list of recommended venues near the location with the provided latitude and longitude.\n  |\n|\n Venue Groups\n  |\n Returns details about a given venue group.\n  |\n|\n Venue Herenow\n  |\n Returns a count of the number of people currently at a given venue.\n  |\n|\n Venue Likes\n  |\n Returns friends and a total count of users who have liked a given venue.\n  |\n|\n Venue Links\n  |\n Returns URLs or identifiers from third parties that have been applied to this venue.\n  |\n|\n Venue Listed\n  |\n Returns lists in which the given venue appears.\n  |\n|\n Venue Menu\n  |\n Returns menu information for a given venue.\n  |\n|\n Venue Photo\n  |\n Returns information about photos for the given venue.\n  |\n|\n Venues\n  |\n Returns details about venues, including location, mayorship, tags, tips, specials, and category.\n  |\n|\n Venue Search\n  |\n Returns venues for a provided latitude and longitude.\n  |\n|\n Venue Similar\n  |\n Returns a list of venues similar to a given venue.\n  |\n|\n Venue Stats\n  |\n Returns venue stats over a given time range.\n  |\n|\n Venue Suggest Completion\n  |\n Returns a list of venues partially matching the search term for a provided latitude and longitude.\n  |\n|\n Venue Tips\n  |\n Returns tips for a given venue.\n  |\n|\n Venue Timeseries\n  |\n Returns daily stats for a given venue for the provided number of days.\n  |\n|\n Venue Trending\n  |\n Returns a list of venues near the provided latitude and longitude with the most people checked in.\n  |\n\n\n |\n|\n Past Days\n  |\n Enter the number of past days of data that should appear in the report. You can use the format\n\nx\n\n,\n\nxday\n\n, or\n\nxdays\n\n, where\n\nx\n\nis a positive integer. Example:\n\n30days\n\n|\n|\n Search By\n  |\n Select the type of query you want to search for.\n  |\n|\n Search Query\n  |\n Enter the query term(s) to search for. If you selected\n **Name**\n in\n **Search By**\n , you can search for a single search string, which may consist of a first name, a last name, or both. For example, you could enter any of the following for the name \"Phil Jones\":\n\nphil\n\n,\n\njones\n\n, or\n\nphil jones\n\nIf you selected any other option in\n **Search By**\n , you may enter multiple search strings using a comma-separated list.\n  |\n|\n Latitude and Longitude\n  |\n Enter the latitude and longitude of the location you want to retrieve data for, separated by commas. Both latitude and longitude must be in signed degrees format:\n\nDDD.dddd\n\n.\n\nExample:\n\n40.63, -111.91\n\n. Compass directions and degree symbols (º) are not allowed.\n  |\n|\n Query\n  |\n Enter a title to search for. The query must be at least three letters long.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Rate Limits\n-------------\n\n\n* 5,000 userless requests per hour for venues\n* 500 userless requests to most other endpoints per hour\n* 500 authenticated requests per hour per OAuth token\n\nFAQs\n------\n\n\n####\n Do I need a certain kind of account with the data service to set up the connector?\n\nNo. A standard FourSquare account is all this required to power up the connector.\n\n###\n How often can the data be updated?\n\nDataSets should be set to update once a day.\n\n###\n Are there any API limits I should be aware of?\n\nEach authenticated user may make up to 500 requests per hour. Note that a single run of a DataSet may require making multiple requests. Domo as a whole may make up to 100,000 requests per day.\n\n\n Troubleshooting\n-----------------\n\nIf the connector returns an error, make sure to read the error description as well as check the authentication and report configuration.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929734\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003483\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFoursquare Connector\n\n", "article_total_view_count": "\n\n\n 4,643\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "foursquare_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}