{"file_path": "../../raw_kb_v2\\article\\360043440433\\index.html", "content": {"title": "\n\n\n Updating Google Analytics Tracking for a Training App\n\n\n", "article_body": "\n\nIntro\n-------\n\nIf you have been using Google Analytics to track user data produced by CourseBuilder training apps, and if the data you’re tracking includes personally identifiable information (PII), such as user name and/or email, you will need to take the following steps to both remove PII data from Google Analytics and also avoid breaking cards using PII data that you’ve already created in Domo using the Google Analytics connector reports associated with your CourseBuilder training apps.\n\n\n Part 1: Delete Training Apps in Your Instance That Are Using the Google Analytics Tracking ID Pulling PII\n-----------------------------------------------------------------------------------------------------------\n\nThe purpose of Part 1 is to help make sure that there are no gaps in the data you’re tracking for your training app(s). Here’s why you need to take the following steps. Because the existing Google Analytics app ID(s) attached to your app(s) may be tracking PII, you will want to stop that from happening as soon as possible. Later on in this article/tutorial, you’ll be asked to (1) create a new Google Analytics tracking ID for your CourseBuilder app(s) that does not track PII, (2) add this new ID to your app(s) in CourseBuilder, and then (3) republish and replace any app(s) in your instance that were using the old ID with the apps that are using the new ID.\n\n\n Before you do this, however, you need make sure you don’t lose data on users taking your training app. In each case where you have a training app live in your Domo instance, you have a couple of options on what to do to ensure there are no gaps in your user data. Whichever option you choose, it is essential that you remove users’ ability to access the CourseBuilder app(s) until you have uploaded a new version of the app(s) that include an updated Google Analytics tracking ID:\n\n\n**Option 1**\n : Pick a time of day when users are least likely to be engaging with your training apps and simply delete the app card(s) and then replace it with a Notebook card that says something like “Training app updates are in progress. Stay tuned for updates.”\n\n\n**Option 2**\n : Temporarily rescind access rights for all users except yourself to the CourseBuilder app(s) or the pages where they reside in your instance, and then delete and replace the app(s) later after you’ve completed all of the following instructions in this article.\n\n\n Part 2: Use the DomoStats Connector to Create “PeopleStats” DataSet\n---------------------------------------------------------------------\n\nThe purpose of Part 2 is to create a DataSet that contains User IDs aligned with Name, Title, Email, and other Domo user info. Creating this DataSet will enable you to create a DataFlow with your Google Analytics DataSet that will provide you with User ID, User Name, Email, etc.\n\n*Note:**\n\nYou will need to have an Admin security profile in your Domo instance if you plan to create the PeopleStats DataSet yourself from the DomoStats Connector. Otherwise, you will need to ask your MajorDomo or Domo administrator to create this DataSet and then gain their permission to access it.\n\n\n You will need this DataSet and, eventually, a DataFlow because your Google Analytics DataSets/reports will no longer include User Name and User Email dimensions. Here are the steps for creating the “PeopleStats” DataSet that you’ll need:\n\n. Go to the Data Center, select Cloud Data Connectors, then find and select the DomoStats Connector, and then select\n **Get the data**\n .\n2. In the connector set-up page, do the following:\n\n* Under Details, select\n\t **People**\n\t .\n\t* Under Scheduling, choose your own schedule. If you are not adding people very often, consier extending the time between updates. Not that you may only have the option to select \"every day.\"\n\t* Under Name & Describe Your Dataset, choose a descriptive DataSet name such as \"PeopleStats\\_[Your Initials]\". Don't forget to add a description, for example \"DataSet connecting User ID to User Name, Email, etc\"\n\t* Select\n\t **Save**\n\t .\n3. If your DataSet does not automatically run based on the Schedule you chose, run it manually by clicking the settings menu and selecting\n **Run Now**\n .\n\nPart 3: Export Historic Google Analytics DataSet(s)\n-----------------------------------------------------\n\nThe purpose of Part 3 is to create a backup of all data you are currently using to power cards based on Google Analytics data or data you wish to keep for future use that include PII data. As for why this is needed, if a Google Analytics tracking ID (also called a Property) has already been tracking PII, the only way to remove this PII from Google Analytics is to delete the Google Analytics tracking ID/Property (at least, this is the only option for deleting this information if you are using a free Google Analytics account).\n\n\n Thus, to both remove PII Google Analytics and avoid losing the data you’ve been collecting in association with that Google Analytics ID, you will need to create a static backup DataSet that retains all of the information you’ve been tracking with that ID. Then, after you create a new Google Analytics tracking ID or property number for your app(s) that doesn’t include PII, you can join any new DataSets or reports pulling from the new Google Analytics tracking ID with your historical Google Analytics data as well as the PeopleStats DataSet.\n\n\n To create this historic Google Analytics DataSet, you must take the following steps for every existing Google Analytics ID and Google Analytics report that you’ve created in association with training apps that track PII:\n\n. If you haven't already, use the Google Analytics Connector to pull a report or reports on your training app that include all of the dimensions and metrics you've been tracking with the Google Analytics tracking ID or Property.\n2. Locate your Google Analytics DataSet(s) or report(s) by going to the Data Center and then searching for it in the DataSets tab. You can add a \"Type\" filter to your search that will return all DataSets/reports pulled from Google Analytics that you have access to.\n3. Go to the Setting menu and select\n **Export**\n . Then choose either\n **Excel**\n or\n **CSV**\n .\n\n\n**Note**\n**:**\n\nYou will need to have an Admin security profile in your Domo instance if you plan to create the PeopleStats DataSet yourself from the DomoStats Connector. Otherwise, you will need to ask your MajorDomo or Domo administrator to create this DataSet and then gain their permission to access it.\n\n\n Part 4: Import the Historic Google Analytics Data into Domo to Create a Historic Google Analytics DataSet\n-----------------------------------------------------------------------------------------------------------\n\nThe purpose of Part 4 is to import the historic Google Analytics data into a new Domo DataSet, which will enable you to maintain the history of any data powering cards in connection with the CourseBuilder apps you’ve created and allow you to append new data to that historical data.\n\n\n Users must take the following steps for every existing Google Analytics ID they’ve created and every historical report they’ve exported from Google Analytics reports that include PII:\n\n. Go to the Data Center, select\n **File**\n , select the\n **File Upload Connector**\n , and then select\n **Get the Data**\n .\n2. In the connector set-up page, do the following:\n\n* Under Details, browse for and add your historic data file that you exported in Part 3.\n\t* Under Select tables, preview your data and modify options if necessary.\n\t* Under Preview, double check to see if everything looks right.\n\t* Under Update Mode, set your update preferences.\n\t* Under Name & Describe Your DataSet, choose a descriptive DataSet name, such as \"HistoricGoogleAnalytics\\_[Your Initials]\". Don't forget to add a description, for example \"DataSet containing all Google Analytics data prior to July 15, 2018.\"\n\t* Select\n\t **Save**\n\t .\n\nPart 5: Make and Apply a New Google Analytics ID\n--------------------------------------------------\n\nThe purpose of Part 5 is to create a new Google Analytics ID for your training app(s) that will contain no personally identifying information. Note that if you have been using a unique Google Analytics tracking ID or property for each individual training app you’ve created, you can start using one ID for all of your apps, if you would prefer. The reason for this is that CourseBuilder enables you to track the App Name of each app. Thus, if you want to create separate reports/DataSets or cards for individual training apps, you can do so in Domo using filtering options.\n\n\n See our\n\n\n Setting Up Google Analytics Tracking on a Training App\n\n\n article to complete the steps involved in setting up a new Google Analytics tracking ID or property as well as the needed Custom Dimensions that you’ll need to add to that property for each of your CourseBuilder training apps.\n\n\n Part 6: Create New Google Analytics Report(s) from Your New Google Analytics Tracking ID(s)\n---------------------------------------------------------------------------------------------\n\nThe purpose of Part 6 is to create a new report or DataSet in Domo from the new Google Analytics tracking ID associated with your training app data, which you can later join with both the historical GoogleAnalytics DataSet(s) that you were using previously as well as the PeopleStats DataSet that you should have created already. Take the following steps outlined\n\n\n in this article\n\n\n for each of the Google Analytics reports you’d like pull into Domo that are attached to the new Google Analytics tracking ID(s) for each of your CourseBuilder training apps.\n\n\n Part 7: Creating a new DataFlow to Combine Historic and Future Google Analytics Data\n--------------------------------------------------------------------------------------\n\nThe purpose of Part 7 is to append the new Google Analytics data to the historic Google Analytics data and join the DomoStats user data to the both the new and historic Google Analytics DataSets to create a new DataSet to power your cards related to tracking CourseBuilder app user behaviors in your Domo instance. Complete the following steps to accomplish this task:\n\n. Go to the Data Center and select\n **ETL**\n .\n2. Select two Input DataSet icons (or more if you want to join multiple historic and new Google Analytics DataSets into one DataSet).\n\n* Select the first Input DataSet icon, designate the \"HistoricGoogleAnalytics\\_[Your Initials]\" DataSet.\n\t* For the second Input DataSet icon, designate the \"GoogleAnalyticsforTrainingApps\\_[Your Initials]\" DataSet.\n3. Under the Combine Data tab, select and drag out an Append Rows icon.\n4. Connect all fo the Input DataSets icons to the Append Rows icon.\n5. Append rows by doing the following:\n\n* (1) Select the input \"Include all columns\". You will see that one column will be removed (\"Customer Batch ID\"), which is okay.\n\t* Select\n\t **Done**\n\t .\n6. Under the Combine Data tab, select and drag out a Join Data icon onto the canvas.\n7. Select an Input DataSet icon and drag it onto the canvas after the Append Rows icon.\n\n* Designate the \"PeopleStats\" DataSet.\n8. Connect the Append Rows icon and the \"PeopleStats\" DataSet to the Join Data icon.\n9. Join the data by doing the following:\n\n* (1) Select input \"Append Rows\"\n\t* (1) Select identifying column \"User Email\"\n\t* (2) Select input \"PeopleStats\"\n\t* (2) Select identifying column \"Email\"\n\t* Select\n\t **Match Another Column**\n\t* (1) Select identifying column \"User ID\"\n\t* (2) Select identifying column \"User ID\"\n\t* With the Join icon, select \"Left Outer\"\n\t* Select\n\t **Done**\n\t .\n10. Select an Output DataSet icon and drag it onto the canvas.\n11. Connect the Join Data icon to the Output DataSet icon.\n12. Choose a descriptive name for the DataSet, such as \"GoogleAnalyticswithUserInfo\\_[Your Initials]\", and copy and paste this DataSet name to the DataFlow name field. Your DataFlow won't run until both of these fields have a name.\n13. Add a description as well. For example, you could type something like \"Google Analytics data joined with user data. Includes static historic data prior to July 15, 2018 and live data thereafter.\"\n14. Select\n **Save and Run**\n .\n\nAssuming everything has been set up correctly, the DataFlow should run successfully. If it doesn’t, please review the above steps to ensure you’ve followed each of them as best as you can.\n\n\n Part 8: Update Existing Cards with the New Output DataSet Produced by the ETL DataFlow\n----------------------------------------------------------------------------------------\n\nThe purpose of Part 8 is to repair any existing cards that may have been pulling User Name or User Email from Google Analytics reports/DataSets you’d previously created. The goal is to make sure all of the cards you’ve created continue to be powered by live data on CourseBuilder app user behavior in your Domo instance. The difference is that these cards will now be pulling data from the Output DataSet you just created instead of the Google Analytics report you were using previously to power these cards. Take the following steps:\n\n. Open any cards that were or are currently powered by Google Analytics DataSets that included PII data in Analyzer.\n2. In the top left corner of the Analyzer view, under Data, select the existing DataSet powering the card and then search for and select the output DataSet (for example, “GoogleAnalyticswithUserInfo\\_[Your Initials]”) that you just created in Part 7 above.\n3. At this point, your card might show that it’s missing the needed dimensions because the dimension titles used in the Google Analytics DataSet “User Email” and “User Name,” whereas the dimension names in the new DataSet are labeled “Email” and “Display Name”. Simply drag these new dimensions from the Dimensions column over to the appropriate fields for the card, and the card should work again as expected.\n\nPart 9: Deleting all Old Google Analytics IDs\n-----------------------------------------------\n\nThe purpose of Part 9 is to help you ensure that all Google Analytics tracking IDs you’ve been using that are or were tracking PII (personally identifiable information) in relation to your CourseBuilder training app(s) are  completely removed or deleted from your Google Analytics account.  Please take the following steps to ensure this takes place:\n\n. Log into your Google Analytics account and select the Admin tab in the bottom left corner of the page.\n2. Find and select the account and then the property (or Google Analytics tracking ID) that you want to delete) from the dropdown list.\n3. Select Property Settings.\n4. In the top right corner of this view, select\n **Move to Trash Can**\n .\n\n\n**Note**\n\n:*\n\nYour property will be permanently deleted after 35 days from the point you put it into the Trash Can.\n\nRepeat the above steps for each tracking ID associated with CourseBuilder training apps that also contain PII.\n\n\n Part 10: Confirm That All of the CourseBuilder Apps/Cards in Your Instance Have Been Replaced with the New Apps\n-----------------------------------------------------------------------------------------------------------------\n\nThis final stage is simply to help you ensure that you’ve found and replaced all CourseBuilder apps/cards in your instance that are or were using Google Analytics tracking IDs associated with PII with apps/cards that are no longer tracking PII. In Part 1 of this tutorial, you were asked to delete or remove access to CourseBuilder apps that were set up to track PII. If you haven’t already, now is the time to publish and place the new apps with new tracking ID(s) in all the relevant locations within your Domo instance.\n\n\n Once you’ve completed this step, you should be all set!\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043440433\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004493\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUpdating Google Analytics Tracking for a Training App\n\n", "article_total_view_count": "\n\n\n 4,723\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "updating_google_analytics_tracking_for_a_training_app", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "training", "url": "/s/topic/0TO5w000000ZamyGAC"}, {"text": "selfservice_training", "url": "/s/topic/0TO5w000000ZaoCGAS"}, {"text": "coursebuilder_14", "url": "/s/topic/0TO5w000000ZaogGAC"}]}