{"file_path": "../../raw_kb_v2\\article\\4416224124439\\index.html", "content": {"title": "\n\n\n Social Studio Connector\n\n\n", "article_body": "\n\nThe Social Studio API is a REST-ful web service for retrieving, analyzing, and modifying social media data contained in your Social Studio Account. It is a one-stop solution to manage, schedule, create, and monitor posts. Social Studio offers powerful real-time publishing and engagement. Having a clear view of your social account performance is always essential. With Domo’s Social Studio Connector, you can easily monitor the key social metrics across your social studio account.\n\n\n Use this Connector to monitor and manage different media types, posts, keywords, profiles, contents, filters, workspaces, and much more, and quickly determine your social account’s strengths, weaknesses, and opportunities.\n\n\n To learn about the Social Studio API, see\n\nhttps://developer.salesforce.com/docs/atlas.en-us.api\\_social.meta/api\\_social/1-introduction-to-the-social-studio-marketing-cloud.htm\n\n.\n\n\n The Social Studio Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Social Studio account in the Data Center.  This topic discusses the fields and menus that are specific to the Social Studio Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Social Studio account and create a DataSet, you must have the following:\n\n The username and password for your Social Studio account.\n* The API key and API secret associated with your Social Studio account.\n\nConnecting to Your Social Studio Account\n------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the Social Studio Connector page. The components of the other panes in this page,\n\n\n**Scheduling**\n\n\n and\n\n\n**Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your\n\nSocial Studio\n\naccount. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into your Social Studio account.\n  |\n|\n Password\n  |\n Enter your Social Studio password.\n  |\n|\n API Key\n  |\n Enter the API key associated with your Social Studio account.\n  |\n|\n API Secret\n  |\n Enter the API secret associated with your Social Studio account.\n  |\n\nOnce you have entered valid Social Studio credentials, you can use the same account any time you go to create a new Social Studio DataSet. You can manage Connector accounts in the\n\n\n**Accounts**\n\n\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n\n\n**Reports**\n\n\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Social Studio report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Approval Rules\n  |\n Retrieves one or more approval rules for a workspace.\n  |\n|\n Case\n  |\n Retrieves a collection of cases.\n  |\n|\n Client\n  |\n Retrieves the Social Studio organization of the company. Currently, this call returns only the client for the authenticated user.\n  |\n|\n Imported Posts\n  |\n Retrieves posts and their metrics imported to a workspace.\n  |\n|\n Keyword Groups\n  |\n Returns a specified keyword group from a workspace.\n  |\n|\n Languages\n  |\n Retrieves information about all languages available when managing your topic profile.\n  |\n|\n Macros\n  |\n Retrieves all macros within a Social Studio organization. This macro can contain several different actions within the JSON payload, indicating actions to perform when the macro receives an execute call.\n  |\n|\n Media Type\n  |\n Retrieves a collection of media types on supplied parameters.\n  |\n|\n Posts\n  |\n Retrieves post data from available broad listening topic profiles and social accounts.\n  |\n|\n Publish Profiles\n  |\n Retrieves publish macros in the Social Studio organization.\n  |\n|\n Regions\n  |\n Retrieves information about all regions available when managing your topic profile.\n  |\n|\n Salesforce Organizations\n  |\n Returns information on all Salesforce organizations registered within the tenant for the user executing the call.\n  |\n|\n Shared Content\n  |\n Retrieves content available for use within a workspace.\n  |\n|\n Short Url\n  |\n Returns Bitly accounts within a workspace.\n  |\n|\n Source Filters\n  |\n Returns all source groups available to the authenticated users.\n  |\n|\n Source Filter Queries\n  |\n Returns all source filter queries associated with a social filter.\n  |\n|\n Social Properties\n  |\n Retrieves social properties the user can access. This object contains information about a managed account topic profile and associated external user account.\n  |\n|\n Topic Profiles\n  |\n Retrieves specific details on topic profiles based on user permissions and role.\n  |\n|\n Users\n  |\n Retrieves information for all users within an account.\n  |\n|\n Workspace\n  |\n Retrieves a paginated list of workspaces within the Social Studio organization.\n  |\n\n|\n|\n Owner ID\n  |\n Enter the Owner ID.\n  |\n|\n Owner Type\n  |\n Enter the Owner Type.\n  |\n|\n Include\n  |\n Select a metric to include the additional information on the workflow.\n  |\n|\n Workspace\n  |\n Select the workspace.\n  |\n|\n Network\n  |\n Select the social network for post.\n  |\n|\n Keyword Group ID\n  |\n Select the keyword group ID.\n  |\n|\n Topic ID\n  |\n Select the topic ID.\n  |\n|\n Priority\n  |\n Select the priority.\n  |\n|\n Sentiment\n  |\n Select the sentiment.\n  |\n|\n Filter\n  |\n Select the filter.\n  |\n|\n Search Characters\n  |\n Enter the characters to search for in the title. A string should contain minimum 3 characters.\n  |\n|\n Select the source filter id.\n  |\n Select the source filter ID.\n  |\n|\n Types\n  |\n Select the social network types.\n  |\n|\n Views\n  |\n Select the view.\n  |\n|\n Status\n  |\n Select the status of topic profile to return.\n  |\n|\n Enabled\n  |\n Select 'True' to only retrieve active users; otherwise, select 'False'.\n  |\n|\n Visibility\n  |\n Specify whether a workspace is visible to all users or private users.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What endpoint is the base URL for this Connector?\n\nThe base URL for the Social Studio Connector is\n\nhttps://api.socialstudio.radian6.com/\n\n.\n\n###\n Which endpoint does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n Approval Rules\n  |\n /v1/approvalflows\n  |\n|\n Case\n  |\n /v1/cases\n  |\n|\n Client\n  |\n /v3/client\n  |\n|\n Imported Posts\n  |\n /v1/importedposts\n  |\n|\n Keyword Groups\n  |\n /v3/keywordGroups/{ID}\n  |\n|\n Languages\n  |\n /v3/languages\n  |\n|\n Macros\n  |\n /v3/macros\n  |\n|\n Media Type\n  |\n /v3/mediaTypes\n  |\n|\n Posts\n  |\n /v3/posts\n  |\n|\n Publish Profiles\n  |\n /v3/publishprofiles\n  |\n|\n Regions\n  |\n /v3/regions\n  |\n|\n Salesforce Organizations\n  |\n /v3/salesforceOrganizations\n  |\n|\n Shared Content\n  |\n /v1/clips\n  |\n|\n Short Url\n  |\n /v1/shorturls\n  |\n|\n Source Filters\n  |\n /v3/sourceFilters\n  |\n|\n Source Filter Queries\n  |\n /v3/sourceFilters/{ID}/sourceFilterQueries\n  |\n|\n Social Properties\n  |\n /v3/socialProperties\n  |\n|\n Topic Profiles\n  |\n /v3/topics\n  |\n|\n Users\n  |\n /v3/users\n  |\n|\n Workspace\n  |\n /v1/workspaces\n  |\n\n\n####\n What kind of credentials do I need to power up the Social Studio Connector?\n\nYou need the username, password, API key, and API secret associated with your Social Studio account.\n\n###\n How frequently will my data update?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n###\n Can I use the same account to create multiple datasets?\n\nYes\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4416224124439\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003203\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSocial Studio Connector\n\n", "article_total_view_count": "\n\n\n 2,387\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "social_studio_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}