{"file_path": "../../raw_kb_v2\\article\\360042926594\\index.html", "content": {"Title": "Constant Contact Connector", "Article Body": "Intro\n                       \n\n                        Constant Contact offers web-based email marketing services.   To learn more about the Constant Contact API, visit their page (\n                        \n                         https://developer.constantcontact.co...ion-index.html\n                        \n                        ).\n                       \n\n                        You connect to your Constant Contact account in the Data Center. This topic discusses the fields and menus that are specific to the Constant Contact connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Constant Contact account and create a DataSet, you must have your Constant Contact username and password.\n                       \n\n                        Connecting to Your Constant Contact Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Constant Contact Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Constant Contact connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Constant Contact accounts in Domo) to open the Constant Contact OAuth screen where you can enter your Constant Contact username and password. Once you have entered valid Constant Contact credentials, you can use the same account any time you go to create a new Constant Contact DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a menu from which you select your desired report type, along with various options for configuring your report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Constant Contact report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Contact Action Summary\n                               \n\n\n\n                                Returns a list of the recent emails sent to a specific contact and a summary of the actions the contact took on that email for the most recent 200 campaigns.\n                               \n\n\n\n\n\n                                Contact Activity Details\n                               \n\n\n\n                                Returns the tracking activity data for a given account and contact.\n                               \n\n\n\n\n\n                                Contact Lists\n                               \n\n\n\n                                Returns a list of contact lists in your account.\n                               \n\n\n\n\n\n                                Contacts\n                               \n\n\n\n                                Returns all contacts in your account.\n                               \n\n\n\n\n                               Email Campaigns\n                              \n\n                               Returns all email campaigns in user's account.\n                              \n\n\n\n\n\n\n\n\n                            Contact ID\n                           \n\n\n\n                            Select the contact you want to retrieve information for.\n                           \n\n\n\n\n\n                            Contact Status\n                           \n\n\n\n                            Select the status you want to filter your report data by.\n                           \n\n\n\n\n\n                            Include Subresource?\n                           \n\n\n\n                            Select whether you want to include subresources in your report.\n                           \n\n\n\n\n\n                            Tracking Activity Types\n                           \n\n\n\n                            Select the tracking activity types you want to retrieve data for.\n                           \n\n\n\n\n\n                            Updated After Date\n                           \n\n\n\n                            Select a date. The report will return all data updated after this date.\n                           \n\n\n\n\n\n                            Updated Days Back\n                           \n\n\n\n                            Enter a relative number of days back. Every time the report runs, it will return all data updated after this relative number of days. For example, if you entered\n                            \n                             7\n                            \n                            , each time the report ran it would pull data updated within the last 7 days.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQs\n                       \n\n                        What version of the Constant Contact API does this connector use?\n                       \n\n                        This connector uses version 3 of the Constant Contact API (\n                        \n                         https://api.cc.email/v3\n                        \n                        ).\n                       \n\n                        What endpoint does each report call in this connector?\n                       \n\n\n\n\n                           Report Name\n                          \n\n                           Endpoint URL\n                          \n\n\n\n\n\n                           Contact Action Summary\n                          \n\n\n                            /reports/contact_reports/{contactId}/activity_summary\n                           \n\n\n\n\n                           Contact Activity Details\n                          \n\n\n                            /reports/contact_reports/{contactId}/activity_details\n                           \n\n\n\n\n                           Contact Lists\n                          \n\n\n                            /contact_lists\n                           \n\n\n\n\n                           Contacts\n                          \n\n\n                            /contacts\n                           \n\n\n\n\n\n                            Email Campaigns\n                           \n\n\n\n\n                             /emails\n                            \n\n\n\n\n\n\n                        How do I know my Constant Contact credentials are secure?\n                       \n\n                        The login process uses the OAuth process, so your Constant Contact credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n                       \n\n                        Can I use the same account to create multiple DataSets?\n                       \n\n                        Yes.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        As often as needed.\n                       \n\n                        Are there any API limits I should be aware of?\n                       \n\n                        If the API reaches the daily call limit, the API key will not be able to make calls until 12:00 am the next day.", "Preview Article": "Click here to preview", "URL Name": "360042926594", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003791", "Archived Date": "", "Language": "English", "Primary Version": "Constant Contact Connector", "Article Total View Count": "4,665", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Constant Contact Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}