{"file_path": "../../raw_kb_v2\\article\\360042923774\\index.html", "content": {"Title": "Linking Related Cards", "Article Body": "In any card Details view, you can add links to related cards. You add a link using the\n                        \n                         Link Related Card\n                        \n                        option, which is located under the card content. When you add a link, a corresponding link back to the current card is also added automatically to the linked card. You can add links to as many cards as you want. Links to related cards appear in the card Details view as a thumbnail image of the linked card.\n                       \n\n\n\n\n\n                         To add a link to another card,\n                        \n\n\n\n\n                          In the Details view of a card, click\n                          \n                           Link Related Card\n                          \n                          .\n                         \n\n\n\n                          In the list of cards, locate and select the card you want to link to. You can locate a card either by scrolling the list or entering the name of the card in the search bar.\n                          \n                          A link to the card is added to this Details view, along with a thumbnail image of the card. A corresponding link to this card is also added to the card Details view you linked to.\n                         \n\n\n\n                          (Optional) Add another link.\n                         \n\n\n\n                        You can also remove a card link from a Details view.\n                       \n\n\n                         To remove a link to another card,\n                        \n\n\n\n                         Mouse over the thumbnail image.\n                        \n\n                         Click the\n                         \n                         icon.", "Preview Article": "Click here to preview", "URL Name": "360042923774", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004096", "Archived Date": "", "Language": "English", "Primary Version": "Linking Related Cards", "Article Total View Count": "4,988", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Linking Related Cards\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Card And Dashboard Management\n              \n", "url": "/s/topic/0TO5w000000ZanDGAS"}]}