{"file_path": "../../raw_kb_v2\\article\\360043439613\\index.html", "content": {"Title": "October 2016 Release Notes", "Article Body": "Note:\n                           \n                           These features will be turned on for all instances on or before October 25, 2016.\n                          \n\n\n\n\n\n                         New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Domo PowerPoint Plugin\n                       \n\n                        Use the Domo PowerPoint plugin to pull Domo cards into a PowerPoint presentation. This plugin provides much more power and flexibility than the other available methods for showing cards in PowerPoint. You can download this plugin in\n                        \n                         Admin > Tool Downloads\n                        \n                        .\n                       \n\n                        Using this plugin, you can do all of the following:\n                       \n\n\n\n                          Connect to the server for the desired Domo instance.\n                         \n\n\n\n                          Create a template for displaying cards in your presentation. You can include or exclude attributes such as card title, description, owner name, last modify date, and so on.\n                         \n\n\n\n                          Specify the page in Domo that cards are being pulled from.\n                         \n\n\n\n                          Refresh the cards in a presentation.\n                         \n\n\n\n                          Specify the types of cards that are pulled into Domo (KPI cards, document cards, custom Apps, etc.).\n                         \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Using the Domo PowerPoint Plugin\n                        \n                        .\n                       \n\n                        Domo Excel Plugin\n                       \n\n                        Use the Domo Excel plugin to download DataSets from Domo into Excel. You can then edit the data in Excel just as you could with any Excel spreadsheet. After editing DataSet data in Excel, you can upload the edited data into the same DataSet you downloaded it from, create a new Domo DataSet from this data, or upload the data to another existing DataSet. You can download this plugin in\n                        \n                         Admin > Tool Downloads\n                        \n                        .\n                       \n\n                        Using this plugin, you can do all of the following:\n                       \n\n\n\n                          Connect to the server for the desired Domo instance.\n                         \n\n\n\n                          Download any DataSet from your connected instance as an Excel file.\n                         \n\n\n\n                          Edit the data in your downloaded DataSet.\n                         \n\n\n\n                          Upload your edited DataSet as a new DataSet, into the same DataSet you pulled the data from, or into a different existing DataSet.\n                         \n\n\n\n                          Refresh the DataSet—if anything has changed in this DataSet, it will be \"redownloaded.\"\n                          \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Using the Domo Excel Plugin\n                        \n                        .\n                       \n\n                        DomoR Plugin\n                       \n\n                        The new DomoR plugin allows you to retrieve a DataSet from Domo, complete further processing on it in R, and then upload the changes back to Domo. The plugin can also be used to create a new DataSet in Domo directly from R. You can access installation information, an instructional video, and help links for the plugin from within Domo, by navigating to the Data Center and clicking\n                        \n                         R Plugin\n                        \n                        in the toolbar at the top of the screen.\n                       \n\n\n\n\n                        For information about the DomoR plugin, see\n                        \n                         DomoR Plugin\n                        \n                        .\n                       \n\n                        Help Center Page\n                       \n\n                        When you now click the\n                        \n                         Help Center\n                        \n                        link in the main menu, a page opens within Domo from which you can navigate to Domo University, the Domo Dojo, the Knowledge Base, or Domo's Developer Portal. The page also contains several featured videos, which you can play right in this page instead of first having to navigate to the video library in Domo University, as well as the help guides found within Domo.\n                       \n\n                        Note that to access Domo's user documentation, you now click\n                        \n                         Domo Knowledge Base\n                        \n                        in the new Help Center page. Previously, clicking\n                        \n                         Help Center\n                        \n                        would open the user documentation directly.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Getting Help\n                        \n                        .\n                       \n\n                        Add to Domo\n                       \n\n                        The new \"Add to Domo\" tool lets you open the \"Add\" interface for almost any object from anywhere in Domo. With just a few mouse clicks, this features brings to the forefront the tools that are available within Domo, similar to the new Data Center user interface. Objects you can add include the following:\n                       \n\n\n\n                          API, file, or database connectors.\n                         \n\n\n\n                          Magic ETL, SQL, and DataFusion transforms.\n                         \n\n\n\n                          All types of cards—KPI cards, Sumo cards, document cards, etc.\n                         \n\n\n\n                          Card pages.\n                         \n\n\n\n                          Projects and tasks.\n                         \n\n\n\n                          People and groups.\n                         \n\n\n\n                        You can also open the Workbench information/download screen (by selecting\n                        \n                         Data > On Premise\n                        \n                        ).\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Domo Application Layout\n                        \n                        .\n                       \n\n                        New Data Center UI\n                       \n\n                        The user interface for the Data Center has been revamped to provide a more consistent experience. Changes to the UI include:\n                       \n\n\n\n                          Navigation between tabs is now accomplished through links on the left side of the screen.\n                         \n\n\n\n                          The Data Warehouse tab is the initially selected tab when you open the Data Center. This view includes a new toolbar with icons for connecting to third-party connectors (categorized as Cloud App, File, and Database connectors); opening the Workbench download page; switching over to Domo's developer environment; and opening the Magic ETL and DataFlow creation views. On all other tabs, you can access these options by clicking the\n                          \n                           New\n                          \n                          button.\n                         \n\n\n\n                          All options in the\n                          \n                           Accounts\n                          \n                          tab have been consolidated into two different menus, eliminating the need to remember various icons.\n                         \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n                        New Workbench Download Page\n                       \n\n                        The Workbench download page has been updated to provide a more visually pleasing user experience, more thorough information about Workbench, and \"What's New\" notes and download buttons for all of the most recent releases. In addition, it has been moved out of the Admin Settings and into a more fitting location in the Data Center. To access the new Workbench download page, select\n                        \n\n                         > Data Center\n                        \n                        then click\n                        \n                         On Premise\n                        \n                        in the toolbar at the top of the window.\n                       \n\n\n\n\n                        For more information about Workbench installation, see\n                        \n                         Installing Workbench\n                        \n                        .\n                       \n\n                        New public-facing connectors\n                       \n\n                        The following Domo connectors are officially being released to customers:\n                       \n\n\n\n                          Amazon S3\n                         \n\n\n\n                          CallRail\n                         \n\n\n\n                          Flurry\n                         \n\n\n\n                          Mixpanel\n                         \n\n\n\n                          Ooyala\n                         \n\n\n\n                          QuickBase\n                         \n\n\n\n                          ServiceNow\n                         \n\n\n\n                        For more information about these and other connectors, see\n                        \n                         Configuring Each Connector\n                        \n                        .\n                       \n\n                        DataFlow Details view UI changes\n                       \n\n                        A new DataFlow details view is being released, with some changes to the user experience:\n                       \n\n\n\n\n\n                            Clicking on an individual DataFlow on the listings page will now take you to the details page instead of the edit page. You can select\n                            \n\n                             > Edit\n                            \n                            on the listings page or click\n                            \n                            on the details page to edit the DataFlow.\n                           \n\n\n\n\n\n\n\n                            The details page itself is redesigned.\n                           \n\n\n\n\n\n\n\n                              A new\n                              \n                               Settings\n                              \n                              tab shows input DataSets for a DataFlow. For any DataSet, you can specify whether to run the DataFlow when that DataSet updates.\n                             \n\n\n\n\n\n\n\n                              A new\n                              \n                               DataSets\n                              \n                              tab shows all input and output DataSets\n                             \n\n\n\n\n\n\n\n                              The\n                              \n                               History\n                              \n                              tab now surfaces the amounts of input and output data. It also shows the version number.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Chart Properties improvements\n                       \n\n                        In the interest of making a simpler and more pleasing user experience, various changes have been made in the Chart Properties. These include the following:\n                       \n\n\n\n                          A number of properties have been marked as deprecated and removed from the product. For a list of deprecated properties, see\n                          \n                           Deprecated Chart Properties\n                          \n                          . Note that for any deprecated checkbox-activated properties, if that property was set to \"on\" before the property was deprecated, the property still appears in your Chart Properties and is still set to \"on.\" However, if you then turn off the property and resave the chart, the deprecated property will no longer be available.\n                         \n\n\n\n                          Numbers to the right of property categories indicate the number of enabled properties within that category. For example, in the following screenshot, one property has been set for\n                          \n                           General\n                          \n                          , two for\n                          \n                           Bar Settings\n                          \n                          , and so on.\n                          \n\n\n\n\n\n\n                          Chart properties that only apply when certain other properties are applied are now grayed out when those properties are not applied. For example, the following screenshot shows the Chart Properties dialog for\n                          \n                           Data Labels\n                          \n                          . Because all properties after\n                          \n                           Text\n                          \n                          are only applicable when a text string has been entered, those properties are grayed out, thereby eliminating user confusion.\n                          \n\n\n\n\n\n\n                          The\n                          \n                           Large View Legend Position\n                          \n                          and\n                          \n                           Details View Legend Position\n                          \n                          properties have been replaced with the more user-friendly\n                          \n                           Portrait View Legend Position\n                          \n                          and\n                          \n                           Landscape View Legend Position\n                          \n                          properties. In addition, all chart types with legends now include the same chart properties for formatting legends.\n                         \n\n\n\n                        For more information about chart properties, see\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           dojo.domo.com\n                          \n\n\n\n                         reach out to your Domo Customer Success Manager or Technical Consultant\n                        \n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439613", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004446", "Archived Date": "", "Language": "English", "Primary Version": "October 2016 Release Notes", "Article Total View Count": "2,408", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              October 2016 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}