{"file_path": "../../raw_kb_v2\\article\\360042934834\\index.html", "content": {"title": "\n\n\n October 2019 Release Notes\n\n\n", "article_body": "\n\n\n New features and enhancements\n--------------------------------\n\nFeatures and enhancements in this release include the following:\n\n##\n Business Automation Engine: Alert Actions\n\nAlert Actions drive powerful action for your business by triggering events such as Webhook integration with third-party systems and Projects & Tasks integrations in Domo. The possibilities for Alert Actions are literally endless. For example...\n\n As a retail store manager, you might already have an Alert that notifies you when a certain product has reached a threshold of units sold; with Alert Actions you could expand upon this basic Alert by having it also activate a \"reorder\" action in your inventory system when it is triggered.\n* As a sales leader, you could set an Alert Action to turn on sirens or music in your office when you've closed a large deal so everyone can celebrate together.\n* As a support manager, you could set Alert Actions to automatically create tasks in Domo and assign them to specified individuals whenever the number of open bugs exceeds a certain number.\n\nTwo types of Alert Actions are currently available in Domo—Webhooks and Tasks. With the Webhook action, you can connect to any of a number of third-party systems. With Task actions, you can create a Task in a specified Project and assign it to a certain person. You configure these actions in the Alert Wizard when you create an Alert or edit an existing Alert.\n\n\n For more information, see .\n\n##\n Updated navigation\n\nDomo's new navigation makes it easy to organize and manage your Pages so that they are easier to find, regardless of whether you have just a few Pages or a few hundred. It also makes is possible to navigate to all of Domo’s most used features in fewer clicks, decreasing the time it takes you to perform actions in Domo and get answers. For more information, watch this\n\ndemo video\n\n.\n\n\n The updated navigation will be available to all customers in our October release. Because of the magnitude of this change, the new navigation structure will not officially replace the old structure until March of 2020. Until then, all customers have the option to turn on the new navigation by going into the Admin Settings and selecting\n **Company Settings > Feature control**\n , then switching on the option reading \"Enable updated navigation for all users.\" (You must have Admin security privileges to do this.) This way, your organization has the freedom to make the transition whenever it is ready. Note that third-level and favorited Pages are only supported in the updated navigation, so if you switch back to the old navigation from the new navigation, these Pages won't be visible in the UI.\n\n\n Here’s a highlight list of some of the most notable improvements:\n\n###\n Improved UI\n\nThe Pages menu has been moved to the left side of the screen in a scrollable \"Dashboards\" list. You can collapse this list, providing more space when you want to focus on important dashboard content. If you want you can still show the list when it is in its collapsed state. The list is searchable too, allowing you to quickly filter down the list of Pages as you type.\n\nYou will also find shortcuts to your most important Domo functions now exposed at the top of the screen, giving you quicker access.\n\n###\n\nThird-level Pages\n\nAn additional level of Page hierarchy lets you create Subpages of your Subpages. You have more options than ever for how you organize your Pages to show related information.\n\n\n####\n\nFavorite Pages\n\nYou can now mark Pages as \"favorites,\" making it easier for you to get to your most important content in Domo. You can add any Page as a \"favorite\" Page by choosing the\n **Add to favorites**\n option in the wrench menu for the Page.\n\nOnce a Page is added as a Favorite, you can jump to it quickly by clicking\n **Favorites**\n at the top of the Pages list and selecting the Page you want to open.\n\n###\n Getting Started Page\n\nThe new\n **Getting Started**\n Page gives users an improved login experience with easier access to several of the most important Domo functions. This Page enables you to get value out of Domo faster by helping you find important Cards and Pages, create Alerts, and join Buzz conversations. This will help guide new users to what they should be doing in Domo and give them a meaningful login experience.\n\nFor companies that have processes already in place to onboard new users or that already have company landing Pages configured, there is an option to “shut off” this Page at the company settings level. This will allow Admin-level users to hide the\n **Getting Started**\n Page for all users at the company and keep their existing onboarding/login process, should they choose to.\n\n\n For more information, see\n\nNew Navigation Announcement\n\n.\n\n##\n Streaming MP4 videos in Doc Cards\n\nEasily create more clarity for your viewers with MP4 video streaming in Doc Cards. You can view these videos either from the Page level (standard Pages and Domo Stories are both supported) or from the Doc Card Details view. You can also choose a custom image for your video's thumbnail or let Domo choose a default thumbnail for you.\n\n\n Videos can be viewed in both Web and Mobile versions of Domo. Please note that\n *only*\n MP4 videos are supported at this time (no AVI, WMV, QuickTime, etc.). If your video is not an MP4 file, the video will not stream; you will just see the file icon. Also note that the file size limit for videos is 1GB and the limit for custom thumbnail images is 10MB.\n\n##\n No Code JSON Connector\n\nConnect custom data to Domo without writing any code using the No Code JSON Connector.\n\n\n Up until now, if you wanted to bring your custom data into Domo, you had to either ask someone at Domo to build a custom connector for you or create the connection using our API or Connector IDE, both code-intensive options. Now you can pull in your custom data just by following the steps in a simple wizard interface. The wizard will help you connect to your data as a JSON file and pull it into Domo.\n\n\n To use this tool, you will need the following:\n\n A client ID and client secret from\n\ndeveloper.domo.com\n* An authorization URL and access token URL from your data provider\n* The URL to access the JSON file\n\nAccess the interface for this connector by searching for \"No-Code JSON OAuth Connector\" in the Appstore.\n\n\n###\n DomoStats - DataSets and DataFlows\n\nThe DataSets and DataFlows App, the newest addition to our ever-expanding repertoire of DomoStats Apps, comes with a pre-built dashboard that allows Admin users to...\n\n Clean up Domo quickly by seeing which DataSets and DataFlows need attention, are orphaned or duplicated, etc., then selecting a direct link to take immediate action.\n* Understand where to target efforts to fix DataSets and DataFlows with Cards that show what needs attention based on Card counts, owners, etc.\n* Keep Domo secure by watching who is creating data and what data is coming into Domo.\n\nReady to take this App for a spin? Simply search for \"DomoStats\" in the Appstore, select the \"DomoStats - DataSets and DataFlows\" App, then click\n **Try it**\n . Note that you must have an \"Admin\"-level security role to deploy DomoStats Apps in Domo.\n\n\n###\n New Help Center\n\nFind all Domo learning materials in one place with our revamped Help Center. The Help Center provides access to all of the following:\n\n 1700 Knowledge Base articles\n* 450+ how-to videos (embedded from YouTube)\n* 80+ free online training modules\n* Our Dojo user community\n* Options for booking professional trainers\n* Support resources\n\nThe Help Center is public-facing, meaning you can access all of the above resources from Google.\n\n\n To access the Help Center, just click on the\n\nicon in the upper right corner of the screen.\n\n\n###\n\nData Impact Analysis\n\nDomo's Data Impact Analysis tool, available in the details view for a DataSet, helps you understand the impact of actions you take on your DataSets.\n\n\n This tool includes all of the following functions:\n\n **Impact card**\n . A new card in the\n ****Overview****\n tab shows you the number of DataSets, DataFlows, Cards, and Alerts directly and indirectly impacted by changes to that DataSet. The card displays the direct impact for each, along with the total number of impacts.\n* **Lineage view**\n . This view shows you the upstream and downstream impact of changes made to the DataSet. You can also see the lineage for a DataSet simply by clicking on the\n ****Lineage****\n tab.\n* **Info panel**\n . This panel shows the owner, the number of direct and indirect impacts on downstream elements, input and outset DataSets (for DataFlows and DataFusions), the update history, and the number of rows and columns (for DataSets).\n* **List panel**\n . This panel allows you to see all of the individual DataSets, DataFlows, Cards, and Alerts powered by this DataSet.\n\nThis tool is currently available\n *by request*\n for any user who wants it. For more information about obtaining this tool, reach out to your CSM or AE.\n\n\n For more information about using this feature, see\n\nViewing the Impact of Changes to DataSets\n\n.\n\n\n Getting help\n--------------\n\nYou can view the latest release notes information in the Help Center, which you can access from Domo by clicking by clicking\n\nin the top navigation bar .\n\n\n If you have questions about Domo,\n\n search for a topic in the Help Center\n* train in Domo University at\n\nhttp://university.domo.com\n* search for training apps in the Appstore\n* get answers in the Domo Community at\n\nhttps://dojo.domo.com\n* contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n\n/support\n\n.\n* reach out to your Domo Customer Success Manager or Technical Consultant\n\nIf you have feedback, please send it from within Domo (\n\n***> Feedback****\n ). Or send an email to\n\nproduct.feedback@domo.com\n\n.\n\n\n For more information about getting help, see\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042934834\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004422\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nOctober 2019 Release Notes\n\n", "article_total_view_count": "\n\n\n 9,295\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:09 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "october_2019_release_notes", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "release_notes", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "archived_feature_release_notes", "url": "/s/topic/0TO5w000000Zan7GAC"}]}