{"file_path": "../../raw_kb_v2\\article\\360043440673\\index.html", "content": {"Title": "January 2017 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        New Card Interaction Tools (CSR)\n                       \n\n                        Our new Card Interaction (Client-Side Rendering) tools make it easy and fun to perform in-depth data analysis on your charts in ways you never could before. These tools include the following:\n                       \n\n\n\n\n                           New Chart Picker\n                          \n                          . You can now change the chart type for most charts right in the Details page instead of having to first open the Card Builder. In contrast to the chart type picker in Card Builder, which only shows icons for each chart type, the Details view chart type picker shows you actual thumbnail versions of each available chart type with your chart data already applied.\n                          \n\n\n\n\n\n\n\n                           Legend Item Toggle\n                          \n                          . In most chart types with legends (excluding Maps), you can now click on a legend item to hide or show the corresponding data in the chart.\n                          \n\n\n\n\n\n\n\n                           Chart Zoom\n                          \n                          . You can click and drag over a portion of a chart to \"zoom in\" on that portion. This works on most chart types, excluding pie-type charts, maps, gauges, Radar graphs, and a few others.\n                         \n\n\n\n\n                           Quick Sort\n                          \n                          . For most Bar and Line graphs, you can now quickly change the sort method just by clicking an icon, without having to open the Card Builder.\n                         \n\n\n\n\n                           Chart Save As\n                          \n                          . When you make changes to a chart in the Details view (whether by using any of the above features or filtering using the Analyzer tool), you can now save a copy of the edited chart to your Domo. You can then give the new version of the card a new name, enter a description to help viewers understand what has been changed in the card, and select the page in Domo where the new card will reside.\n                         \n\n\n\n\n                           Data Forecasting\n                          \n                          . A new chart property for Bar and Line charts allows you to forecast the value of the remainder of the current period in your chart. It does this by taking the current value for the period and comparing it to the previous period.\n                         \n\n\n\n\n\n                        Bulk Admin Options for Pages and Cards\n                       \n\n                        At long last, \"Admin\" users in Domo now have the ability to make bulk edits to the pages and cards in their company Domo instance! With this capability in place, users of your Domo instance will no longer need to waste time manually moving, deleting, and setting permissions on cards and pages, freeing them up to tackle more important tasks like answering the needs of your business.\n                       \n\n                        The\n                        \n                         Cards\n                        \n                        and\n                        \n                         Pages\n                        \n                        tabs in the Admin Settings have been completely revamped to allow you to make bulk changes with ease. The\n                        \n                         Cards\n                        \n                        tab lets you filter by card, owner, number of pages the card is found in, card type (chart, document, poll, etc.), and the date of the last edit, or any combination of these. The\n                        \n                         Pages\n                        \n                        tab lets you filter by page, parent page, owner, the number of cards in the page, and the last update date and time, or any combination. You can even select all of the cards or pages in your instance if you want to make changes to all of them. For any page or card, you can click anywhere in the row to bring up a tab with more information.\n                        \n\n\n\n\n                        Bulk options for pages\n                       \n\n                        Bulk options for pages include all of the following:\n                       \n\n\n\n                          Changing page owners\n                         \n\n\n\n                          Adding and removing users and groups\n                         \n\n\n\n                          Moving pages in the hierarchy (includes options for setting permissions on moved pages)\n                         \n\n\n\n                          Locking and unlocking pages\n                         \n\n\n\n                          Deleting pages\n                         \n\n\n\n                        Bulk options for cards\n                       \n\n                        Bulk options for cards include all of the following:\n                       \n\n\n\n                          Changing cards owners\n                         \n\n\n\n                          Adding and removing users and groups\n                         \n\n\n\n                          Duplicating cards\n                         \n\n\n\n                          Adding and removing cards to/from pages\n                         \n\n\n\n                          Locking and unlock cards\n                         \n\n\n\n                          Deleting cards\n                         \n\n\n\n                        For information about these options, see\n                        \n                         Admin Settings Layout\n                        \n                        .\n                       \n\n                        Domo Online Form v2\n                       \n\n                        The online forms (webforms) tool has been improved to provide more options for manually creating DataSets in Domo. These new options include the following:\n                       \n\n\n\n                          You can import an existing DataSet into a webform.\n                         \n\n\n\n                          You can change the data type for a column.\n                          \n                           Number\n                          \n                          (value),\n                          \n                           Text\n                          \n                          (string), and\n                          \n                           Date\n                          \n                          data types are available. You can also disable Domo's automatic data type identification for a column by deselecting the\n                          \n                           Auto Detect\n                          \n                          option for a column.\n                         \n\n\n\n                          You can search for and replace given text strings.\n                         \n\n\n\n                          You can add columns to your online form with one click of a button.\n                         \n\n\n\n                          You can expand the online forms editor to fill your entire screen.\n                         \n\n\n\n                          You can filter to see rows in a column that do not match the selected data type.\n                         \n\n\n\n                        Each column also shows the number of unique values within that column.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Powering a KPI Card with Data\n                        \n                        .\n                       \n\n                        Domo PowerPoint and Excel Plugins v2\n                       \n\n                        Updated versions of our PowerPoint and Excel plugins are now available. These new versions include the following improvements and fixes:\n                       \n\n                        General\n                       \n\n                        A bug has been fixed, allowing SSO-enabled users behind a proxy to connect to their Domo instance.\n                       \n\n                        Excel Plugin\n                       \n\n\n\n\n                           Query table\n                          \n                          . You can now pull subsets of DataSets or single values into Excel based on aggregates, filters, limits, etc.\n                         \n\n\n\n\n                           New upload UI.\n                          \n                          The UI when uploading a DataSet has been redesigned with a progress bar and better messaging so you know what is going on and approximately how long it’s going to take to upload your data into Domo.\n                         \n\n\n\n\n                           New download UI.\n                          \n                          The UI when downloading a DataSet has also been redesigned with a progress bar and better messaging.\n                         \n\n\n\n\n                           Bug fixes\n                          \n                          . A number of bug fixes have been made, including errors when uploading DataSets containing null columns and checking for the latest version in international locations.\n                         \n\n\n\n                        PowerPoint Plugin\n                       \n\n\n\n\n                           Summary numbers\n                          \n                          . Chart summary numbers can now be pulled and added to slides.\n                         \n\n\n\n\n                           Publication groups support.\n                          \n                          Support for Publication Groups has been added.\n                         \n\n\n\n\n\n                            A number of bug fixes have also been made including errors when refreshing cards in international locations.\n                           \n\n\n\n\n\n                        For more information, see\n                        \n                         Using the Domo Excel Plugin\n                        \n                        .\n                       \n\n                        ETL Enhancements\n                       \n\n                        In our Magic ETL editor, you can now do all of the following:\n                       \n\n\n\n                          Select the current date and time (in UTC).\n                         \n\n\n\n                          Replace\n                          \n                           NULL\n                          \n                          values and empty strings.\n                         \n\n\n\n                          Use\n                          \n                           MIN\n                          \n                          ,\n                          \n                           MAX\n                          \n                          , and\n                          \n                           Count Including NULLs\n                          \n                          aggregation types.\n                         \n\n\n\n                        For more information about the ETL editor, see\n                        \n                         Creating a Magic ETL DataFlow\n                        \n                        .\n                       \n\n                        New public-facing connectors\n                       \n\n                        The following connectors are now customer-facing with this release:\n                       \n\n\n\n                          Bitly\n                         \n\n\n\n                          Brandwatch\n                         \n\n\n\n                          Crimson Hexagon\n                         \n\n\n\n                          Jobvite\n                         \n\n\n\n                          Sample Data Engine\n                         \n\n\n\n                          Snowflake\n                         \n\n\n\n                          Tumblr\n                         \n\n\n\n                          USGS Earthquakes\n                         \n\n\n\n                          Workday Reports-as-a-Service (RAAS)\n                         \n\n\n\n\n\n                        Duplicate Card = Save As\n                       \n\n                        In the interest of eliminating confusion for new users, the\n                        \n                         Duplicate Card\n                        \n                        option for cards has been replaced with\n                        \n                         Save As\n                        \n                        .\n                       \n\n                        Participants in Appstore\n                       \n\n                        Participant-level users are now able to browse Apps in the Appstore. For more information about the Appstore, see\n                        \n                         The Appstore\n                        \n                        . For more information about security roles, see\n                        \n                         Security Role Reference\n                        \n                        .\n                       \n\n                        New Share Menu in Chart Details\n                       \n\n                        Two commonly used share actions in the chart Details view—\n                        \n                         Share\n                        \n                        and\n                        \n                         Export\n                        \n                        —have been moved from the\n                        \n                        menu into a new\n                        \n                        menu. This menu also contains the new\n                        \n                         Save As\n                        \n                        option, described under\n                        \n                         January 2017 Release 1\n                        \n                        above.\n                       \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Card Details View Layout\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n                          .\n                         \n\n\n\n                          contact Technical Support by using\n                          \n                           \\support\n                          \n                          in Buzz, by email at\n                          \n                           support@domo.com\n                          \n                          or by phone at 801-805-9505 (Monday through Friday, 7 am to 6 pm MST)\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043440673", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004445", "Archived Date": "", "Language": "English", "Primary Version": "January 2017 Release Notes", "Article Total View Count": "7,068", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              January 2017 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}