{"file_path": "../../raw_kb_v2\\article\\360043430593\\index.html", "content": {"Title": "Submitting or Approving a Request", "Article Body": "Intro\n                       \n\n                        In Approvals, you can review and leave a comment on any request you have access to view as a submitter, approver, or observer. Once submitted, a request proceeds in a linear fashion through the approval chain. While the request is pending review, the submitter or the pending approver may edit any of the request details.\n                        \n                        While reviewing a request, the pending approver may choose to approve, deny, request a change, or delegate. When taking any of these actions, the approver may also leave an optional message to provide context for the action taken.\n                       \n\n                        This topic discusses how to submit requests for approval as well as approve them. For information about creating a request template, see\n                        \n                         Approvals Layout\n                        \n                        .\n                       \n\n                        Example\n                       \n\n                        Let's say that the chief inspections engineer for filtration company \"Wetter Water\" creates a template to be used by members of his quality control staff whenever they need to do an inspection at a customer company. The template includes required fields such as the customer name, the physical address, the expected amount of time to be spent offsite, the priority level, and so on. Two approvers are specified in the approval chain—Marlo, the chief inspections engineer himself, and Marlo's supervisor, company COO Janice. The following workflow shows a typical example of how this template might be used:\n                       \n\n\n\n                          Quality engineer Jake receives a call from a customer complaining about low water flow in a fountain.\n                         \n\n\n\n                          Jake fills out the inspection template with details for a planned visit and submits it.\n                         \n\n\n\n                          Marlo is notified about the request via email.\n                         \n\n\n\n                          Marlo opens Approvals and takes a look at the details of the request. Satisfied, he gives his stamp of approval.\n                         \n\n\n\n                          Janice is notified about the request via email.\n                         \n\n\n\n                          Janice opens Approvals and takes a look at the details of the request. She feels that Jake has scheduled too much time for the inspection, as the customer company is located only a mile away and the problem probably has an easy solution. She uses the\n                          \n                           Request Change\n                          \n                          option, being sure to include a message suggesting that Jake subtract an hour from the allotted time.\n                         \n\n\n\n                          Jake is notified via email that the request has been sent back.\n                         \n\n\n\n                          Jake opens Approvals and modifies the proposed amount of time. He then resubmits the request.\n                         \n\n\n\n                          Marlo and Janice both approve the modified request.\n                         \n\n\n\n                          Jake is notified via email that his request has been approved.\n                         \n\n\n\n                        Submitting a Request\n                       \n\n                        As explained above, when you submit a request, the first Domo user specified in the approver chain receives a notification. This user can then...\n                       \n\n\n\n                          approve the request, causing a notification to be sent to the next approver in the chain (unless this user is the only user in the approver chain, in which case the submitting user is notified of the approval),\n                         \n\n\n\n                          leave a comment about the request,\n                         \n\n\n\n                          share access to the request by adding specified users and groups as observers,\n                         \n\n\n\n                          make changes to the request details,\n                         \n\n\n\n                          request that a change be made to the details of the request,\n                         \n\n\n\n                          delegate the request to someone else, or\n                         \n\n\n\n                          deny the request altogether.\n                         \n\n\n\n                        If this user approves the request, the next approver in the chain is given this same set of options.\n                       \n\n\n                         To submit a request,\n                        \n\n\n\n\n                          Select\n                          \n\n                           > Approvals\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           New Request\n                          \n                          in the left-hand navigation.\n                         \n\n\n\n                          Locate the request template you want to use to submit your request.\n                          \n                          If you do not see the request template you need, you can create it yourself or ask another user to create it. For more information, see\n                          \n                           Creating a Request Template\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The request form for certifying cards is\n                             \n                              not\n                             \n                             found in the Approval Center (though any card certification requests\n                             \n                              will\n                             \n                             appear in the\n                             \n                              Submitted by You\n                             \n                             /\n                             \n                              Waiting on You\n                             \n                             tabs). You open this form for a specified card by selecting\n                             \n                              Request certification\n                             \n                             in the dropdown menu for the card. If you want to edit the form fields and/or approvers for the card certification form, you can do so in\n                             \n                              Admin Settings > Certified Content\n                             \n                             . You must have an \"Admin\" security role to do this. For more information, see\n                             \n                              Certifying Content\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Fill out the fields in the template as required.\n                         \n\n\n\n                          (Optional) If you want to add additional approvers to the approval chain, and the approval chain is unlocked, you can do so by clicking\n                          \n                           Add Approver\n                          \n                          .\n                         \n\n\n\n                          (Optional) If you want to add additional observers to the request, you can do so by clicking Add Observer.\n                         \n\n\n\n                          Click\n                          \n                           Submit\n                          \n                          .\n                         \n\n\n\n                        A notification is now sent to the first approver in the chain, who has the option to approve the request, ask for modifications, or reject the request.\n                       \n\n                        Reviewing a Request\n                       \n\n                        If you are specified as an approver or observer for any request template in Approvals, it is your responsibility to handle any requests submitted via that template. When a request is made, a notification is sent, based on your preferences in global notification settings, to you letting you know that there is something that needs your attention in Approvals. For any submitted request that is pending your approval, you can take the following actions:\n                       \n\n\n\n                          Approve the request.\n                         \n\n\n\n                          Ask a question or leave a comment about the request.\n                         \n\n\n\n                          Share access to the request by adding a individuals or groups as an observers.\n                         \n\n\n\n                          Edit details of the request.\n                         \n\n\n\n                          Request changes from anyone prior to you in the approval chain.\n                         \n\n\n\n                          Delegate the request to someone else (this person or group will replace you in the approval chain.)\n                         \n\n\n\n                          Deny the request altogether.\n                         \n\n\n\n\n                         To act on a request,\n                        \n\n\n\n\n                          Select\n                          \n\n                           > Approvals\n                          \n                          .\n                         \n\n\n\n                          Select the\n                          \n                           Waiting on You\n                          \n                          quick filer on Approvals home screen or select\n                          \n                           Active requests\n                          \n                          in the left-hand navigation.\n                         \n\n\n\n                          In the list pane, locate and click on the request you wish to review and take action on. When you click a request, details for that request appear in the pane on the right side of the screen.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            To\n                            \n                             approve\n                            \n                            the request, click\n                            \n                             Approve\n                            \n                            .\n                            \n                            If there are approvers after you in the chain, the next approver is notified about the approval, and it now falls upon that user to approve the request, reject it, etc. Otherwise, the approval process is finished and the submitter is notified.\n                           \n\n\n\n                            To\n                            \n                             review\n                            \n                            the comments attached to the request, click on the\n                            \n                             Comments\n                            \n                            tab. (When there are new comments you have not read, a red dot will appear on this tab.)\n                           \n\n\n\n                            To\n                            \n                             share access\n                            \n                            to the request, click on the\n                            \n                            and select\n                            \n                             Edit observers\n                            \n                            .\n                           \n\n\n\n                            To\n                            \n                             edit\n                            \n                            the request, click on the\n                            \n                            , select\n                            \n                             Edit request\n                            \n                            , make your changes, then click\n                            \n                             Save\n                            \n                            .\n                           \n\n\n\n                            To\n                            \n                             request changes, delegate, or deny\n                            \n                            , click on the\n                            \n                            , then select the action you wish to take.", "Preview Article": "Click here to preview", "URL Name": "360043430593", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003013", "Archived Date": "", "Language": "English", "Primary Version": "Submitting or Approving a Request", "Article Total View Count": "4,769", "": "", "Article Created Date": "10/24/2022, 8:59 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Submitting or Approving a Request\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Approvals\n              \n", "url": "/s/topic/0TO5w000000Zan5GAC"}]}