{"file_path": "../../raw_kb_v2\\article\\360043433153\\index.html", "content": {"Title": "AppNeta TraceView Connector", "Article Body": "Intro\n                       \n\n                        AppNeta provides proactive end-user performance monitoring for any application, network, or cloud. To learn more about the AppNeta TraceView API, visit their page (\n                        \n                         https://docs.appneta.com/api.html\n                        \n                        ).\n                       \n\n                        You connect to your AppNeta TraceView account in the Data Center. This topic discusses the fields and menus that are specific to the AppNeta TraceView connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your AppNeta TraceView account and create a DataSet, you must have the AppNeta access key for your organization.  You can find your access key either from\n                        \n                         your organization page\n                        \n                        or in your config file (\n                        \n                         /etc/tracelytics.conf\n                        \n                        ) on a machine with TraceView installed.\n                       \n\n                        Connecting to Your AppNeta TraceView Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the AppNeta TraceView Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your AppNeta TraceView account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Access Key\n                           \n\n\n\n                            Enter the AppNeta access key for your organization. For more information about obtaining an access key, see \"Prerequisites,\" above.\n                           \n\n\n\n\n\n\n                         Once you have entered valid AppNeta TraceView credentials, you can use the same account any time you go to create a new AppNeta TraceView DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the AppNeta TraceView report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Latency Client Series\n                               \n\n\n\n                                Returns a client-side time series of the application's latency and volume.\n                               \n\n\n\n\n\n                                Latency Client Summary\n                               \n\n\n\n                                Returns a client-side summary of the latency and volume traced.\n                               \n\n\n\n\n\n                                Latency Server by Layer\n                               \n\n\n\n                                Returns time series data for each layer in the application.\n                               \n\n\n\n\n\n                                Latency Server Series\n                               \n\n\n\n                                Returns a server-side time series of the application's latency and volume.\n                               \n\n\n\n\n\n                                Latency Server Summary\n                               \n\n\n\n                                Returns a server-side summary of the latency and volume traced.\n                               \n\n\n\n\n\n                                Layers by AppName\n                               \n\n\n\n                                Returns a list of layers assigned to the specified app.\n                               \n\n\n\n\n\n                                Hosts by AppName\n                               \n\n\n\n                                Returns a list of hosts assigned to the specified app.\n                               \n\n\n\n\n\n                                Total Requests Series\n                               \n\n\n\n                                Returns a time series for the application's total requests.\n                               \n\n\n\n\n\n                                Total Requests Summary\n                               \n\n\n\n                                Returns a summary of the total requests.\n                               \n\n\n\n\n\n                                Trace Summary\n                               \n\n\n\n                                Returns a high-level overview of a particular trace's performance characteristics.\n                               \n\n\n\n\n\n\n\n\n\n                            AppNeta AppName\n                           \n\n\n\n                            Select the app you want to retrieve data for.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043433153", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003598", "Archived Date": "", "Language": "English", "Primary Version": "AppNeta TraceView Connector", "Article Total View Count": "2,348", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              AppNeta TraceView Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}