{"file_path": "../../raw_kb_v2\\article\\7617841459223\\index.html", "content": {"title": "\n\n\n Google Analytics 4 connector (Beta)\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Google Analytics 4 Beta connector generates detailed website traffic stats to help measure sales and conversions. Use this Connector to efficiently generate reports about campaign, device, location, social network, and traffic metrics to make sure the customer behavior you're seeing now translates to sales and revenue down the line.\n\n\n The Google Analytics Data API (GA4) allows programmatic access to Google Analytics 4 (GA4) report data.\n\n\n Google Analytics 4 Beta connector generates detailed website traffic stats to help measure sales and conversions. Use this Connector to efficiently generate reports about campaign, device, location, social network, and traffic metrics to make sure the customer behavior you're seeing now translates to sales and revenue down the line.\n\n\n Improve sales and conversions by connecting your Google Analytics data and combining it with other key data sources.\n\n\n|  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n | * Understanding visitor traffic patterns on your website\n* Understanding visitor behavior patterns on your website\n* Understanding the relationship between geography and user behavior on your website\n* Understanding the difference between user behavior on mobile devices vs. desktop browsers\n* Understanding how social media drives traffic to your website\n* Understanding how users interact with products on your website\n |\n|\n**Primary Metrics**\n | * Page Views\n* Unique Visitor Counts\n* Return Visitor Counts\n* Product Sales Numbers\n* Geographic Patterns\n* Referring Domains\n* Conversion metrics\n* Bounce Rate\n* Exit Pages\n |\n|\n**Primary Company Roles**\n | * Data analysts\n* Digital marketers\n* Editorial teams\n* Marketing leads\n |\n|\n**Average Implementation Time**\n |\n If choosing the basic reporting functions you can plan on about an hour depending on how many reports you are pulling. However, if choosing the custom route, the time may be up to 2 hours. Also, depending on how much data you are pulling, it may take several hours for the data to be available in Domo.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 7\n  |\n\nBest Practices\n----------------\n\n\n* When starting out, consider deploying the\n\nGoogle Analytics Dashboard\n\n. The Base Metrics report has many of the fundamental metrics that are key to a Google Analytics Dashboard.\n\nPrerequisites\n---------------\n\nTo connect to the Google Analytics API and create a DataSet, you must have a Google email address and password.\n\n  |  |\n| --- | --- |\n| **Parameter Name**  | **Where to find it**  |\n|\n Username\n  |\n The email address/username used to log in at\n\n\n google.com\n  |\n|\n Password\n  |\n The password is associated with the above username/email.\n  |\n\n\n###\n Credentials Pane\n\nTh Google Analytics 4 connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google accounts in Domo) to open the Google OAuth screen where you can enter your Google email address and password. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Analytics Advanced DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n\n\n**Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Data Selection Pane\n\nThis pane contains a number of subpanes in which you can select a report, set a date range, choose your segments, and more.\n\n\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Custom Report\n  |\n Build your own report by selecting dimensions and metrics.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n When will Domo Google Analytics 4 connector plan to release as an official version?\n\nAn official version will be released after Google releases the GA version for all the endpoints that we are using (currently, APIs in use are beta version).\n\n###\n What version of the Google Analytics API does this connector use?\n\nThis connector uses the beta version of the Google Analytics API (\n\nhttps://developers.google.com/analytics/devguides/reporting/data/v1\n\n).\n\n###\n Why does it seem that my data is not accurate?\n\nGoogle's data processing latency is 24-48 hours. If your query is for yesterday's data, some data may not be displayed. Google may not have finished processing the most current data, so incomplete data may appear.\n\n\n Google 360 accounts have a much faster processing time. Enhanced data freshness normally takes 15-20 minutes depending on some factors. Enhanced data freshness is not applied to data that results from integration with other products (Example: AdWords or any of the DoubleClick products). Visit\n\nrestrictions on enhanced data freshness\n\nto view some other restrictions.\n\n\n The slowest possible data latency for 360 accounts is 24 hours.\n\n\n The fastest possible data latency for 360 accounts is 15-20 minutes.\n\n\n The chart on\n\nthis page\n\nbreaks down all the possible data latency periods based on the account and based on the query. Different queries have different data latency periods.\n\n###\n Where can I find help in building queries?\n\nUtilize Google's\n\nQuery Explorer\n\nto help test and build your queries. The Query Explorer may also give more insight on why the query isn't working.\n\n###\n I keep getting the error \"Selected dimensions and metrics cannot be queried together.\"\n\nRefer to the\n\nDimensions and Metrics Explorer\n\nto understand what dimensions/metrics can actually be queried together because not all combinations are valid.\n\n###\n What are my custom metrics and dimensions?\n\nCustom metrics and dimensions are defined at the web property level. We can only display your custom metrics/dimensions if you have one web property selected. Only views within the web property can use its custom metric/dimension. You can have as many views selected as you want as long as they belong to the same web property. The custom metrics and dimensions (if there are any) will be displayed under the \"Custom Variables or Columns\" section under the custom report.\n\n###\n How do segments work?\n\nA segment is a subset of your Analytics data. For example, of your entire set of users one segment might be users from a particular country or city. Within Domo, when you select multiple segments, we query a report for each segment you have selected. You can use custom segments. Learn more about segments\n\nhere\n\n.\n\n###\n Why am I limited to 10 metrics and 9 dimensions?\n\nThis is a limitation given by the Google Analytics API. There is no way to add more than 10 metrics and 9 dimensions to a report.\n\n\n Troubleshooting\n-----------------\n\n\n* Check user permission settings if you are having trouble gaining access to data.\n* Check to make sure you are using the correct set of credentials.\n* When validating data between the API data and the front end reporting tool, always check to see if the data was sampled or not.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 7617841459223\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003835\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Analytics 4 connector (Beta)\n\n", "article_total_view_count": "\n\n\n 5,224\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "google_analytics_4_connector_beta", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}