{"file_path": "../../raw_kb_v2\\article\\360043436353\\index.html", "content": {"title": "\n\n\n Amazon S3 Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAmazon S3 is an online file storage web service offered by Amazon Web Services that you can use to store and retrieve any amount of data, at any time, from anywhere on the web. To learn more about the Amazon S3 API, visit their page (\n\nhttp://docs.aws.amazon.com/AmazonS3/...I/Welcome.html\n\n).\n\n\n The Amazon S3 and Amazon S3 Advanced connectors are almost the same. The only difference is in how they handle multiple files that begin with the prefix string you provide in the\n **Details**\n section of the connector. The standard Amazon S3 connector will only import the latest modified file. The Amazon S3 Advanced connector will import all files with the provided prefix, assuming they all have the same schema. However, the Amazon S3 Advanced connector will only get files modified since the last run or new files after the first run. For information about the standard version of the connector, see\n\nAmazon S3 Connector\n\n.\n\n\n The Amazon S3 Advanced connector is a \"File\" connector, meaning it retrieves files and outputs them to Domo. In the Data Center, you can access the connector page for this and other File connectors by clicking\n **File**\n in the toolbar at the top of the window.\n\n\n You connect to your Amazon S3 account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon S3 Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is an excellent choice for retrieving flat files when APIs are not an option.\n  |\n|\n**Primary Metrics**\n |\n N/A\n  |\n|\n**Primary Company Roles**\n | * Data specialists\n* Marketing roles\n* Finance roles\n* Anyone who has data stored in S3\n |\n|\n**Average Implementation Time**\n |\n Less than an hour if you have the correct file types in S3.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 4\n  |\n\nBest Practices\n----------------\n\nUnderstanding the data stored in S3 and its relation to other S3 databases will be a huge asset in using this connector.\n\n\n Prerequisites\n---------------\n\nTo connect to your Amazon S3 account and create a DataSet, you must have the following:\n\n Your AWS access key. You can find this in the\n **Security Credentials**\n section of the AWS Console. Alternatively, if you are using IAM, you can find it under\n **Users**\n .\n* Your AWS secret key, which was provided when you created your access key. You can generate a new secret key in the AWS Console.\n* The name of the AWS S3 Bucket you want to retrieve files from.\n\n\n###\n Creating a User with the Proper Permissions\n\nYou must create a user with the proper permissions in the IAM Amazon Console before you can connect to S3 data in Domo.\n\n\n**To configure your user in the IAM Amazon Console,**\n\n. Add a new user, setting options as follows:\n\n1. In the\n\t **Details**\n\t pane, check the box for\n\t **Programmatic Access**\n\t under\n\t **Select AWS access type**\n\t .\n\t2. In the\n\t **Permissions**\n\t pane, select\n\t **Attach existing policies directly**\n\t , then check the box for either\n\t **AmazonS3FullAccess**\n\t or\n\t **AmazonS3ReadOnlyAccess**\n\t .\n\n\n\t Customer-managed policies\n\t *do not work*\n\t .\n\t3. In the\n\t **Review**\n\t pane, click\n\t **Create User**\n\t .\n2. After you create your user, copy the access and secret keys to use in the\n **Credentials**\n pane in Domo.\n\nConnecting to Your Amazon S3 Account\n--------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Amazon S3 Advanced Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Amazon S3 account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter your AWS access key. For information about finding your access key, see \"Prerequisites,\" above.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. For information about finding your secret key, see \"Prerequisites,\" above.\n  |\n|\n Bucket\n  |\n Enter the Amazon S3 Bucket you want to pull files from.\n  |\n|\n Region\n  |\n Select the desired Amazon S3 Bucket region.\n  |\n\n\n Once you have entered valid Amazon S3 credentials, you can use the same account any time you go to create a new Amazon S3 Advanced DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains various menus for locating and configuring the file you want to pull into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n File Type to Import\n  |\n Select the type of file you want to import into Domo, either CSV, JSON, or XML.\n  |\n|\n How Would You Like to Choose Your Filename?\n  |\n Select how you want Domo to identify your file. Options are as follows:\n\n\n|  |  |\n| --- | --- |\n|\n Complete Filename\n  |\n You enter the complete path to the file.\n  |\n|\n Partial Filename\n  |\n You enter a partial file name and specify whether the file to retrieve starts with or contains the name you have entered.\n  |\n|\n FilesDiscovery\n  |\n A list of files in the selected bucket appears and you choose the one you want. This option is available\n *only*\n when your selected S3 bucket contains fewer than 100 files.\n  |\n\n|\n|\n Prefix (Optional)\n  |\n Enter a prefix to filter results by. A prefix limits results to only those keys that begin with the given prefix. Note that this advanced version of the S3 connector imports\n *all*\n files with the provided prefix, assuming they all have the same schema.\n  |\n|\n Enter Complete Filepath\n  |\n Enter the complete path for the desired file.\n  |\n|\n File Name\n  |\n Enter the name of the file you want to import, with or without the file path. For example:\n\nfolder\\_name/file\\_name*\n\n|\n|\n File Name Match Type\n  |\n Specify whether the file you want to retrieve starts with or contains the text you entered under\n **File Name**\n .\n  |\n|\n File Compression Type\n  |\n Select the compression type for the file you want to retrieve. If the file is not compressed, select\n **None**\n .\n  |\n|\n Are Headers Present in CSV File?\n  |\n Select\n **Yes**\n if the CSV file you are importing contains headers; otherwise select\n **No**\n .\n  |\n|\n List of Files\n  |\n Select the file you want to retrieve.\n  |\n|\n Select the Delimiting Character\n  |\n Select the delimiter used in the CSV file you want to retrieve. If your delimiter is not listed, select\n **Other**\n .\n  |\n|\n Quote Character\n  |\n Select a quote character to parse the CSV file you want to retrieve. A double quote (\") is the CSV standard.\n  |\n|\n Escape Character\n  |\n Select an escape character to parse the CSV file you want to retrieve. A backslash (\\) is the CSV standard.\n  |\n|\n Enable Parsing for Large JSON Files?\n  |\n Specify whether parsing is enabled for large JSON files.\n  |\n|\n Does Your JSON Text Require a Line Reader?\n  |\n Specify whether the text in your JSON file includes multiple lines that should be read.\n  |\n|\n Should the Backslash be Escaped?\n  |\n Specify whether the text in your JSON file contains backslash characters that should be escaped.\n  |\n|\n Enter Your Data Tag\n  |\n Enter the tag for the data in your JSON or XML file.\n  |\n|\n Enter Fields to Exclude\n  |\n Provide a comma-separated list of fields to exclude in your JSON/XML import.\n  |\n|\n Enter Your Header Tag\n  |\n Enter the tag for the header in your JSON or XML file.\n  |\n|\n Do You Require Attributes in Data?\n  |\n Specify whether you require attributes values as part of your XML data.\n  |\n|\n Enter XPath Expression\n  |\n Enter your XPath expression.\n  |\n|\n Is Password Protected?\n  |\n Select\n **Yes**\n if the file you are retrieving is password-protected; otherwise select\n **No**\n .\n  |\n|\n Header Start Row\n  |\n Enter the number of the header row in the Excel file you are retrieving.\n  |\n|\n Data Start Row\n  |\n Enter the number of the first data row in the Excel file you are retrieving.\n  |\n|\n Footer\n  |\n Enter the number of the footer row in the Excel file you are retrieving.\n  |\n|\n Blank Rows\n  |\n Select the action that should be taken if blank rows are encountered. If you select\n **Skip blank rows**\n , any blank rows are skipped; if you select\n **Stop at the first blank column**\n , the data import stops when a column with a blank row is encountered.\n  |\n|\n Empty Column Headers\n  |\n Specify what should happen if empty column headers are encountered. If you choose\n **Add blank columns**\n , column names are automatically generated for the new columns. If you select\n **Stop at the first blank column**\n , the data import stops when an empty header is encountered.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Ensure that the file is present in the S3 bucket and that the correct file type is specified in the connector settings.\n* NULL columns\n *must*\n be removed before the connector can successfully retrieve data.\n* If you run into a \"Failed to Import Successfully\" error when trying to import a CSV file, you can often get around this by changing the option in the\n **Quote Character**\n menu to\n **Null Character**\n .\n\nFAQ\n-----\n\n\n####\n How frequently will my data update?\n\nAs often as needed.\n\n###\n Can I use the same Amazon S3 account to create multiple DataSets?\n\nYes.\n\n###\n Are there any API limits that I need to be aware of?\n\nYou may encounter a limit of 100 Amazon S3 buckets per account.\n\n###\n Why is the connector unable to pull the data?\n\nEnsure that the file is present in the S3 bucket and specify the correct file type in the connector settings. Also, remove null columns to allow the connector to retrieve the data.\n\n###\n What's the difference between the standard Amazon S3 connector and the advanced version?\n\nThe Amazon S3 connector and the Amazon S3 Advanced connector both use the same SDK. They differ in how they handle multiple files.\n\n\n If your Amazon S3 bucket contains multiple files that begin with the prefix string you provide in the Details section of the connector, the Amazon S3 connector will only import the latest modified file. The Amazon S3 Advanced connector will import all files with the provided prefix, assuming they all have the same schema.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436353\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003954\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon S3 Advanced Connector\n\n", "article_total_view_count": "\n\n\n 5,242\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "amazon_s3_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}