{"file_path": "../../raw_kb_v2\\article\\360046761214\\index.html", "content": {"title": "\n\n\n Workbench 4 FAQs\n\n\n", "article_body": "\n\n\n**Important:**\n Support for Workbench 4 ended on\n **April 15, 2021**\n . Workbench may continue to run on installed machines, but it will no longer receive feature enhancements and security updates. When issues are encountered in Workbench 4, the recommended course of action from the Domo Support team will be to upgrade to the latest version of Workbench 5. To see this article for Workbench 5, click\n **here**\n .\n\n\n####\n Intro\n\nGet answers to frequently asked questions about Workbench.\n\n--\n\n\n####\n What is Workbench?\n\nWorkbench is a Windows-based application that lets you upload DataSets to Domo.\n\n You can upload data from databases via data queries in ODBC System DSNs, CSV and delimited text files, Microsoft Excel spreadsheets, Jira, QuickBooks, and XML namespaces.\n* You can upload data manually or through scheduled jobs.\n* Workbench validates data and securely transfers data to Domo.\n\n###\n Can Workbench update or make any changes to our original data?\n\nNo, it does not modify your original data. Workbench is designed to read and transmit data to Domo. Workbench does let you modify the data going in to Domo through transforms, calculations, and joins.\n\n\n**Note:**\n\nFor database connections only, if your ODBC driver supports read/write, any queries you pass into your database can be considered a “write.” For example, temp tables, inserts, or deletes are entirely possible with Workbench and database connections. Consider using read-only credentials for your database connections if there is cause for concern.\n\n\n####\n What type of encryption does Workbench use to transmit data?\n\nAll data transferred from Workbench into Domo’s production systems is sent using encrypted HTTPS sessions, the same technology you typically use to conduct online banking and online purchases. No data is sent from Workbench to Domo in an unencrypted manner.\n\n###\n If access credentials cannot be stored as part of the Windows DSN, how are those credentials stored?\n\nWorkbench stores access credentials for ODBC DataSets. To properly protect these credentials, Workbench uses industry standard AES-256 bit encryption. Workbench enforces encryption automatically so users do not have the opportunity of mistakenly storing their passwords or other credentials inappropriately.\n\n###\n How are access controls configured for Workbench?\n\nWorkbench is configured by the client from an access control perspective. Workbench allows users to upload DataSets into Domo to enable KPI card creation and automated updates. Users select DataSets (System DSNs, flat files, Microsoft Excel spreadsheets, JIRA, QuickBooks, XML namespaces) to which they already have access. Workbench can connect to DataSets only if the Microsoft Windows system running the software can reach the DataSet, and if the machine has access to read the DataSet files or databases.\n\n###\n Is any of the data transmitted by Workbench cached on the local machine?\n\nWorkbench uses a temp directory (C:\\Windows\\Temp\\DomoCache) to stage incoming data. If you have many DataSet Jobs with a large number of rows, this temp directory can fill up with a large amount of data. Make sure the C:\\ drive has a reasonable amount of free space for these files. These files are cleared when the job is complete and are not permanently stored.\n\n###\n Do you support Windows 32 and 64-bit versions?\n\nYes, both 32 and 64-bit Windows versions are supported. For more system requirements information, see\n\nInstalling Workbench 4\n\n.\n\n###\n Are 32-bit ODBC connections supported?\n\nYes. Workbench concurrently supports both 32- and 64-bit ODBC drivers.\n\n###\n What is the maximum size of a DataSet that Workbench supports?\n\nWorkbench limits uploading to 50 million rows for a single upload job. You can use a\n\nlastvalue\n\nvariable to upload rows incrementally. For more information about query parameters, see\n\nUnderstanding the Workbench 4 User Interface\n\n.\n\n\n You can check the size of your data by clicking\n **Validate Data**\n .\n\n###\n Can Workbench run from a command line?\n\nYes, Workbench can be executed directly from a command line and/or added as a task in an ETL package.\n\n\n For more information about running Workbench from the command line, see\n\nRunning Workbench 4 from the command line\n\n.\n\n###\n How can I improve the performance of a MySQL driver?\n\nWhen using a MySQL driver, you can decrease its memory usage and improve its performance by configuring parameters for the DSN.\n\n\n**To configure your MySQL DSN,**\n\n. Open the the Windows ODBC Data Source Administrator by entering \"ODBC\" in the Start Menu search, then selecting \"Data Sources (ODBC)\".\n2. Select your DSN, then click\n **Configure**\n .\n3. Click\n **Details**\n to display additional settings.\n\n1. In the\n\t **Connection**\n\t tab, mark the\n\t **Allow big result sets**\n\t box.\n\n\n\t When selected, the driver does not set packet limits for results.\n\t2. In the\n\t **Cursors/Results**\n\t tab, mark the\n\t **Don’t cache results of forward-only cursors**\n\t box and the\n\t **Force use of forward-only cursors**\n\t box.\n\n\n\t When selected, the driver does not cache results and uses forward-only cursors.\n\n\n**Note:**\n Workbench does not need anything other than \"forward only\" cursors and the MySQL ODBC driver performs better using the \"forward only\" cursors option.\n\n\n####\n How do I get access to network files to run a scheduled job?\n\nWhen running a job on a schedule, if the file is not located on the local machine Workbench is running on, you must set up impersonation for access rights.\n\n\n**To set up impersonation,**\n\n. Open\n **Settings**\n for the intended job.\n2. Under\n **Settings > Impersonation,**\n turn on\n **Requires Impersonation**\n .\n3. Enter the\n **Domain**\n and\n **Username**\n information.\n4. Click\n **Validate**\n .\n\nIf you are connecting to a file on a domain file share that the Workbench computer is not on, the domain impersonation will not work if you are not on the domain computer. You will have to give domain access to it.\n\n\n**To give domain access,**\n\n. Open\n **DataSet Jobs**\n in the\n **Accounts**\n pane in Workbench and locate the desired job.\n2. Click\n **Source**\n .\n3. Under\n **Transport Method**\n , enter the network file path in the\n **Network File Path**\n field.\n4. Enter your credentials.\n5. Click\n **Apply Changes**\n .\n\n\n####\n How do I clear the queue in Workbench?\n\nSay you have a dataset set up to update every hour, and you keep getting an error when you’re trying to run the job in Workbench. More specifically, you’re not able to add that job to the queue because it is either already queued or currently executing.\n\n\n There are a few reasons why this error can occur and ways to avoid it:\n\n Check to ensure your jobs are not being scheduled too close to each other. If a job is currently running and another job is scheduled to start while the current job is running, you will see this error. This is normal, as the queue is busy processing the running job. If a job is already in the queue, the queue will not allow it to be queued again until the running job completes or the Domo Workbench service is restarted.\n* The current job could be in a non-responsive state. If a job is running longer than expected, open a case with Domo Support to investigate the issue further. For information on how to contact Support, please see:\n\nGetting Help\n\n.\n* Recreating a job with a different name and deleting the previous job that is stuck in the queue is one way to reset the queue. You can also restart the Workbench service, which will flush the queue.  Normal workflow of Workbench jobs should return after restarting.  If restarting the service does not return your Workbench to normal operation, please open a case with Domo Support. For information on how to contact Support, please see:\n\nGetting Help\n\n.\n\n\n####\n How do I change data capture using Workbench?\n\n\n You can create a new\n\njob that will append the data that has changes in the RDBMS (Relational database management system) since the last load.\n\n\n**Job setup steps**\n\n. Perform the initial load of the data using\n **Create New Data Source**\n .\n2. The two key setup lines in the SQL that are very important are as follows:\n\n\n* Where \"ReportDate\" >\n\n'!{lastvalue:ReportDate}!'\n\nEnsure the Where clause contains the field that holds the value that indicate the changes since last load. The\n\n'!{lastvalue:ReportDate}!'\n\ncontains the last value for the\n **Query Variable**\n as shown (see the Query Variable Setup section below). Call the\n **Query Variable**\n the same name as the field in the query that indicates the changes since the last Load.\n* Order by\n\n\n Ensure you have an\n **Order By**\n clause in the SQL statement, since it will be the value from the last row that will be saved in the Lastvalue variable. If you don’t order by the column that contains the change data capture field, then you might not get the changed rows in the query.\n\n\n3. After the initial load change, the job will start appending data to the existing dataset, as shown in the example below:\n\n*Query Variable Setup Steps**\n\n. Perform the Query Variable setup on the separate ‘Edit Query Variables’ screen. Note that you have the option of setting a Job Variable or a Global Variable.\n2. Create a Job Variable that matches the ‘Name’ of the field that contains the data that controls the Changed data.\n\n. The 'Current Value’ will indicate the last value the job loaded. The initial value must be less than the first record you want to import.\n\n\n####\n What proxy settings does Workbench use?\n\nWhen you first connect to Domo via Workbench, Workbench leverages your Windows system proxy settings. You\n *cannot*\n enter your proxy settings manually at this time. However, after your initial connection, you can then enter proxy settings manually in the\n **Settings > Proxy**\n tab.\n\n###\n Can I save Workbench jobs to a shared folder? I want multiple users to be able to access and edit the jobs, but I can't figure out where jobs are saved on the drive.\n\nAll Workbench jobs are saved in the cloud and tied to a specific login,\n *not*\n saved locally. Therefore, the recommended solution to this problem is to install Workbench on a common server then create an admin user to be used by all users who need to modify jobs. Thus, all these users will be able to access the jobs, and you will not need to worry about saving copies of the job on a physical drive. A benefit specific to Workbench 4 is that users with access to the server can use Workbench simultaneously.\n\n###\n Can I share Workbench jobs?\n\nJobs are tied to the Workbench installation in which they were created. If you wanted to share a job, you would need to export that job on the Workbench installation in which it was created then import it into the second installation of Workbench.\n\n\n**Note:**\n\nIt is not recommended to have the same job running on two different instances of Workbench at the same time. If you do export a job from one and import it into another, be sure to remove it from its original Workbench instance after successfully importing it into another.\n\n\n####\n Is multi-factor authentication available for Workbench?\n\nNot at this time.\n\n###\n Can I do a mass export of all my job files?\n\nYes. Workbench 4.5.1 allows the mass import/export of job files. Right-click\n **DataSet Jobs**\n then select\n **Tools > Export**\n . You are then given the option to check a box for each job you want to export.\n\n\n####\n What are the recommended specifications to run Workbench?\n\n\n* Operating system: Any version of Windows still supported by Microsoft\n* CPU: A modern 4- or 8-core processor\n* Memory: 8-16 GB\n* Hard drive: 250 MB of space minimum, 2 GB recommended (though more may be required depending on the amount of data in your jobs)\n\n\n####\n What firewall rules or ports need to be open for Workbench?\n\nPorts 80 and 443 bi-directional\n\n###\n I’ve put my database connection information in correctly, but the light does not turn green. What do I do?\n\nSome databases, like ACCESS, SAGE, ORACLE, DB-2, and TERADATA, will not validate the transport with a green LED. The validation criteria is a true/false response to the query “SELECT 1.” A positive response will validate and turn the LED green. If there is no response, the LED stays red. Input your query and run a “Preview” to run a true connection validation.\n\n###\n Does Workbench throttle CPU usage?\n\nNot by default, but Workbench 4.51 does have this as a configurable option.\n\n###\n Where does Workbench store staging data by default? And can I move this staging data?\n\nThe data is stored in C:\\Window\\Temp\\DomoCache. Currently you cannot move the staging folder.\n\n###\n The schedule group “existing schedule” radio button is grayed out---what do I do?\n\nClose Workbench and open it as an Administrator.\n\n###\n How do I get the list of table names or stored procedures on my database?\n\nThe query builder is in the\n **Source**\n pane. This may give you a list of tables, views, and procedures. Be aware this is not compatible with all database types.\n\n###\n I am unable to add a user to the Domo Workbench users group in Workbench 4.5+. Why is this?\n\nEnsure your Windows username is not the same as the PC name. Windows 10 appears to enforce this. Older versions of Windows may also be impacted.\n\n###\n My QuickBooks Workbench jobs will not run on schedule. What do I do?\n\nYou must be logged into Windows with an active session for QuickBooks integrated applications to run unattended.\n\n###\n\n\n What do I do if the Unsafe Save dialog appears?\n\nThe \"Unsafe Save\" dialog is displayed when your local job configuration and the remote job configuration stored in Domo do not match up or the job is currently running. To prevent the loss of data, you must first wait for the job to finish if it’s running, then re-sync your local configuration with Domo. This can be done by either clicking\n **Revert**\n or pressing F5 on your keyboard to refresh your entire job list. Unfortunately you will lose any changes that you have made when you take either of these actions. If your job runs long enough or frequently enough that you constantly see this dialog when attempting to make changes, you likely need to temporarily turn off the Workbench service, make your changes, then re-enable the service to start running your newly modified job.\n\n###\n My IT department requires a whitelist for all outgoing internet traffic from our network. Does Domo have an IP whitelist for purposes of running Workbench?\n\nDomo Support can provide you with an IP to whitelist. Note that although unlikely, the IP can change at any moment and without notice, resulting in Workbench job failures. It is advised that you whitelist by DNS name if possible. (e.g.\n\n\n instance.domo.com\n\n\n ).\n\n###\n Is there a way to move my DomoCache directory to a different disk drive?\n\nThe current version of Workbench doesn't allow you to separate the operating system from the application data, but you can work around this issue using hard-coded symbolic links. The following example shows how a user moved his DomoCache directory to the E: drive:\n\n\n`mklink /J \"C:\\ProgramData\\Domo\\Workbench\\DomoCache\" \"E:\\Domo\\Workbench\\DomoCache\"`\n\n###\n What limitations exist for self-serve accounts?\n\nSelf-serve users have a limitation of one auto-run per day and one manual run per hour. If the auto-run fails on the server, this does\n *not*\n count as your one auto-run. Auto-runs only count as runs if an execution is created (i.e. it shows up in the job history in Domo).\n\n*Note:**\n Be sure to set notifications for failures to alert you if a job is unsuccessful. For more information, see\n\nSetting Notifications in Workbench 4\n\n.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360046761214\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004798\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nWorkbench 4 FAQs\n\n", "article_total_view_count": "\n\n\n 4,837\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:30 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "workbench_4_faqs", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_4", "url": "/s/topic/0TO5w000000ZapSGAS"}]}