{"file_path": "../../raw_kb_v2\\article\\360043434013\\index.html", "content": {"Title": "Netbase Connector", "Article Body": "Intro\n                       \n\n                        The NetBase Insight API enables you to search the ConsumerBase index, which contains billions of insight-rich sound bites (sentences), based on the focus of your analysis. Retrieve data to use as input for visualizations in your websites and applications. The Insight API returns metric values, sentiment classifications, emotions, behaviors, and attributes for objects, named entities, and more. You can use the Insight API to integrate social media data and metrics in your web sites and applications. To learn more about the Netbase API, visit their page (\n                        \n                         http://learn.netbase.com/i/706080-ne...ming-interface\n                        \n                        ).\n                       \n\n                        You connect to your Netbase account in the Data Center. This topic discusses the fields and menus that are specific to the Netbase connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n\n\n                              Viewing the ranking of insight categories\n                             \n\n\n\n                              Getting an overview of how your brands are being received\n                             \n\n\n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Sound bites containing a specified insight type\n                             \n\n\n\n                              Total buzz\n                             \n\n\n\n                              Net sentiment\n                             \n\n\n\n                              Passion intensity\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              Social media strategists\n                             \n\n\n\n                              Public relations people\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            1 hour\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            4 (user should have some knowledge of Netbase)\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n                        Be aware that time zones using this connector are determined by UTC.\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Netbase account and create a DataSet, you must a Netbase username and password.\n                       \n\n                        Connecting to Your Netbase Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Netbase Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Netbase account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Username\n                          \n\n                           Enter the username for your Netbase account.\n                          \n\n\n\n                           Password\n                          \n\n                           Enter the password for your Netbase account.\n                          \n\n\n\n\n\n                         Once you have entered valid Netbase credentials, you can use the same account any time you go to create a new Netbase DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with a number of other menus for filtering the report data.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Netbase report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Metric Value\n                              \n\n                               Returns one or more metric values for a time period or time series. You can retrieve metrics such as total buzz, net sentiment, or passion intensity, for a topic.\n                              \n\n\n\n                               Insight Count\n                              \n\n                               Returns the number of sound bites (mentions) containing a specified insight type, such as an emotion or a behavior.\n                              \n\n\n\n                               Cross Tabulation\n                              \n\n                               Returns a specified metric value for one or more topics distributed across one or more themes.\n                              \n\n\n\n\n                                Retrieve Documents\n                               \n\n\n\n\n                                 Returns a list of documents matching the Insight API call, including:\n                                \n\n\n\n\n                                  Metadata for a document, including its insights and sentiment classification.\n                                 \n\n\n                                 The text for each matching sound bite in a document, including the two sentences that occur before and after the matching sentences.\n                                \n\n\n\n\n\n\n\n\n\n\n                                    Note:\n                                   \n                                   Some content providers, such as Twitter, prohibit the download of sound bite text and author details.\n                                  \n\n\n\n\n\n\n                                  The total document count\n                                 \n\n\n\n\n\n\n                               Themes\n                              \n\n                               Returns a list of themes filtered by scope\n                              \n\n\n\n                               Topics\n                              \n\n                               Returns a list of topics filtered by scope and content type.\n                              \n\n\n\n\n\n\n\n                           Topic Scope\n                          \n\n                           Select the category of topics you want to be able to pull data for.\n                          \n\n\n\n                           Theme Scope\n                          \n\n                           Select the category of themes you want to be able to pull data for.\n                          \n\n\n\n                           Topics\n                          \n\n                           Select the topic you want to pull data for.\n                          \n\n\n\n                           Theme Filters\n                          \n\n                           Select the themes you want to pull data for (up to 50).\n                          \n\n\n\n                           Time Period\n                          \n\n\n                            Enter the time period for the data you want to return. This should be in the format\n                            \n                             {time period},{time offset},{time rounding}\n                            \n                            .\n                           \n\n                            The following table lists different examples of how to set this parameter:\n                           \n\n\n\n\n                               No entry\n                              \n\n                               One week of data ending a minute ago\n                              \n\n\n\n                               5d\n                              \n\n                               Five days of data ending a minute ago\n                              \n\n\n\n                               6d,1d\n                              \n\n                               Six days of data ending last midnight UTC\n                              \n\n\n\n                               10d,1h,1h\n                              \n\n                               Ten days of data ending at least an hour ago, on the hour\n                              \n\n\n\n                               2016-05-22\n                              \n\n                               Data between May 22 and now\n                              \n\n\n\n                               2016-05-22 06:00, 2016-05-30 07:00\n                              \n\n                               Data between 6AM UTC May 22 and 7AM UTC May 30\n                              \n\n\n\n\n\n\n\n                           Size Needed\n                          \n\n\n                            Specifies the number of Documents or Insights to be returned. Maximum value for Documents: 2000. Maximum value for Insight Count: 1000 Note only numeric values are valid.\n                           \n\n\n\n\n                           Peer Count\n                          \n\n\n                            The peerCount specifies the number of sentences to return before and after a matching sentence. Default is 2.\n                           \n\n\n\n\n                           Sort\n                          \n\n\n\n                             The sort parameter specifies the sort order for the top sound bites that the Insight API returns in the call. The Insight API sorts to the precision of Deci seconds.\n                            \n\n\n\n                             To sort in ascending order: sort=sort_option.\n                            \n\n\n\n                             To sort in descending order: sort_option where sort_option is one of the following:\n                            \n\n\n\n\n                              confidenceScore\n                             \n\n                              sorts results by a metric that indicates a sound bite's spaminess. It is primarily for internal NetBase use. A lower score indicates that a sound bite is less spammy than a sound bite with a higher score.\n                             \n\n\n\n                              timestamp\n                             \n\n                              sorts results by the date/time data was published to the Internet.\n                             \n\n\n\n                              alertTimestamp\n                             \n\n                              sorts results by the date/time data was indexed into the ConsumerBase system.\n                             \n\n\n\n\n                             To sort results in descending order, preface the parameter with a hyphen (-). To sort in ascending order, do not include the hyphen.\n                            \n\n\n\n\n\n                           Time Units\n                          \n\n                           Select the time unit that the data in the report should be broken down by. For example, if you select\n                           \n                            Month\n                           \n                           , twelve rows of data appear, one for each month in the year.\n                          \n\n\n\n                           Metric Series\n                          \n\n                           Select the metric series you want to filter by. You can select as many metric IDs as you want.\n                          \n\n\n\n                           Authors\n                          \n\n\n                            The authors parameter specifies an author whose documents to include in the analysis. This value will be overwritten if an 'authors' value is provided in the text area. Specifying this parameter excludes documents published by all other authors.\n                           \n\n\n                            syntax:\n                           \n\n                            author_name\n                           \n\n                            :\n                           \n\n                            domain_name\n                           \n\n\n                            Do not include '@', '\n                            \n                             https://'\n                            \n                            ; or 'www.'\n                           \n\n\n\n\n                           Domains\n                          \n\n\n                            The domains parameter specifies a domain from which data should be included in the analysis. This value will be overwritten if a 'domains' value is provided in the text area. Specifying this parameter excludes documents from all other domains.\n                           \n\n\n                            Note:The Insight API supports specifying subdomains and folders, such as\n                            \n                             http://facebook.com/TheSmokingTire/\n                            \n                            .\n                           \n\n\n\n\n                           Keywords\n                          \n\n\n                            The keywords parameters specifies keywords for filtering results. These parameters match both of the following:\n                           \n\n\n                             Sentences containing the keyword, along with their preceding and succeeding sentences.\n                            \n\n                             All sentences in documents whose title contains the specified keyword.\n                            \n\n\n\n\n\n                           Sentiments\n                          \n\n\n                            The sentiments parameter retrieves only data that NetBase has classified with a specified sentiment type. This value will be overwritten if a\n                            \n                             '\n                            \n\n\n                            sentiments\n                           \n\n\n                             '\n                            \n                            value is provided in the text area.\n                           \n\n\n\n\n                           Sources\n                          \n\n\n                            The sources parameter enables you to filter results by source type. If specified, the Insight API only returns data from the specified source type. This value will be overwritten if a\n                            \n                             '\n                            \n\n\n                            sources\n                           \n\n\n                             '\n                            \n                            value is provided in the text area.\n                           \n\n\n\n\n                           Additional Optional Parameters\n                          \n\n\n                            Select the optional parameters you want to filter by. You can select as many optional parameters as you want.\n                           \n\n                            For in-depth documentation on optional parameters, see\n                            \n                             https://api.netbase.com/explorer/api/netbase\n                            \n                            .\n                           \n\n\n\n\n                           Theme Array\n                          \n\n                           Select up to 50 theme arrays. A theme array is a theme you can use to further drill down into your data set. You must define themes in a NetBase application before you can use them in Domo.\n                          \n\n\n\n                           Size Needed\n                          \n\n                           Specifies the number of documents or insights to be returned. The maximum number of documents that may be returned is 2000, and the maximum number of insights is 1000. Only numeric values are valid.\n                          \n\n\n\n                           Peer Count\n                          \n\n                           Specifies the number of sentences to return before and after a matching sentence. The default is 2.\n                          \n\n\n\n                           Categories\n                          \n\n                           Select the categories you want to filter by. You can select as many categories as you want.\n                          \n\n\n\n                           Measure\n                          \n\n\n                            Select the measure parameter for the report.\n                           \n\n\n\n\n                               Mentions\n                              \n                              returns the number of matching sentences for the\n                              \n                               Categories\n                              \n                              value. For example, if you selected\n                              \n                               Sentiment\n                              \n                              for the category, your report would return the number of sentences for each sentiment classification found by the query.\n                             \n\n\n\n\n                               Posts\n                              \n                              returns the number of matching documents for the\n                              \n                               Categories\n                              \n                              value. For example, if you selected\n                              \n                               Geolocation\n                              \n                              for the category, your report would return the number of matching documents for each geolocation found by the query.\n                             \n\n\n\n\n                               Followers\n                              \n                              returns the number of followers when when the selected\n                              \n                               Categories\n                              \n                              value is\n                              \n                               Authors\n                              \n                              . You cannot use\n                              \n                               Followers\n                              \n                              with any other category value. A follower count is the number of users following an author at the moment they publish a document.\n                             \n\n\n\n\n\n\n                           Content Type\n                          \n\n\n                            Select to filter topics by content type.\n                           \n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n\n                          If the connection fails, check the error message. It may contain information concerning an illegal configuration that NetBase does not allow. For example, when running the Insight Count report,\n                         \n\n                        if you s\n                        \n\n\n                           elect\n                           \n                            Followers\n                           \n                           for your\n                           \n                            Measure\n                           \n                           , selecting any category but\n                           \n                            Authors\n                           \n                           will return an error.", "Preview Article": "Click here to preview", "URL Name": "360043434013", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003516", "Archived Date": "", "Language": "English", "Primary Version": "Netbase Connector", "Article Total View Count": "2,378", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Netbase Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}