{"file_path": "../../raw_kb_v2\\article\\360045179713\\index.html", "content": {"title": "\n\n\n Spreaker Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSpreaker provides you with all the tools you need to start a podcast and distribute it on Apple Podcasts, Spotify and more. Use Domo's Spreaker Connector to receive details about episodes, shows, statistics, and more. To learn more about the Spreaker API, visit their page\n\nhttps://developers.spreaker.com/api/\n\n.\n\n\n You connect to your Spreaker account in the Data Center. This topic discusses the fields and menus that are specific to the Spreaker Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Spreaker account and create a DataSet, you must have the following:\n\n Client ID (The client ID of your OAuth2 application)\n* Client Secret (The client secret of your OAuth2 application)\n\nThe Client ID and Client Secret are provided to you upon your account creation in Spreaker.\n\n\n Connecting to Your Spreaker Account\n-------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Spreaker Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Spreaker Connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Spreaker account in Domo) to open the Spreaker OAuth screen where you can enter your Client ID and Client Secret. Once you have entered valid Spreaker credentials, you can use the same account any time you go to create a new Spreaker DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Spreaker when you connect in Domo, you are authenticated automatically when you click\n **Add account.**\n If you want to connect to an account that is different from the one you are logged into, you must first log out of Spreaker.\n\n\n###\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Spreaker report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Demographic Statistics\n  |\n Returns demographic information about people who listen to a specific show, or shows owned by the authenticated user.\n  |\n|\n Device Statistics\n  |\n Returns information about devices used to listen to a specific show, episode, or the authenticated user.\n  |\n|\n Episodes\n  |\n Returns a list of episodes in a specific show or owned by a specific user.\n  |\n|\n Followers Statistics\n  |\n Returns statistics about the authenticated user's followers.\n  |\n|\n Geographic Statistics\n  |\n Returns geographic information about listeners of a specific show or shows owned by the authenticated user.\n  |\n|\n Likes Statistics\n  |\n Returns the number of times listeners have liked a specific show, episode, or shows owned by the authenticated user.\n  |\n|\n Operating System Statistics\n  |\n Returns statistics about the operating systems used to listen to a specific show, episode, or shows owned by the authenticated user.\n  |\n|\n Overall Statistics\n  |\n Returns general statistics about a specific show, episode, or the authenticated user.\n  |\n|\n Play Statistics\n  |\n Returns statistics about how many times a specific show or episode was played, or how many times shows owned by the authenticated user were played.\n  |\n|\n Show\n  |\n Returns a list of shows owned by a specific user.\n  |\n|\n Source Statistics (Details)\n  |\n Returns detailed information about the sites and apps used to listen to a specific show, episode, or shows owned by the authenticated user.\n  |\n|\n Source Statistics (Overall)\n  |\n Returns general information about the sites and apps used to listen to a specific show, episode, or shows owned by the authenticated user.\n  |\n|\n User Information\n  |\n Returns details about a specific user.\n  |\n\n\n |\n|\n Object Type\n  |\n The type of object to report on.\n  |\n|\n Show ID\n  |\n The ID or name of the show to report on. This can be found in the\n ****Shows****\n report or in the URL of the show's Spreaker information.\n\nExample:\n\nhttps://www.spreaker.com/show/\n\n***this-week-in-tech\\_1**** |\n|\n Precision\n  |\n The number of decimal places that should be returned for percentage values.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Time Period\n  |\n The time period for which you would like to receive data.\n  |\n|\n Group\n  |\n The time period that will be used to aggregate statistics in the report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360045179713\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003302\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSpreaker Connector\n\n", "article_total_view_count": "\n\n\n 2,349\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "spreaker_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}