{"file_path": "../../raw_kb_v2\\article\\360043430513\\index.html", "content": {"title": "\n\n\n Creating an Alert for a Visualization Card\n\n\n", "article_body": "\n\nIntro\n-------\n\nWhen you set an Alert on a Visualization Card, you are notified whenever certain conditions (which you specify) are met (a value going above or below a certain threshold, for example). You set Alerts in the\n **Create New Alert**\n dialog.\n\n*Note:**\n You can set Alerts only for PDP (Personalized Data Permissions) policies you are a member of. For example, if you are a member of a policy with permissions to view data for western states only, any Alert you created would apply only to those states. For more information, see\n\nPDP and Alerts\n\n.\n\nYou can specify whether you receive Alerts via email or text. For more information, see\n\nConfiguring Notification and Alert Settings\n\n.\n\n*Video - Alerts Overview**\n\nCreating an Alert\n-------------------\n\nYou can access the\n **Alerts**\n tab to create an Alert in either of the following ways:\n\n Selecting\n **Alert Me**\n from the Card's\n\nmenu in the Card Page.\n* Opening the Card\n **Details**\n view, then clicking\n\nto open the\n **Alerts**\n tab.\n\nAfter you have opened the\n **Alerts**\n tab in the Details view, you can create an Alert by clicking\n **New Alert**\n . You are then taken to a three-step \"New Alert\" wizard in which you can create your Alert. The steps in the wizard are as follows:\n\n. **Set up your Alert rule.**\n Here you specify the conditions that trigger your Alert. You can also specify how often Domo checks to see if the Alert conditions have been met.\n2. **Compose a Notification message**\n . Here you can customize the message for the Alert using a variety of different macros to indicate available metrics.\n3. **Share this Alert**\n . Here you specify the users, groups, and Buzz conversations that receive Notifications when the Alert is triggered.\n\nAll of these steps are described in more detail in continuation.\n\n##\n Setting up your Alert rule\n\nIn Step 1 of the wizard, you specify the conditions that cause your Alert to trigger. You can also set the frequency at which Domo checks to see if the Alert has triggered.\n\n\n If PDP policies have been set on the DataSet for the Card, you can specify how PDP is applied to Alerts in Step 1 of the wizard. For more information, see\n\nPDP and Alerts\n\n.\n\n\n If the data in the Card is filtered via either Page or Card Filters, you are given the option to specify whether the Alert is applied to the filtered or unfiltered version of the Card.\n\n###\n Specifying the Alert conditions\n\nAlerts are made up of the following parts:\n\n The item being measured (the \"metric\"). This could be a specific category or series in your chart, the current value of the chart, or the total of all items in the chart. It could also be a calculation applied to a specific category or series. For example, you could apply an \"Average\" calculation to a given category, then configure your Alert to trigger whenever that value fell below a specified threshold. Domo provides a number of such calculations, from simple arithmetic operations like \"Sum of\" to advanced statistical operations such as \"Skewness of\" and \"Kurtosis of.\"\n* A conditional statement that connects the measure to the value or percentage and determines when your Alert is sent. Domo provides a variety of condition statements to choose from, including greater than, less than, and equal statements and combinations of these. You can also specify a particular degree of change using the\n **changes by**\n ,\n **increases by**\n , and\n **decreases by**\n condition statements.\n* The numerical value or percentage used as the threshold in your Alert.\n\nYou can build an Alert by specifying these components in the three fields in Step 1 (\"Rule\") of the Alert wizard.\n\nIn the preceding screenshot, the user has selected\n **Poor Customer Service (Most recent month)**\n as the measure and\n **Increases by (+ %)**\n as the conditional statement, and has entered\n\n5\n\nas the numerical value. This Alert triggers when the \"Poor Customer Service (Most recent month)\" percentage increases by 5%.\n\n###\n Specifying the Alert frequency\n\nAlso in this tab, you can specify how often Domo checks checks to see if the Alert is in a triggered state. You do this by clicking the arrow at the bottom right of the configuration options and selecting the desired option.\n\nOptions include\n **Every time the data updates**\n ,\n **Hourly**\n ,\n **Daily**\n ,\n **Weekly**\n , and\n **Monthly**\n .\n\n If you select\n **Every time the data updates**\n , Domo checks the Alert any time the data in the Card is refreshed.\n* If you select\n **Hourly**\n or\n **Daily**\n , you can choose whether to include weekends in your evaluation. You can also set the specific time of day when you choose\n **Daily**\n .\n* If you select\n **Weekly**\n , you can select the specific day of the week along with the time of day.\n* If you select\n **Monthly**\n , you can select a specific date or the first/last day of the month, along with the time of day.\n\nDepending on the Alert condition you've selected, a checkbox may also appear reading\n **Keep sending Notifications while in a triggered state**\n . When this box is checked, instead of sending out a single Notification as soon as the Alert enters a triggered state (which is the default functionality), Domo sends out Notifications based on the selected frequency\n *until the Alert conditions are no longer met*\n . For example, let's user Gus creates the Alert rule \"Summary number is greater than 500,\" selects\n **Weekly**\n as the frequency, then checks this box. As soon as the summary number surpasses 500, a Notification is sent. Then, as long as the summary number remains above 500, new Notifications are sent on the specified weekday at the specified time. If the number drops below 500, Notifications will stop being sent. If, on the other hand, Gus doesn't check this box, only an initial Notification is sent when the Alert is triggered.\n\n\n The\n **Keep sending Notifications while in a triggered state**\n checkbox appears only for threshold-based Alerts, as opposed to those one-time Alerts that trigger when a certain degree of change is met. For example, for an \"Is greater than\" Alert (e.g. an Alert that triggers when its value surpasses 1000), this box would be available because the Alert still applies as long as the value remains above the threshold. But for a \"Changes by\" Alert, the box is not available because once the given value is reached, only a single Notification needs be sent—the Alert's work is then done.\n\n###\n Determining whether to honor Filters\n\nIf filters have been set on this Card on either the Page or Card level, an option appears allowing you to toggle whether those filters are honored in the Alert. If you uncheck the box, the Alert will be applied to the unfiltered version of the Card. You can click the\n **Show filters**\n option to see the currently applied filters.\n\n##\n Customizing your Alert message\n\nIn Step 2 of the wizard, you can customize the Notification message that is sent whenever the Alert is triggered. You can choose from a wide variety of macros to include in the message. Macros are used to reference different variables related to your Alert, such as Alert name, previous or current value, Alert owner, change in Alert value, and so on. For example, in the default Notification message that appears when you enter Step 2, macros are used to indicate the Alert rule as configured in Step 1 of the wizard, the name of the Card in which the Alert is found, the previous Alert value, and the current Alert value.\n\nIn the left panel of the wizard, under \"Message,\" you can see the Notification message with the variables switched in for the macros. So for the default Notification message shown above, this message might read as follows:\n\nIn this example, [Full rule] has been replaced by \"Sum of 1-Very Dissatisfied is greater than or equal to 50\"; [Card Name] has been replaced by \"Customer Satisfaction\"; [Previous Alert value] has been replaced by \"empty\" (because there is no previous value for this Alert); and [Current Alert value] has been replaced by \"653.\"\n\n\n You can see a list of macros by clicking the\n **Metric**\n button above the template. For each macro, the list shows you the name of the corresponding variable in your Alert so you know if you are pulling over the right information.\n\nIf you edit the custom message then decide you want to revert it back to the default, you can do so by clicking the\n\nin the top right corner of the Alert message field.\n\n##\n Attaching an action\n\nAlert Actions drive powerful action for your business by triggering events such as Webhook integration with third-party systems and Projects & Tasks integrations in Domo. You can attach an action to an Alert by clicking the\n **Attach Action**\n button below the message preview pane, choosing the action type (either a Webhook or Task), then configuring the action.\n\n###\n Webhook actions\n\nBy attaching Webhook actions to Alerts, you can cause events to be triggered in third-party systems when your Alert threshold is attained. For example, as a CFO,  you might create a Webhook that causes a celebratory message to be posted to your company Facebook page when your stock value reaches a certain price.\n\n\n To create a Webhook action, all you need to do is input the Webhook URL, choose the HTTP API method (POST, DELETE, PATCH, GET, and PUT are available), then enter a secret authorization key if required. You cannot edit the Webhook body aside from the customized Alert message, which was discussed previously.\n\n\n After you have configured your action, you can test it by clicking\n **Send Test**\n .\n\n\n**Video - Alert Actions Overview**\n\n\n**To configure a Webhook action,**\n\n. Click the\n **Attach Action**\n button, which is located under the\n **Message**\n pane in the Alert Wizard.\n2. Select\n **Domo Webhook**\n .\n3. Enter the URL for the desired Webhook.\n4. Select the desired HTTP method in the\n **Method**\n menu (\n **POST**\n is the default).\n5. (Conditional) Enter an authorization key in the\n **Secret**\n field if necessary to authenticate.\n6. (Conditional) If you didn't customize your Alert message previously, you can do this by clicking the arrow next to\n **Webhook body**\n , scrolling down to the bottom of the body content, then clicking the pencil to open the message editor. For more information about the options here, see\n\nCustomizing your Alert message\n\n.\n7. (Optional) Click\n **Send Test**\n if you want to test your configuration.\n8. Click\n **Next**\n to move onto the next step in the wizard.\n\n\n####\n Task creation action\n\nYou can cause a Task to be created when an Alert is triggered. You can choose the Project in which the new Task will be added, edit the customized Alert message if you haven't already, and select an owner for the new Task. As soon as the Alert threshold is reached, this new Task will be added to Domo and assigned to the owner you have selected. For more information about Projects and Tasks, see\n\nProjects and Tasks\n\n.\n\n\n**To configure a Task action,**\n\n. Click the\n **Attach Action**\n button, which is located under the\n **Message**\n pane in the Alert Wizard.\n2. Select\n **Task**\n .\n3. In the\n **Project**\n menu, select the Project where this Task should live.\n\n\n If the desired parent Project doesn't exist yet, you will need to create it. For more information, see\n\nCreating a Project\n\n.\n4. (Conditional) If you didn't customize your Alert message previously, you can do this here by updating the fields in the\n **Task name**\n area as necessary. For more information about the options here, see\n\nCustomizing your Alert message\n\n.\n5. Select the desired Task owner in the\n **Owner**\n menu.\n6. Click\n **Next**\n to move onto the next step in the wizard.\n\n\n###\n Sharing the Alert\n\nIn Step 3 of the wizard, you can share Alerts with other users and/or groups in your Domo so they receive Notifications every time that Alert triggers. You can also write a custom message to let users know what is happening as well as and delete users and groups who should no longer be able to see the Alert. You can delete users and groups only if you have an \"Admin\" default security profile or a custom role with \"Manage All Groups\" enabled. For more information about default security profiles, see\n\nManaging Custom Roles\n\n.\n\n\n You can also share Alerts in Buzz conversations, in which case all users following the conversation receive Notifications. You can search for conversations then select those conversations you want the Alert to be shared in. This search searches keywords from conversation names only; it does\n **not**\n search conversation content.\n\n\n Alerts are sent to the email address and telephone number specified in the user profile. For more information, see\n\nProfile Page\n\n.\n\n\n For information about configuring Notifications, see\n\nConfiguring Notification and Alert Settings\n\n.\n\n\n When you share Alerts with other users in your Domo, they automatically gain access to the Cards those Alerts are tied to if they do not already have it.\n\n\n**To share an Alert with users and/or groups,**\n\n. In the\n **Share this Alert**\n step of the Alert creation wizard, add a person or group to share with by clicking in the\n **Enter users, groups, or emails**\n field and selecting the desired user, group, or email.\n\n\n**Note:**\n In order to share an alert with a group when the DataSet powering a card has PDP policies applied, there must be a PDP policy set specifically for that group.\n\n\n When you select a user or group, that user or group's name appears in the field. You can share with multiple users and/or groups by selecting all of their names and adding them to the field.\n2. (Optional) Write a message in the \"I thought you might find this interesting\" field to let users know what is happening.\n3. Click\n **Save**\n .\n\nThe Alert is shared with the selected users. If you wrote a Notification message, that message is sent to the users you shared with.\n\n\n**To remove users or groups from the shared list for this Alert,**\n\n. In the Details view for the Card with the Alert, click the\n\nicon to show the Alerts for this Card.\n2. Click the\n **Share**\n button for the Alert you want to remove users from.\n3. Expand the section at the bottom of the dialog by clicking the message reading \"Already shared with [person].\"\n\n\n This displays rows for all users and/or groups the Alert is being shared with.\n4. Remove a user or group from the shared list by clicking the \"x\" for that user or group.\n\nThe user or group is removed from the shared list and no longer receives Notifications when this Alert is triggered.\n\n\n**To share an Alert in a Buzz channel,**\n\n. In the\n **Share this Alert**\n step of the Alert creation wizard, click the\n **Buzz**\n tab.\n2. (Optional) Use the\n **Filter Buzz channels and chats**\n field to search for conversations you want to share this Alert in.\n3. Check the boxes for all conversations you want to share the Alert in.\n4. Click\n **Share**\n .\n\nThe Alert is shared in the selected conversations. Any users following those conversations will now receive Notifications any time the Alert is triggered.\n\n\n Saving your Alert\n-------------------\n\nAfter you've selected the desired Alert components and entered a value, click\n **Save**\n .\n\n\n Your new Alert appears in the\n **Alerts**\n tab of the\n **Details**\n view. You can do any of the following with this Alert:\n\n Open it for editing.\n* \"Unsubscribe\" from it so you do\n *not*\n receive Notifications when it is triggered. By default, when you create an Alert, you are set to follow it.\n* See how many times it has been triggered.\n* Delete it.\n* Set instant, daily, or weekly Notifications on the Alert.\n* See a listing of Alert events.\n* See a list of followers.\n\nEditing an Alert\n------------------\n\nYou can open an Alert for editing by doing any of the following:\n\n Select\n **Alert Me**\n from the Card's\n\nmenu in the Card Page, click in the top portion of the Alert Card, then click\n **Edit**\n .\n* Click\n\non the Card in the Card page, click in the top portion of the Alert Card, then click\n **Edit**\n . (This icon\n *only*\n appears if one or more Alerts has been triggered on the Card.)\n* Select\n **Alerts**\n in the app toolbar at the top of the screen, locate and click on the Alert you want to edit, then click the\n **Edit**\n button next to \"Rule\" or \"Message Preview\" and make your desired changes.\n* Open the Card Details view, click\n\nto open the\n **Alerts**\n tab, click in the top portion of the Alert Card, then click\n **Edit**\n .\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043430513\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004352\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCreating an Alert for a Visualization Card\n\n", "article_total_view_count": "\n\n\n 12,614\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:45 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "creating_an_alert_for_a_visualization_card", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "notifications_and_alerts", "url": "/s/topic/0TO5w000000ZanxGAC"}]}