{"file_path": "../../raw_kb_v2\\article\\360042928034\\index.html", "content": {"title": "\n\n\n Toast Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nToast is a point-of-sale software system for restaurants that provides order tracking and a reporting and analytics solution. Use the Domo Toast connector to retrieve data about orders, menu items, and payments. To learn more about the Toast API, visit their page (\n\nhttps://pos.toasttab.com/integrations\n\n).\n\n\n You connect to your Toast account in the Data Center. This topic discusses the fields and menus that are specific to the Toast connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Toast account and create a DataSet, you must have the following:\n\n Your Toast client ID\n* Your Toast client secret\n* The Toast restaurant ID for one of the restaurants in your restaurant management group\n\nFor information about obtaining these credentials, reach out to your Toast representative.\n\n\n Connecting to Your Toast Account\n----------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Toast Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Toast account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Domain\n  |\n Enter the hostname for your Toast account. This should be in the format\n\n\n https://\n *hostname*\n .\n\ntoasttab.com\n\n.\n  |\n|\n Client ID\n  |\n Enter your Toast client ID.\n  |\n|\n Client Secret\n  |\n Enter your Toast client secret.\n  |\n|\n Restaurant ID\n  |\n Enter the ID for any one restaurant in your restaurant management group (this is necessary to make API requests).\n  |\n\n\n Once you have entered valid Toast credentials, you can use the same account any time you go to create a new Toast DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Toast report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Menu Items\n  |\n Returns a list of menu items for the specified restaurants.\n\n\n Use \"Replace\" only. Recommended to update no more than once daily or less.\n  |\n|\n Menu Option Groups\n  |\n Returns a list of menu option groups for the specified restaurants.\n\n\n Use \"Replace\" only. Recommended to update no more than once daily or less.\n  |\n|\n Orders\n  |\n Returns orders from the specified date up to the current date. This report only returns up to 30 days of data per run. It will start with the oldest date and go until it reaches the current date.\n\n\n Use \"Merge\" only. Recommended to update once per hour until the data is caught up to the current date, then as often as needed.\n  |\n|\n Restaurants\n  |\n Returns a list of restaurants within your restaurant management group.\n\n\n Use \"Replace\" only. Recommended to update no more than once daily or less.\n  |\n\n|\n|\n Restaurant Selection\n  |\n Select whether you want to pull data for all the restaurants in your management group or only specific restaurants.\n  |\n|\n Restaurants\n  |\n Select the restaurants you want to retrieve data for.\n  |\n|\n Sub Report\n  |\n Select to flatten the data by either the selections or the payments within an order. For example, if you have an order with 3 selections, choosing selections will result in 3 rows of data for that order.\n  |\n|\n Start Date\n  |\n Select the start date for this report. Starting from this date, Domo will retrieve 7 days of data at a time until the connector has caught up to the current date. After this point, each run will only retrieve any new data added since the previous run.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928034\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003659\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nToast Connector\n\n", "article_total_view_count": "\n\n\n 2,503\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "toast_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}