{"file_path": "../../raw_kb_v2\\article\\360043436173\\index.html", "content": {"title": "\n\n\n Microsoft SQL Server Connector\n\n\n", "article_body": "\n\nIntro\n---------\n\nMicrosoft SQL Server is a relational database management system developed by Microsoft. As a database, it is a software product whose primary function is to store and retrieve data as requested by other software applications, be it those on the same computer or those running on another computer across a network (including the Internet). Its primary query languages are T-SQL and ANSI SQL. You can use Domo's Microsoft SQL Server Connector to pull data from your Microsoft SQL Server database and compile custom reports. You indicate the data you want by inputting an SQL query. For more information about the Microsoft SQL Server API, visit their website. (\n\nhttps://technet.microsoft.com/en-us/library/aa174556(v=sql.80).aspx\n\n).\n\n\n The Microsoft SQL Server connector is a \"Database\" connector, meaning it retrieves data from databases using a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n **Database**\n in the toolbar at the top of the window.\n\n\n You connect to your Microsoft SQL Server in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft SQL Server connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Use this connector when Workbench isn't an option and you need direct access to raw data. Otherwise, given that IT must open up access to the SQL server from outside the corporate intranet in order to use this connector, Workbench is generally the preferred option for connecting to SQL Server. For more information, see\n\nConnecting to Data Using Workbench\n\n.\n  |\n|\n**Primary Metrics**\n |\n N/A\n  |\n|\n**Primary Company Roles**\n | * IT\n* Project management\n |\n|\n**Average Implementation Time**\n |\n If the server and account are properly configured, and if you know the queries you need to get the data, implementation could take minutes. Otherwise it could be much longer.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 5\n  |\n\nBest Practices\n----------------\n\nMake sure you use a read-only account that has access only to the databases and tables you need to access.\n\n\n Prerequisites\n---------------\n\nTo connect to a Microsoft SQL Server database and create a DataSet, have your DBA create an account that has read-only access to the databases and tables you need to access. You must have all of the following to connect:\n\n The username and password you use to log into your Microsoft SQL Server account\n* The host name for the database\n* The port number for the database\n* The name of the database\n* The SQL query you will use to pull data\n\nYou can also include the URL where your SSL CA Certificate is located, though this is optional.\n\n\n Before you can connect to your SQL server, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses for Connectors\n\n.\n\n\n Connecting to Your Microsoft SQL Server Database\n--------------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Microsoft SQL Server Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your database. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into your Microsoft SQL Server account.\n  |\n|\n Password\n  |\n Enter the password you use to log into your Microsoft SQL Server account.\n  |\n|\n Host\n  |\n Enter the host name for the database. You can find the host name using an SQL\n\nSELECT\n\nquery in SQL Server Management Studio, as follows:\n\n\n`SELECT serverproperty('Machinename') as Hostname`\n |\n|\n Port\n  |\n Enter the port number for the database.\n  |\n|\n Database\n  |\n Enter the name of the database. You can find the database name using an SQL\n\nSELECT\n\nquery in SQL Server Management Studio, as follows:\n\n\n`SELECT DB_NAME() AS DataBaseName`\n |\n|\n Certificate\n  |\n Enter the URL where the SSL CA Certificate is located (optional)\n  |\n\nOnce you have entered valid Microsoft SQL Server credentials, you can use the same account any time you go to create a new Microsoft SQL DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nIn this pane you create an SQL query to pull data from your database.\n\n  |  |\n| --- | --- |\n|\n Menu\n  |\n Description\n  |\n|\n SQL Query\n  |\n Enter the Structured Query Language (SQL) query to use in selecting the data you want. For example:\n\n\n`Select GeneralManager from Sales WHERE GeneralManager = 'jane';`\n |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Ensure the port is open on the Windows server and that it is open and forwarded in the firewall.\n* Make sure you can connect from a workstation in the client network.\n* Network protocols must be enabled for remote connections to occur.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436173\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003893\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft SQL Server Connector\n\n", "article_total_view_count": "\n\n\n 5,809\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "microsoft_sql_server_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}