{"file_path": "../../raw_kb_v2\\article\\360042928894\\index.html", "content": {"title": "\n\n\n NetSuite App TBA Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThis version of the NetSuite connector uses NetSuite's SuiteScript 2.0 as well as token-based authentication (TBA). Use this version of the connector if you want to effectively gather all of your NetSuite data as securely as possible.\n\n\n You connect to NetSuite in the Data Center. This topic discusses the fields and menus that are specific to the NetSuite App TBA connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your NetSuite account and create a DataSet using this connector, you must have the following:\n\n An installed \"Domo Data Connection 2.0\" NetSuite bundle\n* A NetSuite token ID and token secret\n* A NetSuite account ID\n* A NetSuite script bundle and deploy bundle ID\n* A NetSuite report ID\n\nEach of these items is discussed in more detail in the next two sections.\n\n\n Installing the NetSuite Bundle\n--------------------------------\n\nBefore you can connect to NetSuite data using this connector, you must first install the Domo Data Connection 2.0 bundle from NetSuite.\n\n\n**To install the bundle,**\n\n. In NetSuite, select\n **Customization > SuiteBundler > Search & Install Bundles.**\n2. In the\n **Keywords**\n section, search for \"Domo.\"\n3. Click the search result for \"Domo Data Connection 2.0.\"\n4. Click\n **Install**\n .\n5. Select\n **Customization > SuiteBundler > Search & Install Bundles > List**\n .\n6. Locate \"Domo Data Connection 2.0\" in the list.\n7. Make sure the install status is complete, indicated by a green checkmark.\n\nConnecting to Your NetSuite Data in Domo\n------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the NetSuite App TBA Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for to connecting to your NetSuite account. Each connection option is discussed in detail in continuation.\n\n\n Once you have connected to NetSuite, you can use the same account any time you go to create a new NetSuite App TBA DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n####\n Choosing Your Environment\n\nIn the\n **Environment**\n menu, select\n **Sandbox**\n if your Netsuite account is a sandbox account. You can find this by hovering over your name/account in the top right corner of NetSuite and clicking\n **View all roles**\n . Your environment should be listed under\n **Account Type**\n .\n\n###\n Obtaining Your Token ID and Token Secret\n\n*To create a Token and ID and Token Secret,**\n\n. In NetSuite, choose the role you want to access data in.\n2. Go to your main page by clicking the house icon in the top left corner of the screen.\n3. In the\n **Settings**\n box in the bottom left corner, click\n **Manage Access Tokens**\n .\n\n\n**Note:**\n\nIf you have not configured your role to use access tokens, you will not see the\n **Manage Access Tokens**\n link. To enable access tokens for your role, do the following:\n\n\n\t1. Navigate to\n\t **Setup > Company > Enable Features**\n\t , then open the\n\t **SuiteCloud**\n\t tab.\n\t2. Under\n\t **Manage Authentication**\n\t , enable\n\t **Token-Based Authentication**\n\t .\n4. Click\n **New Access Token**\n and choose \"Domo Data Connection 2.0.\"\n5. Choose a token name.\n6. Click\n **Save**\n .\n\n\n Your Token ID and Token Secret should appear under the other information.\n7. Store the newly generated credentials securely (they will not be shown again).\n\n\n####\n Finding Your Account ID\n\nTo find your account ID, select\n **Setup > Integration > Web Services Preferences**\n in NetSuite.\n\nYour account ID will be located under \"Primary Information.\"\n\n\n####\n Finding Your Script ID and Deploy ID\n\n*To find your script ID,**\n\n. In Netsuite, select\n **Customization > Scripting > Scripts**\n .\n2. Click on Domo Data Connection 2.0.\n3. The script ID is found under ID in the form: customscriptXXXX. Note that, you need to enter the entire script id, including the word \"customscript\" as well.\n\n*To find your deploy ID,**\n\n. To obtain the deployment id, the script must first be deployed. To do this, click the Deploy Script box.\n2. Go to\n **Customization -> Scripting -> Script Deployments**\n .\n3. Now, find the\n **Domo Data Connection 2.0**\n script.\n4. The deployment ID is found under ID in the form customdeployX. Note that you need to provide the entire deployment id, including the word \"customdeploy\" as well.\n\n##\n Details Pane\n\nThis pane contains a single\n **Report**\n menu in which you enter the ID for the NetSuite saved search you want to pull into Domo.\n\n\n The NetSuite App TBA connector\n *only*\n pulls in data from saved searches.\n\n\n**To find the report ID for a saved search,**\n\n. In Netsuite, select\n **Reports > Saved Searches > All Saved Searches**\n .\n2. Locate the report you want to pull data from.\n3. Copy the ID found in the\n **ID**\n column corresponding to the saved search you want.\n\n\n This will be in the form\n\ncustomsearchXXXX\n\n, where XXXX is the report ID.\n\n*Tip:**\n If the ID from the ID column does not work, click\n **View**\n and use the saved search ID in the URL.\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n\nSaved Searched ID\n\n|\n\nPlease provide the custom search ID for the NetSuite saved search you wish to run.\n\n|\n|\n\nSearch Type\n\n|\n\nSelect the Search Type. If you wish to have no search type, select the blank option at the top and click save.\n\n|\n|\n\nDate Format\n\n|\n\nSelect the date format.\n\n|\n|\n\nDuplicate Row Handling\n\n|\n\nSelect an option to keep or remove duplicate rows from your data.\n\n|\n|\n\nUse SQLLite to Prevent duplicate records caused by modifying data during the connector run\n\n|\n\nCheck this box to remove duplicate records, bringing in only the most recently modified data. These duplicates are caused if your data is modified while the connector is running. Duplicates are removed using an SQLite query that keeps the most recently modified row selected by the [row id].\n\nChecking this box will slow your connector run, so use this feature only when necessary. It only works when you select the update method as\n **Merge.**\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQ\n-----\n\n\n####\n Why do I need a script ID?\n\nNetSuite requires a script to access their information (through Saved Searches). Domo's NetSuite App TBA connector interacts with this script to get your data.\n\n###\n What is the difference between this connector and other NetSuite connectors?\n\nNetSuite App TBA uses the new version of the NetSuite API, which supports many new features. While this connector uses some of these new features to more efficiently provide data, it has the same functionality as the other NetSuite connectors.\n\n###\n How do I know my NetSuite data is being accessed securely?\n\nThe NetSuiteAppTBA uses token-based authentication, so Domo never sees your actual credentials. Your token can be revoked at any time through the NetSuite UI.\n\n###\n How do I know which NetSuite role the connector is using?\n\nNetSuite roles are attached to the tokens you create. To use a different role in the NetSuite connector, you must create a new token in the role you desire. To do so...\n\n. Hover over your name in the top right corner, then choose the role you wish to use from the dropdown.\n2. Follow the directions to create a token in this role.\n\n*Note**\n**:**\n\nAll roles may not have the ability to create access tokens.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928894\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003569\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nNetSuite App TBA Connector\n\n", "article_total_view_count": "\n\n\n 5,174\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "netsuite_app_tba_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}