{"file_path": "../../raw_kb_v2\\article\\360052884153\\index.html", "content": {"title": "\n\n\n JIRA Cloud Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nJIRA helps teams to get organized and work together to build incredible products, but product teams are just one part of your organization. With Domo, you can combine data from multiple sources into a single platform--pulling data from product development, marketing, sales, operations, and finance for a real-time, holistic view of your business.\n\n\n Once your data is in Domo, you can get stunning, dynamic JIRA visualizations with real-time data, on any device.\n\n\n Domo's JIRA Cloud connector allows you to connect to your JIRA account to extract data from JIRA. You can import data including issue tracking, completed tickets per team, ticket resolution time, and project management metrics, using either custom or predefined queries. To learn more about the JIRA API, see\n\nhttps://developer.atlassian.com/jiradev/jira-apis/jira-rest-apis/jira-rest-api-tutorials/jira-rest-api-example-query-issues\n\n.\n\n\n The JIRA connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n ****Cloud App****\n in the toolbar at the top of the window.\n\n\n You connect to your JIRA Cloud account in the Data Center. This topic discusses the fields and menus that are specific to the JIRA Cloud connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n****Primary Use Cases****\n | * Tracking progress and movement of tickets\n* Number of tickets assigned to specific users or groups\n* Seeing if too many tickets of a certain type are open (bugs)\n |\n|\n****Primary Metrics****\n | * Bug / issue / ticket tracking (by age, type, status, submitter)\n* Completed tickets per team\n* Ticket resolution time\n* Project management metrics (tracking individual tasks of a larger project or epic).\n |\n|\n****Primary Company Roles****\n |\n Product managers\n  |\n|\n****Average Implementation Time****\n |\n This can vary wildly depending on the implementation and the user's level of knowledge of their JIRA system.\n  |\n|\n****Ease of Use (on a 1-to-10 scale with 1 being easiest)****\n |\n 7\n  |\n\nBest Practices\n----------------\n\n\n* You should usually use \"Replace\" with the JIRA Cloud connector, as \"Append\" does not work well.\n* If the query is for data across a long time period, scheduling should be kept to a minimum (once a day). For shorter queries, more frequent updates are appropriate.\n\nPrerequisites\n---------------\n\nTo connect to your JIRA Cloud account and create a DataSet, you must have:\n\n The domain of your JIRA Cloud account (Jira Server accounts are not supported for OAuth).\n\nYou can authenticate to the Jira Cloud connector with the same credentials you use to log into your Jira account online.\n\n\n Connecting to Your JIRA Cloud Account\n---------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Jira Cloud Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your (third-party tool) account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Domain\n  |\n The domain of your JIRA Cloud account. Jira Server accounts are not supported for OAuth.\n  |\n\n\n Once you have entered valid\n\nJIRA Cloud\n\ncredentials, you can use the same account any time you go to create a new\n\nJIRA Cloud\n\nDataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n###\n Get JIRA Issue Data\n\nWhen you select\n ****Get JIRA Issue Data****\n , a JQL Query Builder appears on the screen. Here you can build JIRA queries to returns columns for nearly every JIRA ticket parameter, like issue summary and description, creation date, resolution date, impacted customer name, and environment. You can also create a JQL query in JIRA and paste it into the query builder.\n\n\n The JQL Query Builder automatically suggests your JIRA fields and values, enabling you to easily create JQL queries.\n\n\n You may also select from the suggested queries on the right side of the Query Builder. Simply click on a suggested query and it will populate the JQL Query Builder. You may edit the query if desired afterwards.\n\n\n One query example is as follows:\n\n\n`(issuetype = Bug OR issuetype = defect OR issuetype = Improvement) AND status != Closed ORDER BY createdDate DESC`\n\n\n This query retrieves all open issues that are classified as bugs, defects, or Improvements and sorts them by their creation dates.\n\n\n For more information about writing JQL queries, see\n\nhttps://confluence.atlassian.com/display/JIRA/Advanced+Searching\n\n.\n\n####\n JIRA Issue Reports\n\nIf you would prefer to pull in premade reports rather than build custom queries, you can do so by expanding the\n ****Report Selection****\n tab and then choosing the desired report type. The following reports are available:\n\n\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Comments Report\n  |\n Returns JIRA tickets with their related comments.\n  |\n|\n Changelog Report\n  |\n Returns changelogs per issue applicable to the query.\n  |\n|\n Labels Report\n  |\n Returns labels for issues applicable to the query.\n  |\n|\n Linked Issues Report\n  |\n Returns linked issues for issues applicable to the query.\n  |\n|\n Standard Ticket Report\n  |\n Returns columns for nearly every parameter for JIRA tickets, such as issue summary and description, creation date, resolution date, impacted customer name, environment, etc.\n  |\n|\n Ticket History Report\n  |\n Returns historical information about tickets.\n  |\n|\n Worklog Report\n  |\n Returns worklogs per issue applicable to the query.\n  |\n\n\n####\n Get JIRA Admin Data\n\nYou can access a number of JIRA admin-level reports. If you want to build custom queries, select\n ****JIRA Issue Data****\n instead.\n\n\n The following reports are available:\n\n\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Agile API\n  |\n The Agile API is currently not supported for OAuth2 accounts. Once Jira adds support, domo will update this section to include it. This data can be accessed using the regular Jira connector with basic authentication instead.\n  |\n|\n Fields\n  |\n Returns a list of fields used in the user's JIRA account.\n  |\n|\n Group Members\n  |\n Returns a list of users that belong to the specified group. You must have admin access to run this report.\n  |\n|\n Issue Query\n  |\n Allows the user to query issues using JQL (JIRA Query Language).\n  |\n|\n Projects\n  |\n Returns a list of all projects the user has access to.\n  |\n|\n Project Versions\n  |\n Returns a list of all versions of the specified project.\n  |\n|\n Users Groups\n  |\n Returns a list of groups for all users.\n  |\n\nFAQ\n-----\n\n\n####\n When should I use this connector?\n\nThe JIRA Cloud Connector connects to JIRA Cloud instances using OAuth. Use this connector if your JIRA instance does not allow local usernames and passswords, and if you are using a JIRA Cloud instance.\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|  |  |\n| --- | --- |\n| **Report Name**  | **Endpoint URL**  |\n|\n Issue Query\n  |\n /rest/api/2/search\n  |\n|\n Fields\n  |\n /rest/api/2/field\n  |\n|\n Group Members\n  |\n /rest/api/2/group/member/{groupname}\n  |\n|\n Projects\n  |\n /rest/api/2/project\n  |\n|\n Project Versions\n  |\n /rest/api/2/project/{projectId}/versions\n  |\n|\n Users Groups\n  |\n /rest/api/2/user/groups\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the domain of your JIRA Cloud account. The Jira Cloud connector supports OAuth2 authentication. You can authenticate to this connector with the same credentials you use to log into your Jira account online.\n\n###\n How frequently will my data update?\n\nData from Jira's servers are usually made available to the API immediately.\n\n###\n How do I know if my query is right?\n\nJira's platform provides a handy tool to verify if your query is valid. An easy way to access this tool is simply to do a search in Jira's search bar. Once on the search screen, you will see a green check box next to the query string for your search to indicate that it is valid. Otherwise, you will see a red X. You can switch back to the basic search functionality to build a query from the available selectors, and then switch again to advanced to see the resulting query.\n\n###\n Can this connector pull custom fields?\n\nBecause Jira returns so much data, the connector enables you to specify fields either as inclusive or exclusive. If you choose inclusively, only the fields you specify will be returned. If you choose exclusive, all fields will be returned except for those that you specify.\n\n\n**Note**\n : Field ids must be entered. If the field names are entered, then they will be ignored.\n\n###\n Why will the connectors not reset the schema?\n\nConnectors will not reset the schema of what has already been imported, which may result in blank columns appearing, if the customer has the dataset set to run on a\n **Replace**\n . This is due to the need to maintain backwards compatibility.\n\n\n Troubleshooting\n-----------------\n\n\n* Jira requires a fair amount of configuration from the side of the JIRA admin to ensure that API access is enabled. Common issues include setting the timeouts too short or not providing sufficient resources to the JIRA server.\n* If users have trouble understanding how to format JQL, the easiest thing is to log into the JIRA front end. Via the search bar, JIRA provides a tool that can construct a JQL query with preset filters. After constructing your query, if you hit the\n ****Advanced****\n button, JIRA presents you with your selections in JQL format.\n\nOther Panes\n-------------\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360052884153\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003298\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nJIRA Cloud Connector\n\n", "article_total_view_count": "\n\n\n 5,040\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "jira_cloud_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}