{"file_path": "../../raw_kb_v2\\article\\4409812099735\\index.html", "content": {"title": "\n\n\n Figma Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nFigma is a web-based, collaborative graphics editor and prototyping tool used in interface designing. With Figma, everyone works towards a shared goal. The Figma apps for Android and iOS allow viewing Figma prototypes in real-time on mobile devices. Use Domo's Figma Connector to obtain the details about the files in a specific project, components, component sets and styles within a file library as well as a team library, and the projects within a specified team.\n\n\n With the Figma Connector, enable your product teams to ship new products faster and feel more confident in their decisions. By combining your Figma data with Domo's leading business intelligence platform, you'll develop comprehensive strategies to fully optimize your business. Within minutes you'll be able to create customized reports for your most important KPIs, helping you get a holistic view of your file library and team library performance. To learn more about the Figma API, visit their page (\n\nhttps://www.figma.com/developers/api\n\n).\n\n\n The Figma Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Figma account in the Data Center. This topic discusses the fields and menus that are specific to the Figma Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\n\n To connect to your Figma account and create a DataSet, you must have the personal access token of your Figma account. The token can be obtained in Account Settings under the Personal access token section.\n\nConnecting to Your Figma Account\n----------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the Figma Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Figma account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Personal Access Token\n  |\n Enter the personal access token of your Figma account.\n  |\n\nOnce you have entered valid Figma credentials, you can use the same account any time you go to create a new Figma DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Figma report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n File Components\n  |\n Get a list of published components within a file library\n  |\n|\n File Component Sets\n  |\n Get a list of published component\\_sets within a file library\n  |\n|\n File Styles\n  |\n Get a list of published styles within a file library\n  |\n|\n Project Files\n  |\n List the files in a given project.\n  |\n|\n Team Components\n  |\n Get a paginated list of published components within a team library\n  |\n|\n Team Component Sets\n  |\n Get a paginated list of published component\\_sets within a team library\n  |\n|\n Team Projects\n  |\n Get a list of all the Projects within the specified team.\n  |\n|\n Team Styles\n  |\n Get a paginated list of published styles within a team library\n  |\n\n|\n|\n File Key\n  |\n Enter the key of the file to list data from.\n  |\n|\n Project ID\n  |\n Enter the ID of the project to list files from.\n  |\n|\n Team ID\n  |\n Enter the ID of the team to list data from.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the Figma API does this Connector use?\n\nThis Connector uses version 1 of the Figma API (\n\n\n https://api.figma.com/v1\n\n\n ).\n\n###\n Which endpoint(s) does each report call in this Connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n File Components\n  |\n /files/{file\\_key}/components\n  |\n|\n File Component Sets\n  |\n /files/{file\\_key}/component\\_sets\n  |\n|\n File Styles\n  |\n /files/{file\\_key}/styles\n  |\n|\n Project Files\n  |\n /projects/{project\\_id}/files\n  |\n|\n Team Components\n  |\n /teams/{team\\_id}/components\n  |\n|\n Team Component Sets\n  |\n /teams/{team\\_id}/component\\_sets\n  |\n|\n Team Projects\n  |\n /teams/{team\\_id}/projects\n  |\n|\n Team Styles\n  |\n /teams/{team\\_id}/styles\n  |\n\n\n####\n What kind of credentials do I need to power up this Connector?\n\nYou need\n\nthe personal access token of your Figma account. The token can be obtained in Account Settings under the Personal access token section.\n\n\n####\n How often can the data be updated?\n\nAs frequently as needed.\n\n###\n Are there any API limits I should be aware of?\n\nNo\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4409812099735\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003211\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFigma Connector\n\n", "article_total_view_count": "\n\n\n 2,369\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "figma_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}