{"file_path": "../../raw_kb_v2\\article\\4578278680855\\index.html", "content": {"Title": "Getting Started With Goals", "Article Body": "Intro\n                       \n\n                        Domo Goals\n                        \n                         is a feature that allows users to create results-driven objectives.\n                         \n\n                           Domo Goals is based on the OKR, or Objectives and Key Results philosophy. Goals can be personal, for teams, or for companies.\n                           \n\n                             This article describes the various goal types, how to create a new goal, and how to add metrics to track your progress.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The articles in this section use \"Goals\" and \"Metrics.\"\n                           \n                            Your organization may refer to them as something else depending on your Goals Admin Settings.\n                           \n                           For more information, see\n                           \n                            Configuring Goals Settings\n                           \n                           .\n                          \n\n\n\n\n\n\n                        Goal Types\n                       \n\n\n                         Personal\n                        \n                        ,\n                        \n                         Team\n                        \n                        , and\n                        \n                         Company\n                        \n                        goals all serve different purposes. Personal goals allow users to track their individual milestones, while team and company goals give multiple people access to group objectives. With tags and linking parent or child goals, users can create connections between goals regardless of their type. Goal types can be changed at any time. However, o\n                        \n                         nly admin users or those\n                        \n\n                         with\n                        \n\n                         the\n                        \n\n                         \"Manage All Goals\" grant\n                        \n\n                         will be able to designate\n                        \n\n                         an objective as \"\n                        \n\n                         Company.\"\n                        \n\n\n\n\n                        Locating Personal Goals\n                       \n\n                        With personal goals, users can create individual objectives with metrics to measure progress.\n                       \n\n\n\n                        1. In the navigation header, select\n                        \n                         Goals\n                        \n                        .\n                       \n\n\n\n\n                        2. In\n                        \n                         Goals\n                        \n                        , select\n                        \n                         Personal\n                        \n                        from the left-side rail.\n                       \n\n                        A list of your personal goals, metrics, and summary banner displays.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Personal goals are visible to members of your organization.\n                           \n                            Others can see your goals by accessing the\n                            \n                             Search\n                            \n                            tool in the left navigation menu.\n                           \n\n\n\n\n\n\n\n                        Locating Team Goals\n                       \n\n                        With team goals, groups of individuals can track an objective's progress.\n                        \n\n                          Teams\n                         \n\n                          are identical to Groups in the Admin Settings. Users can view and create groups by going to\n                          \n                           More\n                          \n                          >\n                          \n                           Admin\n                          \n                          >\n                          \n                           Groups\n                          \n                          .\n                         \n\n\n\n\n\n                        1. In the navigation header, select\n                        \n                         Goals\n                        \n                        .\n                       \n\n\n\n\n                        2. In\n                        \n                         Goals\n                        \n                        , select\n                        \n                         Team\n                        \n                        from the left-side rail.\n                       \n\n                        A list of your team goals, metrics, and summary banner displays.\n                       \n\n\n\n                        Creating Teams within Goals\n                       \n\n\n\n                          Users can create new teams in\n                         \n\n                          the\n                          \n                           Goals\n                          \n                          feature. You can only make existing teams owners, so ensure your group is created before beginning a new team goal.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           In order to create teams within goals, you must have the Edit Groups grant enabled. Contact your CSM for more information.\n                          \n\n\n\n\n\n\n                          1. In the navigation header, go to\n                          \n                           Goals\n                          \n                          .\n                         \n\n\n\n\n\n                          2. In\n                          \n                           Goals\n                          \n                          , select\n                          \n                           Teams\n                          \n                          from the left-side rail.\n                         \n\n\n\n\n\n                          3. Select the\n                          \n                           + Create Team\n                          \n                          button.\n                         \n\n\n\n\n\n                          The\n                          \n                           Group Creation\n                          \n                          modal displays.\n                         \n\n\n\n                        4. Define the specifications for your new group:\n                       \n\n\n                         Enter a title and optional description.\n                        \n\n                         Choose a group type (closed, dynamic, or open).\n                        \n\n                         Select members from your organization.\n                        \n\n                         (Optional) Choose an avatar.\n                        \n\n                         Add owners. This can be multiple members of your team or specific individuals. The Manage All Groups grant is automatically included.\n                        \n\n                         Review and save.\n                        \n\n\n                        5. After specifying your group's details, select\n                        \n                         Save.\n                        \n\n\n                        The new team is created and can be assigned to a goal.\n                       \n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           If the entire team or group wishes to edit the goal, the team must be assigned as the \"owner.\" Otherwise, you can restrict editing privileges to one user. The team will not be able to update the goal, but they will have access to view it.\n                          \n\n\n\n\n\n\n                        Locating Company Goals\n                       \n\n                        With company goals, all members of an organization can track an objective's progress. Editing privileges can be restricted to individuals or teams within a company. Personal and team goals can be linked to a parent company goal, with connected metrics that determine the overall status and progress.\n                       \n\n\n\n                        1. In the navigation header, select\n                        \n                         Goals\n                        \n                        .\n                       \n\n\n\n\n                        2. In\n                        \n                         Goals\n                        \n                        , select\n                        \n                         Company\n                        \n                        from the left-side rail.\n                       \n\n                        A list of your company goals, metrics, and summary banner displays.\n                       \n\n\n\n                        Creating a Goal\n                       \n\n\n                         1. In the navigation header, select\n                         \n                          Goals.\n                         \n\n\n\n\n\n\n\n                         2. Select the\n                         \n                          + New Goal\n                         \n                         button.\n                        \n\n\n\n\n\n\n\n\n\n\n                         3. Define the specifications for your new goal:\n                        \n\n\n\n                         Enter a title and optional description.\n                        \n\n                         Choose a goal type: personal, team, or company.\n                        \n\n                         Choose an owner. You can add several individuals, a team, or keep yourself as the default owner.\n                        \n\n                         Determine the\n                         \n                          Start Date\n                         \n                         and\n                         \n                          Achieve By\n                         \n                         date by selecting\n                         \n                          Edit\n                         \n\n                         .\n                        \n\n                         Add optional tags. Tagging groups your goal with others that have the same tag.\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           By default, the current period for your company goals program is displayed as your start and achieve by dates. Information for administrators about creating periods for goals is found in\n                           \n                            Configuring Domo Goals for your Organization\n                           \n                           .\n                          \n\n\n\n\n\n\n\n                         4. Select\n                         \n                          Next.\n                         \n\n\n\n\n                         The basic goal is created. You can add one or more metrics that make your goal measurable. If the title and description are sufficient for now, select\n                         \n                          Skip\n                         \n                         . If you'd like to add a metric, select\n                         \n                          Next\n                         \n                         .\n                        \n\n\n\n                         5. (Conditional) If you would not like to add a metric, select\n                         \n                          Skip\n                         \n                         .\n                        \n\n\n\n                         The goal is added to its goal type tab on the left-side rail.\n                        \n\n\n\n\n                        Adding Metrics to Goals\n                       \n\n                        Metrics are crucial for making goals measurable. Metrics can use percentages, custom numerical values, data from Domo cards, and Projects and Tasks to track a goal's progress over time. They can be added during the initial goal creation or later.\n                       \n\n\n                         Before adding metrics to your goal, determine whether you’re tracking progress by:\n                        \n\n\n\n\n                          Linking a Domo card\n                         \n\n\n\n                          Updating metrics manually\n                         \n\n\n\n                          By connecting a project or task.\n                         \n\n\n\n\n                         Adding Metrics to a New Goal\n                        \n\n\n\n                         1. After creating a goal and adding details, such as a title, owner, and completion date, select\n                         \n                          Next\n                         \n                         .\n                        \n\n\n\n\n\n\n                         The\n                         \n                          Add a metric\n                         \n                         modal displays.\n                        \n\n\n\n                         2. From the options, select\n                         \n                          Link a card\n                         \n                         ,\n                         \n                          Manual\n                         \n                         , or\n                         \n                          Projects and Tasks\n                         \n                         .\n                        \n\n\n\n                         3. Depending on your selection, follow the guides within this article:\n                         \n                          Linking a Card\n                         \n                         ,\n                         \n                          Manually Updated Metrics\n                         \n                         , or\n                         \n                          Connecting a Project or Task.\n                         \n\n\n\n\n\n\n\n\n                         Adding Metrics to an Existing Goal\n                        \n\n\n\n                         1. In the navigation header, select\n                         \n                          Goals.\n                         \n\n\n\n\n                         2. Select a goal from the\n                         \n                          Personal\n                         \n                         ,\n                         \n                          Team\n                         \n                         , or\n                         \n                          Company\n                         \n                         tabs.\n                        \n\n\n\n                         The\n                         \n                          Goal Details\n                         \n                         displays.\n                        \n\n\n\n                         3. Select\n                         \n                          + Add a Metric\n                         \n\n\n\n\n                         The\n                         \n                          Add a metric modal\n                         \n                         displays.\n                        \n\n\n\n                         4. From the options, select\n                         \n                          Link a card\n                         \n                         ,\n                         \n                          Manual\n                         \n                         , or\n                         \n                          Projects and Tasks\n                         \n                         .\n                        \n\n\n\n                         5. Depending on your selection, follow the guides within this article:\n                         \n                          Linking a Card\n                         \n                         ,\n                         \n                          Manually Updated Metrics\n                         \n                         , or\n                         \n                          Connecting a Project or Task.\n                         \n\n\n\n\n\n                        Linking a Card\n                       \n\n\n                         This option allows you to create a metric using data in a Domo card. The metric’s progress is automatically driven by value changes in the card. Anyone with a default security role of “Participant” or higher can link Domo cards to goals in their instance.\n                        \n\n\n\n\n\n                         1. Select\n                         \n                          Link a Card\n                         \n                         from the\n                         \n                          Add a metric\n                         \n                         modal. Select\n                         \n                          Next.\n                         \n\n\n\n\n\n\n\n\n\n                         2. Choose a card or search for one.\n                        \n\n\n\n                         3. Make selections from the various menus for\n                         \n                          Metric, Meets this condition\n                         \n                         ,\n                         \n                          For This Value\n                         \n                         , and the\n                         \n                          Start Value.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           A card must have a summary number in order to be used as a metric.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                         Card metrics are made up of the following parts:\n                        \n\n\n\n\n                          Metric:\n                         \n                         T\n                         \n                          he item being measured. This could be the current\n                         \n\n\n                           Summary Number\n                          \n\n\n                          of the Card or the sum, average, minimum, or maximum value of all items or items in a certain column.\n                         \n\n\n\n                          Filters\n                         \n\n                          may be applied to focus on certain aspects of the card without changing the existing data by selecting the\n                          \n                           Filter\n                          \n                          and\n                          \n                           +\n                          \n                          buttons.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                          Meets this condition:\n                         \n                         Domo provides a variety of condition statements to choose from, including greater than, less than, and equal statements and combinations of these.\n                         \n\n\n\n\n                          Frequently, goals are considered achieved if they meet OR exceed a target. Selecting greater than or equal to, for example, will assure your goal is complete even if you go above your target.\n                         \n\n\n\n\n                         3. Define the specifications for your goal's metric:\n                        \n\n\n\n                         Enter a title and optional description.\n                        \n\n                         Choose an owner. You can add several individuals, a team, or keep yourself as the default owner.\n                        \n\n                         Determine the\n                         \n                          Start Date\n                         \n                         and\n                         \n                          Achieve By\n                         \n                         date by selecting\n                         \n                          Edit\n                         \n\n                         .\n                        \n\n                         Add optional tags. Tagging groups your metric with others that have the same tag.\n                        \n\n\n\n\n\n                         4. Select\n                         \n                          Done.\n                         \n\n\n\n\n\n\n                         The card metric is created and attached to your goal.\n                        \n\n\n\n\n\n                         Manually Updated Metrics\n                        \n\n\n\n                         This option allows users to create custom measurements for their needs. The metric's progress is updated when users manually change the values in the metric details view. To create a manually tracked metric, select\n                        \n\n                         Manual\n                        \n\n                         .\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                           After selecting\n                           \n                            Manual\n                           \n                           from the\n                           \n                            Add a metric\n                           \n                           modal,\n                          \n\n                         you have two options:\n                        \n\n\n\n\n\n                           Use a percentage scale\n                          \n\n\n                          , where you report progress as a completion percentage.\n                         \n\n\n\n\n                           Choose your own value\n                          \n\n                         ,\n                         \n                          where you have a specific number you're working towards, such as how many tasks you'd like to complete.\n                         \n\n\n\n\n\n                        Percentage-Based Metrics\n                        \n\n\n\n\n\n\n\n                          1. Choose\n                         \n\n                          Use a percentage scale\n                         \n                         and select\n                         \n                          Next.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                         3. Define the specifications for your goal's metric:\n                        \n\n\n\n                         Enter a title and optional description.\n                        \n\n                         Choose an owner. You can add several individuals, a team, or keep yourself as the default owner.\n                        \n\n                         Determine the\n                         \n                          Start Date\n                         \n                         and\n                         \n                          Achieve By\n                         \n                         date by selecting\n                         \n                          Edit\n                         \n\n                         .\n                        \n\n                         Add optional tags. Tagging groups your metric with others that have the same tag.\n                        \n\n\n\n\n                          7. Select\n                          \n                           Done.\n                          \n\n\n\n\n\n\n                          The metric is created and attached to the goal, with the progress initially set to 0%. Each time you manually update your progress, the completion percentage will change.\n                         \n\n\n\n\n\n\n                         Choose Your Own Value Metrics\n                        \n\n\n\n                         1. Select\n                        \n\n                         Choose your own value\n                        \n                        and select\n                        \n                         Next.\n                        \n\n\n\n\n\n\n\n\n\n\n                         2. Define the specifications for your goal's metric:\n                        \n\n\n\n                         Enter a title and optional description.\n                        \n\n                         Choose an owner. You can add several individuals, a team, or keep yourself as the default owner.\n                        \n\n\n\n\n                            Define what you are measuring. For example, Tasks or Meetings Attended.\n                           \n\n\n\n\n\n\n\n\n\n\n\n                            Enter the\n                            \n                             Start Value/Current Value\n                            \n                            ,\n                            \n                             Target Value\n                            \n                            , and select the condition. For example, if you would like to complete 50 tasks but have completed 0, you would type 0 in the\n                            \n                             Start Value/Current Value\n                            \n                            and 50 in the\n                            \n                             Target Value.\n                            \n                            For\n                            \n                             Meets this condition\n                            \n                            , users can choose what condition must be met for their goal to be \"complete.\"\n                           \n\n\n\n\n                         Determine the\n                         \n                          Start Date\n                         \n                         and\n                         \n                          Achieve By\n                         \n                         date by selecting\n                         \n                          Edit\n                         \n\n                         .\n                        \n\n                         Add optional tags. Tagging groups your metric with others that have the same tag.\n                        \n\n\n\n\n                          3. Select\n                         \n\n\n                           Done.\n                          \n\n\n\n\n\n                         The metric is created and attached to the goal, with the progress initially set to 0%. Each time you manually update your progress, the completion percentage will change.\n                        \n\n\n\n\n                        Connecting a Project or Task\n                       \n\n\n                         This option allows users to track metric progress with\n                         \n                          Projects and Tasks\n                         \n                         . These can be existing, or users can begin new ones when creating the metric.\n                        \n\n\n\n\n\n                         1. Select\n                         \n                          Projects and Tasks\n                         \n                         from the\n                         \n                          Add a metric\n                         \n                         modal. Select\n                         \n                          Next.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                         3. Locate an\n                         \n                          Existing\n                         \n                         project or create a new one by selecting the\n                        \n\n                         New\n                        \n                        tab. Give it\n                        \n                         a\n                        \n\n                         Project name,\n                        \n                        and add an\n                        \n                         o\n                        \n\n                         ptional description.\n                        \n\n                         Select\n                         \n                          Next\n                         \n                         .\n                        \n\n\n\n                         5. Define the specifications for your goal's metric:\n                        \n\n\n\n                         Enter a title and optional description.\n                        \n\n                         Choose an owner. You can add several individuals, a team, or keep yourself as the default owner.\n                        \n\n                         Determine the\n                         \n                          Start Date\n                         \n                         and\n                         \n                          Achieve By\n                         \n                         date by selecting\n                         \n                          Edit\n                         \n\n                         .\n                        \n\n                         Add optional tags. Tagging groups your metric with others that have the same tag.\n                        \n\n\n\n                         The metric is created and attached to the goal, with the progress initially set to 0%. Each time you complete a task in your project, the completion percentage will change.", "Preview Article": "Click here to preview", "URL Name": "4578278680855", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004343", "Archived Date": "", "Language": "English", "Primary Version": "Getting Started With Goals", "Article Total View Count": "5,090", "": "", "Article Created Date": "10/24/2022, 9:41 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Getting Started With Goals\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Goals Center\n              \n", "url": "/s/topic/0TO5w000000ZanmGAC"}]}