{"file_path": "../../raw_kb_v2\\article\\360042930594\\index.html", "content": {"title": "\n\n\n Google Gmail Connector\n\n\n", "article_body": "\n\n*Important:**\n\nDue to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. All pre-existing DataSets will continue to run normally. Current Connectors that rely on Google OAuth authentication will no longer be able to power up new DataSets. These connectors include the following:\n * Google BigQuery\n* Google Adwords via Google BigQuery\n* DoubleClick Campaign Manager via Google Cloud Storage (DTV2)\n* Google Cloud Storage\n* Google Contacts\n* Google Drive\n* Google Gmail\n* Google Admin SDK Reports\n\nIf you need to change a pre-existing Google OAuth DataSet, please use the corresponding Service Account connector. The following Service Account connectors are now available:\n\n Google BigQuery Service\n* Google Ads (fomerly AdWords) via Google BigQuery Service\n* Google Drive Service\n* Google Cloud Storage Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Admin SDK Reports Service\n\nAll other equivalent Google Service Account connectors are currently in development. Domo will communicate when these connectors become available. You will need to look for the Service Account equivalent connector in Data Center or the App Store and use that connector to get their data.\n\n\n Domo recommends that you proactively repower existing Google connections by creating new DataSets utilizing the new Service Account Key connectors as the connectors become available.  Domo will notify you if any further migration changes should arise.\n\n\n Intro\n-------\n\nGoogle Gmail is a powerful email server used throughout the world. The Google Gmail Connector lets you pull data from your Gmail inbox into Domo so you can combine the power of email data and manage your inbox efficiently. To learn more about the Gmail API, visit their page (\n\nhttps://developers.google.com/gmail/api/\n\n).\n\n\n You connect to your Gmail account in the Data Center. This topic discusses the fields and menus that are specific to the Gmail connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Gmail account and create a DataSet, you must have your Google account credentials.\n\n\n Connecting to Your Gmail Account\n----------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Gmail Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Gmail connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Gmail DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n If you are already logged into Google when you connect in Domo, you are given the option to authenticate using the same account or switch to a different account.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Gmail report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Details\n  |\n Returns the specified message attachments.\n  |\n|\n Draft Message Details\n  |\n Returns the specified draft messages.\n  |\n|\n History Details\n  |\n Lists the history of all changes to the given mailbox.\n  |\n|\n Label Details\n  |\n Returns the specified labels.\n  |\n|\n List Draft Message IDs\n  |\n Lists the drafts in the user's mailbox.\n  |\n|\n List User Labels\n  |\n Lists all labels in the user's mailbox.\n  |\n|\n List User Messages IDs\n  |\n Lists the messages in the user's mailbox.\n  |\n|\n List User Threads\n  |\n Lists the threads in the user's mailbox.\n  |\n|\n Message Details\n  |\n Returns the specified messages.\n  |\n|\n Thread Details\n  |\n Returns the specified threads.\n  |\n\n|\n|\n Message ID\n  |\n Enter the ID of the message you want to retrieve data for. You can find message IDs by running the \"List User Message IDs\" report. For the \"Message Details\" report, if this is left blank, information is returned for all messages.\n  |\n|\n Draft ID\n  |\n Select the ID of the draft you want to retrieve data for.\n  |\n|\n History ID\n  |\n Enter the Start History ID you want to retreive data for. This can be obtained from the historyId of a message, thread, or previous list response.\n  |\n|\n Label Name\n  |\n Select the ID of the label you want to retrieve data for.\n  |\n|\n Query (Optional)\n  |\n Enter a query to pull data specific to that query. This supports the same query format as the Gmail search box. For example:\n\nfrom:\n\nsomeuser@example.comrfc822msgid\n\n: is: unread`\n\n|\n|\n Thread ID\n  |\n Enter the ID of the thread you want to retrieve data for. If this is left blank, information is returned for all threads.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042930594\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003401\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Gmail Connector\n\n", "article_total_view_count": "\n\n\n 4,735\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "google_gmail_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}