{"file_path": "../../raw_kb_v2\\article\\4403367344023\\index.html", "content": {"title": "\n\n\n Domo Sandbox\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo Sandbox is a premium feature that allows users to follow and manage a development lifecycle for Domo dashboards and other objects.\n\n\n Here are some terms you should know before using Domo Sandbox:\n\n\n Term\n  |\n Definition\n  |\n| **Repository**  |\n The collection of objects that are being versioned. Over time, multiple versions of the selected objects are stored. An example of what might be included is a dashboard (including cards, Beast Modes, images, etc.)\n  |\n| **Version**  |\n A snapshot of a repository at a given point in time. A repository can have multiple versions.\n  |\n| **Commit**  |\n The action taken to store a new version. This results in a new snapshot of the Domo objects.\n  |\n| **Promote**  |\n The action taken to create or update the objects in the destination Domo instance. An example is promoting a dashboard to production. This creates the dashboard the first time it is promoted or updates the dashboard on subsequent promote actions.\n  |\n| **Same Instance Promotion**  |\n Promoting a repository in the same instance where it was created. Use this when you want to be able to manage the versioning process in the same Domo instance.\n  |\n| **Source Instance**  |\n The location of the source objects. This is typically a development or sandbox Domo instance.\n  |\n| **Destination Instance**  |\n The location where the objects are updated. This is typically production instance.\n  |\n\nGetting This Feature\n----------------------\n\nIf you are interested in using this feature, please contact your Domo Customer Success Manager (CSM), Technical Consultant (TC), or Account Executive (AE). If you do not have their contact information, reach out to Technical Support at\n\nsupport@domo.com\n\nDepending on the feature, you may be required to complete training before you can use the feature.\n\n\n Instance Configuration\n------------------------\n\nSandbox supports both cross instance and same instance promotion. If cross instance promotion is desired, please contact your Customer Success Manager (CSM) to have an instance provisioned.\n\n\n Instance Relationships\n------------------------\n\n1. Log into your source instance (see the table in\n\nIntro\n\nfor more information).\n\n\n 2. In the navigation header, select\n **More**\n >\n **Admin**\n .\n\n\n The\n **Admin Settings**\n displays.\n\n\n 3.. Under\n **Governance**\n , select\n **Sandbox**\n .\n\n\n 4. Go to the\n **Instances**\n tab and select\n **+ Invite Instance.**\n\nThe\n **Invite Instance**\n modal displays.\n\n4. Type in the destination Domo domain and an optional alias. The alias is the identifier used in other areas of Sandbox. Select\n **Save**\n .\n\n\n The invitation is sent to the destination instance.\n\n*Important:**\n The instance should be entered as \"\n *example*\n .\n\ndomo.com\n\n\"\n\n5. Log in to the destination instance.\n\n\n 6. In the\n **Instances**\n tab, choose\n **Incoming Invites**\n and select\n **Approve.**\n\n\n You can now share repositories with the destination instance and promote them.\n\n\n Creating a Repository\n-----------------------\n\n1. Log into your source instance. In the navigation header, select\n **More**\n >\n **Admin**\n .\n\n\n The\n **Admin Settings**\n displays.\n\n\n 2. Under\n **Governance**\n , select\n **Sandbox**\n .\n\n\n 3. Go to the\n **My Repositories**\n tab and select\n **+ New Repository.**\n\n4. Configure the repository by:\n\n + Naming the repository.\n\t+ Selecting the object type being versioned.\n\t+ Choosing the items to be included in the repository.\n\n\n**Note:**\n By default,\n **Create initial commit**\n is selected. When the repository is saved, the first version is committed.\n\n\n 5. Select\n **Save Repository**\n .\n\n\n The repository is stored in Sandbox in the\n **My Repositories**\n tab.\n\n\n Commit Version\n----------------\n\n1. Log into your source instance. In the navigation header, select\n **More**\n >\n **Admin**\n .\n\n\n The\n **Admin Settings**\n displays.\n\n\n 2. Under\n **Governance**\n , select\n **Sandbox.**\n\n\n 3. Go to\n **Repositories > My Repositories.**\n\n4. Locate the repository and select\n **Commit**\n (or, select\n\n*Repository Options**\n and\n **Commit**\n ).\n\n\n 5. Enter a description for the version that you are creating. By default, the version is can be promoted. Uncheck\n **Allow this commit to be promoted**\n to prevent this version from being immediately available for promotion.\n\n6. Select\n **Save**\n .\n\n\n Manage Repository Sharing\n---------------------------\n\n\n####\n Instance Sharing\n\n1. Log into your source instance. In the navigation header, select\n **More**\n >\n **Admin**\n .\n\n\n The\n **Admin Settings**\n displays.\n\n\n 2. Under\n **Governance**\n , select\n **Sandbox.**\n\n\n 3. Go to\n **Repositories > My Repositories.**\n\n\n 4. Locate the repository you want to share. Select\n\n*Repository Options**\n and choose\n **Manage Sharing**\n .\n\n To share the repository with a specific instance, choose\n **Can Promote**\n .\n* For same instance promotion, share the repository with the source instance by choosing\n **Can Promote.**\n\n\n 5. Select\n **Close**\n .\n\n###\n User Sharing\n\n1. Log into your source instance. In the navigation header, select\n **More**\n >\n **Admin**\n .\n\n\n The\n **Admin Settings**\n displays.\n\n\n 2. Under\n **Governance**\n , select\n **Sandbox.**\n\n\n 3. Go to\n **Repositories > My Repositories.**\n\n\n 4. Locate the repository you want to share. Select\n **Repository Options**\n and choose\n **Manage Sharing.**\n\n\n 5. Select\n **People.**\n Add people and groups, choose the appropriate permission level, and select\n **Share.**\n\n\n 6. Select\n **Close.**\n\n\n The repository is updated with access settings.\n\n###\n Sandbox User Permission Levels\n\n\n**Note:**\n Users with the Administer Sandbox grant can access all repositories.\n\n\n|  |  |\n| --- | --- |\n|\n Co-Owner\n  |\n Can edit, delete, and share the repository\n  |\n|\n Can Edit\n  |\n Can edit and share, but cannot delete the repository\n  |\n|\n Can Commit (in source instance)\n  |\n Can commit the repository, but cannot edit, share, or delete. The user must also have the Manage Repositories grant to commit in the instance.\n  |\n|\n Can Promote (in destination instance)\n  |\n Can promote the repository, but cannot edit or share. The user must have the Manage Repository Promotions grant as well to promote in the instance.\n  |\n\nPromote Repository\n--------------------\n\n\n**Note:**\n When promoting a card in a repository, the user doing the promoting is assigned ownership of any Beast Mode that is tied to a DataSet powering that card.\n\n1. Log into your source instance. In the navigation header, select\n **More**\n >\n **Admin**\n .\n\n\n The\n **Admin Settings**\n displays.\n\n\n 2. Under\n **Governance**\n , select\n **Sandbox.**\n\n\n 3. Go to\n **Repositories > Shared Repositories.**\n\nAll repositories that have been shared with your instance display.\n\n4. Locate the appropriate repository and select\n **Promote.**\n\nThe repository details display.\n\n5. Configure the following:\n\n Choose the version to be promoted. This defaults to the most recent Committed Version.\n* Map dependencies. Depending on the object type of the repository, there may be different mapping requirements. The most common mapping that is required are data sources.\n* In the\n **Advanced**\n tab, apply settings as necessary. Renaming/removing strings from object names is available primarily to facilitate same instance promotion, but can be used when promoting across instances.\n\n6. Select\n **Promote**\n .\n\n\n The process to either create the objects (on first promotion) or update the objects on subsequent promotions is initiated.\n\n\n Sandbox Logs\n--------------\n\n1. Log into your source instance. In the navigation header, select\n **More**\n >\n **Admin**\n .\n\nThe\n\n*Admin Settings**\n\ndisplays.\n\n2. Under\n **Governance**\n , select\n **Sandbox.**\n\n\n 3. Select the\n **Logs**\n tab.\n\n*Note:**\n**Commit Logs**\n are available in the source instance and\n **Promote Logs**\n are available in the destination instance.\n\nBy default, high-level Commit Logs display. To view Promotion Logs, select\n **Promote Logs**\n . This view shows the commit or promote actions that have occurred.\n\nTo view detailed logs for a specific commit or promote action, select\n **View More**\n . This view provides the most detailed information about the commit or promotion that was executed.\n\nGrants\n--------\n\n\n|  |  |\n| --- | --- |\n| **Grant Type**  | **Allows Users To:**  |\n|\n Administer Sandbox\n  | * Send, accept, or deny repository sharing invitations to/from other Domo instances\n* Manage global settings, such as requiring approvals for promotion of all repositories, or enabling same-instance promotion\n* Assign ownership of a shared repository in the destination instance.\n\n*Important:**\n Once ownership is assigned, it cannot be changed.\n\n Configure approval requirement and template for a repository in the destination instance\n* Manage all repositories (including repositories not owned or explicitly shared with the user)\n\n*Note:**\n This grant supersedes the “Manage Repositories” and “Manage Repository Promotions” grants; it provides all the privileges of those grants, and more.\n\n|\n|\n Manage Repositories\n  | * Create and commit a repository\n* Manage sharing of a repository with other users/groups in the Domo instance\n* Share a repository with another Domo instance\n* Manage sharing of repository versions with another Domo instance\n\n*Note:**\n Only repositories owned by or shared with the user are visible to the user.\n\n|\n|\n Manage Repository Promotion\n  | * Configure a repository for promotion (i.e., dataset mappings, etc.)\n* Manage sharing of a repository in the destination instance\n* Promote a repository, including selecting which version of a repository is to be promoted\n\n*Note:**\n Only repositories owned by or shared with the user are visible to the user. Ownership of repositories can only be assigned by a user with the “Administer Sandbox” grant.\n\n|\n\n\n###\n Grant Examples\n\nTo administer Sandbox for a Domo instance, including establishing repository sharing relationships, enabling same-instance promotion, and requiring approval for promotion, a user must:\n\n Have the Administer Sandbox grant\n\nTo create a new repository and/or commit content changes to a repository, a user must:\n\n Have the “Manage Repositories” grant (and/or the “Administer Sandbox” grant”)\n* Have the “Manage All Cards and Pages” grant (only required for committing page-type repositories)\n* Be the owner of the repository or have had the repository shared with them.\n\t+ “Can Commit” can commit only\n\t+ “Can Edit” can edit the repository content and sharing but cannot delete\n\t+ “Co-Owner” can edit and delete the repository\n* Be the owner of the content being committed or have had the content shared with them\n\n\n**Note:**\n The content must be owned or explicitly shared, not merely accessible via Domo Admin-level grants.\n\nTo manage incoming shared repositories, including assigning ownership of the repository and establishing a promote approval process, a user must:\n\n Have the Administer Sandbox grant\n\nTo promote a repository, a user must:\n\n Have the Manage Repository Promotions grant (and/or the Administer Sandbox grant)\n* Be the owner of the repository or have had the repository shared with them\n\t+ “Can Promote” can promote only\n\t+ “Can Edit” can edit the repository (i.e., dataset mappings, renaming, etc.) and promote\n* Be included in at least one Personalized Date Permissions (PDP) policy for each DataSet (on which PDP is enabled) used in any cards or dashboards in the repository\n* Be the owner of the content (or, for cards or dashboards, have had the content shared with the promoting user if the promoting user also has the Manage All Cards and Pages grant).\n\n*Note:**\n\n The content must be owned or explicitly shared; not merely accessible via Domo Admin-level grants.\n* If the repository has never been promoted, the user promoting the repository will be the owner of content created during the promotion.\n\nFAQs\n------\n\n*What Domo objects are supported?**\n\n\n Dashboards (includes subpages, cards, Layouts, files, Apps, etc.), DataFlows, Connectors, and Views. We plan to add additional objects over time and welcome feedback to help prioritize.\n\n\n**Are raw data sources supported?**\n\n\n Yes. When creating a repository and selecting an object, choose\n **Connectors.**\n Sandbox supports Connectors with associated accounts in the primary instance. When mapping your Connector to another instance, you need to have an associated account in the target instance.\n\n\n**Can I revert to a previous version of a dashboard if necessary?**\n\n\n Yes, simply repeat the promotion process, but choose the desired version.\n\n\n**How long are versions stored and maintained?**\n\nCommitted versions are stored indefinitely, but they are only guaranteed to work for one month\n\n*Are users in the Destination instance able to make changes to cards/dashboards promoted to them?**\n\n\n Yes, however, any changes they made will be overwritten on a subsequent promotion. If users would like to make changes, they should\n **Save As**\n the card/dashboard to another location and make changes there, as these are independent of the Sandbox Repository.\n\n\n**Are there unsupported items that will not be promoted?**\n\n\n Yes, there is a handful to be aware of:\n\n Dashboards:\n\t+ - Poll Cards\n\t\t- Dynamic Summary Numbers in Notebook Cards\n\t\t- Annotations\n\t\t- Certifications\n\t\t- Page Ordering\n\n\n* Dataflows:\n\t+ - Recursive DataFlows\n\t\t- Password-protected DataFlows\n\t\t- Writeback Tile DataFlows\n\n*How large can repositories be?**\n\n\n There is a limit of 1,000 cards within a repository. In general, there should be a repository for each dashboard or group of DataFlows/Views.\n\n\n**What happens when a promotion is aborted?**\n\n\n The promotion progress is stopped. Any changes that have been made in the process will remain in place and not reverted.\n\n\n Troubleshooting\n-----------------\n\nSandbox provides logging on commit and promote activity. The best place to start troubleshooting is to review the commit/promote logs for errors. This will usually provide enough information to fix an issue with a specific object.\n\n###\n Common Areas to Check\n\n*Objects being committed are invalid**\n\n Cards: Check all Drill Cards for column errors commonly caused by schema changes in the underlying DataSet.\n* Beast Modes: Invalid calculations can cause issues commonly caused by schema changes in the underlying DataSet.\n\n*Different Features between source and destination instance**\n\n Example: If Advanced DataFlow functionality isn’t enabled in the destination, the DataFlows will be inaccessible or won't promote successfully.\n\n*Unsupported items**\n\n Most objects and functionality are supported through Sandbox, though there are a handful of items to be aware of that aren’t currently supported. See\n\nFAQ\n\nsection above for supported objects.\n\nNeed Help?\n------------\n\nEmail:\n\nsupport@domo.com\n\nInclude the following information:\n\n Instance(s) where behavior is occurring\n* Repository Name (if applicable)\n* Description of behavior\n* Screenshot and/or recording of behavior (if applicable)\n* Steps to recreate behavior (if known/applicable)\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4403367344023\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004974\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDomo Sandbox\n\n", "article_total_view_count": "\n\n\n 4,459\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/1/2022, 11:15 PM\n\n\n", "first_published_date": "\n\n\n 11/1/2022, 11:23 PM\n\n\n"}, "title": "domo_sandbox", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "governance_tools", "url": "/s/topic/0TO5w000000ZannGAC"}]}