{"file_path": "../../raw_kb_v2\\article\\360042926654\\index.html", "content": {"title": "\n\n\n DoubleClick Ad Exchange for Sellers Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nDoubleClick Ad Exchange partners with the Google Display Network to provide a real-time marketplace for buying and selling advertising. Import seller reports and metrics to make the best of every impression with Domo's DoubleClick Ad Exchange Connector. To learn more about the DoubleClick Ad Exchange for Sellers API, visit their page (\n\nhttps://developers.google.com/ad-exchange/seller-rest/getting-started\n\n).\n\n\n You connect to your DoubleClick Ad Exchange for Sellers account in the Data Center. This topic discusses the fields and menus that are specific to the DoubleClick Ad Exchange for Sellers connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your DoubleClick Ad Exchange for Sellers account and create a DataSet, you must have a Google username and password.\n\n\n Connecting to Your DoubleClick Ad Exchange for Sellers Account\n----------------------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the DoubleClick Ad Exchange for Sellers Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n Credentials Pane\n\nThe Domo DoubleClick Ad Exchange for Sellers connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing DoubleClick Ad Exchange for Sellers accounts in Domo) to open the Google OAuth screen where you can enter your Google username and password. Once you have entered valid Google credentials, you can use the same account any time you go to create a new DoubleClick Ad Exchange for Sellers DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the DoubleClick Ad Exchange for Sellers report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Get Account Information\n  |\n Retrieves information about the selected Ad Exchange account.\n  |\n|\n Get Account Reports\n  |\n Generates an Ad Exchange report for the selected account, based on the selected metrics.\n  |\n|\n Get Custom Channel\n  |\n Returns data about a custom channel from the specified ad client product.\n  |\n|\n List Accounts\n  |\n Lists all accounts available to this Ad Exchange account.\n  |\n|\n List Ad Clients\n  |\n Lists all ad clients in this Ad Exchange account.\n  |\n|\n List Alerts\n  |\n Lists all alerts for this Ad Exchange account.\n  |\n|\n List Custom Channels\n  |\n Lists all custom channels in the specified ad client for this Ad Exchange account.\n  |\n|\n List URL Channels\n  |\n Lists all URL channels in the specified ad client for this Ad Exchange account.\n  |\n\n|\n|\n Account\n  |\n Select the Ad Exchange account you want to retrieve data for.\n  |\n|\n Metrics\n  |\n Select all metrics you want to retrieve data for.\n  |\n|\n Dimensions\n  |\n Select all dimensions you want to retrieve data for.\n  |\n|\n Ad Client Product\n  |\n Select the ad client product you want to retrieve data for.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042926654\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003776\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDoubleClick Ad Exchange for Sellers Connector\n\n", "article_total_view_count": "\n\n\n 2,364\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "doubleclick_ad_exchange_for_sellers_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}