{"file_path": "../../raw_kb_v2\\article\\360042934254\\index.html", "content": {"title": "\n\n\n Controlling Access to Cards and Pages\n\n\n", "article_body": "\n\nIntro\n-------\n\nIf you have the proper permissions, you can grant and remove access to Cards and Pages in the\n\nAdmin Settings\n\n. Users with an \"Admin\" default security role or a custom role including the \"Manage All Cards and Pages\" grant have the ability to grant and remove access to all Cards and Pages in Domo. For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n\n\n You can grant and remove access to Cards and Pages in the following ways:\n\n From the\n **Groups**\n sub-tab, in which case you add the Page or Card to a group's list of accessible content, or remove it if you want to restrict access. These tasks are discussed in\n\nAdding and Removing Accessible Content for a Group\n\n.\n* From the\n **People**\n sub-tab, in which case you add the Page or Card to a user's list of accessible content, or delete it from this list to remove this user's access.\n* From the\n **Cards**\n or\n **Pages**\n sub-tab, in which case you add the user or group to the Card or Page you want them to have access to, or remove them if you want to restrict their access. If you have \"Admin\" access, you can add or remove users and/or groups to/from multiple Cards or Pages at once.\n\nBecause you can share Pages and Cards separately, you can better control who sees what. For example, if you want a particular user to have access only to one or two specific Cards on a Page, you can share with them the Cards themselves, rather than risking security issues by allowing them to view the entire Page.\n\n\n When you are granted access to a Card, you gain access to all past Buzz conversations for that Card. Conversely, if your access to a Card is removed, you lose access to all past Buzz conversations for that Card. For more information, see\n\nChatting in Buzz\n\n.\n\n\n Sharing Pages and Cards with a user or group\n----------------------------------------------\n\nWhen you share a\n *Page*\n with a user, the Page itself is added to the Page tab row in the user's personalized Domo view, and the name of the Page is added to the user's\n **Pages**\n listing in the\n **People**\n sub-tab. When you share a Page with a group, the Page is added to the Domo view of every member of that group, and the name of the Page is added to the group's\n **Content Accessible by this Group**\n listing in the\n **Groups**\n sub-tab. Users you've shared with have access to the Page and all of the Cards in it (unless you restrict access to specific Cards in the Page using the\n **Share**\n dialog).\n\n\n When you share a\n *Card*\n with a user, the Card is added to the user's\n\nShared\n\nPage, and the name of the Card is added to the user's\n **Cards**\n listing in the\n **People**\n sub-tab. When you share a Card with a group, the Card is added to the\n\nShared\n\nPage for every member of that group, and the name of the Card is added to the group's\n **Content Accessible by this Group**\n listing in the\n **Groups**\n tab.\n\n\n As discussed previously, you can share content either by assigning the content to the user or group (in the\n **People**\n and\n **Groups**\n sub-tabs, respectively) or by assigning the user or group to the content. Both of these methods are described in detail in continuation.\n\n\n For information about sharing content by assigning it to a group, see\n\nAdding and Removing Accessible Content for a Group\n\n.\n\n\n**To share content by assigning it to a user or group,**\n\n. Click\n **More**\n**> Admin**\n .\n\n\n The Admin Settings appears.\n2. In the\n **People**\n or\n **Groups**\n sub-tab, select the user or group with whom you want to share content.\n3. Click\n\nin the\n **People**\n sub-tab or\n\nin the\n **Groups**\n sub-tab.\n\n\n A field appears in which you can enter the names of the content you want to add.\n4. Enter the name of a Page or Card into the field.\n\n\n As you enter or remove characters, results appear in a list.\n5. Select a Page or Card from the list.\n6. Click\n **Share**\n .\n7. (Optional) Add additional content by repeating steps 4-6.\n8. (Optional) Remove a page or Card from the field by clicking the \"x\" to the right of the name.\n\n\n**Note:**\n It is best practice to only share content with groups and not individual users.\n\n*To share access rights for content by assigning users or groups to the content,**\n\n. Click\n **More**\n\n*> Admin**\n\n.\n\n\n The\n\nAdmin Settings\n\nappears.\n2. Select the\n **Content**\n tab.\n3. Select either the\n **Cards**\n or\n **Pages**\n sub-tab.\n4. Select\n **Edit >**\n**Add Users & Groups**\n .\n\n\n A dialog appears in which you can search for users or groups to add to this Card or Page.\n5. Check the boxes for all the Cards or Pages you want to provide access to.\n\n\n You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n6. Enter the name of a user or group into the search field.\n\n\n The top results of your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n7. Select a user or group from the list.\n\n\n The name of the user or group is added to the field.\n8. (Optional) Add additional users and/or groups by repeating the previous two steps.\n9. (Optional) Remove a user or group from the field by clicking the \"x\" to the right of the name.\n10. Click\n **Add**\n to add all users and/or groups appearing in the field to the Card or Page.\n\nAll users you've shared with have access to all of the Pages and Cards you've shared.\n\n*Note:**\n It is best practice to only share content with groups and not individual users.\n\nRemoving access to Cards and Pages\n------------------------------------\n\nYou can also remove access to or \"unshare\" Pages and Cards that have been shared in this way. This includes all copied or shared instances of the content; for example, if you shared a Visualization Card with a user, who then shared it with another user, unsharing the Card would cause it to be removed from the Domo views for both users.\n\n\n You\n *cannot*\n remove resources available to a user through membership in a group. If you want to remove a user's access to these resources, you must either remove the resources themselves from the group or remove the user from the group.\n\n\n For information about removing access to resources shared with groups, see\n\nAdding and Removing Accessible Content for a Group\n\n.\n\n\n**To remove access to a resource previously shared with a user,**\n\n. Click\n **More**\n**> Admin**\n .\n\n\n The\n\nAdmin Settings\n\nappears.\n2. Select the\n **Governance**\n tab.\n3. In the\n **People**\n sub-tab, select the user for whom you want to remove access to shared resources.\n4. In the\n **Cards**\n section of the panel, locate the name of the Page or Card you want to remove.\n\n\n You can use the\n **Search**\n box to find the resource you're looking for.\n5. Select either\n **Pages**\n or\n **Cards**\n .\n6. Click\n\nfor the Page or Card you want to remove.\n\n\n A dialog appears asking you to confirm this removal.\n7. Click\n **Unshare**\n .\n\nThis resource is removed from the list of resources this user has access to.\n\n\n You can also perform this same basic task in the\n **Cards**\n or\n **Pages**\n tabs by removing groups or users from the content.\n\n*Note:**\n It is best practice to only share content with groups and not individual users.\n\n*To revoke access rights for content by removing users or groups from the content,**\n\n. Click\n **More**\n\n*> Admin**\n\n.\n\n\n The Admin Settings appears.\n2. Select the\n **Content**\n tab.\n3. Select either the\n **Cards**\n or\n **Pages**\n sub-tab.\n4. Check the boxes for all the Cards or Pages you want to remove access to.\n5. Select\n **Edit >**\n**Add Users & Groups**\n .\n\n\n A dialog appears in which you can search for users or groups to remove from this Card or Page.\n\n\n You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n6. Enter the name of a user or group into the search field.\n\n\n The top results of your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n7. Select a user or group from the list.\n\n\n The name of the user or group is added to the field.\n8. (Optional) Add additional users and/or groups by repeating the previous two steps.\n9. (Optional) Remove a user or group from the field by clicking the \"x\" to the right of the name.\n10. Click\n **Remove**\n to remove all users and/or groups appearing in the field from the Card or Page.\n\nAll users you've removed from the selected content will now lose their access to that content.\n\n*Note:**\n It is best practice to only share content with groups and not individual users.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042934254\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004071\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nControlling Access to Cards and Pages\n\n", "article_total_view_count": "\n\n\n 5,582\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "controlling_access_to_cards_and_pages", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "controlling_access_in_domo", "url": "/s/topic/0TO5w000000ZanMGAS"}, {"text": "user_and_group_management", "url": "/s/topic/0TO5w000000ZapJGAS"}]}