{"file_path": "../../raw_kb_v2\\article\\360043428013\\index.html", "content": {"Title": "SPC Charts", "Article Body": "Intro\n                       \n\n                        SPC (statistical process control) charts, also known as control charts, Shewhart charts, or process-behavior charts, are line charts used to determine if a manufacturing or business process is in a state of control. Domo's SPC charts lets you set up rules from SPC standards by configuring them in the Chart Properties. When values outside the specified rules are encountered, these are flagged in the chart as outliers.\n                       \n\n                        Rules\n                       \n\n                        There are 8 rules you can configure for SPC charts in Domo. You can have one SPC rule per chart or combine them. You configure rules for SPC charts in the\n                        \n                         Control Chart Rules\n                        \n                        menu in Chart Properties. For more information about these and other unique properties for these charts, see\n                        \n                         Properties for Data Science Charts\n                        \n                        .\n                       \n\n                        The rules you can configure are as follows:\n                       \n\n\n\n\n                           Rule\n                          \n\n                           Description\n                          \n\n                           Example\n                          \n\n\n\n\n\n                           Beyond Limits\n                          \n\n                           Points are flagged if they are outside of the automatically determined upper or lower limits of the chart, which are 3 standard deviations away from the mean.\n                          \n\n\n\n\n\n\n                           2 of 3 Outside 2 Standard Deviations\n                          \n\n                           If 2 out of 3 consecutive points are outside of 2 standard deviations away from the mean, they are flagged.\n                          \n\n\n\n\n\n\n                           4 of 5 Outside 1 Standard Deviation\n                          \n\n                           If 4 out of 5 consecutive points are outside of 1 standard deviation away from the mean, they are flagged.\n                          \n\n\n\n\n\n\n                           Run Over/Under Mean\n                          \n\n                           If a specified number of consecutive points fall over or under the mean, they are flagged.\n                          \n\n\n\n\n\n\n                           Trend\n                          \n\n                           If there is a specified number of consecutive points trending up or down, they are flagged.\n                          \n\n\n\n\n\n\n                           8 Outside 1 Standard Deviation\n                          \n\n                           If there are 8 consecutive points outside of 1 standard deviation away from the mean, they are flagged.\n                          \n\n\n\n\n\n\n                           15 Within 1 Standard Deviation\n                          \n\n                           If there are 15 consecutive points within 1 standard deviation away from the mean, they are flagged.\n                          \n\n\n\n\n\n\n                           14 Alternating\n                          \n\n                           If there are 14 consecutive points that alternate up and down, they are flagged.\n                          \n\n\n\n\n\n\n\n                        Powering SPC charts\n                       \n\n                        SPC charts are similar to basic\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your Line graph. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        Customizing SPC charts\n                       \n\n                        You set the rules and customize the appearance of SPC charts by configuring their Chart Properties. For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        . Unique properties of SPC charts include the following. You can click a thumbnail image to see a larger image.\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Symbol Type\n                           \n\n\n\n                            Lets you select the symbol used to denote points on the line (the default is a circle). In the example, the points appear as diamonds.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > Line Thickness\n                           \n\n\n\n                            Lets you determine whether the line in your SPC chart is thin (default), medium, or thick. In the example, the thickness has been set to thick.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > Out of Control Color\n                           \n\n\n\n                            Lets you specify the color of the outlier points as determined by your rules (the default color is red). In the example, the outlier color has been set to orange.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > Beyond Limits\n                           \n\n\n\n                            Turns on the \"Beyond Limits\" rule, which flags points if they are outside of the automatically determined upper or lower limits of the chart, which are 3 standard deviations away from the mean.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > 2 of 3 Outside 2 Standard Deviations\n                           \n\n\n\n                            Turns on the \"2 of 3 Outside 2 Standard Deviations\" rule, which looks at whether 2 out of 3 consecutive points are outside of 2 standard deviations away from the mean.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > 4 of 5 Outside 1 Standard Deviation\n                           \n\n\n\n                            Turns on the \"4 of 5 Outside 1 Standard Deviation\" rule, which looks at whether 4 out of 5 consecutive points are outside of 1 standard deviation away from the mean.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > Run Over/Under Mean\n                           \n\n\n\n                            Turns on the \"Run Over/Under Mean\" rule, which looks at whether a specified number of consecutive points fall over or under the mean. You specify the number of points that must be consecutive using the\n                            \n                             Color Chart Rules > Run Length\n                            \n                            option.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > Run Length\n                           \n\n\n\n                            Determines the number of points over or under the mean that must be consecutive for the \"Run Over/Under Mean\" rule to apply.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Control Chart Rules > Trend\n                           \n\n\n\n                            Turns on the \"Trend\" rule, which looks whether a specified number of points are trending up or down. You specify the number of points that must be consecutive using the\n                            \n                             Color Chart Rules > Trend Length\n                            \n                            option.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > Trend Length\n                           \n\n\n\n                            Determines the number of points that must trend up or down for the \"Trend\" rule to apply.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Control Chart Rules > 8 Outside 1 Std Deviation\n                           \n\n\n\n                            Turns on the \"8 Outside 1 Std Deviation\" rule, which looks at whether 8 consecutive points are outside of 1 standard deviation away from the mean.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > 15 Within 1 Std Deviation\n                           \n\n\n\n                            Turns on the \"15 Within 1 Std Deviation\" rule, which looks at whether 15 consecutive points fall within 1 standard deviation away from the mean.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Control Chart Rules > 14 Alternating\n                           \n\n\n\n                            Turns on the \"14 Alternating\" rule, which looks at whether 14 consecutive points alternately rise and fall.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > Mean Line Color\n                           \n\n\n\n                            Determines the color of the mean line in your chart (the default is green). In the example, the mean line appears as purple.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > Mean Line Style\n                           \n\n\n\n                            Determines the style of the mean line in your chart, whether solid (default), dotted, or dashed. In the example, the mean line appears solid.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > Upper/Lower Control Line Color\n                           \n\n\n\n                            Determines the color of the upper and lower limit lines (the default is red). In the example, the limit lines appear as orange.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > Upper/Lower Control Line Style\n                           \n\n\n\n                            Determines the style of the upper and lower limit lines (the default is dashed). In the example, the limit lines appear dotted.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > Show 1-2 Std Deviation Lines\n                           \n\n\n\n                            Determines whether standard deviation lines appear in your chart. When these are present, they appear as green and dotted.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Limit Lines > 1st Std Deviation Line Color\n                           \n\n\n\n                            Determines the color of the 1st standard deviation lines in the chart (the default is green). In the example, the lines appear as purple.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > 1st Standard Deviation Line Style\n                           \n\n\n\n                            Determines the style of the 1st standard deviation lines in the chart (the default is dotted). In the example, the lines appear solid and red.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > 2nd Standard Deviation Color\n                           \n\n\n\n                            Determines the color of the 2nd standard deviation lines in the chart (the default is green). In the example, the lines appear as purple.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Limit Lines > 2nd Standard Deviation Style\n                           \n\n\n\n                            Determines the style of the 2nd standard deviation lines (the default is dotted). In the example, the lines appear as red and solid.", "Preview Article": "Click here to preview", "URL Name": "360043428013", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004750", "Archived Date": "", "Language": "English", "Primary Version": "SPC Charts", "Article Total View Count": "5,044", "": "", "Article Created Date": "10/24/2022, 10:29 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              SPC Charts\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}