{"file_path": "../../raw_kb_v2\\article\\360042929294\\index.html", "content": {"Title": "Google Analytics Real Time Connector", "Article Body": "Intro\n                       \n\n                        Real-Time allows you to monitor activity as it happens on your site or app. The reports are updated continuously and each hit is reported seconds after it occurs.  To learn more about the Google Analytics API, visit their website (\n                        \n                         https://developers.google.com/analyt...g/realtime/v3/\n                        \n                        ).\n                       \n\n                        You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Analytics Real Time connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n\n                          Adding a DataSet Using a Data Connector\n                         \n\n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to the Google Analytics Real Time API and create a DataSet, you must have a Google email address and password.\n                       \n\n                        Connecting to Your Google Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Google Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n\n                          Adding a DataSet Using a Data Connector\n                         \n\n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Google Analytics Real Time connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Google accounts in Domo) to open the Google OAuth screen where you can enter your Google email address and password. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Analytics Real Time DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains three menus from which you select your profile, metrics, and dimensions.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           View (Profile)\n                          \n\n                           Select the profile you want to retrieve data for. Usually each website you maintain has one or more associated profiles.\n                          \n\n\n\n                           Dimensions\n                          \n\n                           Select up to 7 dimensions for your report.\n                          \n\n\n\n                           Metrics\n                          \n\n                           Select at least one metric for your report.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n\n                          Adding a DataSet Using a Data Connector\n                         \n\n                        .\n                       \n\n                        FAQs\n                       \n\n                        What can I do with this connector?\n                       \n\n\n\n                          Display active viewers of a page and create a sense of urgency for users looking at an item with finite inventory.\n                         \n\n\n\n                          Display the most popular content such as the top 10 active pages.\n                         \n\n\n\n                          Create and display a real time dashboard.\n                         \n\n\n\n                        Why does my data appear incorrect?\n                       \n\n                        If your data looks incorrect, check which filters are being applied to the \"View\" field. It is best to use an unfiltered view when debugging the tracking code implementations. Changes made to views may take up to two hours to reflect in the Google Analytics Realtime connector.\n                       \n\n                        Why am I limited to 7 dimensions?\n                       \n\n                        This is a limitation given by the Google Analytics API. There is no way to add more than 7 dimensions to a report.\n                       \n\n                        What is the difference between this connector and the Google Analytics Connector?\n                       \n\n                        The Google Analytics Real Time connector uses the real-time reporting API and returns real-time data. The Google Analytics connector uses the reporting API and returns historical data.", "Preview Article": "Click here to preview", "URL Name": "360042929294", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003535", "Archived Date": "", "Language": "English", "Primary Version": "Google Analytics Real Time Connector", "Article Total View Count": "4,720", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Google Analytics Real Time Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}