{"file_path": "../../raw_kb_v2\\article\\360042927514\\index.html", "content": {"title": "\n\n\n Twitter Ads Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nTwitter Ads is an advertising service that lets businesses reach potential customers by getting me\n\n\n ssages in front of people not yet following the business. You can use Domo's Twitter Ads connector to retrieve data about statistics for accounts, campaigns, funding instruments, line items, and tweets. For more information about the Twitter API, see their documentation (\n\nhttps://developer.twitter.com/en/docs\n\n).\n\n\n The Twitter Ads connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n This topic discusses the fields and menus that are specific to the Twitter Ads connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector lets you discover impressions, who is interacting with your Twitter ads, and the kind of reach you're getting.\n  |\n|\n**Primary Metrics**\n | * Total number of engagements\n* Total number of impressions\n* Total number of retweets\n* Total number of replies\n* Total number of likes\n* Total number of follows\n* Total number of clicks, including favorites and other engagements\n* Total number of qualified impressions\n |\n|\n**Primary Company Roles**\n |\n All marketing roles\n  |\n|\n**Average Implementation Time**\n |\n 10 minutes or less\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\nBest Practices\n----------------\n\n\n* Create DataSets that use\n **Replace**\n instead of\n **Append**\n , and only pull the last 3-7 days at a time.\n* Use a recursive DataFlow to deduplicate and append data. For more information, see\n\nCreating a Recursive/Snapshot Magic ETL DataFlow\n\n.\n* To collect historical promoted Tweet Statistics and then update it with the latest tweet data, follow these steps:\n\n\n\t1. Create a new Twitter Ads DataSet.\n\n**Tip:**\n\n You may want to configure more settings than what is shown here; feel free to add settings according to your needs. Keep in mind that we will be selecting two different reports, the Promoted Tweet Statistics v.1 and Recent Promoted Tweets Statistics v.1. Make sure your settings match for both of these.\n\t2. Configure the connector for the first run, making sure to configure settings as follows:\n\t\t1. For the\n\t\t **Report**\n\t\t , select \"Promoted Tweets Statistics v.1.\"\n\t\t2. For the duration of the report, choose to pull data for the past 90 days (the connector limits you to 90 days of data; if you need more then that, we suggest selecting the first date of history you want and then selecting 90 days after that, running the report on Append, selecting the next 90 days, then running the DataSet again on Append, etc. until you have collected all the history you want).\n\n\n\t3. Save the configurations.\n\t4. Schedule the connector to \"Append\" instead of \"Replace.\"\n\t5. Run the connector.\n\t6. Once the run has completed, reconfigure the connector for the second run as follows:\n\n\t1. For the\n\t\t **Report**\n\t\t , select \"Recent Promoted Tweets Statistics v.2.\"\n\t\t2. For\n\t\t **Tweets Selection Window**\n\t\t , select\n\t\t **Past 3 Months**\n\t\t .\n\t\t3. For the duration of the report, choose to pull data for yesterday.\n\n\n\t\t**Note:**\n\n\t The other settings should match how you had them in the configuration of the first run; the only difference is you have no promoted tweets to select as this report will bring in tweet activity on all the promoted tweets that had activity yesterday.\n\n7. Save the configuration.\n\t8. Make sure the scheduling is set to \"Append.\"\n\t9. Let the connector run on the next schedule—you want it to run tomorrow to collect the most recent tweet activity from the previous day.\n\n\n\t Congratulations, you have just selected the promoted tweet history and configured the DataSet to collect yesterday's promoted tweet activity, appending it to the history you just collected.\n\nPrerequisites\n---------------\n\nTo connect to your Twitter Ads account and create a Twitter Ads DataSet, you must have the following:\n\n The Twitter account to use to log into your Twitter Ads account.\n* The password you use to log into your Twitter account.\n\nConnecting to your Twitter Ads account\n----------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Twitter Ads connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Twitter Ads connector uses OAuth to connect to Twitter Ads. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Twitter Ads accounts in Domo) to open the Twitter Ads OAuth screen where you can enter the credentials associated with your Twitter account. After you have entered valid Twitter credentials, you can use the same account in Domo any time you create a Twitter Ads DataSet.\n\n\n You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nCreating and Managing User Groups\n\n.\n\n##\n Details Pane\n\nThis pane includes a primary menu,\n **Report**\n , and other menus that appear depending on the report you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Twitter Ads report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account Media\n  |\n Retrieves details about all account media associated with the specified account.\n  |\n|\n Account Statistics\n  |\n Retrieves the summary of analytics about the campaigns executed by the specified account.\n  |\n|\n All Campaigns\n  |\n Retrieves all campaigns executed by the specified account.\n  |\n|\n All Funding Instruments\n  |\n Retrieves all Funding Instruments for the specified account.\n  |\n|\n All Line Items\n  |\n Retrieves all Line Items for the specified account.\n  |\n|\n All Promoted Tweets\n  |\n Retrieves all Promoted Tweets for the specified account.\n  |\n|\n Campaign Reach\n  |\n Retrieves reach and average frequency analytics for specified campaigns.\n  |\n|\n Campaign Statistics\n  |\n Retrieves summary analytics about campaigns executed by the specified account.\n  |\n|\n Funding Instruments Reach\n  |\n Retrieves reach and average frequency analytics for specified funding instruments.\n  |\n|\n Funding Instruments Statistics\n  |\n Retrieves summary analytics about specific funding instruments with the specified account.\n  |\n|\n Line Item Statistics\n  |\n Retrieves summary analytics about Line Items accessible by the current user.\n  |\n|\n Media Creatives\n  |\n Retrieves details for media creatives associated with the specified account.\n  |\n|\n Media Creatives Statistics\n  |\n Retrieves summary analytics about specific media creatives with the specified account.\n  |\n|\n Media Library\n  |\n Retrieves details for media library objects associated with the account.\n  |\n|\n Organic Tweet Statistics\n  |\n Retrieves the organic summary analytics about Promoted Tweets accessible by the current user.\n  |\n|\n Promoted Tweet Statistics\n  |\n Retrieves the summary analytics about Promoted Tweets accessible by the current user.\n  |\n|\n Reach Estimate (deprecated)\n  |\n Determines the approximate reach of the campaigns for the specified account.\n\nThis report will no longer be available from September 1, 2020.\n  |\n|\n Recent Organic Tweet Statistics\n  |\n Retrieves the organic summary analytics about recent Promoted Tweets accessible by the current user.\n  |\n|\n Recent Promoted Tweet Statistics\n  |\n Retrieves the summary analytics about recent Active Promoted Tweets accessible by the current user.\n  |\n|\n Tweets\n  |\n Retrieve Tweet details for the account.\n  |\n\n|\n|\n Account\n  |\n Select the Twitter Ads account to query data from.\n  |\n|\n Duration\n  |\n Select whether to pull data for a single date or a date range.\n  |\n|\n Report Date\n  |\n Select whether to pull data for a specific date or a given number of days back (offset).\n  |\n|\n Specific Date\n  |\n Select the date you want to pull data for.\n  |\n|\n Days Back\n  |\n Enter the number of days back you want to pull data for.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific date or a given number of days back (offset).\n  |\n|\n Specific Start Date\n  |\n Select the start date for your date range.\n  |\n|\n End Date\n  |\n Specify whether the last date in your date range is a specific date or a given number of days back (offset).\n  |\n|\n Specific End Date\n  |\n Select the end date for your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of days back (offset) for the start date in your date range. For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , each time the report ran it would pull data for the last 10 days up until the last 5 days.\n  |\n|\n Days Back to End At\n  |\n Enter the number of days back (offset) for the end date in your date range. For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , each time the report ran it would pull data for the last 10 days up until the last 5 days.\n  |\n|\n Granularity\n  |\n Select the required granularity. For example, if the granularity is\n **Hour**\n , data is presented by hour between the\n **Start Date**\n and the\n **End Date**\n .\n  |\n|\n Segmentation Type\n  |\n Select the required segmentation type.\n  |\n|\n Placement\n  |\n\nSelect the required Placement from the available options.\n\n\n For example, if the placement is\n\n*ALL ON TWITTER**\n\n, data is presented by all possible placement types on Twitter. If placement is\n\n*Publisher Network**\n\n, data is presented by the Twitter Audience Platform.\n\n*Total**\n\nwill total the result for both the Publisher Network and All On Twitter.\n\n|\n|\n Country\n  |\n\nSelect the country that should have data returned.\n\n|\n|\n Platform\n  |\n\nSelect the platform that should have data returned.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n How do I get engagement metrics for organic (non-promoted) tweets?\n\nTo get engagement metrics for tweets that have not been promoted, you need to use the Twitter Engagement connector which uses the Twitter Engagement API.\n\n\n The Twitter Engagement API is one of Twitter’s Enterprise-level APIs. This means that your business will need to sign a contract with Twitter to use this API. See\n\nTwitter Enterprise data\n\nfor more information and to set up a contract with Twitter to access this API.\n\n\n Once your company has access to the Twitter Engagement API, contact your Account Executive or Customer Success Manager. They will ensure that you have access to the connector in your Domo instance.\n\n###\n What endpoint is the base URL for this connector?\n\nThe base URL for the Twitter Ads connector is\n\nhttps://ads-api.twitter.com/\n\n.\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint(s)\n  |\n| --- | --- |\n|\n Account Media\n  |\n /10/accounts/{account\\_id}/account\\_media\n  |\n|\n Account Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=ACCOUNT\n  |\n|\n All Campaigns\n  |\n /10/accounts/{account\\_id}/campaigns\n  |\n|\n All Funding Instruments\n  |\n /10/accounts/{account\\_id}/funding\\_instruments\n  |\n|\n All Line Items\n  |\n /10/accounts/{account\\_id}/line\\_items\n  |\n|\n All Promoted Tweets\n  |\n /10/accounts/{account\\_id}/promoted\\_tweets?with\\_deleted=true\n  |\n|\n Campaign Reach\n  |\n /10/stats/accounts/{account\\_id}/reach/campaigns\n  |\n|\n Campaign Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=CAMPAIGN\n  |\n|\n Funding Instruments Reach\n  |\n /10/stats/accounts/{account\\_id}/reach/funding\\_instruments\n  |\n|\n Funding Instruments Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=funding\\_instruments\n  |\n|\n Line Item Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=LINE\\_ITEM\n  |\n|\n Media Creatives\n  |\n /10/accounts/{account\\_id}/media\\_creatives\n  |\n|\n Media Creatives Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=MEDIA\\_CREATIVES\n  |\n|\n Media Library\n  |\n /10/accounts/{account\\_id}/media\\_library\n  |\n|\n Organic Tweet Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=ORGANIC\\_TWEET\n  |\n|\n Promoted Tweet Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=PROMOTED\\_TWEET\n  |\n|\n Reach Estimate (deprecated)\n  |\n /6/accounts/{account\\_id}/reach\\_estimate\n  |\n|\n Recent Organic Tweet Statistics\n  |\n /10/stats/accounts/{account\\_id}?entity=ORGANIC\\_TWEET\n  |\n|\n Recent Promoted Tweet Statistics\n  |\n /10/accounts/{account\\_id}?entity=PROMOTED\\_TWEET\n  |\n|\n Tweets\n  |\n /10/accounts/{account\\_id}/tweets\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the email address or Twitter handle, and password associated with your Twitter account.\n\n###\n How do I know my Twitter credentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n Do I need a certain kind of account to set up the connector?\n\nYou must have an Advertising account. You may register for an Advertising account at \"\n\nads.twitter.com\n\n\". You can have multiple Twitter user accounts associated with a single Advertising account.\n\n###\n How frequently will my data update?\n\nMost information is available immediately. It is recommended to configure the datasets to run every 24 hours.\n\n###\n Can I use the same Twitter account for multiple datasets?\n\nYes\n\n###\n Why didn't my dataset return any new rows when it ran?\n\nThis generally happens if there is no data for the connector to return. Most frequently this happens if there is no activity (new tweets, retweets, etc.) on the account after the Start Date.\n\n###\n Why is the report taking so long to run? Is this normal?\n\nSome of the reports can take a very long time to run. They have to read through several levels of data, making multiple calls to Twitter at each step. The time increases even more if you select all Tweets and run for all time.\n\n\n Troubleshooting\n-----------------\n\nTroubleshooting usually starts with making sure you don't have an issue with the credentials. If those are clear, next check that your request isn't timing out. If you select all Tweets and run for all time, you can expect to experience long run times. Adjust the number of Tweets you are pulling or the time frame if you are experiencing these issues.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042927514\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003703\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nTwitter Ads Connector\n\n", "article_total_view_count": "\n\n\n 4,755\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "twitter_ads_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}