{"file_path": "../../raw_kb_v2\\article\\360042936234\\index.html", "content": {"Title": "August 2017 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Analyzer (formerly Card Builder)\n                       \n\n                        Introducing the new Analyzer—data exploration, powerful analytics, insights, and a self-guided experience all in one place. As data continues to flow into businesses like never before and the breadth of different data sources increases, the new Analyzer is an analytic heaven for analysts to explore, discover, slice and dice, and empower others to stop making decisions with their gut and start making decisions with data.\n                       \n\n                        All of the following new and updated features are now available:\n                       \n\n\n                         User Interface\n                        \n                        . We’ve added a beautiful new design with additional flexibility so you can be the driver of your own workspace, using the analytic tools you want when you need them.\n                       \n\n\n\n\n                        For more information about the Analyzer user interface, see\n                        \n                         Analyzer Layout\n                        \n                        .\n                        \n\n\n                         Period-over-Period\n                        \n                        . With the powerful and flexible Period-over-Period experience in Analyzer, you’ll be able to compare numerous time periods to see trends and comparisons. No other BI tool has an easier Period-over-Period experience. All you need is a date range, and your options are endless: Year over Year, Quarter over Quarter, Past 30 days, and many other options. Want to see a growth trend in your sales performance for the past few years, and add a variance percentage line along with that? Done and done. Measure the past 30 days vs any previous days? Compare monthly sales to the same day 4, 8, 12, even 52 weeks ago? We've got you covered. Analyzer makes the visualization of trends even easier.\n                       \n\n\n\n\n\n\n\n\n\n                        For more information about implementing Period-over-Period chart, including use cases, see\n                        \n                         Period-over-Period Charts\n                        \n                        .\n                        \n\n\n                         Quick Filters\n                        \n                        . Quick Filters are pre-defined filters that live on a card to help guide and focus management to see results in specific areas. As analysts explore their data and find important insights, they want to share these answers with management. With Quick Filters, you now can easily create a self-guided experience for others to explore data on a card and answer questions for themselves. Quick Filters you set will appear on cards in both the desktop and mobile versions of Domo.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        For more information about Quick Filters, see\n                        \n                         Adding Filters to Your Chart - Applying Quick Filters\n                        \n                        .\n                        \n\n\n                         Data Lineage\n                        \n                        . Trusting your data is critical. As you find answers and explore your data, you need to be confident all the data is up-to-date and running smoothly. Since Domo can effectively bring all your data into one place as no other tool can, you may need to see all your data is combining correctly for true peace of mind. With the new Data Lineage in Analyzer, you can see the data is flowing correctly and on time without having to check the Data Center.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing the Lineage of a DataSet in Analyzer\n                        \n                        .\n                        \n\n\n                         Conditional Colors\n                        \n                        . As analysts explore their data, it’s often important to have consistent colors in order to highlight exceptions. If, for instance, you want a specific company to be blue or red on a DataSet to more easily identify those trends spanning many charts, you would need the Conditional Color in Analyzer. This new feature enables you to see exceptions and trends with a consistent color—making analysis even easier.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Setting Color Rules for a Chart\n                        \n                        .\n                       \n\n\n                         Data Table\n                        \n                        . The new Data Table in Analyzer allows you to see and manipulate the data in all columns you have applied to your chart, along with any other unused columns you want to show. Changes you make to the data in the Data Table are reflected in your chart preview. Likewise, when you make changes to the chart using other tools such as filters and sorting, the data in the table is updated.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Understanding the Data Table in Analyzer\n                        \n                        .\n                        \n\n\n                         60+ New Chart Types and Improved Table Card\n                        \n                        . The new Analyzer includes over 60 new chart types. We’ve also enhanced table cards with colors, % to total, and sub totals. All of these inclusions enables more analysis and less paralysis.\n                       \n\n                        New chart types include the following:\n                       \n\n\n\n                          Vertical and horizontal Marimekko graphs\n                         \n\n\n\n                          Vertical and horizontal Overlay graphs\n                         \n\n\n\n                          Vertical Line graphs\n                         \n\n\n\n                          Vertical and horizontal Lollipop graphs\n                         \n\n\n\n                          19 new Area graphs\n                         \n\n\n\n                          Data Science graphs (Predictive Modeling, Forecasting, Outliers, and XY Line)\n                         \n\n\n\n                          Nautilus & Nautilus Donut graphs\n                         \n\n\n\n                          Nightingale Rose graph\n                         \n\n\n\n                          Stream & Stream Funnel graphs\n                         \n\n\n\n                          4 new maps—Italy, South Korea, Switzerland, and Indonesia\n                         \n\n\n\n                        Here are screenshots of just a few of the new chart types available in Analyzer:\n                       \n\n\n\n                          Vertical Line Graph\n                         \n\n\n\n\n\n\n\n\n\n\n                          Vertical Grouped Lollipop Graph\n                         \n\n\n\n\n\n\n\n\n                          Predictive Modeling Graph\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                          Nightingale Rose Graph\n                         \n\n\n\n\n\n\n\n\n\n\n                          Improved Table (with subtotal rows)\n                         \n\n\n\n\n\n\n                        To watch a series of videos about the new chart types and properties included in this release, visit\n                        \n                         August 2017 Analyzer Release -- New Chart Types and Properties Videos\n                        \n                        .\n                       \n\n                        Snapshot Annotation\n                       \n\n                        Let’s face it, data is messy. It's easy to feel overwhelmed and lost when trying to decipher data visualizations. Now you can clarify the chaos with the new Snapshot Annotation feature. Pictures are worth a thousand words, and probably more when working with data. Snapshot Annotations makes analytic life easier for everyone.\n                        \n\n                        With the Snapshot Annotation feature, you don’t need to use thousands of words to call out trends and insights. When you see a spike or trends in your data, you can now annotate on any card. Specifically, you can now draw free-form, place shapes, write text, and highlight, on any card— both on the web and on your mobile device. Then, once you’ve made things more clear, sharing annotated cards is seamless in Buzz. Everyone now can spend less typing and more time making business decisions.\n                        \n\n                        Analysts, Managers, Senior Execs, and all data consumers need tools to help craft their data story or to visually call attention to important trends and differences on their charts. Having annotation tools makes analytic life easier for everyone because it's more efficient to communicate with visual tools to help educate others.\n                       \n\n\n\n\n\n\n\n\n\n                        For more information about this feature, see\n                        \n                         Taking Snapshots of Cards\n                        \n                        .\n                       \n\n                        New Self-Service Connectors\n                       \n\n\n\n                          This month we have polished and released another 18 connectors that are now available to all customers in their Domo account. These connectors are self-service, so you no longer need to contact support to get help powering them up. Here are the new connectors:\n                         \n\n\n\n\n\n\n\n                            Connector\n                           \n\n\n\n                            Link to Knowledge Base article\n                           \n\n\n\n\n\n\n                           Base CRM\n                          \n\n\n                            Base CRM Connector\n                           \n\n\n\n\n                           DataSet via Email (described in more detail below)\n                          \n\n\n                            DataSet via Email Connector\n                           \n\n\n\n\n                           Docebo\n                          \n\n\n                            Docebo Connector\n                           \n\n\n\n\n                           Dotmailer\n                          \n\n\n                            Dotmailer Connector\n                           \n\n\n\n\n                           GradLeaders\n                          \n\n\n                            GradLeaders Connector\n                           \n\n\n\n\n                           Indeed\n                          \n\n\n                            Indeed Connector\n                           \n\n\n\n\n                           Infusionsoft\n                          \n\n\n                            InfusionSoft Connector\n                           \n\n\n\n\n                           Kafka\n                          \n\n\n                            Kafka Connector\n                           \n\n\n\n\n                           Klaviyo\n                          \n\n\n                            Klaviyo Connector\n                           \n\n\n\n\n                           Mavenlink\n                          \n\n\n                            Mavenlink Connector\n                           \n\n\n\n\n                           Paydirt\n                          \n\n\n                            Paydirt Connector\n                           \n\n\n\n\n                           PostgreSQL SSH\n                          \n\n\n                            PostgreSQL SSH Connector\n                           \n\n\n\n\n                           Silverpop\n                          \n\n\n                            Silverpop Connector\n                           \n\n\n\n\n                           SmartRecruiters\n                          \n\n\n                            SmartRecruiters Connector\n                           \n\n\n\n\n                           Sportradar\n                          \n\n\n                            Sportradar Connector\n                           \n\n\n\n\n                           Teradata via ODBC\n                          \n\n\n                            Connecting to ODBC Data in Workbench 5\n                           \n\n\n\n\n                           The Trade Desk\n                          \n\n\n                            The Trade Desk Connector\n                           \n\n\n\n\n                           Treasure Data\n                          \n\n\n                            Treasure Data Connector\n                           \n\n\n\n\n\n                        DataSet via Email Connector\n                       \n\n                        The Dataset via Email connector enables you to get your data into Domo quickly and easily by capturing and processing .xls, .xlsx, and .csv files that have been included as attachments to an email. When you configure this connector, it generates a unique email address that corresponds to your Dataset via Email DataSet in Domo. Once the email address is created, you can send the spreadsheet as an attachment to that email address. The connector will then process the email and update your data accordingly.\n                       \n\n                        For more information, see\n                        \n                         DataSet via Email Connector\n                        \n                        .\n                       \n\n                        Workbench UI Improvements\n                       \n\n                        List View\n                       \n\n                        Workbench now includes a list view that allows you to search and sort DataSet jobs, see upcoming schedules, and organize jobs by status, giving better visibility into jobs to facilitate job management in an instance.\n                       \n\n\n\n\n                        Status Panel\n                       \n\n                        The new Status Panel in Workbench provides you with better insights around when jobs are being run and allows you to make changes, pause, cancel and run jobs. The Status Panel will be visible from every job details page to give real-time information about job status.\n                       \n\n\n\n\n                        Rank & Window Functions in Magic ETL\n                       \n\n                        Domo's Magic ETL tool now includes Rank & Window functions. These new functions enable you to rank and compare data without having to be familiar with complex SQL functions and syntax. These functions are available in Magic ETL in a new action tile called\n                        \n                         Rank & Window\n                        \n                        , which can be found in the\n                        \n                         Edit Columns\n                        \n                        section.\n                       \n\n                        The new Rank & Windows functions include all of the following:\n                       \n\n\n\n                          Rank\n                         \n\n\n\n                          Dense Rank\n                         \n\n\n\n                          Row Number\n                         \n\n\n\n                          Avg\n                         \n\n\n\n                          Count\n                         \n\n\n\n                          Sum\n                         \n\n\n\n                          Lag\n                         \n\n\n\n                          Lead\n                         \n\n\n\n\n\n\n                        For detailed information about each of these functions and step-by-step instructions for using them, see\n                        \n                         ETL Actions: Rank and Window\n                        \n                        .\n                       \n\n                        Self-Service Payments\n                       \n\n                        Beginning August 10th, existing Domo customers will be able to add and pay for licenses right from within the Domo product. With this change, please be aware of the following:\n                       \n\n\n\n                          This will be rolled out over time, so some customers may not see this change right away.\n                         \n\n\n\n                          The price you see is based on your current contract.\n                         \n\n\n\n                          Tax is applied to the purchase price in the product.\n                         \n\n\n\n                        Mobile Page Filters\n                       \n\n                        We have taken the powerful and complex page filters tool and released it to the mobile platform in an accessible and intuitive way. Any business user can immediately gain value. Whether you're an executive walking into one of your retail stores or a manufacturing manager looking at a specific product line, you can quickly filter your full page to find the story.\n                       \n\n                        Try it out for yourself. Navigate to any of your pages in Domo on mobile, tap into the menu, and filter away.\n                       \n\n\n\n\n                        Mobile Card/Page Sharing\n                       \n\n                        Domo has introduced a simple way to collaborate even more easily while on your phone. Have an important card or page you need to share with an individual or your team? Do it now from your phone. As of today you can tap into any card or page and easily share it with others.\n                       \n\n                        Page API\n                       \n\n                        With Domo’s Page public API, users can now automate the creation or duplication of pages and seamlessly update the page’s content. The ability to manage pages through the API gives you the ability to create systems and processes to easily share existing information and content inside a Domo page that can be tailored to any situation that arises.\n                       \n\n                        To begin developing with Domo’s Pages API requires little effort. Once you create authentication tokens in the developer portal’s\n                        \n                         client section\n                        \n                        , you can then explore the Page API functionality by following the steps within the\n                        \n                         Page API Quickstart\n                        \n                        guide or by downloading pre-built Page API examples from any of Domo’s official\n                        \n                         SDK libraries\n                        \n                        .\n                       \n\n                        Developer Sandbox\n                       \n\n                        By obtaining a sandbox, developers can now quickly explore, iterate, and accelerate their development cycles on Domo’s APIs. A developer sandbox also empowers developers with a self-service tool to simulate scenarios with APIs to better understand and handle certain error conditions. This ultimately enables the creation of more resilient applications that can be confidently introduced into production environments.\n                       \n\n                        The option to obtain a developer sandbox is now available in Domo’s Developer portal,\n                        \n                         https://developer.domo.com/dev-sandbox-request\n                        \n                        .  After you submit a request for your sandbox, a new Domo instance is created automatically, and an invitation is sent to your email to activate your login.\n                       \n\n                        Once you activate your account, you will then be able to explore specific developer links in your Sandbox as well as leverage pre-built sample data, cards, and content to begin developing solutions.\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal, by sending a Buzz message to\n                          \n                           \\support\n                          \n                          , or by emailing\n                          \n                           support@domo.com\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042936234", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004439", "Archived Date": "", "Language": "English", "Primary Version": "August 2017 Release Notes", "Article Total View Count": "4,717", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              August 2017 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}