{"file_path": "../../raw_kb_v2\\article\\000005143\\index.html", "content": {"Title": "Domo Add-ins for Microsoft 365 Desktop Apps User Guide", "Article Body": "Intro\n                       \n\n                        This user guide provides instructions for performing common tasks within the Excel, Outlook, PowerPoint, and Word desktop apps using the Domo add-ins. When the guide refers to Microsoft 365 apps in general, it is referring to these four apps. This guide presents general tasks that apply to all apps unless otherwise noted.\n                       \n\n                        All tasks in this guide require the user to have previously installed the Domo add-in for the app they are working in. We highly recommend that you download the add-ins from Microsoft AppSource. You can download\n                        \n                         Domo for Office\n                        \n                        (Excel, PowerPoint, and Word) and\n                        \n                         Domo for Outlook\n                        \n                        . For more detailed instructions about installing the add-ins, see the\n                        \n                         Domo Add-ins for Microsoft 365 Installation Guide\n                        \n                        .\n                       \n\n                        Updates to the Domo add-ins should automatically apply to your installation. If you do not see these updates, you may need to clear your Microsoft 365 add-in's cache. For instructions on how to do this, see\n                        \n                         Microsoft’s documentation\n                        \n                        .\n                       \n\n                        In addition to the tasks described in this guide, the Domo add-ins provide access to Buzz from within the Microsoft 365 apps. You can select the\n                        \n                         Buzz\n                        \n                        tab in the Domo toolbar to view existing conversations and start new ones.\n                       \n\n                        PDP\n                       \n\n                        When you create content in Domo against DataSets with PDP configured, your Personalized Data Permissions, or PDP, are automatically applied.\n                       \n\n                        When you export Domo content or take screenshots to include in documents outside of Domo, recipients receive the data as seen by you with your PDP and access levels. The Domo add-ins for Microsoft 365 apps work similarly until the recipient triggers an automatic or manual refresh, at which point the content from Domo is refreshed with the recipient’s individual PDP and access levels.\n                       \n\n                        Given this information, you should not use add-ins with the expectation that they are a way to create and share content using PDP.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If the recipient of your content does not have the Domo add-in, they cannot refresh the content, so the data remains static and as seen by you.\n                          \n\n\n\n\n                        Known Limitations\n                       \n\n\n                         Outlook\n                        \n\n\n\n\n                          Auto-refresh functionality is not available because an email is a static document.\n                         \n\n\n\n\n                         PowerPoint\n                        \n\n\n\n\n                          Due to a limitation of the current release of PowerPoint, the auto-refresh options are not currently available. You must manually refresh each imported card or DataSet from the Document tab of the Domo toolbar.\n                         \n\n\n\n                        General Tasks\n                       \n\n                        All tasks in this section require the same steps in each of the four Microsoft 365 apps for which there are Domo add-ins (Excel, Outlook, PowerPoint, and Word) unless otherwise noted.\n                       \n\n                        You can navigate through the guide using the linked subheadings below.\n                       \n\n\n\n                          Access the Domo side rail in Excel, PowerPoint, and Word\n                         \n\n\n\n                          Access the Domo side rail in Outlook\n                         \n\n\n\n                          Connect to a Domo instance\n                         \n\n\n\n                          Delete a Domo instance\n                         \n\n\n\n                          Disconnect from/reconnect to a Domo instance\n                         \n\n\n\n                          Switch instances\n                         \n\n\n\n                          Search Domo content\n                         \n\n\n\n                          Import Domo content to your document\n                         \n\n\n\n                          Apply Filters\n                         \n\n\n\n                          Update Filters\n                         \n\n\n\n                          Search for Dashboards and content\n                         \n\n\n\n                          Search for and import DataSets\n                         \n\n\n\n                          Alter document settings\n                         \n\n\n\n                          Alter Domo content settings individually\n                         \n\n\n\n                          Refresh all Domo content in your document\n                         \n\n\n\n                          Refresh all Domo content individually\n                         \n\n\n\n                          Add data to Domo\n                         \n\n\n\n                          Update DataSets in Excel\n                         \n\n\n\n                          Add data to Domo from an email attachment in Outlook\n                         \n\n\n\n\n\n                        Access the Domo Side Rail in Excel, PowerPoint, and Word\n                       \n\n\n                         Open the Microsoft 365 app you want to work in.\n                        \n\n                         Select the\n                         \n                          Domo\n                         \n                         tab in the ribbon at the top of your app to display the Domo toolbar.\n                         \n                         The Domo toolbar displays.\n                         \n\n\n\n\n\n                         In the Domo toolbar, select\n                         \n\n                          Search\n                         \n                         .\n                         \n                         The Domo add-in displays in a side rail to the right of your document. After you have connected to an instance of Domo in the side rail, that instance opens when you access the side rail.\n                         \n\n\n\n\n\n\n\n                        Access the Domo Side Rail in Outlook\n                       \n\n\n                         Open Outlook.\n                        \n\n                         Select\n                         \n                          Domo\n                         \n                         in the toolbar to display the menu.\n                         \n\n\n\n\n\n                         Select\n                         \n\n                          Search\n                         \n                         .\n                         \n                         The Domo add-in displays in a side rail to the right of your document. After you have connected to an instance of Domo in the side rail, that instance opens when you access the side rail.\n                         \n\n\n\n\n\n\n\n                        Connect to a Domo Instance\n                       \n\n\n                         Select the\n                         \n                          Domo\n                         \n                         logo from the toolbar at the top of your Microsoft 365 app.\n                        \n\n                         Select\n                         \n                          + Add Instance\n                         \n                         .\n                         \n                         The Domo add-in displays in a side rail at the right of the app.\n                        \n\n                         In the side rail, enter your organization's domain in the\n                         \n                          Your Company\n                         \n                         field.\n                        \n\n                         Select\n                         \n                          Authenticate\n                         \n                         or\n                         \n                          +\n                         \n                         to sign into your instance.\n                         \n                         A web page opens where you can sign in with your Domo credentials.\n                        \n\n                         Enter your email and password and select\n                         \n                          Sign In\n                         \n                         .\n                         \n                         If your Domo credentials are validated, you are redirected to a web page confirming that you have been granted access. Close the page and return to your Microsoft 365 app to begin using the Domo add-in.\n                         \n\n\n\n\n\n\n\n                        Delete a Domo Instance\n                       \n\n\n                         Select the\n                         \n                          Domo\n                         \n                         logo from the toolbar at the top of your Microsoft 365 app.\n                        \n\n                         Select\n                         \n                          + Add Instance\n                         \n                         .\n                         \n                         The Domo add-in displays in a side rail at the right of the app.\n                        \n\n                         In the side rail, under\n                         \n                          Instances History\n                         \n                         , locate the instance you want to delete and select\n                         \n\n                          Delete\n                         \n                         to the right of the instance name.\n                         \n                         A dialog displays to confirm the deletion of the instance.\n                        \n\n\n\n                         If you select\n                         \n                          Yes\n                         \n                         , the instance is removed from the add-in.\n                        \n\n                         If you select\n                         \n                          No\n                         \n                         , you return to the previous screen.\n                        \n\n\n\n\n\n\n\n\n\n                        Disconnect from/Reconnect to a Domo Instance\n                       \n\n\n                         Select the\n                         \n                          Domo\n                         \n                         logo from the toolbar at the top of your Microsoft 365 app.\n                        \n\n                         Select\n                         \n                          + Add Instance\n                         \n                         .\n                         \n                         The Domo add-in displays in a side rail at the right of the app.\n                        \n\n                         In the side rail, under\n                         \n                          Instances History\n                         \n                         , find the instance you want to disconnect from and select the\n                         \n                         link icon.\n                         \n                         A dialog displays to confirm that you want to unlink that instance.\n                        \n\n\n\n                         If you select\n                         \n                          Yes\n                         \n                         , you return to the previous screen\n                         \n                          ,\n                         \n                         and the link icon is replaced by the\n                         \n                         open link icon for that instance.\n                        \n\n                         If you select\n                         \n                          No\n                         \n                         , you return to the previous screen.\n                        \n\n\n\n                         From the\n                         \n                          Instances\n                         \n                         screen of the add-in, you can add another instance by entering the domain name in the\n                         \n                          Your Company\n                         \n                         field and selecting\n                         \n                          +\n                         \n                         . Additionally, you can reconnect any disconnected instances by selecting the\n                         \n                         open link icon for that instance.\n                        \n\n\n\n\n                        Switch Instances\n                       \n\n                        In order to switch to an instance, you must be connected to that instance. To switch to an instance that you are not connected to, follow the instructions earlier in this guide for\n                        \n                         Connecting to a Domo Instance\n                        \n                        .\n                       \n\n\n                         Select the\n                         \n                          Domo\n                         \n                         logo from the toolbar at the top of your Microsoft 365 app.\n                        \n\n                         Select\n                         \n                          + Add Instance\n                         \n                         .\n                         \n                         The Domo add-in displays in a side rail at the right of the app.\n                        \n\n                         Under\n                         \n                          Instances History\n                         \n                         , you can view the list of connected instances.\n                         \n\n\n\n\n\n                         Select the logo for the connected instance that you want to switch to.\n                        \n\n\n\n\n                        Search Domo Content\n                       \n\n\n                         Complete this step depending on the app you are working in.\n                         \n\n                           For Excel, PowerPoint, and Word:\n                          \n\n\n\n                           Select\n                           \n                            Search\n                           \n                           in the Domo toolbar at the top of your document.\n                           \n                           The\n                           \n                            Search\n                           \n                           screen of the add-in displays in a side rail to the right of your document.\n                          \n\n\n\n                           For Outlook:\n                          \n\n\n\n                           Select the\n                           \n                            Domo\n                           \n                           logo in the toolbar at the top of the app.\n                           \n                           The menu displays.\n                          \n\n                           In the menu, select\n                           \n                            Search\n                           \n                           .\n                           \n                           The\n                           \n                            Search\n                           \n                           screen of the add-in displays in a side rail at the right of the app.\n                          \n\n\n\n                         Enter keywords in the\n                         \n                          Search\n                         \n                         field at the top of the side rail.\n                        \n\n                         You can filter the search results between\n                         \n                          All Domo\n                         \n                         ,\n                         \n                          Card\n                         \n                         ,\n                         \n                          Apps\n                         \n                         , and\n                         \n                          More\n                         \n                         .\n                         \n                          More\n                         \n                         opens a menu with more filtering options.\n                        \n\n\n\n\n\n                        You can change the format you view results in by toggling between\n                        \n\n                         List\n                        \n                        and\n                        \n                         Tile\n                        \n                        at the top of the search results.\n                       \n\n\n\n\n\n\n                        Import Domo Content to Your Document (Excel, PowerPoint, Word)\n                       \n\n\n                         Search for the content you want to import into your document by following the instructions for\n                         \n                          Searching Domo Content\n                         \n                         .\n                        \n\n                         In the search results, select the content.\n                        \n\n                         Drag the content into place in your document.\n                         \n                         The content import modal displays.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Importing is currently supported for Notebook Cards, all card types you can edit in Analyzer, and Domo Bricks. Other card types open in a web browser when selected and cannot be imported.\n                            \n\n\n\n\n\n\n\n\n\n\n                         Choose the\n                         \n                          Insert Type\n                         \n                         and make any changes to\n                         \n                          Settings\n                         \n                         .\n                         \n\n                         Under\n                         \n                          Settings\n                         \n                         , you can choose to\n                         \n                          Include Summary Numbers\n                         \n                         with your card. If your card includes a Summary Number, it displays with your imported card.\n                         \n\n\n\n\n                         You can also choose to\n                         \n                          Include Card Title\n                         \n                         . Including the card title displays the name of the card in your document.\n                         \n\n\n\n\n                         If you want to apply any of the additional settings available in this modal to your content, see the instructions for\n                         \n                          Applying Filters\n                         \n\n\n                         later in this guide.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             You can also search for and import cards from the\n                             \n                              Dashboards\n                             \n                             tile in the Domo toolbar of your document. If you import a card this way, a modal displays with a list of all the Page Filters available for the content under\n                             \n                              Settings\n                             \n                             . You can select a Page Filter to apply to the card you are importing. If you enable the switch for\n                             \n                              Remember my selection for other cards imported from this page\n                             \n                             , you can continue to import cards from that dashboard without needing to configure the Page Filters each time.\n                            \n\n\n\n\n\n\n\n                         Select\n                         \n                          Import Card\n                         \n                         .\n                         \n\n\n\n\n\n                         Verify that the configured card imported correctly to your document.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           See\n                           \n                            Altering Document Settings\n                           \n                           for more information about modifying imported content.\n                          \n\n\n\n\n\n\n                        Apply Filters\n                       \n\n                        In the card import modal shown in the instructions for\n                        \n                         Importing Domo Content to Your Document\n                        \n                        , there are additional Filters you can configure when importing content. Follow these instructions to apply them.\n                       \n\n\n                         In the right navigation menu of the card import modal, select\n                         \n\n                          Filters\n                         \n                         .\n                         \n                         You are redirected to the\n                         \n                          Setup Filters\n                         \n                         screen of the modal.\n                         \n\n\n\n\n\n                         In\n                         \n                          Setup Filters\n                         \n                         , drag the columns you want to filter on from the\n                         \n                          Available Columns\n                         \n                         section to the\n                         \n                          Filters\n                         \n                         section.\n                         \n\n\n\n\n\n                         For each column in the\n                         \n                          Filters\n                         \n                         section, select the column and choose any applicable values for the Filter, such as Filter type and condition. Select\n                         \n                          Apply\n                         \n                         to apply each Filter.\n                         \n\n\n\n\n\n                         When you have created all your Filters, select\n                         \n                          Finish\n                         \n                         to return to the main screen of the card import modal.\n                         \n\n\n\n\n                         The applied Filters display in the right navigation menu of the modal.\n                         \n\n\n\n\n\n                         Select\n                         \n                          Save\n                         \n                         to save your Filters and close the modal.\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Document Filters allow you to apply Filters to all columns with the same name in your document. To use them, highlight the column you want to filter, select the\n                            \n                             Document\n                            \n                            tab in the Domo toolbar, and then select\n                            \n                             Filter Views\n                            \n                            .\n                            \n\n\n\n\n\n\n\n\n\n                        Update Filters\n                       \n\n                        After you import content and apply Filters, you can update your Filters by following these steps:\n                       \n\n\n                         Select\n                         \n                          Document\n                         \n                         from the Domo toolbar at the top of your Microsoft 365 app.\n                         \n                         The\n                         \n                          Document\n                         \n                         screen of the Domo add-in displays in a side rail to the right of your document.\n                        \n\n                         In the list of Domo Content, find the content for which you want to update the Filters.\n                        \n\n                         Select\n                         \n\n                          Settings\n                         \n                         for that content.\n                         \n                         The card import modal displays.\n                        \n\n                         Select\n                         \n\n                          Filters\n                         \n                         .\n                         \n                         You are redirected to the\n                         \n                          Setup Filters\n                         \n                         screen of the modal.\n                        \n\n                         Edit, add, or remove any Filters for the content. See\n                         \n                          Applying Filters\n                         \n                         for more information.\n                        \n\n                         When you have made all the updates to your Filters, select\n                         \n                          Finish\n                         \n                         to return to the main screen of the card import modal.\n                        \n\n                         Select\n                         \n                          Save\n                         \n                         to save your Filters and close the modal.\n                        \n\n\n\n\n                        Search for Dashboards and Content\n                       \n\n\n                         Complete this step depending on the app you are working in.\n                         \n\n                           For Excel, PowerPoint, and Word:\n                          \n\n\n\n                           Select\n                           \n                            Dashboards\n                           \n                           in the Domo toolbar at the top of your document.\n                           \n                           The\n                           \n                            Dashboard\n                           \n                           screen of the Domo add-in displays in a side rail to the right of your document.\n                          \n\n\n\n                           For Outlook:\n                          \n\n\n\n                           Select the\n                           \n                            Domo\n                           \n                           logo in the toolbar at the top of the app.\n                           \n                           The menu displays.\n                          \n\n                           In the menu, select\n                           \n                            Dashboards\n                           \n                           .\n                           \n                           The\n                           \n                            Dashboards\n                           \n                           screen of the add-in displays in a side rail at the right of the app.\n                          \n\n\n\n                         Enter keywords into the\n                         \n                          Filter by name\n                         \n                         field at the top of the\n                         \n                          Dashboard\n                         \n                         screen or scroll through the list items to find the dashboard you are looking for.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Some dashboards are nested under other search results. To view these nested dashboards, select the\n                             \n                             down arrow.\n                             \n\n\n\n\n\n\n\n\n\n\n                         When you find the dashboard you are looking for, select it to view its contents.\n                        \n\n\n\n\n                        Search for and Import DataSets\n                       \n\n\n                         Complete this step depending on the app you are working in.\n                         \n\n                           For Excel, PowerPoint, and Word:\n                          \n\n\n\n                           Select\n                           \n                            Data\n                           \n                           in the Domo toolbar at the top of your document.\n                           \n                           The\n                           \n                            Data\n                           \n                           screen of the Domo add-in displays in a side rail to the right of your document.\n                          \n\n\n\n                           For Outlook:\n                          \n\n\n\n                           Select the\n                           \n                            Domo\n                           \n                           logo in the toolbar at the top of the app.\n                           \n                           The menu displays.\n                          \n\n                           In the menu, select\n                           \n                            Data\n                           \n                           .\n                           \n                           The\n                           \n                            Data\n                           \n                           screen of the add-in displays in a side rail at the right of the app.\n                          \n\n\n\n                         Enter keywords into the\n                         \n                          Search\n                         \n                         bar at the top of the\n                         \n                          Data\n                         \n                         screen of the add-in or scroll through the list to find the DataSet you are looking for.\n                        \n\n                         Select\n                         \n\n                          Filters\n                         \n                         to access Filters to further narrow your search results.\n                         \n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Filters allows you to filter by various criteria, such as who owns the DataSet, what type of data it is, any tags it may have, and when it was last run.\n                            \n\n\n\n\n\n\n\n                         After you select a Filter, you are prompted to select criteria for that Filter.\n                         \n\n\n\n                         With all search criteria applied, you can view the results in list and tile formats by toggling between\n                         \n\n                          List\n                         \n                         and\n                         \n                          Tile\n                         \n                         at the top of the search results.\n                         \n\n                         Results can also be sorted by\n                         \n                          Name\n                         \n                         ,\n                         \n                          Created Date\n                         \n                         ,\n                         \n                          Number of Cards\n                         \n                         ,\n                         \n                          Number of Rows\n                         \n                         ,\n                         \n                          Last run\n                         \n                         , and\n                         \n                          Status\n                         \n                         .\n                         \n\n\n                         Select the DataSet that you want to import into your document.\n                         \n                         The\n                         \n                          Import Data\n                         \n                         button displays.\n                         \n\n\n\n\n\n                         Select\n                         \n                          Import Data\n                         \n                         .\n                         \n                         A preview modal displays where you can alter settings, apply Filters, and view important information about the data.\n                         \n\n\n\n\n                         Select\n                         \n\n                          Filters\n                         \n                         to apply any filters.\n                         \n                         A\n                         \n                          Setup Filters and Select Columns\n                         \n                         modal displays. There are three sections in the modal:\n                         \n                          Available Columns\n                         \n                         ,\n                         \n                          Select Columns\n                         \n                         ,\n                         \n                          and Filters\n                         \n                         . You can drag items between the sections.\n                         \n\n\n                         When you have applied all the necessary Filters, select\n                         \n                          Finish\n                         \n                         .\n                         \n                         The Setup Filters and Select Columns modal closes.\n                         \n\n\n\n\n\n                         When you have finished configuring all settings in the preview modal, select\n                         \n                          Import DataSet\n                         \n                         .\n                        \n\n                         Verify that the DataSet has been imported and displays correctly in your document.\n                        \n\n\n\n\n                        Alter Document Settings (Excel, PowerPoint, Word)\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Any changes to imported content from within the Microsoft app are not reflected in the original asset in Domo. You can change the settings or Filters for the original asset in the\n                           \n                            Document\n                           \n                           tab of the add-in. Any changes made to the source of the content using the add-in display in the Microsoft app after refreshing.\n                          \n\n\n\n\n\n                         Select\n                         \n                          Document\n                         \n                         in the Domo toolbar at the top of your document.\n                         \n                         The\n                         \n                          Document\n                         \n                         screen of the add-in displays in a side rail to the right of the document.\n                        \n\n                         Under\n                         \n                          Settings\n                         \n                         in the add-in, adjust the settings as needed.\n                        \n\n\n\n\n                        Alter Domo Content Settings Individually (Excel, PowerPoint, Word)\n                       \n\n\n                         Open the\n                         \n                          Document\n                         \n                         screen of the Domo add-in. For detailed instructions on how to do this, see\n                         \n                          Altering Document Settings\n                         \n                         .\n                        \n\n                         In the\n                         \n                          Domo Content\n                         \n                         section of the Document side rail, find the content that you want to alter the settings for and select\n                         \n\n                          Settings\n                         \n                         .\n                         \n                         A modal displays with a content preview and sections for settings, Filters, and other information about content.\n                         \n\n\n\n\n\n                         Select\n                         \n                          Save\n                         \n                         or\n                         \n                          Remove Card\n                         \n                         .\n                        \n\n\n\n                         If you select\n                         \n                          Save\n                         \n                         , any changes you made are saved, and you return to the Document screen of the side rail.\n                        \n\n                         If you select\n                         \n                          Remove Card\n                         \n                         , a dialog displays asking you to confirm that you want to remove the content from your document. If you select\n                         \n                          Yes\n                         \n                         , that content is removed from your document.\n                         \n\n\n\n\n\n\n\n                        Refresh All Domo Content in Your Document (Excel, PowerPoint, Word)\n                       \n\n\n                         Select\n                         \n                          Refresh All\n                         \n                         in the Domo toolbar at the top of your document.\n                         \n                         All the Domo content in your document refreshes, and the\n                         \n                          Document\n                         \n                         screen of the Domo add-in displays in a side rail to the right of your document.\n                         \n\n\n\n\n\n                         Adjust the\n                         \n                          Settings\n                         \n                         in the add-in as needed.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             You can make sure the format of your documentation doesn’t change when you refresh your content by selecting\n                             \n\n                              Lock Content\n                             \n                             .\n                            \n\n\n\n\n\n\n\n\n                        Refresh All Domo Content Individually (Excel, PowerPoint, Word)\n                       \n\n\n                         Open the\n                         \n                          Document\n                         \n                         screen of the Domo add-in. For detailed instructions on how to do this, see\n                         \n                          Altering Document Settings\n                         \n                         .\n                        \n\n                         In the\n                         \n                          Domo Content\n                         \n                         section of the Document screen of the add-in, find the content that you want to refresh.\n                        \n\n                         Select\n                         \n\n                          Refresh\n                         \n                         for each item.\n                         \n\n\n\n\n\n\n\n                        Add Data to Domo (Excel, Outlook, and Word)\n                       \n\n\n                         Select\n                         \n                          Data\n                         \n                         in the Domo toolbar at the top of the app.\n                         \n                         The\n                         \n                          Data\n                         \n                         screen of the Domo side rail opens at the right of the document.\n                         \n\n\n\n\n\n\n\n                         In the side rail, select\n                         \n                          Add Data to Domo\n                         \n                         .\n                         \n                         The\n                         \n                          Add Data to Domo\n                         \n                         modal displays.\n                         \n\n\n\n\n\n                         Check the boxes to select each of the tables that you want to upload to Domo.\n                        \n\n                         (Optional) Next to your selected content, hover over\n                         \n\n                          Preview\n                         \n                         to preview it.\n                        \n\n                         Select\n                         \n                          Next\n                         \n                         to configure the DataSets.\n                        \n\n                         Select the radio button to\n                         \n                          Create New Dataset\n                         \n                         or\n                         \n                          Update Existing Dataset\n                         \n                         .\n                         \n                         A preview of the selected data displays in the\n                         \n                          Preview\n                         \n                         area so you can view and validate the data before importing it to Domo.\n                         \n\n                         You can configure your\n                         \n                          Column Data type\n                         \n                         in the\n                         \n                          Preview\n                         \n                         by selecting the column and choosing the data type from the list.\n                         \n\n\n\n\n                           If you choose\n                           \n                            Create New Dataset\n                           \n                           , you are prompted to add a\n                           \n                            Name\n                           \n                           and any\n                           \n                            Tags\n                           \n                           .\n                          \n\n\n\n                           Select\n                           \n                            Next\n                           \n                           to add these items for each sheet.\n                          \n\n                           Complete any remaining fields.\n                          \n\n                           (Optional) Select\n                           \n                            Open in Domo\n                           \n                           to open each selected sheet in Domo.\n                          \n\n\n\n                           If you choose\n                           \n                            Update Existing Dataset\n                           \n                           , you are prompted to select any DataSets in Domo that you want to update from the menu.\n                          \n\n\n\n                           Select the radio button for how you want to update the DataSet:\n                           \n                            Replace\n                           \n                           or\n                           \n                            Append\n                           \n                           .\n                          \n\n                           Add any\n                           \n                            Tags\n                           \n                           .\n                          \n\n                           Complete any remaining fields.\n                          \n\n                           Select\n                           \n                            Next\n                           \n                           to configure each of the selected sheets.\n                          \n\n\n\n                         Select\n                         \n                          Finish\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           To upload only part of an existing DataSet to Domo, highlight your desired data, right-click it, and select\n                           \n                            Domo\n                           \n                           >\n                           \n                            Add selected data to Domo\n                           \n                           .\n                           \n\n\n\n\n\n\n\n\n\n                        Update DataSets in Excel\n                       \n\n\n                         Select\n                         \n                          Data\n                         \n                         in the Domo toolbar at the top of the spreadsheet.\n                         \n                         The\n                         \n                          Data\n                         \n                         screen of the Domo add-in displays in a side rail to the right of the spreadsheet.\n                         \n\n\n\n\n\n\n\n                         Enter keywords in the\n                         \n                          Search\n                         \n                         bar to locate the DataSet you want to update.\n                        \n\n                         Select the DataSet.\n                        \n\n                         Select\n                         \n                          Update Data\n                         \n                         .\n                         \n                         The\n                         \n                          Update DataSet\n                         \n                         modal displays, prompting you to select the sheets that you want to upload.\n                         \n\n\n\n\n\n                         Select the checkboxes for the sheets you want to upload.\n                        \n\n                         Select\n                         \n                          Next\n                         \n                         to configure the selected sheets.\n                         \n\n\n\n\n\n                         Select the DataSet you want to update in Domo.\n                        \n\n                         Select the radio button for how you want to update the DataSet:\n                         \n                          Replace\n                         \n                         or\n                         \n                          Append\n                         \n                         .\n                        \n\n                         Apply any necessary\n                         \n                          Tags\n                         \n                         .\n                        \n\n                         After you have configured all selected sheets, select\n                         \n                          Finish\n                         \n\n\n\n\n\n\n                         (Optional) Select\n                         \n                          Open in Domo\n                         \n                         to open the updated DataSet in Domo in a new window.\n                         \n\n\n\n\n\n                         Select\n                         \n                          Close\n                         \n                         to close the modal.\n                        \n\n\n\n\n                        Add Data to Domo from an Email Attachment in Outlook\n                       \n\n\n                         Open the email that you want to import DataSets from.\n                        \n\n                         Select the\n                         \n                          Domo\n                         \n                         logo from the toolbar at the top of the app.\n                         \n                         The Domo menu displays.\n                         \n\n\n\n\n\n                         In the Domo menu, select\n                         \n                          Data\n                         \n                         .\n                         \n                         The\n                         \n                          Data\n                         \n                         screen of the Domo add-in displays at the right of the app.\n                         \n\n\n\n\n\n                         In the\n                         \n                          Data\n                         \n                         side rail, select\n                         \n                          Add Data to Domo\n                         \n                         .\n                         \n                         The\n                         \n                          Add Data to Domo\n                         \n                         modal displays.\n                        \n\n                         Select the radio button\n                         \n\n                         for where your data is coming from:\n                         \n                          From an Attachment\n                         \n                         or\n                         \n                          From Email Body\n                         \n                         .\n                         \n\n\n\n\n\n                         Select\n                         \n                          Next\n                         \n                         .\n                        \n\n                         Select the checkboxes for the data you want to add.\n                         \n\n\n\n\n\n                         Select\n                         \n                          Next\n                         \n                         .\n                        \n\n                         Select the radio button\n                         \n\n                         to\n                         \n                          Create New Dataset\n                         \n                         or\n                         \n                          Update Existing Dataset\n                         \n                         .\n                         \n\n                           If you choose\n                           \n                            Create New Dataset\n                           \n                           , you are prompted to add a\n                           \n                            Name\n                           \n                           and any\n                           \n                            Tags\n                           \n                           .\n                          \n\n\n\n                           Select\n                           \n                            Next\n                           \n                           to add these items for each of the selected sheets.\n                          \n\n                           Complete any remaining fields.\n                          \n\n                           (Optional) Select\n                           \n                            Open in Domo\n                           \n                           to open each selected sheet in Domo.\n                          \n\n\n\n                           If you choose\n                           \n                            Update Existing Dataset\n                           \n                           , you are prompted to select any DataSets in Domo that you want to update from the menu.\n                          \n\n\n\n                           Select the radio button for how you want to update the DataSet:\n                           \n                            Replace\n                           \n                           or\n                           \n                            Append\n                           \n                           .\n                          \n\n                           Add any\n                           \n                            Tags\n                           \n                           .\n                          \n\n                           Complete any remaining fields.\n                          \n\n                           Select\n                           \n                            Next\n                           \n                           to configure each of the selected sheets.\n                          \n\n\n\n                         Select\n                         \n                          Finish\n                         \n                         .\n                         \n\n\n\n\n\n                         (Optional) Select\n                         \n                          Open in Domo\n                         \n                         to open the DataSet in Domo in a new window.\n                        \n\n                         Select\n                         \n                          Close\n                         \n                         to close the modal.", "Preview Article": "Click here to preview", "URL Name": "000005143", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005143", "Archived Date": "", "Language": "English", "Primary Version": "Domo Add-ins for Microsoft 365 Desktop Apps User Guide", "Article Total View Count": "1,517", "": "", "Article Created Date": "3/3/2023, 7:28 PM", "First Published Date": "3/6/2023, 8:27 PM"}, "title": "\n              Domo Add-ins for Microsoft 365 Desktop Apps User Guide\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Microsoft Office Add-ins\n              \n", "url": "/s/topic/0TO5w000000ZkAlGAK"}]}