{"file_path": "../../raw_kb_v2\\article\\1500003408882\\index.html", "content": {"Title": "Data Science Home Page", "Article Body": "Intro\n                       \n\n                        The Data Science Home Page shows all of the powerful data science tools, all in one place. It gives you quick access to the data science tools, outlines the products and services, and outlines where the tools fit into the data science maturity journey.\n                       \n\n                        Accessing the Data Science Home Page\n                       \n\n                        To access the Data Science Home Page, click on the\n                        \n                         More\n                        \n                        menu in the top navigation pane and select the\n                        \n                         Data Science\n                        \n                        icon.\n                       \n\n\n\n                         >\n                        \n\n\n\n                        Prepare & Discover tab\n                       \n\n                        The first tab of the Data Science Home Page is Prepare & Discover. This allows you to clean up your data and discover insights. The first step to a solid Data Science strategy is aligning your data to your organization's needs. These tools can help as you clean, prepare, and explore your data, identifying new correlations and relationships that you can leverage in the next phase.\n                       \n\n\n\n\n                        Experiment & Predict tab\n                       \n\n                        The second tab of the Data Science Home Page is Experiment & Predict. This allows you to develop models of what drives data. With your data in Domo you can run experiments to understand what drives change in your data. These tools help you develop models that predict results with greater efficiency or classify with increased accuracy.\n                       \n\n\n\n\n                        Deploy & Distribute tab\n                       \n\n                        The third tab of the Data Science Home Page is Deploy & Distribute. This allows you to gain actionable insights into people and systems. Turn your experiments, models, and insights into action. In record time you can build rich stories, powerful apps, and intelligent alerts that are Machine Learning powered and always up to date or extend Data Science outside of your company with embedded analysis for customers and partners.\n                       \n\n\n\n\n                        Search All Tools tab\n                       \n\n                        The final tab of the Data Science Home Page is the Search All Tools. This allows you to see all of the capabilities in one place. You can search for a specific tool or see all tools under a specific use case, such as Hygiene, Insights, etc.", "Preview Article": "Click here to preview", "URL Name": "1500003408882", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003149", "Archived Date": "", "Language": "English", "Primary Version": "Data Science Home Page", "Article Total View Count": "4,823", "": "", "Article Created Date": "10/24/2022, 9:10 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Data Science Home Page\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}