{"file_path": "../../raw_kb_v2\\article\\360056655734\\index.html", "content": {"Title": "Productivity", "Article Body": "Intro\n                       \n\n                        The Productivity App helps you to understand productivity trends in your business over time as well as how many of your employees are working in the office, working from home, and on PTO/quarantine. The main overview Company Productivity Card displays where employees are working and high-level productivity metrics for your business systems. Individual Tool Tracker Cards for each system highlight more detailed metrics, along with trends over the last 30 days and comparisons to your data from yesterday. The\n                        \n                         More\n                        \n                        button on each Tool Tracker links to a dashboard that offers even more detailed information.\n                       \n\n                        With the Productivity App, you can define productivity indicators and track them in real-time to see how your teams are doing. The system calculates your highest productivity over the last 90 days, then tells you your current percentage of attainment to that high. You can see participation in each activity, and even compare productivity estimates for when people are working in the office versus working at home.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This app is part of the\n                             \n                              Get Back to Work Solution\n                             \n                             and is available\n                             \n                              on-demand and paid\n                             \n                             .\n                            \n\n\n\n\n                            To request this feature be enabled,\n                           \n\n\n\n                              Reach out to your Domo Customer Success Manager or Account Executive.\n                             \n\n\n\n\n                               If you do not have contact information for your CSM or AE, contact Domo Support. For information on how to contact Support, please see:\n                               \n                                Getting Help\n                               \n\n\n\n\n\n\n\n\n\n                        Company Productivity Card\n                       \n\n                        The Company Productivity Card shows whether employees are working in the office, working from home, or on PTO/quarantine as reported in the Safe Worker App. Each of the systems connected to the app will appear in the Company Productivity Card tracking a key activity, along with a percentage about how that activity today compares to the highest level from the last 90 days. Estimates are also given indicating whether this activity is happening in the office, from home, or on PTO/quarantine.\n                        \n\n\n\n\n                        Tool Trackers\n                       \n\n                        The Tool Trackers have a sampling of systems to connect to, and you can choose which Tool Trackers you want to use, depending on your team and the systems you use in your business. You can track email activity, online meetings attended, tickets resolved, closed leads, and more and start bringing data from other systems into Domo in just minutes, with your user credentials for the systems you want to track. See at a glance if your indicators are trending upward or downward, and see usage over time. The drill down menus offer an even deeper dive into the productivity indicators for the different systems in your business.\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            The Slack Connector is pending development and sample data is shown in the screenshots.\n                           \n\n\n\n\n\n                        Drill down menus\n                       \n\n                        For detailed numbers about the indicators on the Tool Tracker Cards, there is a Drill down menu tied to each one. The drill down menu shows specific numbers and percentages for each indicator, as well as a trendline for each of the metrics over the last four months.\n                        \n\n\n\n\n                        Understanding the data in the Productivity Indicators App\n                       \n\n                        Company Productivity Card data\n                       \n\n                        Where does the employee data come from on the Company Productivity Card?\n                       \n\n                        The employee data is derived from the data in the Safe Worker App where employees report whether they are working from home, the office, or PTO/quarantine.\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            This data is currently dependent on the Safe Worker App.\n                           \n\n\n\n\n\n                        Are the colored percentage bars for each system exact for how much of the activity is happening from home, in the office, and on PTO/quarantine?\n                       \n\n                        Because the systems do not provide exact information on who is performing each action, the colored percentage bars are estimates based on the percentage of employees working in the office, from home, and on PTO/quarantine.\n                        \n\n\n\n\n                        What do the percentage numbers for each system indicate?\n                       \n\n                        This number is the most recent value from today and compared to the highest value from the previous 90 days and indicated as a percentage here. The time the DataSet runs data for that day can be set in the schedule for the Dataset.\n                       \n\n                        What metric is each system measuring?\n                       \n\n                        Zoom Meetings: Total meetings.\n                        \n                        Gong Calls: Total Calls.\n                        \n                        Exchange Email Activity: How many people sent emails.\n                        \n                        Slack Messages: Total Messages posted.\n                        \n                        Buzz Posts: Total Posts created.\n                        \n                        Salesforce Leads: New leads created.\n                        \n                        Zendesk Tickets: Open tickets.\n                        \n                        Intercom Conversations: Total conversations.\n                        \n                        Zoho Deals: New deal.\n                       \n\n                        Tool Trackers data\n                       \n\n                        The trendline shows data points from the last 30 days for the metric listed underneath the line. The Summary Number shows a percentage change of the same metric from yesterday. The percentage underneath the trendline is calculated by comparing the most recent value with the value from 30 days ago. The direction and color of the arrow indicate whether that metric has gone up or down from the previous day. Detailed numbers about these metrics are found by clicking on the\n                        \n                         More\n                        \n                        menu.\n                        \n\n\n\n\n                        Drill down menus data\n                       \n\n\n\n\n\n                        The summary Cards in the drill downs are more detailed metrics from the key indicators on the main Productivity Dashboard. The numbers are the most recent data and the percentages are based on the most recent data compared to yesterday.\n                        \n\n\n\n\n\n\n                        The trendline shows aggregations of monthly totals for the metrics found in the summary Cards.", "Preview Article": "Click here to preview", "URL Name": "360056655734", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004132", "Archived Date": "", "Language": "English", "Primary Version": "Productivity", "Article Total View Count": "4,676", "": "", "Article Created Date": "10/24/2022, 9:24 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Productivity\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}