{"file_path": "../../raw_kb_v2\\article\\360043439313\\index.html", "content": {"title": "\n\n\n DomoStats - Projects and Tasks\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomoStats gives you the freedom to explore how your team is using Domo. Because DomoStats is powered by a live Domo DataSet with no configuration, you can easily build cards, alerts, and workflows around the metrics you want to see as well as use the pre-built dashboard.\n\n\n This DomoStats app provides key insights into your organization's Domo Projects and Tasks. Ensure projects will be delivered on time by monitoring all your open projects and tasks in a single dashboard. Identify at-risk projects, address overdue tasks, and manage team workloads by tracking assignee productivity and efficiency.\n\n\n Video - Domostats - Projects and Tasks App\n--------------------------------------------\n\nRequirements\n--------------\n\nYou must have Admin level access to download from the Appstore.\n\n\n Using the DomoStats App\n-------------------------\n\nYou can use the pre-built dashboard or build any of your own content using the DomoStats DataSets in the Data Center. When you first download the app, a new page is created titled DomoStats - Projects and Tasks. You'll need to power up the dashboard with the following steps:\n\n. Navigate to the\n **DomoStats - Projects and Tasks**\n page.\n2. Select\n **Connect Data**\n .\n3.\n4. In the drop-down, select\n **Connect**\n to connect the page to the DomoStats DataSets or select\n **Assign**\n if you want to assign another Domo user to set up the data.\n5. In the last window, select\n **Connect**\n .\n\nThe dashboard\n---------------\n\n\n###\n Data\n\nThe following data is included in the download of the DomoStats - Projects and Tasks app and can be found in the Data Center as a 'DomoStats' type DataSet.\n\n\n DataSets include:\n\n Projects\n* Tasks\n* Task Owners\n\nDataFlows include:\n\n Projects and Tasks\n* Tasks + Task Owners\n\n\n**Note:**\n All DataSets powering the app run once a day. Runtime is every 24 hours from when the app is first deployed. While the run frequency cannot be changed, you can edit the runtime in the DataSet settings. For more information on how to schedule DataSets, see\n\nDataSet Scheduling\n\n.\n\n\n###\n Cards\n\nThe following cards are included in the pre-built dashboard.\n\n  |  |  |\n| --- | --- | --- |\n| **Collection**  | **Card**  | **Description**  |\n|\n Projects\n  |\n Project Tracker\n  |\n Displays the start date and due date for each project and measures the number of completed tasks against the number of total tasks to give an estimated completion percentage for each project.\n\n*Note:**\n For best results, be sure to include a project due date for each of your projects within your Domo Projects and Tasks. When a project due date is not defined, the current date will be displayed as the due date on this card.\n\n\n |\n|\n Project Progression\n  |\n Shows the number of to-do, working on, and completed tasks per project.\n  |\n|\n Project Due Dates\n  |\n Shows the projects due on each day of the calendar.\n  |\n|\n Projects Due - Next 10 Days\n  |\n The projects that will come due in the next 10 days.\n  |\n|\n Projects Past Due\n  |\n The projects that are past due and the number of days since they were due.\n  |\n|\n Newest Projects\n  |\n The project name, created date, creator name, and project description of the 15 most recently created projects.\n  |\n|\n Project Creation Trend\n  |\n The number of projects created over time.\n  |\n|\n Top Project Creators\n  |\n The number of projects created by users.\n  |\n|\n Largest Projects\n  |\n The number of tasks created across all active projects.\n  |\n|\n Tasks\n  |\n Project Task Completion\n  |\n Measures the number of completed tasks against the number of total tasks within each active project.\n  |\n|\n Task Completion by Project\n  |\n The number of tasks completed on each project over time.\n  |\n|\n Tasks Completed (30 Days)\n  |\n The trend of tasks completed over the last 30 days.\n  |\n|\n Tasks Due Calendar\n  |\n The tasks that are due each day.\n  |\n|\n Overdue Tasks\n  |\n Shows the tasks that are past due, the projects those tasks belong to, and the number of days since the tasks were due.\n  |\n|\n Task Breakdown\n  |\n Displays the number of tasks listed as to-do, working on, and completed across all active projects.\n  |\n|\n Assignees\n  |\n Assignee Productivity\n  |\n The number of tasks each member has been assigned and the number of tasks each member has completed. Bubble sizes represent the percentage of assigned tasks that have been completed.\n  |\n|\n Assignee Workloads\n  |\n Shows the number of tasks each member has been assigned in each project.\n  |\n|\n Top 10 Assignee Workloads\n  |\n The number of tasks each member has been assigned and the number of tasks each member has completed. Displays the top 10 assignees by the number of tasks.\n  |\n|\n Top 25 Assignees\n  |\n The number of tasks each member has been assigned.\n  |\n|\n Lightest Workloads\n  |\n The 5 assignees with the fewest number of \"to-do\" or \"working-on\" tasks assigned them.\n  |\n|\n Assignee Efficiency\n  |\n Shows the average number of days each assignee's tasks have had a \"to-do\" or \"working-on\" status. Also displays the average number of days each assignee spent on tasks that have been completed.\n  |\n|\n Assignee Tasks To-do\n  |\n Shows the number of to-do tasks assigned to each member and the average number of days these tasks have had a to-do status.\n  |\n|\n Assignee Tasks Working-on\n  |\n The number of tasks each member is working on and the average number of days these tasks have had a \"working-on\" status.\n  |\n|\n Assignee Tasks Completed\n  |\n The number of tasks each member has completed and the average number of days spent completing these tasks.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043439313\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003039\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDomoStats - Projects and Tasks\n\n", "article_total_view_count": "\n\n\n 4,764\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:05 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "domostats__projects_and_tasks", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "governance_tools", "url": "/s/topic/0TO5w000000ZannGAC"}]}