{"file_path": "../../raw_kb_v2\\article\\360043433973\\index.html", "content": {"title": "\n\n\n Microsoft Exchange Metrics REST Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMicrosoft Exchange Server is a mail server or messaging platform which works as a centralized hub with mailboxes for storing users' mail. To learn more about Microsoft Exchange Server, visit their page (\n\nhttps://docs.microsoft.com/en-us/exc...xchserver-2019\n\n).\n\n\n To use this connector, you must first create a Microsoft Azure Web App and set the necessary permissions. This is discussed in the \"Prerequisites\" section below.\n\n\n You connect to your Microsoft Exchange Metrics REST account in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft Exchange Metrics REST connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Microsoft Exchange Metrics account and create a DataSet, you must have the following:\n\n A customer client ID and client secret obtained from your Microsoft Azure Web App\n* Microsoft account credentials\n\n\n###\n Configuring Your Azure App\n\nTo create a connection with your Microsoft Exchange Metrics account, you must first create a Microsoft Azure Web App to obtain the necessary client ID and secret.\n\n\n**To configure an Azure App,**\n\n. Login into Azure Portal.\n2. Select\n **Azure Active Directory > App Registrations > Create New Application**\n .\n3. In the\n **Name**\n field, enter the name of the application.\n4. In the\n **Application type**\n menu, select\n **Web app /API**\n .\n5. In the\n **Sign-on URL**\n , enter the sign-on URL of your application (\n\nwww.yourcompanyname.com\n\n).\n6. Click\n **Create**\n .\n7. Click on your application.\n\n\n The\n **Application ID**\n that appears here is the Client ID you will enter in the\n **Connection**\n pane in Domo.\n8. **Select Settings > Reply URLs.**\n9. Enter the following URL in the field and click\n **Save**\n .\n\n\n`https://oauth.domo.com/api/data/v1/oauth/providers/microsoft-exchange-metrics-rest/exchange`\n10. Select\n **Settings > Required Permissions > Add > Microsoft Graph > Save**\n .\n11. Set the following permissions:\n\n* \"Maintain access to data you have given it access to\"\n\t* \"Read all usage reports\"\n\t* \"Read user and shared contacts\"\n\t* \"Read user and shared calendars\"\n\t* \"Read all files that user can access\"\n12. Select\n **Settings > Required Permissions > Add > Windows Azure Active Directory > Save**\n .\n13. Set the following permissions:\n\n* \"Sign in and read user profile\"\n\t* \"Read all users' basic profiles\"\n14. Select\n **Settings > Required Permissions > Grant Permissions > Yes**\n .\n\n\n**Note:**\n\nIn some cases, an Admin has to approve grant permissions; otherwise you will see a message reading \"Failed to grant permissions for application.\"\n15. Select\n **Settings > Keys > Create New Key**\n .\n\n\n This is the Client Secret you will enter in the\n **Connection**\n pane in Domo. Be sure to save this, as you will not see it again.\n\nConnecting to Your Microsoft Exchange Metrics Account\n-------------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Microsoft Exchange Metrics Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Microsoft Exchange Metrics account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Client ID\n  |\n Enter your Microsoft Exchange Metrics client ID.\n  |\n|\n Client Secret\n  |\n Enter your Microsoft Exchange Metrics client secret.\n  |\n\n\n After you enter a client ID and client secret, you are taken to Microsoft's OAuth page where you are requested to enter your email, phone number, or Skype name associated with your Microsoft account. Once you have connected, you can use the same account any time you go to create a new Microsoft Exchange Metrics DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n****Note:****\n If you are already logged into Microsoft when you connect in Domo, you are authenticated automatically when you click\n ****Add account****\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Microsoft.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Microsoft Exchange Metrics report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Activity Counts\n  |\n Returns trends on how many users organized and participated in conference sessions held in your organization through Skype for Business.\n  |\n|\n Activity User Counts\n  |\n Returns trends on how many unique users organized and participated in conference sessions held in your organization through Skype for Business.\n  |\n|\n Activity User Detail\n  |\n Returns details about Skype for Business activity by user.\n  |\n|\n Device Usage Distribution User Counts\n  |\n Returns the number of users using unique devices in your organization.\n  |\n|\n Device Usage User Counts\n  |\n Returns usage trends on how many users in your organization have connected using the Skype for Business app.\n  |\n|\n Device Usage User Detail\n  |\n Returns details about Skype for Business device usage by user.\n  |\n|\n Email Activity Counts\n  |\n Returns trends of email activity (like how many were sent, read, and received) in your organization.\n  |\n|\n Email Activity User Counts\n  |\n Returns trends on the number of unique users who are performing email activities like send, read, and receive.\n  |\n|\n Email Activity User Detail\n  |\n Returns details about email activity users have performed.\n  |\n|\n Email App Usage User Detail\n  |\n Returns details about which activities users performed on the various email apps.\n  |\n|\n Email App Usage Apps User Counts\n  |\n Returns the count of unique users per email app.\n  |\n|\n Email App Usage User Counts\n  |\n Returns the count of unique users that connected to Exchange Online using any email app.\n  |\n|\n Email App Usage Versions User Counts\n  |\n Returns the count of unique users by Outlook desktop version.\n  |\n|\n Mailbox User Detail\n  |\n Returns details about mailbox usage.\n  |\n|\n Mailbox Usage Mailbox Counts\n  |\n Returns the total number of user mailboxes in your organization and how many are active each day of the reporting period.\n  |\n|\n Mailbox Usage Quota Status Mailbox Counts\n  |\n Returns the count of user mailboxes in each quota category.\n  |\n|\n Mailbox Usage Storage\n  |\n Returns the amount of storage used in your organization.\n  |\n|\n Office365 Groups Activity Detail\n  |\n Returns details about Office 365 Groups activity by group.\n  |\n|\n Office365 Groups Activity Counts\n  |\n Returns the number of group activities across group workloads.\n  |\n|\n Office365 Groups Activity Group Counts\n  |\n Returns the daily total number of groups and how many of them were active based on email conversations, Yammer posts, and SharePoint file activities.\n  |\n|\n Office365 Groups Activity Storage\n  |\n Returns the total storage used across all group mailboxes and group sites.\n  |\n|\n Office365 Groups Activity File Counts\n  |\n Returns the total number of files and how many of them were active across all group sites associated with an Office 365 Group.\n  |\n|\n OneDrive Activity File Counts\n  |\n Returns the number of unique, licensed users that performed file interactions against any OneDrive account.\n  |\n|\n OneDrive Activity User Counts\n  |\n Returns the trends in the number of active OneDrive users.\n  |\n|\n Organizer Activity Minute Counts\n  |\n Returns usage trends on the length in minutes and type of conference sessions held and organized by users in your organization.\n  |\n|\n Organizer Activity Counts\n  |\n Returns usage trends on the number and type of conference sessions held and organized by users in your organization.\n  |\n|\n Participant Activity Counts\n  |\n Returns usage trends on the number and type of conference sessions that users from your organization participated in.\n  |\n|\n Participant Activity User Counts\n  |\n Returns usage trends on the number of unique users and type of conference sessions that users from your organization participated in.\n  |\n|\n Participant Activity Minute Counts\n  |\n Returns usage trends on the length in minutes and type of conference sessions that users from your organization participated in.\n  |\n|\n PeerToPeer Activity User Counts\n  |\n Returns usage trends on the number of unique users and type of peer-to-peer sessions held in your organization.\n  |\n|\n PeerToPeer Activity Counts\n  |\n Returns usage trends on the number and type of sessions held in your organization.\n  |\n|\n PeerToPeer Activity Minute Counts\n  |\n Returns usage trends on the length in minutes and type of peer-to-peer sessions held in your organization.\n  |\n|\n SharePoint Activity User Counts\n  |\n Returns trends in the number of active users. A user is considered active if he or she has executed a file activity (save, sync, modify, or share) or visited a page within the specified time\n  |\n|\n SharePoint Site Usage Storage\n  |\n Returns trends of storage allocated and consumed during the reporting period.\n  |\n|\n Teams User Activity User Detail\n  |\n Returns details about Microsoft Teams user activity by a user.\n  |\n|\n Teams User Activity Counts\n  |\n Returns the number of Microsoft Teams activities by activity type. The activities are performed by Microsoft Teams licensed users.\n  |\n|\n Teams User Activity User Counts\n  |\n Returns the number of Microsoft Teams users by activity type. The activity types are number of teams chat messages, private chat messages, calls, or meetings.\n  |\n|\n Teams Device Usage User Detail\n  |\n Returns the details about Microsoft Teams device usage by user.\n  |\n|\n Teams Device Usage User Counts\n  |\n Returns the number of Microsoft Teams daily unique users by device type.\n  |\n|\n Teams Device Usage Distribution User Counts\n  |\n Returns the number of Microsoft Teams unique users by device type over the selected time period.\n  |\n\n|\n|\n Parameter Type\n  |\n Select whether you want to pull data for a selected period of days (\n **Period**\n ) or for a specified date or date range (\n **Date**\n ).\n  |\n|\n Period\n  |\n Select the number of days you want to retrieve data for. (\"D\" refers to days. So\n **D7**\n would pull data for 7 days,\n **D30**\n would pull data for 30 days, etc.)\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433973\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003523\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft Exchange Metrics REST Connector\n\n", "article_total_view_count": "\n\n\n 4,684\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "microsoft_exchange_metrics_rest_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}