{"file_path": "../../raw_kb_v2\\article\\1500008535702\\index.html", "content": {"title": "\n\n\n On-Premise SharePoint Data Provider Plugin (Beta)\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Domo SharePoint Plugin allows you to create jobs in Workbench 5 to get the data from SharePoint into Domo. Domo Workbench provides a secure, client-side solution for uploading your on-premise data to Domo. The Domo SharePoint Data Provider links Domo Workbench to operational SharePoint data. You can build datasets from SharePoint data in Workbench and then create real-time visualizations of SharePoint data in the Domo service. This tutorial teaches you how to use the Domo SharePoint Plugin to connect to your SharePoint data.\n\n\n What you need to get started\n------------------------------\n\n\n* Windows 10 64-bit operating system\n* Domo Workbench\n* SharePoint Plugin\n\nInstalling the SharePoint Plugin in Domo Workbench\n----------------------------------------------------\n\nAll Workbench plugins are contained within Dynamic Link Libraries (DLLs). You can add plugins to Workbench by selecting the desired DLL on your machine or network.\n\n##\n Adding SharePoint Plugin to Workbench:\n\n*Note:**\n Your SharePoint Plugin must be located in a subdirectory of the chosen directory.\n\n. In Domo Workbench, click\n\nin the left-hand icon bar.\n2. Click\n **Plugins**\n in the\n **More**\n pane. (If you do not see this pane, click\n\nto expand it.)\n\n\n The\n **Plugin Manager**\n opens.\n3. Under\n **Register new plugins**\n click the ellipsis (\n **...**\n ) next to the\n **Search path**\n field.\n4. On your machine or network, locate and open the folder that contains a folder with all DLLs of SharePoint Plugin.\n5. Click\n **Add**\n after you have chosen your DLL.\n\nConnecting to the SharePoint Data\n-----------------------------------\n\n\n###\n Creating a SharePoint DataSet job in Workbench 5\n\n\n1. Click the\n\nicon in the left-hand icon bar.\n2. Click the\n **+**\n button in the top right corner of the jobs listing pane.\n3. An\n **Overview**\n tab for a new job will appear.\n4. Enter the following details in\n **Job Details**\n section.\n\n\n| **Field**  | **Description**  |\n| --- | --- |\n|\n Domo Domain\n  |\n Select the desired account (Domo instance) in the\n **Domo Domain**\n dropdown menu.\n\n\n If you have only one account set up, that account is already chosen for you and the menu is unavailable.\n  |\n|\n Job Name\n  |\n Enter a name for the DataSet Job.\n\n\n This is the job name that appears in Workbench, not the name of the uploaded DataSet in Domo.\n  |\n|\n Transport Type\n  |\n Select\n **Domo SharePoint Data Provider**\n .\n  |\n|\n Reader Type\n  |\n Select the file type that you want to read from SharePoint in Workbench.\n  |\n5. In the\n **Domo Details**\n section, provide the information for your DataSet.\n\n\n| **Field**  | **Description**  |\n| --- | --- |\n|\n DataSet Name\n  |\n Enter the name of the DataSet. This is the name of the uploaded DataSet in Domo.\n  |\n|\n DataSet Type\n  |\n Select the type of DataSet from the dropdown. The DataSet type you select or enter here is reflected as the Connector type in Domo after you execute the job.\n  |\n|\n DataSet Description\n  |\n Enter a description for the DataSet, if desired.\n\n\n This is the description of the DataSet as it appears in Domo.\n  |\n6. Click\n **Create**\n .\n\n\n A new SharePoint DataSet Job is created and added to the list of jobs for the currently authenticated account.\n\n*Note:**\n After creating a job, you cannot edit any of the settings you just configured except for the DataSet name. If you want to change any of the other settings, you must create another new job.\n\n##\n Configuring Your Job\n\nOnce a job is created, you need to provide the configuration details for the job.\n\n###\n Configure the Source\n\n\n1. Provide the details for the SharePoint data in the\n **Source**\n menu.\n2. Click\n **Edit**\n .\n3. A\n **Domo SharePoint Data Provider Editor**\n window will appear. Here, you need to provide the Credentials and Report details required to connect to your SharePoint data.\n\n\n|\n**Field**\n | **Description**  |\n| --- | --- |\n|\n Connection Type\n  |\n Select the connection type as\n **SharePoint On-Premise**\n .\n  |\n|\n SharePoint URL\n  |\n Enter URL for the SharePoint site.\n  |\n|\n Username\n  |\n Enter your SharePoint username.\n  |\n|\n Password\n  |\n Enter your SharePoint password.\n  |\n|\n Domain\n  |\n Enter your SharePoint Windows domain name.\n\n\n Example: If your SharePoint site was located at\n\nhttps://sample.sharepoint.com\n\n, your domain name would be “sample”.\n  |\n|\n Report\n  |\n Select the report from the dropdown.\n  |\n|\n Server Relative URL\n  |\n Enter the name of the data file you want to connect with this DataSet in SharePoint.\n  |\n4. Click\n **Apply**\n .\n\n\n####\n Configure Data Processing\n\n\n1. Provide the details about data processing for the SharePoint data in the\n **Processing**\n menu.\n2. Click\n **Edit**\n .\n3. An\n **Editor**\n window will appear for the selected Reader type. Here, you can provide the properties and details for your data to define how your data will be handled in the DataSet.\n4. Click\n **Apply**\n .\n\n\n####\n Configuring Data Update Method\n\n\n1. Select\n **Replace**\n if you want newly uploaded data to replace the existing data in the DataSet.\n2. Select\n **Append**\n if you want the newly added data to be appended (added) to the existing data\n3. Select\n **Partition**\n if you want to apply partitioning on your data. Partitioning uses a grain (like day or week) to create groups in your data. Data can then be processed as a group, and added or replaced as it changes.\n4. Select the\n **Partition column**\n and\n **Date grain**\n in the respective drop downs for your data.\n\n\n####\n Applying Transforms to Your Data\n\nTransforms modify your data locally before uploading it to Domo. They are faster, and process on your computer or server without a queue. Choose from a variety of options to transform your data so it’s ready when it hits Domo.\n\n. Select the desired transform from the drop down and click the\n **+**\n button next to it.\n2. Mention the transform properties for the selected transform and click\n **Apply**\n .\n3. You can add multiple transforms to your data.\n4. Click\n\nto update the transform properties for a specific transform.\n5. Click\n\nto remove a specific transform.\n6. Click the\n\n(up and down arrows) to interchange the positions of the transforms.\n\n\n####\n Impersonating Your Job\n\nUse of impersonation allows the Domo Workbench to run your job as a specific Active Directory user.\n\n*Note:**\n The user profile in job impersonation needs to be a role that has access to the source data needed to run the job.\n\n\n1. Select the\n **Requires impersonations**\n check box.\n2. Your Active Directory domain name and username will appear.\n3. Enter your Active Directory password and click\n **Validate**\n .\n\n\n####\n Additional Settings for Your Job\n\nSet the advanced options for how your job uploads data in Domo in the\n **Additional Settings**\n . You can specify the Error handling method, and the job run duration and conditions here.\n\n##\n Scheduling Your Job\n\nYou can schedule a DataSet job to routinely upload data from external DataSets to Domo. You mention this frequency in the Schedule tab.\n\n###\n Basic Schedule\n\nThe\n **Basic Schedule**\n section allows you to update the data manually, update when file is changed, or update on a schedule.\n\n\n If you chose to update on a schedule, you can select the time interval and a specific time window to run the job.\n\n###\n Advanced Schedule\n\nIn the\n **Advanced Scheduling**\n section, you can opt to run the job once a day, more than once a day, every day, specific days of the week/month, every month, or specific months.\n\n\n Click the\n\n(\n **Save**\n ) button to save your changes.\n\n##\n Schema Protection for Your Job\n\nDomo Workbench 5 offers three different schema protection types. You can control the schema changes by allowing the schema changes safely or permitting the unprotected schema changes, or completely blocking all schema changes. Domo Workbench supports a Protect feature that enables you to control these schema changes in a way. It is available for the “Allow safe schema changes” and “Allow unprotected schema changes” views.\n\n###\n Protect Column\n\nThe Protect column indicates whether your column (data field) is protected while you apply the schema changes to your job.\n\n If the\n **Protect**\n checkbox is selected for a column, it means that column is protected, and no schema changes can be made. If you try to remove the protection for any column (by unchecking it) while allowing either the safe schema changes or unprotected schema changes, the Domo Workbench will give you the following warning:\n\n\n**Warning:**\n Unprotected columns can be changed and deleted, which may break content in Domo.\n* The Protect column provides you a control to protect or unprotect all columns with a single click. Select the checkbox next to the column header (Protect) to protect all your columns at once. Similarly, you can unprotect your columns at the same time by deselecting this checkbox.\n* The column header also provides the control to get a filtered view of protected, unprotected, or both type of entries with a single click.\n\n+ When you click to select the regular select view\n\n , the Protect column will display all protected entries.\n\t+ When you click to select the unchecked view\n\n , the Protect column will display the unprotected entries.\n\t+ When you click to select the mixed view\n\n , the Protect column displays both protected and unprotected entries together.\n* You cannot change the name of a protected source column. Domo Workbench does not allow the edit operation on a protected source column name. However, you can change the names or properties for other columns.\n* Similarly, you cannot delete a protected column.\n* If you want to allow the schema change, uncheck the column and re-run the job.\n\n\n####\n Allow Safe Schema Changes\n\nIf you select this option, the unprotected columns will accept the changes during the next execution, and will automatically be protected after. New columns will be added, and will automatically be protected in future runs. The\n **Allow safe schema changes**\n option is the default setting for new jobs.\n\n###\n Allow Unprotected Schema Changes\n\nIf you choose to allow unprotected schema changes, you will be able to change and delete the unprotected columns, and they will remain unprotected.\n\n###\n Block All Schema Changes\n\nIf you choose to block all schema changes, you will not see the Protect option for your columns. If you attempt to make changes to any column and run the job, you will receive an error stating about your forceful change.\n\n##\n Setting Notifications for Your Job\n\nYou can set notify other users upon your job success or failure by simply selecting the respective checkbox in front of their names under the respective columns.\n\n. Once you are done with the job specifications, click the\n\n(\n **Save**\n ) button to save your changes.\n2. Click the\n\n(\n **Execute**\n ) button to run your job.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500008535702\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004877\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nOn-Premise SharePoint Data Provider Plugin (Beta)\n\n", "article_total_view_count": "\n\n\n 5,012\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:32 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "onpremise_sharepoint_data_provider_plugin_beta", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_51", "url": "/s/topic/0TO5w000000ZapUGAS"}]}