{"file_path": "../../raw_kb_v2\\article\\360042929474\\index.html", "content": {"title": "\n\n\n STAT Search Analytics Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSTAT Search Analytics is a rank tracking and SERP (search engine result page) analytics provider for enterprises and digital agencies. To learn more about the STAT Search Analytics API, visit their page (\n\nhttps://getstat.com/optional-api-services/\n\n).\n\n\n You connect to your STAT Search Analytics account in the Data Center. This topic discusses the fields and menus that are specific to the STAT Search Analytics connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your STAT Search Analytics account and create a DataSet, you must have the following:\n\n A STAT Search Analytics API key\n* The subdomain for your account. For example, if your instance was\n\nmycompany.getstat,com\n\n, the subdomain would be\n\ngetstat\n\n.\n\nFor more information about obtaining these credentials, please reach out to your STAT Search Analytics account representative.\n\n\n Connecting to Your STAT Search Analytics Account\n--------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the STAT Search Analytics Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your STAT Search Analytics account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n API Key\n  |\n Enter your STAT Search Analytics API key.\n  |\n|\n Subdomain\n  |\n Enter the subdomain for your STAT Search Analytics instance.\n  |\n\n\n Once you have entered valid STAT Search Analytics credentials, you can use the same account any time you go to create a new STAT Search Analytics DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the STAT Search Analytics report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Keywords\n  |\n Returns information about keywords for the selected sites.\n  |\n|\n Most Frequent Domains per Site\n  |\n Returns the competitor domains most frequently in the top 10 for the site specified for the engine specified.\n  |\n|\n Most Frequent Domains per Tag\n  |\n Returns the competitor domains most frequently in the top 10 for the tag specified for the engine specified.\n  |\n|\n Projects\n  |\n Returns all projects saved in an account.\n  |\n|\n Ranking Distributions per Site\n  |\n Returns all ranking distribution records for Google and Bing for the selected sites.\n  |\n|\n Ranking Distributions per Tag\n  |\n Returns all ranking distribution records for Google and Bing for the selected tags.\n  |\n|\n Rankings per Keyword\n  |\n Returns all rankings archived for the selected keywords and date range.\n  |\n|\n SERPs\n  |\n Returns the archived SERPs for the specified search engine and date for the specified keywords.\n  |\n|\n SERPs via Optional Bulk Service\n  |\n Returns SERPS information via the optional, paid, bulk service.\n  |\n|\n Share of Voice per Site\n  |\n Returns the SoV score for each competitor domain that appears on the SERP for the selected sites.\n  |\n|\n Share of Voice per Tag\n  |\n Returns the SoV score for each competitor domain that appears on the SERP for the selected tags.\n  |\n|\n Sites List\n  |\n Returns a list of all sites.\n  |\n\n|\n|\n Tags Selection\n  |\n Select whether you want to pull data for all tags or specified tags for the selected site.\n  |\n|\n Sites Selection\n  |\n Select whether you want to pull data for all sites, all sites for a specific project, or specific sites only.\n  |\n|\n Site ID\n  |\n Select the sites you want to retrieve data for.\n  |\n|\n Project ID\n  |\n Select the project you want to retrieve data for.\n  |\n|\n Keywords Selection\n  |\n Select whether you want to pull data for all keywords or specified keywords for the selected site.\n  |\n|\n Keyword ID\n  |\n Select the keywords you want to retrieve data for.\n  |\n|\n Tag ID\n  |\n Select the tags you want to retrieve data for.\n  |\n|\n Search Engine\n  |\n Select the search engine you want to retrieve data for.\n  |\n|\n Backfill Start Date\n  |\n Select the date for which you want to retrieve backfill data. Subsequent runs will automatically fetch the previous day's data. The data will be appended to the report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929474\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003506\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSTAT Search Analytics Connector\n\n", "article_total_view_count": "\n\n\n 2,355\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "stat_search_analytics_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}