{"file_path": "../../raw_kb_v2\\article\\6594082161687\\index.html", "content": {"Title": "DataSet Copy Connector Access Token Only", "Article Body": "Intro\n                       \n\n                        You can use Domo's DataSet Copy connector to copy data from one Domo instance to another. You do this in the Data Center.\n                       \n\n                        The DataSet Copy DataSet connector is a \"File\" connector, meaning it retrieves files and outputs them to Domo. In the Data Center, you can access the connector page for this and other File connectors by clicking\n                        \n                         File\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        There are two versions of this connector, a regular and an advanced version. The only difference between these is that the advanced version asks you for the username and password for the Domo instance you are copying from. Because of this, we do not provide separate documentation for the advanced version.\n                       \n\n                        This topic discusses the fields and menus that are specific to the DataSet Copy connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To copy data from one instance to another, you must have the following:\n                       \n\n\n\n                          The access token for the DataSet you are copying data from. This token belongs to the owner of the DataSet you are copying data from. If you have an \"Admin\" security role, you can generate access tokens; otherwise, you need to request an access token from an administrator. Make sure the token is not expired. For information about generating access tokens, see\n                          \n                           Managing Access Tokens\n                          \n                          .\n                         \n\n\n\n                          The Domo instance containing the DataSet you want to copy. For example, if your Domo URL was\n                          \n\n\n                             https://abc123.domo.com\n                            \n\n\n                          , the instance would be\n                          \n                           abc123.\n                          \n\n\n\n\n                          The DataSource ID of the data you want to copy. You can find the DataSource ID by opening the Details view for the DataSet in the Data Center. The ID is the number in the URL following\n                          \n                           \"/datasources/\"\n                          \n                          .\n                          \n\n\n\n\n\n\n                        Configuring the Connector\n                       \n\n                        This section enumerates the options in the\n                        \n                         Credentials\n                        \n                        and\n                        \n                         Details\n                        \n                        panes in the DataSet Copy Connector page. The components of the other panes in this page,\n                        \n                         Scheduling\n                        \n                        and\n                        \n                         Name & Describe Your DataSet\n                        \n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to create a DataSet Copy account. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Access Token\n                           \n\n\n\n                            Enter the developer token for the DataSet you are copying data from.\n                           \n\n\n\n\n                           Domo Instance\n                          \n\n                           Enter t\n                           \n                            he Domo instance name. For example, in\n                            \n                             https://abc123.domo.com\n                            \n                            , abc123 is the instance.\n                           \n\n\n\n\n\n                        For more information about obtaining the above credentials, see \"Prerequisites,\" above.\n                       \n\n                        Once you have entered valid credentials, you can use the same account any time you go to create a new DataSet Copy DataSet. You can manage connector accounts in the\n                        \n                         Accounts\n                        \n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        In this pane you enter details about the DataSet you want to copy.\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            DataSource ID\n                           \n\n\n\n                            Enter the\n                            \n                             Domo DataSource ID of the DataSet to pull data from. The DataSource ID is the GUID in the URL of the DataSet, immediately after /datasources/.\n                            \n\n\n\n\n\n                           Exclude Meta Columns\n                          \n\n                           Select this checkbox if you do not want Domo to add meta columns to the copied dataset (Batch ID, Batch Last Run, and Domo Instance).\n                          \n\n\n\n\n                            Only Updated Data\n                           \n\n\n\n\n                             Choose 'Yes' to retrieve data only if the dataset has ran after the latest run of this copy dataset. This helps prevent stale data.\n                            \n\n\n\n\n\n\n                            Preserve Empty String\n                           \n\n\n\n\n                             Select this checkbox if you do not want the empty strings to be converted into null values.\n                            \n\n\n\n\n\n\n                            Use Origin DataSet's Schema\n                           \n\n\n\n\n                             Choose 'Yes' to use the schema from the inputted dataset for every run.\n                            \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQs\n                       \n\n                        What kind of credentials do I need to power up this connector?\n                       \n\n                        You need the access token and Domo instance of an account that has access to the original dataset. For example, if your Domo URL is \"\n                        \n                         https://abc123.domo.com\"\n                        \n                        \", the instance would be \"abc123\".\n                       \n\n                        Where can I find my access token?\n                       \n\n                        If you have an \"Admin\" security role, you can generate access tokens; otherwise, you need to request an access token from the administrator. Make sure the token is not expired. For information about generating access tokens, see\n                        \n                         Managing Access Tokens\n                        \n                        .\n                       \n\n                        Why do I need the access token?\n                       \n\n                        Access tokens are used to import data in or export data from Domo.\n                       \n\n                        I am not able to connect with my access token. Why?\n                       \n\n                        Access tokens are associated with the specific user accounts and have the same access as the user. If the user's permissions change, the access token reflects that.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        Datasets should be set to update once every 15 minutes.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        No", "Preview Article": "Click here to preview", "URL Name": "6594082161687", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003185", "Archived Date": "", "Language": "English", "Primary Version": "DataSet Copy Connector Access Token Only", "Article Total View Count": "4,701", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              DataSet Copy Connector Access Token Only\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}