{"file_path": "../../raw_kb_v2\\article\\4403508913943\\index.html", "content": {"Title": "Page Filters in Dashboard Embed", "Article Body": "Intro\n                       \n\n                        With Page Filters in Dashboard Embed you are now able to add the same filters you use in your Domo instance inside of your embedded Dashboard. This will allow users to:\n                       \n\n\n                         Filter for any column with the same flow you know from the full instance.\n                        \n\n                         Choose from default date ranges to jump quickly to popular time frames.\n                        \n\n                         Change trend granularity with the “graph by” option for hour, day, week, etc.\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Unlike filtering on Dashboards in your full instance of Domo, you cannot save the filtered view in the embedded instance.\n                          \n\n\n\n\n                        Enabling Page Filters in Dashboard Embed\n                       \n\n\n                         Navigate to the Dashboard you would like to embed.\n                        \n\n                         Click the\n                         \n                         icon.\n                        \n\n                         Select\n                         \n                          Embed Dashboard\n                         \n                         from the dropdown menu.\n                        \n\n                         Enable the check the boxes for\n                         \n                          Allow interactions and filtering\n                         \n                         AND\n                         \n                          Show filter bar\n                         \n                         .\n                         \n\n\n\n\n\n                        Using Page Filters in Dashboard Embed\n                       \n\n                        To apply Page Filters,\n                       \n\n\n                         Navigate to the Dashboard you would like to filter.\n                        \n\n                         Click on the blue filter icon located at the top right-hand side of the Dashboard.\n                         \n\n\n\n\n\n\n                         Click the\n                         \n                          +\n                         \n                         button.\n                         \n\n                         A list of all column names used in DataSets in Cards in this Page appears. If a column name is used in more than one DataSet, an arrow appears to the right of the name so you can filter down to the desired DataSet if you want.\n                        \n\n\n                          Click the name of the column you want to filter.\n                          \n\n                          Alternatively, if the column name is used in more than one DataSet and you want to filter to show just the rows in a specific DataSet, you can click the arrow next to the column name to bring up a dialog with the names of all the applicable DataSets. Here you can check the boxes for all the DataSets you want to show rows for (or simply select all DataSets by checking the Select all box).\n                          \n\n                          If you select a column that appears in more than one DataSet without filtering down to a specific DataSet, the columns from the DataSet powering the most Cards in the Page will be used for the Filter.\n                          \n\n                          After you select a column or DataSets, a Filter button appears on the left side of the gray bar, and a dialog appears in which you can select your Filters. The interface components of the dialog differ depending on whether the column or row you selected contains series, amount, or date data.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n\n                         (Conditional) If the selected column contains string data,\n                         \n\n\n\n\n\n\n                           Select the checkboxes for each series you want to show in the Cards in this Page.\n                           \n                           You can select all of the checkboxes by clicking\n                           \n                            All\n                           \n                           or deselect all of the checkboxes by clicking\n                           \n                            None\n                           \n                           .\n                           \n                           You can filter the series that appear in the list by entering a keyword or a string of characters found in a keyword in the Filter by field.\n                           \n                           Note: Currently, only 500 unique values will show in the Filter menu.\n                           \n                           Finally, if you want to load values from a specific DataSet, you can click\n                           \n                           then choose the desired DataSet. This will load the unique values on that DataSet but apply to all DataSets with that same column name.\n                          \n\n                           Specify whether the items you have checked appear or do not appear in your chart by selecting\n                           \n                            In\n                           \n                           or\n                           \n                            Not In\n                           \n                           from the menu in the top right.\n                          \n\n                           Click\n                           \n                            Apply\n                           \n                           .\n                          \n\n\n\n                         (Conditional) If the selected column contains amount data,\n                         \n\n\n\n\n\n\n                           Do one of the following:\n                           \n\n                             If you want to filter amounts based on a range...\n                             \n\n                               Leave the dropdown menu in the upper right corner set to\n                               \n                                Range\n                               \n                               .\n                              \n\n                               Select a condition statement from the menu.\n                               \n                               One or more fields may appear, depending on the condition statement.\n                              \n\n                               (Conditional) If one or more fields appeared when you selected a condition statement, enter the desired amounts in the fields.\n                               \n                               For example, if you wanted your Cards to show information for amounts between 200,000 and 300,000, you would select\n                               \n                                is between\n                               \n                               from the menu, enter \"200,000\" in the first field, and enter \"300,000\" in the second field.\n                              \n\n\n\n                             If you want to filter amounts based on specific values from your DataSet...\n                             \n\n                               Select\n                               \n                                Selection\n                               \n                               in the dropdown menu in the upper right corner.\n                              \n\n                               Check the boxes for all of the values you want to filter on.\n                               \n\n                               You can select all of the checkboxes by clicking All or deselect all of the checkboxes by clicking None. Or you can filter the values that appear in the list by entering a string of numbers in the Filter by field.\n                               \n\n                               If you want to load values from a specific DataSet, you can click  then choose the desired DataSet. This will load the unique values on that DataSet but apply to all DataSets with that same column name.\n                               \n\n                               Finally, you can specify whether the items you have checked appear or do not appear in your chart by selecting In or Not In from the menu in the top right.\n                              \n\n                               Click\n                               \n                                Apply\n                               \n                               .\n                              \n\n\n\n\n\n\n\n                         (Conditional) If the selected column contains date data,\n                         \n\n\n\n\n\n\n                           Do one of the following:\n                           \n\n                             If you want to filter dates based on a range...\n                             \n\n                               Leave the dropdown menu in the upper right corner set to\n                               \n                                Range\n                               \n                               .\n                              \n\n                               Select a condition statement from the menu.\n                               \n                               One or more fields may appear, depending on the condition statement.\n                              \n\n                               Enter the desired dates in the fields as necessary.\n                               \n\n                               For example, if you wanted your Cards to show information for dates between 1-31-2014 and 4-30-2015, you would select\n                               \n                                is between\n                               \n                               from the menu, select January 1, 2014 in the first field, and select April 30, 2015 in the second field.\n                              \n\n\n\n                             If you want to filter dates based on specific dates from your DataSet...\n                             \n\n                               Select Selection in the dropdown menu in the upper right corner.\n                              \n\n                               Check the boxes for all of the dates you want to filter on.\n                               \n\n                               You can select all of the checkboxes by clicking All or deselect all of the checkboxes by clicking None. Or you can filter the dates that appear in the list by entering a filter string in the Filter by field. (For example, if you wanted to filter down to dates from 2010, you would enter \"2010\" into this field.)\n                               \n                               If you want to load values from a specific DataSet, you can click\n                               \n                               then choose the desired DataSet. This will load the unique values on that DataSet but apply to all DataSets with that same column name.\n                               \n\n                               Finally, you can specify whether the dates you have checked appear or do not appear in your chart by selecting In or Not In from the menu in the top right.\n                              \n\n                               Click\n                               \n                                Apply\n                               \n                               .\n                              \n\n\n\n\n\n\n\n\n                        The affected Cards in the Page update to reflect the Filters you have selected. In addition, a\n                        \n                        icon appears on each affected Card.\n                       \n\n                        To edit a Filter,\n                       \n\n\n                         Click the button for the Filter in the gray bar at the top of the Page.\n                         \n                         The dialog for the Filter appears.\n                        \n\n                         Edit the Filter settings as desired.\n                        \n\n                         Click\n                         \n                          Apply\n                         \n                         .\n                        \n\n\n                        Your changes are applied to the Filter.\n                       \n\n                        To remove a Filter,\n                       \n\n\n                         Click the button for the Filter in the gray bar at the top of the Page.\n                         \n                         The dialog for the Filter appears.\n                        \n\n                         Click\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Continue\n                         \n                         to confirm the removal.\n                        \n\n\n                        This Filter is removed, and all of the Cards that used the Filter are updated accordingly.\n                       \n\n                        Using Filter views\n                       \n\n                        You can embed a Dashboard with Filter views that you have curated for your Subscribers. Filter views allow you to customize a Page to meet the needs of all audiences. Using Filter views, you can do all of the following:\n                       \n\n\n\n                          Create and save your own Filters without affecting anyone else's view.\n                         \n\n\n\n                          Curate and share important views to create alignment on a specific perspective.\n                         \n\n\n\n                          Provide any number of personalized data stories for any person in any role.\n                         \n\n\n\n                          Designate which saved Filter view is the \"default\" for first-time visitors to a Page.\n                         \n\n\n\n                        Any Subscriber can add Filter views as well as rename, copy, and delete his/her own Filter views. For more information on Filter views, see\n                        \n                         Applying Page-Level Filters with Filter Views\n                        \n                        .\n                       \n\n                        Applying dynamic date range Filters\n                       \n\n                        You can use dynamic date range Filters to adjust the date range window for all the Cards on a Page. These Filters can be saved and used as the default for all users in a Page. They can also be saved to different Filter Views (described in the previous section). Dynamic date range Filters can be a huge time-saver, since users do not need to manually apply filters to see data for a given date or time range. Also, with dynamic date range Filters, the date range data for your Cards automatically \"rolls over\" when the current period ends.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Dynamic date range filters only apply to Visualization Cards and Sumo Cards. They do NOT work on Doc Cards, Poll Cards, Notebook Cards, and Custom Apps.\n                          \n\n\n\n\n                        You choose dynamic date range Filters in the\n                        \n                         Choose Date\n                        \n                        menu in the gray filter bar at the top of a Page.\n                        \n\n\n\n\n                        The Filters you choose here are applied to all Cards in the Page that have had a\n                        \n                         date column applied in Analyzer\n                        \n                        . Filters are applied to each Card's unique date column and take into account date filters that have already been set on the Card. So for example, if a Page contained a Card that was powered by the \"Sales Dates\" column and the dates were filtered in Analyzer to show March through June, if dynamic date range Filters were set on the Page, the Filters would be applied to the \"Sales Dates\" column and would only work within the March-June time period. If the dynamic Filters were set outside that time period, the Card would display \"No data in filtered range.\"\n                       \n\n                        You are able to choose Cards that will not be affected by the dynamic date, by deselecting the\n                        \n                         Allow global date\n                        \n                        feature. More information can be found in the\n                        \n                         Controlling how Page Filters affect your Page\n                        \n                        section above. If you have chosen the\n                        \n                         Hide Date on Card Details\n                        \n                        option for a Card, the dynamic date will also not be applied to the Card.\n                       \n\n                        Most of the options for dynamic date range Filters are the same as those for filtering dates in the Analyzer. In essence, these options are as follows:\n                       \n\n\n\n\n\n                            Date Range\n                           \n\n                          . This lets you choose the range of data shown for all Cards in the Page being powered by date columns. By default this is set to\n                          \n\n                            Default\n                           \n\n                          , meaning that all Cards use their own date ranges. A wide variety of other options is available, including the current date period, period-to-date options such as\n                          \n                           Week to Date\n                          \n                          , and so on.\n                         \n\n\n\n\n\n                            Graph By\n                           \n\n                          . This lets you choose the date grain for all Cards in the Page being powered by date columns. The date grain determines whether the data is shown by week, by month, etc. This menu is described in more detail in\n                          \n                           Changing the unit of time used to represent data\n                          \n                          . By default no date grain is selected, meaning the Cards use the same date grain used in their powering DataSets. (For example, if data for a Card was broken down by week in the DataSet, it would be automatically broken down by week in the Card).\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The Date Graph By does not impact Single Value charts. This is to ensure best data practices as Graph By will impact which row is returned in the chart query.", "Preview Article": "Click here to preview", "URL Name": "4403508913943", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004245", "Archived Date": "", "Language": "English", "Primary Version": "Page Filters in Dashboard Embed", "Article Total View Count": "5,507", "": "", "Article Created Date": "10/24/2022, 9:35 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Page Filters in Dashboard Embed\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}