{"file_path": "../../raw_kb_v2\\article\\1500000216821\\index.html", "content": {"Title": "Amazon S3 AssumeRole Advanced Connector", "Article Body": "Intro\n                       \n\n                        Amazon S3 is built to store and retrieve any amount of data from anywhere. Like Amazon S3, Domo is built to scale with your business. Our customers collectively upload new data into their Domo environments millions of times each week. Have datasets that exceed 50 billion rows? No problem, Domo is built to handle huge amounts of data with speed. Domo’s S3 connector will allow you to leverage all of your S3 data anytime, anywhere.\n                        \n                        Domo connects directly to S3 and delivers the information you need in real-time visualizations that make analysis easier. Plus, you can see your S3 data alongside metrics from any other system, all in a single platform, and get instant notifications when your metrics hit thresholds that you determine.\n                        \n                        If your Amazon S3 bucket contains multiple files that begin with the prefix string you provide in the Details section of the connector, the Amazon S3 AssumeRole Advanced connector will import all files with the provided prefix, assuming they all have the same schema. Use Domo's Amazon S3 AssumeRole Advanced Connector to connect your S3 bucket data with the Amazon S3 AssumeRole Advanced integration that imports all files with the same prefix. To learn more about the Amazon S3 API, visit their page (\n                        \n                         http://docs.aws.amazon.com/AmazonS3/latest/API/Welcome.html\n                        \n                        ).\n                       \n\n                        The Amazon S3 AssumeRole Advanced connector is a \"File\" connector, meaning it retrieves files and outputs them to Domo. In the Data Center, you can access the connector page for this and other File connectors by clicking\n                        \n\n                          File\n                         \n\n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to your Amazon S3 account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon S3 AssumeRole Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Best Practices\n                       \n\n                        Understanding the data stored in S3 and its relation to other S3 databases will be a huge asset in using this connector.\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Amazon S3 account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The Amazon Resource Name (ARN) of the role to assume.\n                         \n\n\n\n                          The identifier for the assumed role session. You will need to set up a trust policy. This is described in continuation.\n                         \n\n\n\n                          The unique identifier used by third parties when assuming roles in their customers' accounts.\n                         \n\n\n\n                          The name of the Amazon S3 bucket you want to pull data from.\n                         \n\n\n\n                          Your Amazon S3 Region.\n                         \n\n\n\n                        Trust policy configuration\n                       \n\n                        The trust policy for the role session identifier should look as follows:\n                       \n\n\n                         {\n                         \n                         \"Effect\": \"Allow\",\n                         \n                         \"Principal\": {\n                         \n                         \"AWS\": \"arn:aws:iam::*accountId*:root\"\n                         \n                         },\n                         \n                         \"Action\": \"sts:AssumeRole\",\n                         \n                         \"Condition\": {\n                         \n                         \"StringEquals\": {\n                         \n                         \"sts:ExternalId\": \"*customer externalID*\"\n                         \n                         }\n                         \n                         }\n                         \n                         }\n                        \n\n\n                        Account IDs for Domo environments are as follows:\n                       \n\n\n\n                          US: 339405024189\n                         \n\n\n\n                          AU: 010251424122\n                         \n\n\n\n                          EMEA (IE): 687132894031\n                         \n\n\n\n                          JP: 622384692065\n                         \n\n\n\n                          CA: 710710207408\n                         \n\n\n\n                        FAQs\n                       \n\n                        Q: What is ARN? Can it be a user or a role?\n                        \n                        A: ARN is Amazon Resource Name (ARN). It must be a role.\n                       \n\n                        Q: What is the Role Session Name? Do I need to establish it on the trust policy or within the AWS environment first?\n                        \n                        A: The Role Session Name is the identifier for the assumed role session. It can be any name you choose.\n                       \n\n                        Q: Can I get a detailed example of a principal trust policy and connector config?\n                        \n                        A: Below is what the trust policy should look like for a customer in us-east-1.\n                       \n\n\n\n                          Note\n                         \n\n                        : You need to replace the EXTERNAL_ID with the ID generated by DOMO on the Connector Credentials section UI.\n                       \n\n                        {\n                        \n                        \"Effect\": \"Allow\",\n                        \n                        \"Principal\":\n                       \n\n                        { \"AWS\": \"arn:aws:iam::339405024189:root\" }\n                       \n\n                        ,\n                        \n                        \"Action\": \"sts:AssumeRole\",\n                        \n                        \"Condition\": {\n                        \n                        \"StringEquals\":\n                       \n\n                        { \"sts:ExternalId\": \"EXTERNAL_ID\" }\n                       \n\n                        }\n                        \n                        }\n                       \n\n                        Description for the fields in the connector configuration:\n                       \n\n\n\n                          Role ARN\n                         \n\n\n                        This is the ARN of the role that the customer created and added the trust policy to.\n                       \n\n\n\n                          Role Session Name\n                         \n\n\n                        This can be left as the default - \"Domo\".\n                       \n\n\n\n                          External ID\n                         \n\n\n                        This is the external ID that DOMO generated in the credentials section pane and put into their trust policy for the role.\n                       \n\n\n\n                          Bucket\n                         \n\n\n                        This is the S3 bucket the customer wants to get data out of.\n                       \n\n\n\n                          Region\n                         \n\n\n                        This is the AWS region in which their S3 bucket resides.\n                       \n\n                        Connecting to an Amazon S3 Bucket\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Amazon S3 AssumedRole Advanced Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n                         Credentials Pane\n                        \n\n\n                        This pane contains fields for entering credentials to connect to an Amazon S3 bucket. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Role ARN\n                          \n\n                           Enter the Amazon Resource Name (ARN) of the role you want to assume.\n                          \n\n\n\n                           Role Session Name\n                          \n\n                           Enter the identifier for the assumed role session.\n                          \n\n\n\n                           External ID\n                          \n\n                           Enter the unique identifier used by third parties when assuming roles in their customers' accounts.\n                          \n\n\n\n                           Bucket\n                          \n\n                           Enter the Amazon S3 Bucket you want to pull files from.\n                          \n\n\n\n                           Region\n                          \n\n                           Select the S3 Bucket Region where your file is located.\n                          \n\n\n\n\n                        Once you have entered valid Amazon S3 credentials, you can use the same account any time you go to create a new Amazon S3 AssumedRole Advanced DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           What File Type would you like to import?\n                          \n\n                           Select the file type that you would like to parse and import, either CSV, JSON, TSV, TXT, XML, XLS, or XLSX.\n                          \n\n\n\n                           Prefix\n                          \n\n                           Enter a prefix to filter results by. A prefix limits the results to only those keys that begin with the specified prefix.\n                          \n\n\n\n                           File Name\n                          \n\n                           Enter the name of the Amazon S3 Object(file) that you would like to import.\n                          \n\n\n\n                           File Name Match Type\n                          \n\n                           Specify whether the file you want to retrieve starts with or contains the text you entered under\n                           \n\n                             File Name\n                            \n\n                           .\n                          \n\n\n\n                           File Compression Type\n                          \n\n                           Select the compression type of your file, either Gzip, zip, or none.\n                          \n\n\n\n                           Subfile Name\n                          \n\n                           Enter the name or a portion of the name of the subfiles that you would like to import.\n                          \n\n\n\n                           Add Filename Column\n                          \n\n                           Specify if the\n                           \n\n                             _BATCH_FILE_NAME_\n                            \n\n                           column should be added to the final output or not.\n                          \n\n\n\n                           Select the Delimiting Character\n                          \n\n                           Select the delimiting character used in your file. If your delimiter is not listed select 'Other.'\n                          \n\n\n\n                           Specify your Delimiter\n                          \n\n                           Enter the character used to delimit your character separated values (CSV) text.\n                          \n\n\n\n                           Quote Character\n                          \n\n                           Select the desired quote character for parsing CSV files. Double quote is the default quote character for CSV standard.\n                          \n\n\n\n                           Custom Quote Character\n                          \n\n                           Enter the desired CSV Quote character.\n                          \n\n\n\n                           Escape Character\n                          \n\n                           Select the desired escape character for parsing CSV files.\n                          \n\n\n\n                           Custom Escape Character\n                          \n\n                           Enter the desired CSV escape character.\n                          \n\n\n\n                           Are Headers present in CSV file?\n                          \n\n                           Select YES if the file contains headers, else select NO.\n                          \n\n\n\n                           Date Columns and Formats\n                          \n\n                           Enter the desired date column names and their respective formats as specified below, in the same order they exist in the file.\n                           \n                           Example: columnName1:dateFormat1,columnName2:dateFormat2\n                           \n                           columnName1:dd-MM-yyyy,columnName2:MM-dd-yyyy\n                          \n\n\n\n                           Enable parsing for large JSON files?\n                          \n\n                           Select Yes to enable parsing large JSON files.\n                          \n\n\n\n                           Does your JSON text require a line reader?\n                          \n\n                           Select Yes if your JSON text includes multiple lines that should be read.\n                          \n\n\n\n                           Should the backslash be escaped?\n                          \n\n                           Select Yes if your JSON text has backslash characters that need to be escaped.\n                          \n\n\n\n                           Enter your data tag\n                          \n\n                           Enter the tag for the data in your file.\n                          \n\n\n\n                           Enter your sub list to flatten\n                          \n\n                           Enter the comma-separated lists that you would like to flatten out in your data.\n                          \n\n\n\n                           Enter fields to exclude\n                          \n\n                           Provide a comma-separated list of fields you want to exclude from the import.\n                          \n\n\n\n                           Enter your header tag\n                          \n\n                           Enter the tag for the header in your JSON text.\n                          \n\n\n\n                           Header Start Row\n                          \n\n                           Enter the header start row number in the file.\n                          \n\n\n\n                           Data Start Row\n                          \n\n                           Enter the data start row number in the file.\n                          \n\n\n\n                           Footer Rows to Skip\n                          \n\n                           Enter the number of rows at the end of the file to skip. For example, to skip the last two rows you would enter 2.\n                          \n\n\n\n                           Sheet Name\n                          \n\n                           Enter the sheet name you want to retrieve from the specified spreadsheet be sure to check sheet name for accidental spaces, first sheet of the workbook will be used if the field is left blank.\n                          \n\n\n\n                           Enter XPath Expression\n                          \n\n                           Enter your XPath expression.\n                          \n\n\n\n                           Do you require Attributes in Data?\n                          \n\n                           Select 'Yes' if you require attributes values as a part of data.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "1500000216821", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003268", "Archived Date": "", "Language": "English", "Primary Version": "Amazon S3 AssumeRole Advanced Connector", "Article Total View Count": "4,897", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Amazon S3 AssumeRole Advanced Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}