{"file_path": "../../raw_kb_v2\\article\\360042931194\\index.html", "content": {"Title": "Twitch Connector", "Article Body": "Intro\n                       \n\n                        Twitch is a live streaming video platform that focuses on video gaming, including playthroughs of video games, broadcasts of eSports competitions, creative content, and music broadcasts. To learn more about the Twitch API, visit their page (\n                        \n                         https://dev.Twitch/\n                        \n                        ).\n                       \n\n                        You connect to your Twitch account in the Data Center. This topic discusses the fields and menus that are specific to the Twitch connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Twitch account and create a DataSet, you must have the username and password for your Twitch account.\n                       \n\n                        Connecting to Your Twitch Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Twitch Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Twitch connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Twitch accounts in Domo) to open the Twitch OAuth screen where you can enter your Twitch username and password. Once you have entered valid Twitch credentials, you can use the same account any time you go to create a new Twitch DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Twitch when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Twitch.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Twitch report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Active Teams\n                               \n\n\n\n                                Returns a list of active teams.\n                               \n\n\n\n\n\n                                All Streams\n                               \n\n\n\n                                Returns a list of all live streams.\n                               \n\n\n\n\n\n                                Blocks\n                               \n\n\n\n                                Returns a block list for a specified user.\n                               \n\n\n\n\n\n                                Channel Follows\n                               \n\n\n\n                                Returns a list of users who follow a specified channel.\n                               \n\n\n\n\n\n                                Channel Streams\n                               \n\n\n\n                                Returns streams for a specified channel.\n                               \n\n\n\n\n\n                                Channel Subscribers\n                               \n\n\n\n                                Returns a list of subscribers for a specified channel.\n                               \n\n\n\n\n\n                                Channels Followed by User\n                               \n\n\n\n                                Returns a list of channels followed by a specified user.\n                               \n\n\n\n\n\n                                Chat Emoticons\n                               \n\n\n\n                                Returns a list of chat emoticons.\n                               \n\n\n\n\n\n                                Check Subscription for User\n                               \n\n\n\n                                Returns subscription details for a specified user and channel.\n                               \n\n\n\n\n\n                                Current Streams Summary\n                               \n\n\n\n                                Returns a summary of live streams.\n                               \n\n\n\n\n\n                                Editors\n                               \n\n\n\n                                Returns a list of editors for a specified channel.\n                               \n\n\n\n\n\n                                Featured Streams\n                               \n\n\n\n                                Returns a list of featured live streams.\n                               \n\n\n\n\n\n                                Followed Streams\n                               \n\n\n\n                                Returns a list of live streams you are following.\n                               \n\n\n\n\n\n                                Games\n                               \n\n\n\n                                Returns a list of the most popular games.\n                               \n\n\n\n\n\n                                Get Specific Channel\n                               \n\n\n\n                                Returns details for a specified channel.\n                               \n\n\n\n\n\n                                Ingest\n                               \n\n\n\n                                Returns a list of Twitch ingest servers.\n                               \n\n\n\n\n\n                                Relationship Between User and Channel\n                               \n\n\n\n                                Returns relationship details for a specified user and channel.\n                               \n\n\n\n\n\n                                Search Games\n                               \n\n\n\n                                Searches for games based on a specified search query. A list of games whose names match or partially match the query is returned.\n                               \n\n\n\n\n\n                                Search Streams\n                               \n\n\n\n                                Searches for streams based on a specified search query. A list of streams is returned whose names match or partially match the query in the game name or description.\n                               \n\n\n\n\n\n                                Top Videos\n                               \n\n\n\n                                Returns a list of top videos based on view count for a specified time period.\n                               \n\n\n\n\n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter the username of the user you want to retrieve information for.\n                           \n\n\n\n\n\n                            Channel Name\n                           \n\n\n\n                            Enter the name of the video channel you want to retrieve information for.\n                           \n\n\n\n\n\n                            Search Query\n                           \n\n\n\n                            Enter the query you want to return results for.\n                           \n\n\n\n\n\n                            Period\n                           \n\n\n\n                            Select the timeframe for the report.\n                           \n\n\n\n\n\n                            User's Channel\n                           \n\n\n\n                            Returns a list of all of your channels.\n                           \n\n\n\n\n\n                            Videos\n                           \n\n\n\n                            Returns a list of VODs (Videos on Demand) for a specified channel.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042931194", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003343", "Archived Date": "", "Language": "English", "Primary Version": "Twitch Connector", "Article Total View Count": "4,669", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Twitch Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}