{"file_path": "../../raw_kb_v2\\article\\360042934274\\index.html", "content": {"Title": "Adding Users to Domo", "Article Body": "Intro\n                       \n\n                        You can add users to your Domo instance either one at a time or in bulk. You can do this\n                        \n                         only\n                        \n                        if you have a default security role of \"Admin\" or \"Privileged\" or a custom role with \"Add New Users\" enabled.\n                       \n\n                        When you add users to Domo, Domo does the following:\n                       \n\n\n\n                          Sets up a\n                          \n                           Profile page\n                          \n                          for the user.\n                         \n\n\n\n                          Adds the user's name to the list in the\n                          \n                           People\n                          \n                          tab in the Admin Settings.\n                         \n\n\n\n                          Sends an email to the user with a link to\n                          \n                           join\n                          \n                          Domo.\n                         \n\n\n\n                        Depending on settings, Domo may only allow you to add people whose email address contains an authorized domain. For more information, see\n                        \n                         Specifying Authorized Domains for Invited Users\n                        \n                        .\n                       \n\n                        For information about inviting users to join Domo, see\n                        \n                         Inviting Others to Join Domo\n                        \n                        .\n                       \n\n                        For information about how an added user connects to Domo and finishes setting up an account, see\n                        \n                         Joining Domo\n                        \n                        .\n                       \n\n                        For more information about the Profile page, see\n                        \n                         Profile Page Layout\n                        \n                        .\n                       \n\n\n                         Video - Adding New Users to Domo\n                        \n\n\n\n\n\n\n                        Adding Users One by One\n                       \n\n                        You can add users to Domo one at a time in the\n                        \n                         Add New Person\n                        \n                        dialog, which you can access either through the Admin Settings or by clicking\n                        \n                        at the top of the screen and selecting\n                        \n                         People > Person\n                        \n                        . When you invite a user to Domo in this way, you can fill in his/her personal and contact information, upload a photo, and specify his/her security role.\n                       \n\n\n                         To add a single user to Domo,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Click\n                            \n                            in the app toolbar at the top of the screen and select\n                            \n                             People > Person\n                            \n                            .\n                           \n\n\n\n                            Click\n                            \n                             More\n                            \n\n                             >\n                            \n\n                             Admin > Governance > People\n                            \n                            , then click\n                            \n                             Add New Person\n                            \n                            .\n                            \n                            An\n                            \n                             Add New Person\n                            \n                            dialog appears.\n                            \n\n\n\n\n\n\n\n                         In the appropriate fields, enter the user's name and email address.\n                        \n\n\n                          Select a security role for the user from the menu.\n                          \n                          For more information about security roles, see\n                          \n                           Security Role Reference\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Invite\n                          \n                          .\n                          \n                          If an error message appears indicating you need to provide a proper email address and the email address you specified is properly formed, then you cannot add that person because the domain in the email address is not authorized. For more information, see\n                          \n                           Specifying Authorized Domains for Invited Users\n                          \n                          .\n                          \n                          A\n                          \n                           Profile page\n                          \n                          is set up for the user, and their name and basic information appears in the Admin Settings. In addition, an email is sent to the address you entered for the user, providing instructions on how to join Domo. To finish setting up their accounts, invited users must complete several additional steps.\n                         \n\n\n\n                          (Optional) Enter a phone number, title, and employee number for the user.\n                         \n\n\n\n\n\n\n\n\n\n\n                             Notes:\n                            \n\n\n\n\n                              Users can edit their name and phone number in their\n                              \n                               Profile\n                              \n                              page.\n                             \n\n\n\n                              Users\n                              \n                               cannot\n                              \n                              edit their email address and employee number in their\n                              \n                               Profile\n                              \n                              page. These settings are only editable in the Admin Settings.\n                             \n\n\n\n                              Enter only numbers (up to 16 digits) in the employee numbers field.\n                             \n\n\n\n\n\n\n\n\n\n                        Adding Users in Bulk\n                       \n\n                        You can add users or groups to your Domo instance in bulk by uploading a CSV file containing the information for all the users or groups you want to add. You do this by going into\n                        \n                         More >\n                        \n\n                         Admin > Governance > People\n                        \n                        and choosing\n                        \n                         Bulk Import\n                        \n                        . This opens a dialog in which you can select the CSV file with your user information. This dialog also allows you to download a sample CSV file with the columns you will need to fill in with your own data. This method of adding users is much quicker and easier than adding users one at a time or using Domo's API.\n                       \n\n                        You must have a \"Privileged\" or \"Admin\" default security role or a custom role with \"Add New Users\" enabled to use this feature. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n\n                          Video - Bulk Import Users\n                         \n\n\n\n\n\n\n\n\n\n\n                         To bulk add users to Domo,\n                        \n\n\n\n\n                          Navigate to\n                          \n                           More\n                          \n\n                           > Admin\n                          \n                          to open the Admin Settings.\n                          \n                          The Admin Settings opens.\n                         \n\n\n                         Click the\n                         \n                          Governance\n                         \n                         tab.\n                        \n\n                         The\n                         \n                          People\n                         \n                         sub-tab opens.\n                        \n\n\n                          Click\n                          \n                           Bulk Import\n                          \n                          in the top right corner of the\n                          \n                           People\n                          \n                          tab.\n                          \n                          The\n                          \n                           Bulk Import\n                          \n                          dialog opens.\n                          \n\n\n\n\n\n\n                          Create an import file in CSV format with the following formatting:\n                          \n                          Required columns are indicated by an asterisk *\n                         \n\n\n\n\n\n                              Column Header\n                             \n\n\n\n                              Type\n                             \n\n\n\n                              Valid values/format\n                             \n\n\n\n\n\n\n                             *email\n                            \n\n                             Email\n                            \n\n                             Example:\n                             \n                              johnsmith@domo.com\n                             \n\n\n\n\n                             *displayName\n                            \n\n                             String\n                            \n\n                             Example: John Smith\n                            \n\n\n\n                             edit\n                            \n\n                             Boolean\n                            \n\n\n                              Example: TRUE/FALSE\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 This column value will override the edit mode provided by the form.\n                                \n\n\n\n\n\n\n\n                             newEmail\n                            \n\n                             String\n                            \n\n\n                              Example:\n                              \n                               johnsmith@newDomain.com\n                              \n\n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 This will change the person's identifying email address and login.\n                                \n\n\n\n\n\n\n\n                             alternateEmail\n                            \n\n                             Email\n                            \n\n                             Example:\n                             \n                              johnsmith@domo.com\n                             \n\n\n\n\n                             title\n                            \n\n                             String\n                            \n\n                             Example: Software Engineer\n                            \n\n\n\n                             roleId\n                            \n\n                             Number\n                            \n\n                             Enter a number:\n                             \n                             1 (Admin)\n                             \n                             2 (Privileged)\n                             \n                             3 (Editor)\n                             \n                             4 (Participant)\n                             \n                             5 (Social)\n                            \n\n\n\n                             phoneNumber\n                            \n\n                             International phone number\n                            \n\n                             Example: (800) 899-1000\n                            \n\n\n\n                             deskPhoneNumber\n                            \n\n                             International phone number\n                            \n\n                             Example: (800) 899-1000\n                            \n\n\n\n                             employeeNumber\n                            \n\n                             Number\n                            \n\n\n                              Example: 123\n                             \n\n\n\n\n\n\n\n                                  Important:\n                                 \n                                 Employee number is being replaced by Employee ID. Please use Employee ID instead.\n                                \n\n\n\n\n\n\n\n                             employeeId\n                            \n\n                             String\n                            \n\n\n                              Example: ABC123\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 This attribute is overridden by the employeeNumber value when provided to Domo through an SSO login. This is different from Employee# and will not show up in the UI.\n                                \n\n\n\n\n\n\n\n                             locale\n                            \n\n                             Locale language tag\n                            \n\n                             Valid values:\n                             \n                             de-DE, de-AT, de-CH, en-AU, en-CA, en-150, en-HK, en-IE, en-IL, en-MO, en-NZ, en-SG, en-GB, en-US, en-001, es-ES, es-US, es-419, es-MX, fr-BE, fr-CA, fr-FR, fr-CH, nl-BE, nl-NL, pt-BR, pt-PT, ja-JP, zh-CN, zh-Hans-HK, zh-Hans-MO, zh-Hans-SG\n                            \n\n\n\n                             location\n                            \n\n                             String\n                            \n\n                             Example: Utah\n                            \n\n\n\n                             sendInvite\n                            \n\n                             Boolean\n                            \n\n\n\n                              Example: TRUE/FALSE\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 This column will override customer settings for sending an invite email.\n                                \n\n\n\n\n\n\n\n                             groups\n                            \n\n                             String\n                            \n\n\n                              Example: groupname1,groupname2\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 Separate each group name with a comma.\n                                \n\n\n\n\n\n\n\n\n\n\n                          The easiest way to do this is by clicking\n                          \n                           Download example\n                          \n                          to download a template to your computer, then, under the correct column headers, filling in the information for the users you want to bring into Domo. At minimum, you will need to fill in the \"displayName\" and \"email\" columns.\n                         \n\n\n\n\n\n\n\n\n\n                                Important:\n                               \n\n                              If you intend to save your CSV import file using UTF-8 encoding, you cannot simply change the encoding type when saving; otherwise you will get an error telling you to check the names of your column headers. As a workaround to this issue, you can do the following:\n                              \n\n\n\n\n                                Save the file in Excel format.\n                               \n\n\n\n                                Open the file in a text application such as Notepad.\n                               \n\n\n\n                                Select\n                                \n                                 Save As\n                                \n                                .\n                               \n\n\n\n                                Select\n                                \n                                 UTF-8\n                                \n                                in the\n                                \n                                 Encoding\n                                \n                                dropdown menu.\n                               \n\n\n\n                                Save the file.\n                               \n\n\n\n\n\n                              You should now be able to upload the newly saved file without any problems.\n                             \n\n\n\n\n\n\n\n\n\n                          (Conditional) If you want to add new people and update existing people simultaneously, select\n                          \n                           Add new people and edit existing profiles\n                          \n                          .\n                         \n\n\n\n                          (Conditional) If the import file contains group data for your users, check the\n                          \n                           Create new group(s)\n                          \n                          box if you want to bring those groups into Domo.\n                         \n\n\n\n                          Upload your CSV file by dragging and dropping into the area with dashed lines or clicking\n                          \n                           Browse\n                          \n                          and navigating to the desired file on your computer.\n                         \n\n\n\n                        All of the users in the spreadsheet are imported into Domo and their information is populated into the correct fields in the Admin Settings and user Profile pages.", "Preview Article": "Click here to preview", "URL Name": "360042934274", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004068", "Archived Date": "", "Language": "English", "Primary Version": "Adding Users to Domo", "Article Total View Count": "12,946", "": "", "Article Created Date": "10/24/2022, 9:19 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Adding Users to Domo\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Controlling Access In Domo\n              \n", "url": "/s/topic/0TO5w000000ZanMGAS"}, {"text": "\n\n               User And Group Management\n              \n", "url": "/s/topic/0TO5w000000ZapJGAS"}]}