{"file_path": "../../raw_kb_v2\\article\\360042926494\\index.html", "content": {"Title": "Bronto Connector", "Article Body": "Intro\n                       \n\n                        Bronto Software is a commerce marketing automation provider, enabling retailers to drive revenue through their email, mobile and social campaigns. Use Domo's  Bronto connector to retrieve data about contacts, messages, deliveries, and so on. To learn more about the Bronto API, visit their page (\n                        \n                         http://dev.bronto.com/api/\n                        \n                        ).\n                       \n\n                        You connect to your Bronto account in the Data Center. This topic discusses the fields and menus that are specific to the Bronto connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                        \n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your Bronto account and create a DataSet, you must have a Bronto API token. For information about obtaining an API token, visit\n                        \n                         http://dev.bronto.com/gettingstarted...ccess-the-api/\n                        \n                        .\n                       \n\n                        Connecting to Your Bronto Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Bronto Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Bronto account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Token\n                          \n\n                           Enter your Bronto API token. For information about obtaining a token, see\n                           \n                            http://dev.bronto.com/gettingstarted...ccess-the-api/\n                           \n\n\n\n\n\n\n                         Once you have entered a valid API token and created an account, you can use the same account any time you go to create a new Bronto DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Bronto report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Accounts\n                              \n\n                               Returns account data for the authenticated user.\n                              \n\n\n\n                               Activities\n                              \n\n                               Returns activities data for the authenticated user for a specified number of past days.\n                              \n\n\n\n                               API Tokens\n                              \n\n                               Returns a list of API tokens for the authenticated user.\n                              \n\n\n\n                               Contacts\n                              \n\n                               Returns a list of contacts for the authenticated user for a specified number of past days.\n                              \n\n\n\n                               Content Tags\n                              \n\n                               Returns a list of content tags for the authenticated user.\n                              \n\n\n\n                               Conversions\n                              \n\n                               Returns a list of conversions for the authenticated user.\n                              \n\n\n\n                               Deliveries\n                              \n\n                               Returns a list of delivered emails for the authenticated user for a specified number of past days, with or without the email content.\n                              \n\n\n\n                               Delivery Groups\n                              \n\n                               Returns a list of delivery groups for the authenticated user.\n                              \n\n\n\n                               Delivery Recipients\n                              \n\n                               Returns a list of delivery recipients for the authenticated user for a specified number of past days.\n                              \n\n\n\n                               Headers Footers\n                              \n\n                               Returns a list of headers and footers for the authenticated user.\n                              \n\n\n\n                               Logins\n                              \n\n                               Returns a list of logins for the authenticated user.\n                              \n\n\n\n                               Lists\n                              \n\n                               Returns a list of lists for the authenticated user.\n                              \n\n\n\n                               Messages\n                              \n\n                               Returns a list of messages for the authenticated user.\n                              \n\n\n\n                               Message Folders\n                              \n\n                               Returns a list of message folders for the authenticated user.\n                              \n\n\n\n                               Message Rules\n                              \n\n                               Returns a list of message rules for the authenticated user.\n                              \n\n\n\n                               Segments\n                              \n\n                               Returns a list of segments for the authenticated user.\n                              \n\n\n\n                               Workflows\n                              \n\n                               Returns a list of workflows for the authenticated user.\n                              \n\n\n\n\n\n\n\n                           Number of Days\n                          \n\n                           Enter the number of past days you want to include in this report. For example, if you entered\n                           \n                            30\n                           \n                           , the report would pull data for the last 30 days.\n                          \n\n\n\n                           Includes Emails' Content\n                          \n\n                           Select\n                           \n                            Yes\n                           \n                           if you want the \"Deliveries\" report to return the message content of delivered emails; otherwise select\n                           \n                            No\n                           \n                           .\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042926494", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003798", "Archived Date": "", "Language": "English", "Primary Version": "Bronto Connector", "Article Total View Count": "2,359", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Bronto Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}