{"file_path": "../../raw_kb_v2\\article\\360042925414\\index.html", "content": {"title": "\n\n\n Assigning Users to Power Up Template Visualization Cards\n\n\n", "article_body": "\n\nIntro\n-------\n\nAs an executive or manager of your organization, you may want to assign a team member to create and power up a Visualization Card. Domo provides a simple way to do this. You can choose the\n\n*>**\n**Assign Card creation**\n option in a Page and assign a user in your Domo to power a Card. Domo then creates a\n *template*\n Visualization Card—a \"dummy\" Card not yet connected to a DataSet—and adds it to the same Page in the assigned user's Domo. The assigned user also receives a notification that he/she is responsible for powering and owning the Card. For more information about notifications, see\n\nCreating an Alert for a Visualization Card\n\n.\n\n\n Assigning a user to create a Visualization Card\n-------------------------------------------------\n\nWhen you assign a Card to a user, Domo sends a message to the user and adds an empty template Card to the Page.\n\n\n**To assign a user to create a Visualization Card,**\n\n. Navigate to the Page where you want the new Card to appear.\n2. Click\n\n.\n3. Click\n **Assign Card creation**\n .\n\n\n The\n **Assign Card**\n dialog appears.\n4. Designate an owner by typing a name in the\n **Assignee**\n field.\n5. Enter a name for the Card.\n6. (Optional) Enter a message for the new owner if desired.\n7. Click\n **Assign**\n .\n\nPowering a template Card\n--------------------------\n\nWhen a user assigns you to create a Visualization Card, it is your job to power it with meaningful data. Domo lets you power up charts using DataSets that have already been uploaded to Domo. You can also upload new Microsoft Excel or Google Sheet DataSets on the fly.\n\n##\n Powering up a template Visualization Card with an existing DataSet\n\nIf the DataSet you want to use to power up the Card has already been uploaded, you can use the\n **Existing Data**\n option to retrieve the DataSet. All DataSets that you upload to Domo are stored in a database so you can locate them for use in powering up new Cards.\n\n\n**To power up a template Visualization Card using an existing DataSet,**\n\n. Click\n **Power this Card**\n at the bottom of the Card.\n2. Click\n **Existing Data**\n .\n\n\n A dialog appears in which you can choose a DataSet.\n\nThis dialog includes many options for locating your desired DataSet. In addition to being able to search by name, you can also apply various filters to your search. If you click the\n\nicon, a dialog appears with a number of selectable filters such as\n **Owned by**\n ,\n **Created Date**\n ,\n **Tag**\n , and so on. You can choose any of these filters then specify the criteria for the filter. For example, if you chose\n **Tag**\n , you would then be prompted to select the tag associated with your desired DataSet. You can also customize filters by applying operators. These differ between filters. Most filters include the\n **Not**\n operator so you can indicate that specified criteria are excluded from your filter. For example, you might build a filter in which the status is\n *not*\n disabled. Date-based filters include the\n **On**\n ,\n **Not On**\n ,\n **Before**\n , and\n **After**\n operators so you can narrow down when a DataSet was created or last run. Number-based filters include\n **Equal To**\n ,\n **Not Equal To**\n ,\n **Less Than**\n , and\n **Greater Than**\n operators.\n\n\n In the filter dialog, you can also choose from several quick filters by clicking\n **Favorite Filters**\n . These include\n **Recently run**\n (which defaults to 7 days),\n **Owned by you**\n , and\n **Needs attention**\n .\n\n\n You can apply multiple filters to narrow down your results; for example, you might apply an\n **Owned by**\n filter specifying user \"Kate Nickelby,\" a\n **Type**\n filter specifying \"Adobe Analytics,\" and a\n **Status**\n filter specifying \"Disabled.\"\n\n\n Once you have your results set, you can change the sort by clicking\n **Created Date (oldest to newest**\n**)**\n and then choosing the desired sort method and direction.\n\n\n You can add or manage DataSets in the Data Center. For more information, see\n\nData Center Layout\n\n.\n3. Locate and select the desired DataSet.\n\n\n The Analyzer appears. For more information, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n###\n Powering up a template Visualization Card with a Microsoft Excel or CSV spreadsheet\n\nYou can power up a Visualization Card using a Microsoft Excel spreadsheet or CSV file.\n\n\n**To power up a static Visualization Card using a Microsoft Excel spreadsheet or CSV file,**\n\n. Click\n **Power this Card**\n at the bottom of the Card.\n2. Click\n **Excel**\n (even if you are planning to upload a CSV file).\n3. Upload your file by following the instructions in\n\nFile Upload Connector\n\n.\n\nAfter you upload your spreadsheet, the Analyzer appears. For more information, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n##\n Powering up a Visualization Card with a Google Sheet spreadsheet\n\nAs with a Microsoft Excel spreadsheet, you can power up a Card using a Google Sheet spreadsheet.\n\n\n**To power up a static Visualization Card using a Google Sheet spreadsheet,**\n\n. Select\n **Power this Card**\n at the bottom of the Card.\n2. Click\n **Connect Spreadsheet**\n .\n3. (Conditional) If necessary, link your Google account to Domo by entering your Google account information. For more information, see\n\nGoogle Sheets Connector\n\n.\n4. Select the desired Google Sheet spreadsheet.\n5. Specify whether the data in your spreadsheet is laid out in a column or row format. For more information about the distinction between column- and row-based spreadsheets, see\n\nUnderstanding Chart Data\n\n.\n6. Click\n **Continue**\n .\n\n\n The spreadsheet data appears on your screen for you to review.\n7. (Optional) Add a description for the DataSet by doing the following:\n\n1. Click\n\t **Add DataSet Description**\n\t .\n\n\n\t A\n\t **Description**\n\t field appears.\n\t2. Enter the desired description text in the field.\n\t3. Click\n\t **Save**\n\t .\n\n\n\t You can add or manage DataSets in the Data Center. For more information, see\n\n Data Center Layout\n\n .\n8. (Optional) Specify a range of rows or columns in the spreadsheet to be uploaded by doing the following:\n\n1. Click\n\t **Specify where your data is**\n\t .\n\t2. In the\n\t **Label Cells**\n\t fields, enter the numbers of the header cells in your spreadsheet that constitute your range boundaries. For example, if you entered \"A1\" and \"J1\", only the columns in your spreadsheet between columns A1 and J1 would be uploaded.\n\n\n\t This pulls all of the data for the range you specified.\n\t3. To specify only a single column or row of data in the range you specified in the previous step, check\n\t **Manually specify data range?**\n\t , then enter the range for the data cells in the two fields marked\n\t **Data Cells**\n\t .\n\t4. Click\n\t **Preview**\n\t to see the cells in the range(s) you specified.\n9. (Conditional) If the desired spreadsheet is found on a specific Page in your document, select the correct Page from the menu under the \"Success\" message.\n10. Click\n **Continue**\n .\n\n\n The Analyzer appears. For more information, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042925414\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004754\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAssigning Users to Power Up Template Visualization Cards\n\n", "article_total_view_count": "\n\n\n 4,790\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:29 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "assigning_users_to_power_up_template_visualization_cards", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "powering_your_card", "url": "/s/topic/0TO5w000000ZapBGAS"}]}