{"file_path": "../../raw_kb_v2\\article\\360043429713\\index.html", "content": {"Title": "Projecting the Last Value in Your Chart", "Article Body": "Intro\n                        \n\n\n\n                        In many kinds of line and bar charts, you may find it useful to show how the data might be expected to change in the near future. Domo provides the ability to create such \"data projections.\" Data projections give viewers an idea of how the data might change between the current value of a chart and upcoming future values.\n                       \n\n                        Data projections come in two types—Last Value Projections and Multi-Period Projections. Last Value Projections project only the last value in your chart, but you can use several different kinds of calculations to make the projection, including linear regression, averaging the previous values, etc. Multi-Period Projections let you project as many future periods as you want, either by using included controls to add and remove periods or by manually entering the desired number in Chart Properties. However, all multi-period projections are based on linear regression (though a number of different options are available for configuring your linear regression).\n                       \n\n                        Last Value Projections\n                       \n\n                        Last Value Projections let you project one future value onto your chart. These are available for the following chart types:\n                       \n\n\n\n                          Vertical single bar\n                         \n\n\n\n                          Vertical grouped bar\n                         \n\n\n\n                          Vertical stacked bar\n                         \n\n\n\n                          Line bar\n                         \n\n\n\n                          Multi-line bar\n                         \n\n\n\n                          Line with grouped bar\n                         \n\n\n\n                          Line\n                         \n\n\n\n                          Multi-line\n                         \n\n\n\n                          Curved line\n                         \n\n\n\n                          Symbol line\n                         \n\n\n\n                          Curved symbol line\n                         \n\n\n\n                        In line charts, dotted lines are used to show how far data values are expected to fall or drop when a Last Value Projection is applied. In the following example, the data value is expected to rise to about $27,000, based on a linear regression:\n                       \n\n\n\n\n\n\n                        You could also set projections in a chart with multiple lines, like in the following example:\n                       \n\n\n\n\n\n\n                        Likewise, a dotted line is used in a bar chart to show the expected change. A region of different color above the current value indicates an expected increase in the data; a dotted line below the current value indicates an expected drop. In the following example, the user created a projection based on the average of the three values prior to the last value:\n                       \n\n\n\n\n\n\n                        You could also set projections in a chart with grouped or stacked bars, like in the following example:\n                       \n\n\n\n\n\n\n                        For a grouped bar with line chart, you can choose to apply a projection to either the last bar or last line that appears in the chart (or both).\n                       \n\n\n\n                          Video - Using Last Value Projections\n                         \n\n\n\n\n\n\n\n\n\n\n\n                        Types of Last Value Projections\n                       \n\n                        There are four possible types of Last Value Projections in Domo. These are as follows:\n                       \n\n\n\n\n\n                            Projection Type\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Forecast Value\n                          \n\n\n                            Domo forecasts the value of the remainder of the current period in your chart. It does this by taking the current value for the period and comparing it to the previous period. For example, in the following chart, the current month, October, is not yet over, so the user applies the\n                            \n                             Forecast\n                            \n                            property. The light blue represents the forecasted value for the entire month of October.\n                           \n\n\n\n\n\n\n\n\n                            Specified Value\n                           \n\n\n\n                            You specify the projected value yourself. When you select this option, you must enter the desired value in the\n                            \n                             Projection Value\n                            \n                            field.\n                           \n\n\n\n\n\n                            Average Previous Values\n                           \n\n\n\n                            Domo calculates the projection based on the average of a specified number of values prior to the current value. You specify the number of values in the\n                            \n                             Previous Values to Average\n                            \n                            field.\n                           \n\n\n\n\n\n                            Linear Regression\n                           \n\n\n\n                            Domo calculates the projection based on a linear regression of your data.\n                           \n\n\n\n\n\n                        Creating a Last Value Projection\n                       \n\n                        You can add a Last Value Projection to your chart in the\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n\n                         To add a projection to your chart,\n                        \n\n\n\n\n                          Open the Analyzer for the chart you want to edit.\n                         \n\n\n\n                          In\n                          \n                           Chart Properties\n                          \n                          , click\n                          \n                           Last Value Projection\n                          \n                          (for a bar or line chart) or\n                          \n                           Last Bar Value Projection\n                          \n                          or\n                          \n                           Last Line Value Projection\n                          \n                          (for a grouped bar with line chart).\n                         \n\n\n\n                          Select the projection type in the\n                          \n                           Project Using\n                          \n                          menu.\n                         \n\n\n\n                          (Conditional) If you select\n                          \n                           Specified Value\n                          \n                          , enter the desired value in the\n                          \n                           Projection Value\n                          \n                          field.\n                         \n\n\n\n                          (Conditional) If you select\n                          \n                           Average Previous Values\n                          \n                          , enter the number of previous values for which you want to take the average.\n                         \n\n\n\n                        Use Cases\n                       \n\n                        The following projection use cases were introduced in the Domopalooza 2017 Tips and Tricks session. For more tips and tricks, see\n                        \n                         Tips and Tricks: Quick Lessons from Power Users\n                        \n                        .\n                       \n\n\n\n                          If your data is showing steady growth, you may want to use\n                          \n                           Linear Regression\n                          \n                          to best predict your end of period performance.\n                         \n\n\n\n                          If your data has a strong end-of-period trend, use\n                          \n                           Forecast Value\n                          \n                          will likely give you the projection you want.\n                         \n\n\n\n                          If your data has a lot of variability in it, you may need to experiment with\n                          \n                           Forecast Value\n                          \n                          ,\n                          \n                           Average Previous Values\n                          \n                          ,\n                          \n                           Linear Regressions\n                          \n                          , or a manual entry.\n                         \n\n\n\n                        Multi-Period Projections\n                       \n\n                        Multi-Period Projections allow you to add unlimited projections to your chart. These are available for the following chart types:\n                       \n\n\n\n                          Vertical single bar\n                         \n\n\n\n                          Vertical grouped bar\n                         \n\n\n\n                          Vertical stacked bar\n                         \n\n\n\n                          Vertical running total bar\n                         \n\n\n\n                          Vertical running total grouped bar\n                         \n\n\n\n                          Vertical running total stacked bar\n                         \n\n\n\n                          Line\n                         \n\n\n\n                          Multi-line\n                         \n\n\n\n                          Curved line\n                         \n\n\n\n                          Symbol line\n                         \n\n\n\n                          Curved symbol line\n                         \n\n\n\n                          Running total line\n                         \n\n\n\n                        Chart types in which Multi-Period Projections are available include \"+\" and \"-\" controls for adding and removing projections. These appear at the bottom right of the chart, like in the following example:\n                       \n\n\n\n\n                        Clicking the \"+\" button adds a new projected data point to the chart (using the selected\n                        \n                         Project Using\n                        \n                        option in\n                        \n                         Chart Properties > Multi-Period Projection\n                        \n                        ), and clicking the \"-\" button removes a projection. You can add as many projections to a chart as you want. In the following example, the user added three projections to his chart. The first projection is \"added\" to the last data point of March 23rd, and the second and third follow the same date pattern already established in the data, becoming new projected data points, March 24th and 25th.\n                       \n\n\n\n\n                        These controls are available in the Details view, meaning anyone with access to the card can add or remove periods (unless you choose to restrict this option by removing the controls, which you can do in Chart Properties).\n                       \n\n                        You can also enter a number of projected periods manually in\n                        \n                         Chart Properties > Multi-Period Projection > Projection Period Count\n                        \n                        .\n                       \n\n                        Understanding Properties for Multi-Period Projection\n                       \n\n                        A number of chart properties are available for tuning your multi-period projections.\n                       \n\n\n\n\n\n                            Projection Type\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Remove Controls\n                          \n\n\n                            When this box is checked, the \"+\" and \"-\" controls for adding projections are removed from your chart.\n                           \n\n\n\n\n\n                            Projection Period Count\n                           \n\n\n\n                            Lets you manually enter a set number of projection periods to your chart.\n                           \n\n\n\n\n\n                            Project Using\n                           \n\n\n\n                            Determines how your projection periods are calculated. The following options are available:\n                           \n\n\n\n\n                               Linear Regression\n                              \n\n                               Domo calculates the projection based on a linear regression of your data. This is the default option.\n                              \n\n\n\n                               Linear Regression by Period\n                              \n\n                               Projections are calculated by looking at all similar data points in your data and determining the linear regression for each individual point. For example, if your data was broken down by week and you chose this option, a separate linear regression would be calculated for all Mondays, all Tuesdays, and so on. At least 2 instances of each data point are required for this to work (e.g. your timeline must have 2 Mondays, 2 Tuesdays, etc.); otherwise the\n                               \n                                Linear Regression Recent Periods\n                               \n                               option will be used as a fallback.\n                              \n\n\n\n                               Linear Regression Recent Periods\n                              \n\n                               Projections are calculated by taking the linear regressions for the data points in the most recent period and applying them to the same points in the next period. If you do not have sufficient data for this to work, the default linear regression option will be used as a fallback.\n                              \n\n\n\n                               Linear Regression Recent Weighted\n                              \n\n                               Projections put more weight on recent periods. Use this option if recent periods are more valuable in your data than earlier periods.\n                              \n\n\n\n\n\n\n\n                           Repeating Pattern\n                          \n\n                           Lets you specify the number for the repeating sequence of data points used in your timeline. For example, a weekly timeline would have a pattern of\n                           \n                            7\n                           \n                           (for 7 days); a quarterly timeline would have a pattern of\n                           \n                            3\n                           \n                           (for 3 months); and so on. If you do not specify a value, Domo will make its best guess as to your pattern.\n                          \n\n\n\n\n                        Creating a Multi-Period Projection\n                       \n\n                        You can add a Multi-Period Projection to your chart in the\n                        \n                         Chart Properties\n                        \n                        . (You can also add projections in the Details view or Analyzer using the controls, as described previously, though this does not give you any configuration options.)\n                       \n\n\n                         To add a Multi-Period Projection to your chart,\n                        \n\n\n\n\n                          Open the Analyzer for the chart you want to edit.\n                         \n\n\n\n                          In\n                          \n                           Chart Properties\n                          \n                          , click\n                          \n                           Multi-Period Projection\n                          \n                          .\n                         \n\n\n\n                          Enter the number of periods you want to project in the\n                          \n                           Projection Period Count\n                          \n                          field.\n                         \n\n\n\n                          Select the projection type in the\n                          \n                           Project Using\n                          \n                          menu.\n                         \n\n\n\n                          (Optional) To indicate the pattern you want Domo to look at when calculating your future periods, enter the number of data points in the pattern in the\n                          \n                           Repeating Pattern\n                          \n                          field. For example, if you wanted Domo to determine future periods based on a repeating 10-day period, you would enter\n                          \n                           10\n                          \n                          here.", "Preview Article": "Click here to preview", "URL Name": "360043429713", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005028", "Archived Date": "", "Language": "English", "Primary Version": "Projecting the Last Value in Your Chart", "Article Total View Count": "2,901", "": "", "Article Created Date": "11/2/2022, 9:00 PM", "First Published Date": "11/2/2022, 9:04 PM"}, "title": "\n              Projecting the Last Value in Your Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Properties\n              \n", "url": "/s/topic/0TO5w000000ZaodGAC"}]}