{"file_path": "../../raw_kb_v2\\article\\360043439153\\index.html", "content": {"title": "\n\n\n Specifying Default Overview Content for Users\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can specify the cards that users see in the\n\nOverview\n\npage by setting the default overview content for each group. You do this in the Admin Settings. You can only access this page if you have an \"Admin\" default security role or a custom role with \"Manage All Company Settings\" enabled. For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n\n\n When users view the\n\nOverview\n\npage, what they see depends on the default overview content specified for the groups they are a member of.\n\n\n**Notes:**\n\n The content that appears in the Overview page for a user consists of the default overview content specified for the groups that the user is a member of, either at the time they join Domo or after manually resetting the default overview content of the user.\n* The Overview page is not updated automatically for a user when the user is added to or removed from a group but when the default overview content of the user is manually reset.\n\nFor information about sharing content, see\n\nSharing Access to Content\n\n.\n\n\n Specifying the default overview content for a group\n-----------------------------------------------------\n\nYou can specify the cards that appear in the\n\nOverview\n\npage for users by specifying the cards to be in the\n **Default Overview Content**\n section for each group.\n\n\n**Note:**\n\n\n The Overview page is not updated automatically for a user when the user is added to or removed from a group but when the default overview content of the user is manually reset.\n\n\n**To specify default content for a group,**\n\n. Click\n **More**\n\n*> Admin**\n\n.\n\n\n The Admin Settings appears.\n2. Select\n **Governance >**\n**Groups**\n .\n3. Select the group in the list that you want to add default content to.\n\n\n If the group does not exist yet, you need to create it. For more information, see\n\nCreating and Managing User Groups\n\n.\n4. Click the\n\nicon.\n5. Enter the name of a Card into the field.\n\n\n The top results for your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n6. Select a Card from the list.\n7. (Optional) Add additional cards to the default overview content for this group by repeating the previous two steps.\n8. (Optional) Remove a card from the field by clicking the \"x\" to the right of the name of that card.\n9. Click\n **Add**\n to add all cards in the field into the default overview content for the group.\n\nThe specified cards are added to the default overview content for this group. Any Domo users who are members of the group see these cards in the\n\nOverview\n\npage. If a user is added to or removed from the group, you must reset the default overview content for the user to see it.\n\n\n Resetting the default overview content for a user\n---------------------------------------------------\n\nYou can manually reset the cards that appear in the\n\nOverview\n\npage.\n\n\n**Important:**\n\nResetting the default overview content removes any cards in the Overview page that are not specified as default overview content for the groups the user is a member of. After the overview content is reset, the user can re-add cards that were removed (if accessible).\n\n*To reset the default overview content for a user,**\n\n. Click\n **More**\n\n*> Admin**\n\n.\n\n\n The Admin Settings appears.\n2. Select\n **Governance >**\n**People**\n .\n3. In the user list, select the user you want.\n4. Click the\n\nicon.\n\n\n The user sees the reset\n\nOverview\n\nPage when refreshing or after signing in to Domo.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043439153\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003054\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSpecifying Default Overview Content for Users\n\n", "article_total_view_count": "\n\n\n 4,842\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:09 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "specifying_default_overview_content_for_users", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "specifying_company_settings", "url": "/s/topic/0TO5w000000ZaoGGAS"}]}