{"file_path": "../../raw_kb_v2\\article\\360043430533\\index.html", "content": {"Title": "Managing Your Alerts", "Article Body": "Intro\n                       \n\n                        You can manage all Alerts in the Alert Center. You can also choose to follow suggested Alerts created by other users. You can also manage your individual\n                        \n                         Card\n                        \n                        Alerts in the Card Details view, and your individual\n                        \n                         DataSet\n                        \n                        Alerts in the Data Center. From any of these locations, you can open a panel that provides options for setting Notifications, making edits, viewing the owner and followers, and seeing the Alert history.\n                       \n\n\n\n\n                        Subscribing or unsubscribing to an Alert\n                       \n\n                        When you subscribe to an Alert on a Card or a DataSet, you receive Notifications whenever that Alert is triggered, edited, or deleted.\n                       \n\n                        When you click the\n                        \n                         Subscribe\n                        \n                        button for an Alert, icons appear for four methods of receiving Notifications—SMS\n                        \n                        , email\n                        \n                        , mobile push notifications\n                        \n                        , and telephone call\n                        \n                        . Of these, all but the telephone option are active by default. You can turn an option on or off by clicking on its icon. If you turn off all four Notification options, you become unsubscribed from the Alert. When you unsubscribe to an Alert, you no longer receive Notifications when any changes occur for that Alert.\n                       \n\n                        You can also choose to receive a daily or weekly email listing all Alerts that triggered in the last day or week, respectively. You do this by clicking the\n                        \n                        icon then checking the box for\n                        \n                         Daily\n                        \n                        or\n                        \n                         Weekly\n                        \n                        .\n                       \n\n                        To see all your subscribed Alerts, open the Alert Center then click\n                        \n                         Subscribed\n                        \n                        in the\n                        \n                         Quick Filters\n                        \n                        pane on the left side of the Alert Center.\n                       \n\n\n                         To subscribe or unsubscribe to an Alert in the Alert Center,\n                        \n\n\n\n                         Click\n                         \n                          Alerts\n                         \n                         in the navigation bar at the top of the screen.\n                        \n\n\n                          Locate the Alert you want to subscribe or unsubscribe to.\n                         \n\n\n\n                          (Conditional) Do one of the following:\n                         \n\n\n\n                            To subscribe, click the\n                            \n                             Subscribe\n                            \n                            button, then choose the desired Notification options by toggling their icons on or off.\n                            \n\n                            You can also choose to add the Alerts to your daily and weekly summaries by clicking\n                            \n                            then clicking in the appropriate checkboxes.\n                           \n\n\n\n                            To unsubscribe, click each highlighted Notification icon to turn it off.\n                           \n\n\n\n\n\n\n                         To subscribe or unsubscribe to a Card Alert in the Card Details view,\n                        \n\n\n\n\n                          Open the pertinent Details view by clicking on its Card, then click\n                          \n                          in the top right corner.\n                         \n\n\n\n                          (Conditional) Do one of the following:\n                         \n\n\n\n                            To subscribe, under Discover click subscribe, and check one or more boxes.\n                           \n\n\n\n                            To unsubscribe, under Followed clear all checkboxes.\n                           \n\n\n\n\n\n\n                         To subscribe or unsubscribe to a DataSet Alert in the Data Center,\n                        \n\n\n\n\n                          Select\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                          \n                          The Data Center opens with the\n                          \n\n                            DataSets\n                           \n\n                          tab open by default.\n                         \n\n\n\n                          Locate and click on the pertinent DataSet.\n                          \n                          For more information about searching and filtering DataSets in the Data Center, see\n                          \n                           Data Center Layout\n                          \n                          .\n                         \n\n\n\n                          Click on the\n                          \n                           Alerts\n                          \n                          tab.\n                         \n\n\n\n                          (Conditional) Do one of the following:\n                         \n\n\n\n                            To subscribe to an Alert, click the\n                            \n                             Subscribe\n                            \n                            button for that Alert.\n                           \n\n\n\n                            To unsubscribe from an Alert, click each blue-highlighted icon to turn it off. Once all of the icons are no longer highlighted (i.e. gray), you are unsubscribed from the Alert.\n                           \n\n\n\n\n\n                        For more information about the\n                        \n                         Instantly\n                        \n                        ,\n                        \n                         Daily\n                        \n                        , and\n                        \n                         Weekly\n                        \n                        Notification options, see\n                        \n                         Configuring Notification and Alert Settings\n                        \n                        .\n                       \n\n                        Editing an Alert\n                       \n\n                        Editing a Card Alert is discussed in\n                        \n                         Creating an Alert for a DataSet\n                        \n                        .\n                       \n\n                        Deleting an Alert\n                       \n\n                        You can delete an Alert from the Alert options panel. Keep in mind that deleting an Alert affects all followers of that Alert.\n                       \n\n\n                         To delete an Alert,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Click\n                            \n                             Alerts\n                            \n                            in the toolbar at the top of the screen, then find the Alert using the various search/filter options and click on it.\n                           \n\n\n\n                            For a Card Alert, open the pertinent Details view by clicking on its Card, click\n                            \n                            in the top right corner, then click the Alert you want to delete.\n                           \n\n\n\n                            For a DataSet Alert, open the Data Center by selecting\n                            \n                             Data\n                            \n                            in the toolbar at the top of the screen, locate and click on the pertinent DataSet, click on the Alerts tab, then finally click on the card for the Alert you want to delete.\n                           \n\n\n\n\n\n                          Click the\n                          \n                          icon.\n                         \n\n\n\n                          Click\n                          \n                           Delete\n                          \n                          to confirm.\n                         \n\n\n\n                        Viewing the history of an Alert\n                       \n\n                        For any Alert, you can see how many times that Alert has been triggered. You can also see a log of specific Alert events. You can switch between these by clicking\n                        \n                        or\n                        \n                        in the options panel for the Alert. When you click\n                        \n                        , a trendline appears showing changes in the value of the Alert:\n                        \n\n\n\n\n                        You can change the sort method used for the trendline by mousing over either of the axes of the chart then clicking the sort icon that appears.\n                        \n\n                        When you click\n                        \n                        , a chronological list of trigger events appears:\n                        \n\n\n\n\n\n\n\n                         To view the history of an Alert,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Click\n                            \n                             Alerts\n                            \n                            in the toolbar at the top of the screen, then find the Alert using the various search/filter options and click on it.\n                           \n\n\n\n                            For a Card Alert, open the pertinent Details view by clicking on its Card, click\n                            \n                            in the top right corner, then click the Alert you want to see the history of.\n                           \n\n\n\n                            For a DataSet Alert, open the Data Center by selecting\n                            \n\n                              Data\n                             \n\n                            in the toolbar at the top of the screen, locate and click on the pertinent DataSet, click on the Alerts tab, then finally click on the card for the Alert you want to see the history of.\n                           \n\n\n\n\n\n                          (Optional) Switch between the event log and trendline by clicking\n                          \n                          or\n                          \n                          as desired.", "Preview Article": "Click here to preview", "URL Name": "360043430533", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004355", "Archived Date": "", "Language": "English", "Primary Version": "Managing Your Alerts", "Article Total View Count": "5,342", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Managing Your Alerts\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Notifications And Alerts\n              \n", "url": "/s/topic/0TO5w000000ZanxGAC"}]}