{"file_path": "../../raw_kb_v2\\article\\360043428913\\index.html", "content": {"title": "\n\n\n Available Pie-Type Charts\n\n\n", "article_body": "\n\nA pie-type graph is a graph divided into sections that usually add up to 100%. Each section represents the relative size of its corresponding value. Pie-type graphs are usually accompanied by legends so you can tell what each section represents. In Domo, legends are added automatically.\n\n\n When you are powering up a pie-type graph, the values in your values column do\n *not*\n need to be percentages, because Domo sums the values and converts each into the correct percentage of the total.\n\n\n The following table lists the Pie-type graphs available in Domo. You can click a thumbnail image to see a larger image.\n\n\n Chart Type\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Pie graph\n\n|\n The most common of the pie-type graphs, a basic Pie graph is a circle divided into cone-shaped \"wedges,\" each of which represents a percentage of the overall graph.\n\n\n For more information, see\n\nPie Graph\n\n.\n  |\n\n|\n|\n Donut graph\n\n|\n Donut graphs are almost identical to Pie graphs; the only difference is that they contain a hole in the middle, like a doughnut, so the sections are arcs of a circle rather than wedges.\n\n\n For more information, see\n\nDonut Chart\n\n.\n  |\n\n|\n|\n Nautilus graph\n\n|\n A Nautilus graph is the same as a standard Pie graph, except that the \"wedges\" are arranged in a logarithmic spiral and become smaller closer to the center of the spiral. This layout makes it easier to distinguish small differences between slices than it is with a regular Pie graph.\n\n\n For more information, see\n\nPie Graph\n\n.\n  |\n\n|\n|\n Nautilus Donut graph\n\n|\n A Nautilus Donut graph is the same as a standard Donut graph, except that the \"wedges\" are arranged in a logarithmic spiral and become smaller closer to the center of the spiral.\n\n\n For more information, see\n\nPie Graph\n\n.\n  |\n\n|\n|\n Nightingale Rose graph\n\n|\n As with other Pie-type graphs, Nightingale Rose graphs are divided into sections, each of which represents a percentage of the overall graph. These graphs are unique in that they are based on a polar coordinate system, i.e. each wedge originates from a common point in the center of the graph. This layout makes it easy to see smaller contributors to the overall pie.\n\n\n For more information, see\n\nPie Graph\n\n.\n  |\n\n|\n|\n Funnel graph\n\n|\n Funnel graphs are similar to basic Pie graphs, except that they use a funnel shape divided into horizontal sections.\n\n\n By default, in the legend for a Funnel graph, the percentage for each successive layer is derived from the value of the previous layer. This functionality is appropriate for conversion charts, in which you want to show the degree of change from one process to the next. If you want, you can turn off this default functionality. In this case, percentages are derived from the chart total, as in a standard Pie chart. The screenshot shows a typical conversion Funnel graph.\n\n\n For more information, see\n\nFunnel Chart\n\n.\n  |\n\n|\n|\n Stream Funnel graph\n\n|\n A Stream Funnel graph is cross between a\n\nStacked Area graph\n\n. Unlike other pie-type graphs in Domo, Stream Funnel graphs allow you to include series data (though this is not required). Legends are not shown in a Stream Funnel graph unless series data is included. Stream Funnel graphs also do not show value data except upon mouse-over. Therefore they are best used for showing relative differences between stages rather than representing exact amounts.\n\n\n For more information, see\n\nFunnel Chart\n\n.\n  |\n\n|\n|\n Folded Funnel graph\n\n|\n A Folded Funnel graph is a Funnel graph in which the sections have been \"folded.\" This type of Funnel graph shows the relative sizes of sections more accurately than a regular Funnel graph.\n\n\n For more information, see\n\nFunnel Chart\n\n.\n  |\n\n|\n|\n Funnel Bars graph\n\n|\n A Funnel Bars graph is a combination of a Funnel graph and a horizontal Bar graph. This graph type shows differences between one stage in a process (such as a sales cycle) and the next. For each stage in the process, the data for the previous round drops off, so that only the relationships between the current round and all subsequent rounds is shown. In essence, this chart type shows \"what's left\" after each stage in a process. The example at right shows a Funnel Bars graph for a typical sales cycle. Each subsequent stage depicts the number of potential customers who have progressed to that stage.\n\n\n For more information, see\n\nFunnel Chart\n\n.\n  |\n\n|\n|\n Tree Map\n\n|\n A Tree Map displays the names of categories within rectangles of differing sizes. The sizes of the rectangles reflect the relative values of each category.\n\n\n For more information, see\n\nTree Map\n\n.\n  |\n\n|\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428913\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004735\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAvailable Pie-Type Charts\n\n", "article_total_view_count": "\n\n\n 5,052\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:28 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "available_pietype_charts", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}