{"file_path": "../../raw_kb_v2\\article\\360042930174\\index.html", "content": {"Title": "Box Governance Connector", "Article Body": "Intro\n                       \n\n                        Box Governance provides a globally accessible, cloud-based solution that allows users to seamlessly manage the entire lifecycle of their business documents. To learn more about the Box API, visit their page (\n                        \n                         https://developer.box.com/\n                        \n                        ).\n                       \n\n                        You connect to your Box Governance account in the Data Center. This topic discusses the fields and menus that are specific to the Box Governance connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Box account and create a Box Governance DataSet, you must have your Box username and password.\n                       \n\n                        Connecting to Your Box Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Box Governance Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Box Governance connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Box Governance accounts in Domo) to open the Box OAuth screen where you can enter your Box credentials. Once you have entered valid Box Governance credentials, you can use the same account any time you go to create a new Box Governance DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Box when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Box.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Box Governance report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                File Classification Report\n                               \n\n\n\n                                Lets you retrieve data about File Classification policies. These policies provide the ability to classify content and drive security settings based on that classification.\n                               \n\n\n\n\n\n                                Legal Hold Reports\n                               \n\n\n\n                                Lets you retrieve either of two different Legal Hold subreports. Legal Hold policies allow one to specify a custodian whose content must be retained in Box until the hold is removed.\n                               \n\n\n\n\n\n                                Retention Report\n                               \n\n\n\n                                Lets you retrieve data about Retention policies. These policies allow one to specify a length of time that a file must be retained in Box prior to a specified disposition date.\n                               \n\n\n\n\n\n\n\n\n\n                            Enterprise Metadata Templates\n                           \n\n\n\n                            Select the template you want to retrieve data for.\n                           \n\n\n\n\n\n                            Specific Type of Subreport\n                           \n\n\n\n                            Select the desired subreport for your \"Legal Hold Report,\" either\n                            \n                             \"\n                            \n                            File Versions\" or \"Assignments.\"\n                           \n\n\n\n\n\n                            Assign To Type\n                           \n\n\n\n                            Select the desired filter for your report.\n                           \n\n\n\n\n\n                            Assign To ID (Optional)\n                           \n\n\n\n                            Enter an ID to filter assignments to that ID only. Note that this shows only those assignments applied directly to this entity.\n                           \n\n\n\n\n\n                            Disposition Action\n                           \n\n\n\n                            Select the disposition action you want to show data for in your report.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042930174", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003442", "Archived Date": "", "Language": "English", "Primary Version": "Box Governance Connector", "Article Total View Count": "4,676", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Box Governance Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}