{"file_path": "../../raw_kb_v2\\article\\360043436213\\index.html", "content": {"Title": "MySQL SSH Connector", "Article Body": "Intro\n                       \n\n                        MySQL is a widely used open-source relational database management system. You can use Domo's MySQL SSH Connector to pull data from your MySQL database and compile custom reports. You indicate the data you want by inputting an SQL query. For more information about the MySQL API, visit their website. (\n                        \n                         http://dev.mysql.com/doc/refman/5.0/en/c-api.html\n                        \n                        )\n                       \n\n                        The MySQL SSH connector is a \"Database\" connector, meaning it retrieves data from a database using a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n                        \n                         Database\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to your MySQL database in the Data Center. This topic discusses the fields and menus that are specific to the MySQL SSH connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Pulling data mart and data warehouse SQL queries\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n                            N/A\n                           \n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              CIO\n                             \n\n\n\n                              CTO\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            5-40+ hours\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            7\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n\n\n                          Limit the results set size as much as possible.\n                         \n\n\n\n                          Keep the number of columns to a minimum.\n                         \n\n\n\n                        Prerequisites\n                       \n\n                        To connect to a MySQL database via an SSH server and create a DataSet, you must have the following:\n                       \n\n\n\n                          The hostname of the UNIX server you are SSH-tunneling through\n                         \n\n\n\n                          The SSH username and password for your UNIX account\n                         \n\n\n\n                          The host name for the database\n                         \n\n\n\n                          The SSH private key (either DES or RSA)\n                         \n\n\n\n                          The database name\n                         \n\n\n\n                          The username and password you use to log into your MySQL database\n                         \n\n\n\n\n\n\n\n\n\n\n                             Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys (in PEM format) generated by OpenSSL.\n                            \n\n\n\n\n\n\n                        Creating MySQL Accounts\n                       \n\n                        You can create MySQL accounts two ways:\n                       \n\n\n\n                          By using account management statements intended for creating accounts and establishing their privileges, such as\n                          \n                           CREATE USER\n                          \n                          and\n                          \n                           GRANT\n                          \n                          . These statements cause the server to make appropriate modifications to the underlying grant tables.\n                         \n\n\n\n                          By manipulating the MySQL grant tables directly with statements such as\n                          \n                           INSERT\n                          \n                          ,\n                          \n                           UPDATE\n                          \n                          , or\n                          \n                           DELETE.\n                          \n\n\n\n\n                        The preferred method is to use account management statements because they are more concise and less error-prone than manipulating the grant tables directly.\n                       \n\n                        Another option for creating accounts is to use the GUI tool MySQL Workbench. Also, several third-party programs offer capabilities for MySQL account administration, such as phpMyAdmin.\n                       \n\n                        Whitelisting\n                       \n\n                        Before you can connect to a MySQL database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n                        \n                         Whitelisting IP Addresses for Connectors\n                        \n                        .\n                       \n\n                        Connecting to Your MySQL Database\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the MySQL Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your database. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            SSH Server Hostname\n                           \n\n\n\n                            Enter the hostname of the UNIX server to SSH-tunnel through.\n                           \n\n\n\n\n\n                            SSH Username\n                           \n\n\n\n                            Enter the SSH username for your UNIX account.\n                           \n\n\n\n\n\n                            SSH Password\n                           \n\n\n\n                            Enter the SSH password for your UNIX account.\n                           \n\n\n\n\n\n                            Database Hostname\n                           \n\n\n\n                            Enter the hostname or IP address for the SQL database. For example:\n                            \n\n                              db.company.com\n                             \n\n\n\n\n\n\n\n                            SSH Private Key\n                           \n\n\n\n                            Enter the SSH private key (either DES or RSA).\n                           \n\n\n\n\n\n                            Database Name\n                           \n\n\n\n                            Enter the name of the SQL database or schema.\n                           \n\n\n\n\n\n                            Database Username\n                           \n\n\n\n                            Enter your MySQL username.\n                           \n\n\n\n\n\n                            Database Password\n                           \n\n\n\n                            Enter your MySQL password.\n                           \n\n\n\n\n\n                        Once you have entered valid credentials, you can use the same account any time you go to create a new MySQL SSH DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        In this pane you create an SQL query to pull data from your database as well as specify a few options.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Query Type\n                           \n\n\n\n\n                             Select a query type.\n                            \n\n\n\n\n\n\n                                Query\n                               \n\n\n\n                                Regular SQL query without parameter.\n                               \n\n\n\n\n\n                                Query Parameter\n                               \n\n\n\n                                SQL query with parameter.\n                               \n\n\n\n\n\n\n\n\n\n                            SQL Query\n                           \n\n\n\n                            Structured Query Language (SQL) query to use in selecting the data you want. For example:\n                           \n\n\n                             select * from Employee\n                            \n\n\n\n\n\n\n                            Query Parameter\n                           \n\n\n\n\n                             Enter the query parameter value, it is the initial value for query parameter. The last run date is optional. By default, it is '02/01/1700' if is not provided.\n                            \n\n\n\n                             For example: !{lastvalue:_id}!=1,!{lastrundate:start_date}!=02/01/1944\n                            \n\n\n\n\n\n                           TINYINT Values Treated as Bit (Boolean) Values?\n                          \n\n                           Select\n                           \n                            Yes\n                           \n                           if you want TINYINT values to be treated as Boolean values.\n                          \n\n\n\n                           Keep Connection Alive For Large Queries\n                          \n\n                           Select\n                           \n                            Yes\n                           \n                           if the connection should be kept running for very large queries.\n                          \n\n\n\n\n                            Include HTML Tag\n                           \n\n\n\n                            Select Yes to include the html tag with the data.\n                           \n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n\n                          Verify the credentials using MySQL Workbench.\n                         \n\n\n\n                          Confirm the server supports encrypted connections.\n                         \n\n\n\n                          Confirm the Domo IPs are whitelisted.", "Preview Article": "Click here to preview", "URL Name": "360043436213", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003887", "Archived Date": "", "Language": "English", "Primary Version": "MySQL SSH Connector", "Article Total View Count": "5,017", "": "", "Article Created Date": "10/24/2022, 9:16 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              MySQL SSH Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               Database Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaojGAC"}]}