{"file_path": "../../raw_kb_v2\\article\\360042925074\\index.html", "content": {"Title": "U.S. State and County Maps", "Article Body": "In Domo, you can add maps representing data for U.S. Counties. You do this by building a U.S. State map or a U.S. County map. These are nearly the same, with one important difference. U.S. County maps show County data on the\n                        \n                         national\n                        \n                        level—that is, your County data appears on a map of the entire United States (though you can add a\n                        \n                         drilldown\n                        \n                        allowing users to jump to individual states). U.S. State maps, on the other hand, automatically zoom in on the State indicated in your DataSet, allowing you to build maps for individual States.\n                       \n\n                        Both U.S. State and U.S. County maps require a column or row containing the FIPS codes representing each County and another containing the values for each such County. A FIPS code is a five-digit number that identifies Counties and County equivalents in the United States, certain U.S. possessions, and certain freely associated States. The first two digits are the FIPS State code and the last three are the County code within the State or possession. For example, the FIPS State code for Florida is 12, and the FIPS County code for Miami-Dade County is 086, so to represent Miami-Dade County in your DataSet you would use the number \"12086.\"\n                       \n\n                        You can find FIPS codes for any U.S. county by setting up the Domo Dimensions Connector using the following steps:\n                       \n\n\n                         Navigate to the\n                         \n                          Appstore\n                         \n                         .\n                        \n\n                         Type\n                         \n                          Domo Dimensions\n                         \n                         into the Search bar.\n                        \n\n                         Select the Domo Dimensions Connector.\n                         \n\n\n\n\n\n                         Click\n                         \n                          Get the data\n                         \n                         .\n                        \n\n                         Select the\n                         \n                          zips_to_fips_latest.csv\n                         \n                         file.\n                        \n\n                         Click\n                         \n                          Next\n                         \n                         .\n                        \n\n                         Name the DataSet.\n                        \n\n                         Click\n                         \n                          Save\n                         \n                         .\n                        \n\n                         Join the Domo Dimensions DataSet you just created to your data on the Zip column.\n                        \n\n\n\n\n\n\n\n\n\n                             Tip:\n                            \n\n                           In Domo, maps are generated based on the existing data you provide. When building a U.S. State map, you can use ZIP codes instead of FIPS codes. Your map will then automatically switch to a ZIP code-level map. If a\n                           \n                            column name includes \"st\" (short for \"state\") the state-level map will load. If\n                           \n\n                            the column name in the ETL is \"zip2fip,\" the zipcode-level map will load.\n                            \n                             When using the US counties map, you can use either ZIP codes or FIPS codes in the county selector. Domo will try and match FIPS or ZIPS by matching column name clues like \"Zip\" or \"zip code\". It will try \"FIPS\" or \"county\" for the county column name.\n                            \n\n\n\n\n\n\n                        If you want to build a U.S. State map and your DataSet includes information for multiple States, you can select the State you want to show by\n                        \n                         applying a filter\n                        \n                        .\n                       \n\n                        Values in your U.S. State or U.S. County map are represented by varying shades of color, each of which corresponds to a specific range. Ranges are determined automatically based on the distribution of values in your DataSet and are represented by a legend, which is automatically included beside the map.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           When multiple instances of a single region occur in a DataSet, the values for that region are summed to show a single value for the region in the map. For example, if your DataSet contained three rows for \"Georgia,\" the values for the rows would be summed, and the Georgia region in the map would show the total value. You\n                           \n                            cannot\n                           \n                           turn off this automatic aggregation in maps.\n                          \n\n\n\n\n                        For information about Country maps, see\n                        \n                         Latitude-Longitude Map\n                        \n                        .\n                       \n\n                        For information about troubleshooting when an area in your map does not show data but there is data, see\n                        \n                         Troubleshooting\n                        \n                        .\n                       \n\n                        Powering U.S. County Maps\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your map. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows you how data from a typical column-based spreadsheet is converted into a U.S. County map:\n                       \n\n\n\n\n                        Powering U.S. State Maps\n                       \n\n                        This scenario is the same as the one for powering a U.S. County map. If your DataSet contains data for more than one State, you will need to point to the desired State by\n                        \n                         adding a filter\n                        \n                        . For example, if your DataSet contained data for all of the States in the \"South\" region but you only wanted to show a map for Florida, you would follow these steps:\n                       \n\n\n\n                          Build your map by dragging your \"FIPS\" and value columns into the fields above the chart preview area.\n                         \n\n\n\n                          Drag your \"State\" column into the\n                          \n                           Filters\n                          \n                          pane.\n                         \n\n\n\n                          Check the box for \"Florida.\"\n                         \n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          .\n                         \n\n\n\n                        Your preview should now update to show a zoomed-in map of Florida.\n                       \n\n                        Customizing U.S. County/U.S. State Maps\n                       \n\n                        You can customize the appearance of a U.S. County or State map by editing its\n                        \n                         Chart Properties\n                        \n                        . Properties for all chart types are listed and described in\n                        \n                         Chart Properties\n                        \n                        . Unique properties of U.S. County and State maps include the following:\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            Theme > Theme\n                           \n\n\n\n                            Allows you to change the color theme for the map. For more information about setting colors, see\n                            \n                             Changing the Default Colors in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Balanced Distribution\n                           \n\n\n\n                            Adjusts maps to include a balanced number of items within each range. This is helpful in spreading values across each range when your data contains extreme outliers.\n                           \n\n                            The pair of maps in the screenshots at right show how\n                            \n                             Balanced Distribution\n                            \n                            works. (These are Country maps for Canada, not World maps, but the principle is the same.) In these maps, the values of most of the Canadian provinces are in the range of 100 to 1500. The outlier, Alberta, has a value of 10,000.\n                            \n                             Balanced Distribution\n                            \n                            has not been turned on in the top map, so a skewed version of the data is shown—Alberta appears dark and all of the other provinces appear light. In the bottom map, the user has turned on\n                            \n                             Balanced Distribution\n                            \n                            , so Alberta is grouped into the same range as the province with the next highest value.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n                            General > Auto Zoom to Data\n                           \n\n\n\n                            Zooms in on the region of your map with data. In the example at right, the only States with data are Utah, Arizona, Colorado, and New Mexico, so the map zooms on them automatically. This option will not work if all of the regions in your map with data are not adjacent. For example, if the map at right showed Oregon as having data, the auto-zoom would not work because Oregon is not adjacent to any of the other States with data.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General> Hide No Data Items\n                           \n\n\n\n                            Hides all items in your map without data. In the example at right, the only States with data are Utah, Arizona, Colorado, and New Mexico, so the map hides all other States. Unlike the \"Auto Zoom to Data\" property, this will work even if there are regions not adjacent to other regions.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > Hide Abbreviated Legend\n                           \n\n\n\n                            Hides the legend shown at the bottom of maps in some views.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Override Maximum Value\n                           \n\n\n\n                            Lets you specify the maximum value for a map or Heat Map.\n                           \n\n                            By default, Domo uses the highest value in the DataSet as the maximum value. However, by setting this property you can override this value.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Hover Legend > Hide Legend\n                           \n\n\n\n                            Hides the legend that normally appears on the right side of a map in the Details view.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Hover Legend > Hide Total\n                           \n\n\n\n                            Hides the \"Total\" section of the legend that appears on the right side of a map in the Details view. The example shows a map in which this has been done.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Hover Legend > Hide Values\n                           \n\n\n\n                            Hides the value and percent of total value in the legend that appears on the right side of a map in the Details view. The example shows a map in which this has been done.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Data Label Settings > Text\n                           \n\n\n\n                            Specifies text for the data labels. This property is the \"on switch\" for data labels—you must specify text for them to appear.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Data Label Settings > Font Size\n                           \n\n\n\n                            Allows you to increase or decrease the data label font size. The \"Default\" font size falls between the largest and second-smallest font sizes. For more information, see\n                            \n                             Changing the Font Size in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Data Label Settings > Text Color\n                           \n\n\n\n                            Lets you determine the text color for your map data labels. If you select \"Default,\" the color will be automatically determined based on the background color. This is shown in the example at right, in which the data labels on darker areas appear white and those on lighter areas appear dark red.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Data Label Settings > Value Abbreviation\n                           \n\n\n\n                            Determines whether data label values are abbreviated (the default being 3 significant digits) or not.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Data Label Settings > Fill\n                           \n\n\n\n                            Lets you add a colored fill to your map data labels. The example at right shows a chart in which a pale blue fill color with 60% transparency has been added.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Data Label Settings > Fill Color\n                           \n\n\n\n                            Lets you specify the color for the fill in your map data labels. This property is only available when you check the\n                            \n                             Fill\n                            \n                            box.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Data Label Settings > Fill Transparency Percent\n                           \n\n\n\n                            Lets you specify the fill transparency for map data labels. You can specify any number between 0 and 100, in which 0 is completely opaque and 100 is completely transparent. This property is only available when you check the\n                            \n                             Fill\n                            \n                            box.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Hover Text > Hover Text\n                           \n\n\n\n                            Lets you set the text that appears in map hovers. A variety of macros for showing map values in your hovers is available. For more information and a list of available macros, see\n                            \n                             Formatting Data Label and Hover Text in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Hover Text > Always Show Over Map\n                           \n\n\n\n                            Specifies whether hover text specified using the\n                            \n                             Hover Text\n                            \n                            option is turned on for your chart.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Values > Label Format\n                           \n\n\n\n                            Determines the general number format for hover text and legend items in maps.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Values > Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places used in decimal values in hover text and legend items in maps.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Values > Negative Numbers\n                           \n\n\n\n                            Determines the format for negative numbers in hover text and legend items in maps\n                           \n\n\n\n                            —\n                           \n\n\n\n\n                           Cities > Cities\n                          \n\n\n                            Shows whether cities and city names are shown on the map. The closer a map is zoomed, the more cities are shown.\n                           \n\n                            The first example at right shows an \"unzoomed\" map of the United States. Note that only two cities are shown in Texas. In the second example, the map is zoomed to show only Texas, and many more cities are shown.", "Preview Article": "Click here to preview", "URL Name": "360042925074", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004666", "Archived Date": "", "Language": "English", "Primary Version": "U.S. State and County Maps", "Article Total View Count": "5,254", "": "", "Article Created Date": "10/24/2022, 10:20 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              U.S. State and County Maps\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}