{"file_path": "../../raw_kb_v2\\article\\360042936274\\index.html", "content": {"Title": "April 2017 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n\n                         Buzz Updates\n                        \n\n\n\n                         Based on your feedback, Buzz has been updated to include a number of improvements to facilitate your communication. These improvements include...\n                        \n\n\n\n\n\n\n                            Ability to edit messages\n                           \n                           . Edit mistakes out of your messages after you have posted them.\n                           \n\n\n\n\n\n\n\n\n\n                            Mention filter that sorts based on category\n                           \n                           . @-mentioning in Buzz now filters based on category to allow you to more easily navigate to that card or group you are looking for.\n                          \n\n\n\n\n\n\n\n\n\n                            Display who is online\n                           \n                           . Just like in your old DomoBuzz, you can see who in your organization is logged into Domo. For more information, see\n                           \n                            Seeing Online Users in Domo\n                           \n                           .\n                           \n\n\n\n\n\n\n\n\n\n                            Ability to collapse attachments\n                           \n                           . Hide attachments and GIFs that may be distracting you.\n                           \n\n\n\n\n\n\n\n\n                         For more information, see\n                         \n                          Buzz Layout\n                         \n\n                        .\n                       \n\n                        Hybrid SSO\n                       \n\n\n                         Hybrid SSO allows users with Single Sign-On enabled to specify which of their users can log in directly to Domo.\n                        \n\n\n\n                         Previously, hybrid SSO was available only to Administrators using a feature switch. For SSO customers trying to grant Domo access to contractors or non-employees, this often created a dilemma because such users were not usually given accounts in the company’s email or directory system. Now, however, Admins can go into the\n                         \n                          Single Sign-On\n                         \n                         tab in the Admin Settings and specify a set of users who are able to sign into Domo directly, just as they would without SSO enabled. Users can then toggle login modes (Direct or Single Sign-on) from the Domo login screen.\n                        \n\n\n\n\n\n\n\n\n                         For more information, see\n                         \n                          Adding Users to Direct Sign-On\n                         \n                         .\n                        \n\n\n\n                         App Deploy Improvements\n                        \n\n\n\n                         For this release we are pushing the following improvements to our App deploy process:\n                        \n\n\n\n\n\n                           Support for multi-connector content.  Apps can now be powered by 1:n connectors, providing a simple-to-understand interface.\n                          \n\n\n\n\n\n                           Multi-user deploy capability. With more complicated Apps, it’s unlikely a single person has all the credentials needed to be successful.  We’ve leveraged Buzz and added the ability to collaborate in the power-up process. You can assign specific portions to the right person.  This effectively removes the need for sticky notes and other uncomfortable requests for credentials.\n                          \n\n\n\n\n                        Updated UI for Google Analytics Connector\n                       \n\n                        The user interface for the Google Analytics connector now offers a more intuitive, step-by-step workflow. Instead of providing a single pane for selecting parameters and report types, the new interface divides up options between five panes—\n                        \n                         Select Views\n                        \n                        ,\n                        \n                         Select Reports\n                        \n                        ,\n                        \n                         Select Segments\n                        \n                        ,\n                        \n                         Select Duration\n                        \n                        , and\n                        \n                         Test My Configuration\n                        \n                        .\n                       \n\n                        The following screenshot shows the new view for selecting Google Analytics reports in Domo:\n                       \n\n\n\n\n                        For more information including FAQs, see\n                        \n                         Google Analytics Connector\n                        \n                        .\n                       \n\n                        Page and Card Analyzer Filter Search Box\n                       \n\n                        When you add a filter to a page or card, you can now more easily find the columns you're looking for using a new search box.\n                        \n\n\n\n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal, by sending a Buzz message to\n                          \n                           \\support\n                          \n                          , or by emailing\n                          \n                           support@domo.com\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042936274", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004442", "Archived Date": "", "Language": "English", "Primary Version": "April 2017 Release Notes", "Article Total View Count": "4,666", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              April 2017 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}