{"file_path": "../../raw_kb_v2\\article\\360047236574\\index.html", "content": {"Title": "Zoom App Advanced Setup and Best Practices", "Article Body": "Intro\n                       \n\n                        As a cloud software provider with services that range from video conferences to virtual meeting rooms and webinars, Zoom is a heavyweight in the video and teleconference industry for businesses around the world.\n                        \n                         Domo\n                        \n                        helps you to get the most out of Zoom with interactive, out-of-the-box visualizations that can be set up in minutes, as well as automated access to raw Zoom data for you to explore and understand.\n                       \n\n                        In order to help you get the most out of your Zoom data, here are some points to consider and other best practices that you might find useful.\n                       \n\n                        What do I need to set up my Zoom app or Connector?\n                       \n\n\n\n                          An admin-level account in Zoom\n                         \n\n\n\n                          An Editor-level or equivalent account in your\n                          \n                           Domo\n                          \n                          instance\n                         \n\n\n\n                          Access to the Zoom app in\n                          \n                           Domo's\n                          \n                          App Store\n                          \n                           here\n                          \n                          which will set up a Zoom dashboard and all the required\n                          \n                           DataSets\n                          \n\n\n\n                         If you prefer to connect directly using the Zoom Connector, please access the connector\n                         \n                          here\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Each account can only be used once to authenticate to Zoom.\n                          \n\n\n\n\n                        Make your Zoom data more robust with Departments & Groups\n                       \n\n\n                         Domo\n                        \n                        gives you several options to easily augment your Zoom data with your departments and groups making your Zoom data more robust.\n                       \n\n                        Manage departments and groups in Zoom\n                       \n\n\n\n                          Integrate Zoom with your company's directory service or identity provider (\n                          \n                           Idp\n                          \n                          ) solution, like Active Directory, to capture existing departments/groups data.\n                         \n\n\n\n                          Users and departments/groups can also be managed manually assigning users to specific departments or groups in Zoom itself.\n                         \n\n\n\n                          Access the Zoom department data in\n                          \n                           Domo\n                          \n                          using the \"Users\" report in the\n                          \n                           Zoom Connector\n                          \n                          .\n                         \n\n\n\n                        Bring department or group data directly into\n                        \n                         Domo\n                        \n\n\n\n\n                          If your\n                          \n                           Domo\n                          \n                          instance is already syncing\n                          \n                           Domo\n                          \n                          Groups with the department/group information in your company's\n                          \n                           Idp\n                          \n                          using\n                          \n                           SSO\n                          \n                          , consider creating a\n                          \n                           DataFlow\n                          \n                          to combine your department/groups with the \"Users\" report from the\n                          \n                           Creating a SQL DataFlow\n                          \n                          .\n                         \n\n\n\n                          If you are not using\n                          \n                           SSO\n                          \n                          , but can still provide department/groups from your\n                          \n                           Idp\n                          \n                          via an automated report, Workbench, database export, etc., you can still consider combining your department/groups\n                          \n                           DataSet\n                          \n                          with the \"Users\" report from the Zoom Connector.\n                         \n\n\n\n                          This kind of dynamic connection for department data will be reflected in your Zoom data anytime something changes in your directory provider and/or\n                          \n                           Idp\n                          \n                          .\n                         \n\n\n\n                        Manage departments and groups in\n                        \n                         Domo\n                        \n\n\n\n\n                          If you are manually maintaining departments or groups directly in\n                          \n                           Domo\n                          \n                          using\n                          \n                           Domo\n                          \n                          Groups and are not able to bring in this information from your\n                          \n                           Idp\n                          \n                          , you can add\n                          \n                           Domo\n                          \n                          Groups to your Zoom data by creating a\n                          \n                           DataFlow\n                          \n                          using the\n                          \n                           DomoStats\n                          \n                          User Activity Report and the Users report from the Zoom Connector. For more information on how to access\n                          \n                           DomoStats\n                          \n                          reports, see\n                          \n                           DomoStats Connector\n                          \n                          .\n                         \n\n\n\n                          This gives you the flexibility to see group-level data in Zoom and to do so from the same place that you already manage permissions and access for users.\n                         \n\n\n\n                        Secure your Zoom data using Personalized Data Permissions (\n                        \n                         PDP\n                        \n                        )\n                       \n\n                        Due to the potentially sensitive nature of meeting data,\n                        \n                         Domo\n                        \n                        makes it easy to secure your data using\n                        \n                         PDP\n                        \n                        rules on your Zoom\n                        \n                         DataSets\n                        \n                        . For more information on setting up and using\n                        \n                         PDP\n                        \n                        , see\n                        \n                         Personalized Data Permissions (PDP)\n                        \n                        .\n                       \n\n\n\n                          By default, Zoom day will be unfiltered with no additional\n                          \n                           PDP\n                          \n                          policies applied.\n                         \n\n\n\n                          Consider using\n                          \n                           Domo\n                          \n                          Groups to make sure that people only see meeting details that meet certain conditions.\n                         \n\n\n\n                          Consider using a trusted attribute like email to create a\n                          \n                           PDP\n                          \n                          policy to dynamically secure your Zoom data.\n                         \n\n\n\n                          If your\n                          \n                           Domo\n                          \n                          instance and Zoom are both integrated with your\n                          \n                           Idp\n                          \n                          , setting up\n                          \n                           PDP\n                          \n                          on trusted attributes is easy and may not require joining\n                          \n                           Domo\n                          \n                          Group data with the Zoom Users report.\n                         \n\n\n\n                        Understand your Zoom data\n                       \n\n                        Make sure that you understand the settings that you have in your Zoom configuration in order to properly understand the data.\n                       \n\n\n\n                          Names of meetings in Zoom may not necessarily be the same as the subject line of your calendar invite. For example, if you sue the Zoom extension inside of your email client, it may use a default meeting name for the Zoom meeting. For example, John Smith's Zoom Meeting or John Smith's Personal Meeting Room.\n                         \n\n\n\n                          It is possible for somebody to join a meeting without being an authenticated user. This is a setting that is configurable for an Admin in Zoom. If your Zoom account has been configured to allow users to join a meeting without being authenticated, you may see entries in the All Meeting Participants report that have entries such as \"Call-in User_1\", a phone number, or possibly a null entry.\n                         \n\n\n\n                          In order to add more richness to your data, you may consider encouraging best practices for your users to join in certain ways so data is recorded properly.\n                         \n\n\n\n                            Encourage users to always join as an authenticated user.\n                           \n\n\n\n                            If possible, avoid direct dial-ins wherever possible.\n                           \n\n\n\n\n\n                          What about the participant data with people outside of your organization?\n                         \n\n\n\n                            The All Meeting Participants\n                            \n                             DataSet\n                            \n                            will include the user data for any participant that joined a Zoom-hosted meeting, including those outside of your organization.\n                           \n\n\n\n                            If those users from outside your organization have a Zoom account of their own, then the user information for them will be available in the All Meeting Participants\n                            \n                             DataSet\n                            \n                            . This will include their user name and user email.\n                           \n\n\n\n\n\n                        Advanced options\n                       \n\n                        Need to customize your data even more? Consider using\n                        \n                         Domo's\n                        \n                        Magic\n                        \n                         ETL\n                        \n                        or MySQL\n                        \n                         DataFlows\n                        \n                        to configure things even more to meet your specialized needs. If that's not enough or there is more data form the Zoom API that you would like to see in\n                        \n                         Domo\n                        \n                        , here are some helpful resources:\n                       \n\n\n\n\n                           Zoom API Documentation\n                          \n\n\n\n\n\n                           Create your own Connector\n                          \n\n\n\n\n                          Speed up the updating cycle on a\n                          \n                           custom Zoom Connector using a webhook\n                          \n                          .\n                         \n\n\n\n\n\n                          Uninstalling the Zoom app from Domo\n                         \n\n\n\n\n\n\n                           Log in to your Domo instance and navigate to the Domo Appstore.\n                          \n\n\n\n                           Click\n                           \n                            Installed Apps\n                           \n                           .\n                           \n\n\n\n\n\n                           Click\n                           \n                            Your Apps\n                           \n                           .\n                          \n\n\n\n                           Select the Zoom app from the list of apps.\n                          \n\n\n\n                           Click\n                           \n                            Uninstall\n                           \n                           .\n                          \n\n\n\n\n\n\n\n\n                          Uninstalling the Domo app from Zoom\n                         \n\n\n\n\n\n\n                           Log in to your Zoom account and navigate to the Zoom App Marketplace.\n                          \n\n\n\n                           Click\n                           \n                            Manage > Installed Apps\n                           \n                           or search for the\n                           \n                            Domo\n                           \n                           app.\n                          \n\n\n\n                           Select the\n                           \n                            Domo\n                           \n                           app.\n                          \n\n\n\n                           Click\n                           \n                            Uninstall\n                           \n                           .", "Preview Article": "Click here to preview", "URL Name": "360047236574", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004143", "Archived Date": "", "Language": "English", "Primary Version": "Zoom App Advanced Setup and Best Practices", "Article Total View Count": "2,415", "": "", "Article Created Date": "10/24/2022, 9:24 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Zoom App Advanced Setup and Best Practices\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}