{"file_path": "../../raw_kb_v2\\article\\360042934234\\index.html", "content": {"Title": "Admin Settings Overview", "Article Body": "Intro\n                       \n\n                        In the\n                        \n                         Admin Settings\n                        \n                        , you can handle many administrative functions in Domo, including managing users and groups, controlling user access to content, and changing your organization's name and logo that appear in Domo.\n                       \n\n                        This article provides information on the Admin Settings in the following topics:\n                       \n\n\n\n                          Access the Admin Settings\n                         \n\n\n\n                          Navigate the Admin Settings\n                         \n\n\n\n\n\n                        Access the Admin Settings\n                       \n                       In the Domo navigation header, select\n                       \n                        More\n                       \n                       >\n                       \n                        Admin\n                       \n                       . The Admin Settings screen displays. Depending on your level of Domo access, your Admin Settings may display differently.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Your Admin Settings options may be different, depending on your Domo environment's security settings.\n                          \n\n\n\n\n\n\n\n                         Navigate the Admin Settings\n                        \n\n                         The Admin Settings contain the following menus, available on the Admin Settings screen, shown above, or in the left side rail, which you can expand by selecting the\n                         \n                         hamburger menu.\n                        \n\n                         The left side rail also has a search field, where you can search for a specific topic in the Admin Settings.\n                        \n\n                         The Admin Settings menu options include the following (depending on your Domo security settings).\n                        \n\n                         Governance, Content, Company settings, Brand Kit, and Domo Everywhere have their own documentation, linked below. The other options are treated in this article and link to headings below.\n                        \n\n\n\n                           Governance\n                          \n\n\n\n                           Content\n                          \n\n\n\n                           Authentication\n                          \n\n\n\n                           Network security\n                          \n\n\n\n                           Company settings\n                          \n\n\n\n                           Brand Kit\n                          \n\n\n\n                           Domo Everywhere\n                          \n\n\n\n                           Features\n                          \n\n\n\n                           More\n                          \n\n\n\n\n\n\n\n                          Authentication\n                         \n\n                          The Authentication tab contains the following pages:\n                         \n\n\n\n                            Authentication\n                           \n\n\n\n                            OpenID Connect (SSO)\n                           \n\n\n\n                            SAML (SSO)\n                           \n\n\n\n                            Access tokens\n                           \n\n\n\n                            API Clients\n                           \n\n\n\n\n\n                          Authentication\n                         \n\n                          The\n                          \n                           Authentication\n                          \n                          menu contains options for authenticating in Domo, including password criteria, username autocomplete, and multi-factor authentication. For more information on these topics, see:\n                         \n\n\n\n                            Setting Password Requirements\n                           \n\n\n\n                            Changing Your Password\n                           \n\n\n\n                            Disabling Username Autocomplete in the Login Screen\n                           \n\n\n\n                            Turning On Multi-Factor Authentication\n                           \n\n\n\n\n\n                          OpenID Connect (SSO)\n                         \n\n                          The OpenID Connect (SSO) sub-tab lets you configure SSO using OpenID Connect. For more information, see\n                          \n                           Enabling SSO with OpenID Connect\n                          \n                          .\n                         \n\n\n\n                          SAML (SSO)\n                         \n\n                          The SAML (SSO) sub-tab ets you configure Single Sign-On (SSO) for your Domo instance. For more information, see\n                          \n                           Understanding and Configuring Domo Single Sign-On\n                          \n                          .\n                         \n\n\n\n                          Access Tokens\n                         \n\n                          The Access tokens sub-tab lets you view a list of access tokens that have been issued. For more information, see\n                          \n                           Managing Access Tokens\n                          \n                          .\n                         \n\n\n\n                          API Clients\n                         \n\n\n\n                          Network Security\n                         \n\n                          The\n                          \n                           Network security\n                          \n                          menu contains the following pages:\n                         \n\n\n\n                            Invite authorized domains\n                           \n\n\n\n                            Custom Apps authorized domains\n                           \n\n\n\n                            Embed authorized domains\n                           \n\n\n\n                            IP Address Whitelist\n                           \n\n\n\n\n\n                          Invite Authorized Domains\n                         \n\n                          The Authorized domains (for invites) sub-tab lets you specify email domains for users who can be invited to Domo. For more information, see\n                          \n                           Specifying Authorized Domains for Invited Users\n                          \n                          .\n                         \n\n\n\n                          Custom Apps authorized domains\n                         \n\n                          The Custom Apps authorized domains sub-tab lets you specify the domains allowed for navigation from a Custom App. If this is left blank, it allows navigation to all domains from a Custom App.\n                         \n\n\n\n                          Embed Authorized Domains\n                         \n\n                          The Embed settings sub-tab allows you to set a bounce page. Depending on browser type and user settings, the Domo cookie may be rejected when embedding Domo in an iFrame. For example, the Safari browser requires a user to either visit a Domo site first or to change their privacy settings in order to load Domo in an iFrame. Learn more about Safari\n                          \n                           here\n                          \n                          .\n                         \n\n                          To support these browsers, Domo provides a bounce page. This bounce page automatically loads a Domo page that sets a cookie, then returns the user to the referring site. For security reasons, this bounce page only works when the user’s browser originates from one of the sites listed below. Wild cards in the form of an asterisk “*” are allowed as a placeholder for the subdomain or path. Find more information on how to implement the bounce page in your custom app or embedding website\n                          \n                           here\n                          \n                          .\n                         \n\n\n\n                          IP Address Whitelist\n                         \n\n                          The Whitelist sub-tab lets you whitelist specific IP addresses in Domo. For more information, see\n                          \n                           Whitelisting IP Addresses in Domo\n                          \n                          .\n                         \n\n\n\n                          Features\n                         \n\n                          The\n                          \n                           Features\n                          \n                          menu contains the following sections. Goals and Cloud Amplifier have their own documentation, linked below.\n                         \n\n\n\n                            Certified Content\n                           \n\n\n                           Approvals\n                          \n\n\n                            Slideshows\n                           \n\n\n\n                            Buzz\n                           \n\n\n\n                            Goals\n                           \n\n\n\n                            Cloud Amplifier\n                           \n\n\n\n                            Connectors\n                           \n\n\n\n\n\n                          Certified Content\n                         \n\n                          When you select\n                          \n                           Certified Content\n                          \n                          in the sub-tab menu, you can see a list of all Domo Cards or DataSets that have been certified, that are awaiting certification, or that have an expired certification. You can also modify the fields and approvers in the Card or DataSet certification request form. You must have an \"Admin\" security profile to see this tab.\n                         \n\n                          The following screenshot shows the most important components of the\n                          \n                           Certified Content\n                          \n                          tab for Cards. (Most of these components are the same for Cards and DataSets.)\n                          \n\n\n\n\n\n\n                          You can learn more about these components in the following table:\n                         \n\n\n\n\n\n\n\n                              Name\n                             \n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n                            Navigation pane\n                           \n\n                            Lets you switch between the tabs for Certified Cards and Certified DataSets.\n                           \n\n\n\n\n\n                              Company-certified Card form\n                             \n\n\n\n\n\n                              Allows you to open the Card company-level certification request form for editing. This is the form that users fill out when they want to request company-level certification for a Card. Company-level certification represents the highest level of certification your organization can bestow. In the form edit view, you can edit the fields users need to fill out as well as the names of the Card approvers. For more information, see\n                              \n                               Certifying Cards and DataSets\n                              \n                              .\n                             \n\n\n\n\n\n\n\n                              Department-certified Card form\n                             \n\n\n\n\n\n                              Allows you to open the Card department-level certification request form for editing. This is the form that users fill out when they want to request department-level certification for a Card. In the form edit view, you can edit the fields users need to fill out as well as the names of the Card approvers. For more information, see\n                              \n                               Certifying Cards and DataSets\n                              \n                              .\n                             \n\n\n\n\n\n                            Search field\n                           \n\n                            Lets you search for Cards that have been certified, are pending certification, or have an expired certification.\n                           \n\n\n\n\n\n                              Certified/pending certified Cards\n                             \n\n\n\n\n\n                              Provide details about Cards that are either certified, have certification pending (i.e. a user has requested certification but the Card has not gone through the chain of approvers yet), or that have an expired certification. Entries for certified Cards appear blue, entries for certification pending Cards appear gray, and entries for expired Cards appear red. If you click the\n                              \n                              button for a certified or expired Card, a\n                              \n                               Remove Certification\n                              \n                              option appears. This option removes the certified status for the Card. If you click the\n                              \n                              button for a certification pending Card, a\n                              \n                               Cancel Certification\n                              \n                              option appears. This option cancels the approval process for the Card.\n                             \n\n\n\n\n\n\n\n                              \"Expire if edited\" toggle\n                             \n\n\n\n\n\n                              Lets you specify whether certified Cards are automatically considered expired if they are edited. This lets you ensure that any content updates to certified Cards get approval first. Note that this is a\n                              \n\n                                global\n                               \n\n\n\n\n\n\n\n                                setting\n                               \n\n                              ; you cannot enable this setting on a Card-by-Card basis.\n                             \n\n\n\n\n\n\n\n                              Filter menu\n                             \n\n\n\n\n\n                              Lets you filter to show all Cards or those that are certified, pending certification, or have an expired certification.\n                             \n\n\n\n\n\n\n\n                          For more information about Card certification, see\n                          \n                           Certifying Cards and DataSets\n                          \n                          .\n                         \n\n\n\n                          Slideshows\n                         \n\n\n                         When you select\n                         \n                          Slideshows\n                         \n                         in the sub-tab menu, the middle panel shows the names of the slideshows in Domo, and the rightmost panel shows the Card slides in the slideshow, along with any published URL and access code.\n                        \n\n                         You can filter the list of slideshows by entering text in the\n                         \n                          Search\n                         \n                         field.\n                        \n\n                         The following screenshot shows the most important components of the\n                         \n                          Slideshows\n                         \n                         tab:\n                        \n\n\n\n\n                         You can learn more about these components in the following table:\n                        \n\n\n\n\n\n                             Name\n                            \n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Title\n                            \n\n\n\n                             Displays the name of the title and the number of Cards in the slideshow.\n                            \n\n\n\n\n\n                             Shared URL\n                            \n\n\n\n                             Displays the URL for accessing the slideshow.\n                            \n\n\n\n\n\n                             Access Code\n                            \n\n\n\n                             Displays the access code for accessing the slideshow.\n                            \n\n\n\n\n\n                             Stop Publishing\n                            \n\n\n\n                             Removes Web access to the slideshow.\n                            \n\n\n\n\n\n                             Cards in this Slideshow\n                            \n\n\n\n                             Lists the Cards in the slideshow. You can see information such as the name, refresh rate, and last refresh time for the Card. You can remove a Card from the slideshow by clicking\n                             \n                              Remove\n                             \n                             .\n                            \n\n\n\n\n\n                             Delete Slideshow\n                            \n\n\n\n                             Deletes the slideshow from Domo.\n                            \n\n\n\n\n\n                         For more information about slideshows, see\n                         \n                          Sharing Content Using Slideshows\n                         \n                         .\n                        \n\n\n\n                         Buzz\n                        \n\n                         When you select\n                         \n                          Buzz\n                         \n                         in the sub-tab menu, you can configure global options for Buzz in your Domo instance. You can also see activity indicators showing you the number of Buzz messages sent and users for this week compared to last week.\n                        \n\n                         Options you can configure in this tab include the following:\n                        \n\n\n\n\n                            Enable company-wide General channel\n                           \n                           . When this box is checked, a \"General\" conversation is available for all users of Buzz in your instance.\n                          \n\n\n\n                           Default all conversations around Domo data to private\n                          \n                          . When this box is checked, the conversations on Domo data will be set to private.\n                         \n\n\n\n                            Allow all users to invite Social users\n                           \n                           . When this box is checked, anyone in your Domo can invite users to Domo as Social users. For more information, see\n                           \n                            Inviting Others to Join Domo\n                           \n                           .\n                          \n\n\n\n\n\n\n                         The\n                         \n                          Buzz\n                         \n                         sub-tab appears in your\n                         \n                          Admin Settings\n                         \n                         Page only if you have an \"Admin\" default security role or a custom role with the \"Edit Conversations and Messages\" privilege enabled. For more information about default security roles, see\n                         \n                          Managing Roles\n                         \n                         .\n                        \n\n                         For more information about Buzz, see\n                         \n                          Buzz Layout\n                         \n                         .\n                        \n\n\n\n                         Connectors\n                        \n                        The\n                        \n                         Connectors\n                        \n                        page allows you to grant and revoke access to power up Connector DataSets. For more information, see our\n                        \n                         Connector Permissioning in Domo\n                        \n                        article.\n                        \n\n\n                         More\n                        \n\n                         The More tab contains the following sub-tabs:\n                        \n\n\n\n                           Manage easy links\n                          \n\n\n\n                           Exporting data\n                          \n\n\n\n                           Alert Actions\n                          \n\n\n\n                           Tool Downloads\n                          \n\n\n\n\n\n                         Manage Easy Links\n                        \n\n                         The Manage easy links sub-tab lets you share easy links with team members so they immediately start collaborating with you over Buzz. For more information, see\n                         \n                          Inviting Others to Join Domo\n                         \n                         .\n                        \n\n\n\n                         Exporting Data\n                        \n\n                         The Exporting data sub-tab lets you enable or disable Excel formulas before exporting Domo data.\n                        \n\n\n\n                         Alert Actions\n                        \n\n                         The Alert Actions sub-tab allows you to enable Alert actions, which allow users to use an Alert trigger event to automatically take action in a third party application via webhook or API. These actions may transmit data from the Card or DataSet that the Alert is set on to the third party application. Disabling Alert actions will prevent users from creating Alert actions and will disable any currently functioning actions in Domo.\n                        \n\n\n\n                         Tool Downloads\n                        \n\n                         When you select\n                         \n\n                           Tool Downloads\n                          \n\n                         in the sub-tab menu, a panel appears on the right with information about tools you can download. Currently, you can choose between the following tools:\n                        \n\n\n\n                           Workbench 5\n                          \n\n\n\n                           Workbench 5.1\n                          \n\n\n\n\n                            Domo ODBC Driver 1.0\n                           \n\n\n\n\n\n                            Domo PowerPoint Plugin\n                           \n\n\n\n\n\n                            Domo Excel Plugin\n                           \n\n\n\n\n                           Domo Word plug-in\n                          \n\n\n\n                           Domo CLI\n                          \n\n\n\n                           Domo Google Sheets add-on\n                          \n\n\n                        Watch the video below for an overview of the Admin Settings.\n                        \n\n\n                           Video - Admin Settings Overview", "Preview Article": "Click here to preview", "URL Name": "360042934234", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003010", "Archived Date": "", "Language": "English", "Primary Version": "Admin Settings Overview", "Article Total View Count": "6,232", "": "", "Article Created Date": "10/24/2022, 8:59 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Admin Settings Overview\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Admin Settings Overview\n              \n", "url": "/s/topic/0TO5w000000Zan4GAC"}]}