{"file_path": "../../raw_kb_v2\\article\\4403089503383\\index.html", "content": {"Title": "Creating Segments in Analyzer", "Article Body": "Intro\n                       \n\n                        The Segments feature allows you to create better comparisons of a Segment versus another group. It also allows you to dynamically filter one item and not have the filter impact the Segment so that you can compare the two results. You can add a Segment to any multi-series chart, period over period chart, or multi-value chart. You can also add Segments to the Card Details view of a Card and to Dashboards.\n                       \n\n\n                         Video - Segments\n                        \n\n\n\n\n\n\n\n\n\n                        Parts of the Segment Creation Window\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Segment name\n                          \n\n\n                            Add the name of the Segment.\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               Ensure that the name of the Segment matches the item you are filtering in your data. For example, if you are selecting where the Product column equals \"Toys\" then you would name the Segment Toys. Otherwise, your chart will display both the original data for \"Toys\" and the new Segment for \"Toys\" instead of the Segment replacing the existing data for \"Toys\".\n                              \n\n\n\n\n\n\n\n                           Description\n                          \n\n                           Add an optional description of what the Segment contains.\n                          \n\n\n\n                           Filter columns to create a segment\n                          \n\n                           Add the columns that define the Segment. These will filter the Segment.\n                          \n\n\n\n                           Do not filter this segment by the following columns\n                          \n\n                           Add columns that will not filter the Segment.\n                          \n\n\n\n                           Segment Color Rules - Card Color\n                          \n\n\n                            Choose what color the Segment value will show on the chart. The color selected will only display on this specific Card.\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               If a Card Color is selected it will override the DataSet Color.\n                              \n\n\n\n\n\n\n\n                           Segment Color Rules - Dataset Color\n                          \n\n                           Choose what color the Segment value will show on the DataSet. The Segment will always display this unless a Card Color has been set.\n                          \n\n\n\n                           Segment preview\n                          \n\n                           This will display the columns defined in the Segment.\n                          \n\n\n\n\n                        Creating a Segment\n                       \n\n\n                         Open a Card in\n                         \n                          Analyzer\n                         \n                         .\n                        \n\n                         Select the\n                         \n                          Add Dynamic Segment\n                         \n                         button under the Dimensions and Measures OR select\n                         \n                          Segments\n                         \n                         from the Analyzer Toolbar.\n                        \n\n                         Enter the\n                         \n                          Segment name\n                         \n                         .\n                        \n\n                         (Optional) Enter a\n                         \n                          Description\n                         \n                         of the Segment. This will help users to determine what Segments they should use if there are multiple on the DataSet.\n                        \n\n                         Click the\n                         \n                          +\n                         \n                         icon and add the column that you want to filter the Segment to the\n                         \n                          Filter columns to create a segment\n                         \n                         section.\n                        \n\n                         Select the value in the column that you wish to filter the Segment by and click\n                         \n                          Apply\n                         \n                         .\n                        \n\n                         Repeat steps 5 and 6 until all of the desired columns are added.\n                        \n\n                         Click the\n                         \n                          +\n                         \n                         icon and add the column that you do not want to filter the Segment to the\n                         \n                          Do not filter this segment by the following columns\n                         \n                         section.\n                        \n\n                         Repeat step 8 until all of the desired columns are added.\n                        \n\n                         (Optional) Select either a\n                         \n                          Card Color\n                         \n                         or a\n                         \n                          Dataset Color\n                         \n                         to apply to the Segment.\n                        \n\n                         Click\n                         \n                          Save & Close\n                         \n                         to save the Segment.\n                        \n\n\n                        Below is an example Segment that was used in the corresponding screenshots:\n                        \n\n\n\n\n\n\n                        Using a Segment in a Card\n                       \n\n\n                         Open a Card in\n                         \n                          Analyzer\n                         \n                         .\n                        \n\n                         Select an existing Segment from the list of columns under the\n                         \n                          Beast Modes & Segments\n                         \n                         section OR create a new Segment by following the steps in the\n                         \n                          Creating a Segment\n                         \n                         section.\n                        \n\n                         Drag the Segment to the\n                         \n                          Segments\n                         \n                         section next to the Series in the Card.\n                         \n\n\n\n\n\n\n                         Repeat steps 2 and 3 until all the desired Segments are added.\n                        \n\n\n                          Save\n                         \n                         the Card.\n                        \n\n\n                        Using a Segment in the Card Details view of a Card\n                       \n\n\n                         Select the\n                         \n                          Segments\n                         \n                         tab from the menu on the right-hand side of the chart.\n                        \n\n                         Select the Segment(s) you want applied to the Card. If you hover over the Segment name, and there is a Description entered for the Segment, it will be displayed. Up to three Segments can be selected at a time.\n                         \n\n\n\n\n\n                        Using a Segment on a Dashboard\n                       \n\n\n                         Click the Filter icon\n                         \n                         if the Filter Bar is not currently displayed on the Dashboard.\n                        \n\n                         Click the\n                         \n                          Segments\n                         \n                         dropdown menu.\n                         \n\n\n\n\n\n\n                         Select the Segment(s) you want applied to the Dashboard. If you hover over the Segment name, and there is a Description entered for the Segment, it will be displayed.\n                         \n\n\n\n\n\n\n                         Click\n                         \n                          Apply\n                         \n                         .\n                        \n\n\n                        FAQ's\n                       \n\n\n                         Segments are saved to the DataSet. If a DataSet that has Segments is used on a Dashboard, then the Segments option will display.\n                        \n\n                         There can be up to 20 Segments saved to a DataSet.\n                        \n\n                         You can disable Segments on Dashboards by going to the Filter Options and toggling off Segments for that Dashboard.", "Preview Article": "Click here to preview", "URL Name": "4403089503383", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004622", "Archived Date": "", "Language": "English", "Primary Version": "Creating Segments in Analyzer", "Article Total View Count": "6,594", "": "", "Article Created Date": "10/24/2022, 10:17 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Creating Segments in Analyzer\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Analyzer\n              \n", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}