{"file_path": "../../raw_kb_v2\\article\\5428851518999\\index.html", "content": {"Title": "Brand Kit", "Article Body": "Intro\n                       \n\n                        Domo Brand Kit is a collection of tools and features that help you craft a Domo experience for your users that is consistent with your internal and external branding.\n                       \n\n                        You can do the following with Brand Kit:\n                       \n\n\n                         Style your interface to match brand guidelines​.\n                        \n\n                         Customize experiences for your target audience.\n                        \n\n                         Domo Everywhere users can match published content to the surrounding colors on the host page for more cohesive external experiences​.\n                        \n\n                       This article provides information on Brand Kit in the following topics:\n                       \n\n\n                          Prerequisites\n                         \n\n\n\n                          Login backgrounds\n                         \n\n\n\n                          Chart color palettes\n                         \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        Brand Kit is a premium Domo feature. You need to have it enabled for your organization before the tool displays in your interface. Contact your Customer Success Manager (CSM) for more information.\n                       \n\n                        Brand Kit Tools\n                       \n\n                        The Brand Kit tools include login backgrounds, chart color palettes, and other features in development.\n                       \n\n\n\n                        Login Backgrounds\n                       \n\n                        Brand Kit allows you to customize the background image or color shown when logging into your organization within Domo.\n                       \n\n\n\n\n                        Follow these steps to customize your own login experience:\n                       \n\n                        1. From the navigation header, go to\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                       \n\n                        2. Select\n                        \n\n                         Brand Kit\n                        \n                        in the side rail.\n                       \n\n\n\n\n                        3. In\n                        \n                         Settings\n                        \n                        , select a radio button to set a solid\n                        \n                         Color\n                        \n                        or\n                        \n                         Image\n                        \n                        as the login background.\n                       \n\n\n                         If you choose\n                         \n                          Color\n                         \n                         , select the field displaying a HEX color code and choose a preset color or enter your own HEX code.\n                         \n\n\n\n\n                         If you choose\n                         \n                          Image\n                         \n                         , select\n                         \n                          Choose Image\n                         \n                         to browse for an image to upload.\n                         \n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The image must be smaller than 2 MB and in either JPG or PNG format.\n                            \n\n\n\n\n\n\n                        You have successfully customized the login background.\n                       \n\n\n\n                        Chart Color Palettes\n                       \n\n                        Brand Kit Chart Colors allows you to set custom color palettes to use with your charts, helping to create a default look that is consistent with your branding.\n                       \n\n                        Follow these steps to customize your color palettes:\n                       \n\n                        1. From the navigation header, go to\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                       \n\n                        2. In the left rail, select\n                        \n\n                         Brand Kit\n                        \n                        .\n                       \n\n                        3. Select\n                        \n                         Chart Colors\n                        \n                        .\n                       \n\n                        4. Select\n                        \n                         New Palette\n                        \n                        .\n                        \n                        The\n                        \n                         Color Creator\n                        \n                        displays.\n                       \n\n\n\n\n\n\n                        5. In the\n                        \n                         Color Creator\n                        \n                        , follow the steps in the UI. You can preview all selections in Step 5: Review colors.\n                       \n\n\n                         Step 1: Choose main hue.\n                         \n                          In this step, you select the main hues in your color palette. You can enter a HEX code. Color Creator automatically gives you a gradient of nine evenly spaced steps from your chosen hue.\n                         \n\n\n                          The default palette includes Blues. You can delete this default hue by selecting\n                          \n\n\n\n                           Remove\n                          \n\n                           . A dialog displays, confirming removal.\n                          \n\n\n\n\n\n                          You can edit the name of the hue by selecting\n                          \n\n\n\n                           Edit.\n                          \n\n\n\n                         (Optional) Step 2: Choose indicator colors\n                         \n                         Choose the Negative, Warning and Positive colors indicators to use in your charts.\n                         \n\n\n                         (Optional) Step 3: Choose categorical color pattern\n                         \n                         Select the colors from your palette for use in bar and line charts.\n                         \n\n\n\n\n                         (Optional) Step 4: Choose 'Period over Period' color pattern\n                         \n                         Choose which of your colors to use for indicating different time periods.\n                        \n\n                         Step 5: Review colors\n                         \n                         Preview the palette and confirm accessibility by dragging the slider to simulate multiple series.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The colors in the charts in step 5 are pulled from the preview in step 3, moving from left to right, as you can see in the above screenshots.\n                            \n\n\n\n\n\n\n                        6. When you finish creating your palette, select\n                        \n                         Save\n                        \n                        .\n                       \n\n\n\n\n                        7. Return to\n                        \n                         Chart Colors\n                        \n                        in the left navigation.\n                       \n\n                        8. Locate and activate your new color palette by selecting its radio button in Chart Colors.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Activating the color palette applies it to all charts in the instance, but color rules at the card level still take precedence.", "Preview Article": "Click here to preview", "URL Name": "5428851518999", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003007", "Archived Date": "", "Language": "English", "Primary Version": "Brand Kit", "Article Total View Count": "6,014", "": "", "Article Created Date": "10/24/2022, 8:59 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Brand Kit\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Admin Settings Overview\n              \n", "url": "/s/topic/0TO5w000000Zan4GAC"}]}