{"file_path": "../../raw_kb_v2\\article\\360043436913\\index.html", "content": {"title": "\n\n\n Box Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nBox is a cloud content management and file sharing service for businesses. Use this connector to export data from a Domo DataSet into your Box account. To learn more about the Box API, visit their website. (\n\nhttps://developers.box.com/\n\n)\n\n\n You export Domo data to Box in the Data Center. This topic discusses the fields and menus that are specific to the Box Writeback connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nPrerequisites\n---------------\n\nTo configure this connector, you must have a Domo Client ID and Client Secret. To obtain these credentials, do the following:\n\n. Log into your Domo developer account at\n\nhttps://developer.domo.com/login\n\n.\n2. Create a new client\n\n.\n3. Select the desired data and user application scope.\n4. Click\n ****Create****\n .\n\nYou must also have the email address and password for your Box account.\n\n\n Configuring the Connection\n----------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Box Writeback Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\nThis pane contains fields for entering credentials to connect to your Domo developer account.\n\nThe following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Domo Client ID\n  |\n Enter your Domo client ID.\n  |\n|\n Domo Client Secret\n  |\n Enter your Domo client secret.\n  |\n\nFor information about obtaining these credentials, see \"Prerequisites,\" above.\n\n\n After you connect, you are taken to the Box OAuth screen where you are prompted to enter your Box email address and password.\n\n\n You can use the same account any time you go to set up a new Domo-Box connection.\n\nYou can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n File Upload Criteria\n  |\n Select the Box directory in which you want to upload your file.\n  |\n|\n Folder\n  |\n Select the Box folder in which you want to store your file.\n  |\n|\n Input DataSet ID\n  |\n Enter the DataSet ID (GUID) for the DataSet you want to copy to Box. You can find the ID by opening the details view for the DataSet in the Data Center and looking at the portion of the URL following datasources/. For example, in the URL\n\nhttps://mycompany.domo.com/datasources/845305d8-da3d-4107-a9d6-13ef3f86d4a4/details/overview\n\n, the DataSet ID is\n\n845305d8-da3d-4107-a9d6-13ef3f86d4a4\n\n.\n  |\n|\n Select Filename\n  |\n Select whether you want to reference your DataSet using the\n ****Input DataSet ID****\n or an output file name.\n  |\n|\n Filename\n  |\n Enter the output file name for your data.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQ\n-----\n\n\n####\n What do I do if I just uploaded a file to\n\nbox.com\n\n, but the Box connector says the file does not exist when I try to pull in the file?\n\nMake sure all your connector settings match your file and free of typos. Files may not be available via the Box API up to 30 minutes after the file was uploaded. Ensure the file has been in Box for at least 30 minutes, and then attempt to run the DataSet again.\n\n\n Many users have also reported that they still cannot find a file using the search field in Box even after the file has been in Box for 30 minutes. This issue stems from a problem with Box's Search API. It means that your account has not yet been synced with the most recent files and is not available through the API.\n\n###\n What do I do if I can’t connect to\n\nbox.com\n\nwith valid credentials?\n\nThis problem might stem from an issue with your option settings in Box. Domo is an unpublished application in\n\nbox.com\n\nterminology, and one of the options Box gives to its users is to disable unpublished applications by default. Therefore, if a customer is using this option, Domo users may not be able to authenticate or connect to Box to import data from Box to Domo.\n\n\n Box gives customers the option to allow any unpublished application to use a customer's Box instance, which appears to be what most customers have enabled in their Box account settings. Some customers do not want to enable all unpublished applications but would like to enable Domo to use Box. In this case, there is also an option Box provides to allow exceptions. To enable an exception for Domo, Domo's public API key for Box needs to be added to the exception list.\n\n\n The public API key for Domo at Box is: wmiawbgvombfafa0jj4dgvmvq5ivq83m.\n\n###\n What is the difference between the Box connector and the Box Advanced connector?\n\nThe Box connector allows you to specify the name and type of the file to pull the data from. The Box Advanced connector offers an additional advanced section to specify the data formatting details, along with the name and type of the file.\n\n###\n Can I use the same Box account for multiple DataSets?\n\nYes.\n\n###\n How frequently will my data update?\n\nAs often as required.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436913\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004051\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nBox Writeback Connector\n\n", "article_total_view_count": "\n\n\n 4,926\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "box_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}