{"file_path": "../../raw_kb_v2\\article\\360042931654\\index.html", "content": {"title": "\n\n\n Amazon Redshift Upsert Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAmazon Redshift is a hosted data warehouse project that is part of the larger cloud computing platform Amazon Web Services. Redshift handles analytics workloads on large scale DataSets stored by a column-oriented DBMS principle. With the Amazon Redshift Upsert Connector you have the ability to schedule your data using the merge (upsert) option.\n\n\n You connect to your Amazon Redshift Upsert Account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon Redshift Upsert connector interface. General information for adding DataSets and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to Amazon Redshift so you can begin creating Amazon Redshift Upsert DataSets, you must have the following:\n\n JDBC Driver\n* The host name for the Redshift database\n* The database name for the Redshift database\n* Your Redshift username and password\n* The port number of your Redshift database\n* The format of your certificate. This must match what you enter in the Certificate field.\n* The text for your CA certificate or enter the URL where your certificate is located. By default, no certificate is required.\n\n\n###\n Whitelisting\n\nBefore you can connect to a Redshift database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses for Connectors\n\n.\n\n\n Connecting To Your Amazon Redshift Upsert Account\n---------------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Amazon Redshift Upsert Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Amazon Redshift Upsert account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n JDBC Driver\n  |\n Select the JDBC driver to use.\n  |\n|\n Host\n  |\n Enter the host name for the SQL database. If you do not know the host name, contact your Amazon Redshift Database Administrator.\n  |\n|\n Database\n  |\n Enter the name of the SQL database. If you do not know the database name, contact your Amazon Redshift Database Administrator.\n  |\n|\n Username\n  |\n Enter your Redshift username. If you do not know your username, contact your Amazon Redshift Database Administrator.\n  |\n|\n Password\n  |\n Enter your Redshift password. If you do not know your username, contact your Amazon Redshift Database Administrator.\n  |\n|\n Database Port\n  |\n Enter the port number of your Redshift database. If you do not know the port number, contact your Amazon Redshift Database Administrator.\n  |\n|\n Certificate Format\n  |\n Select a certificate format. This must match what you enter in the\n **Certificate**\n field. If you are not aware of a special certificate, select no certificate.\n  |\n|\n Certificate\n  |\n Paste the text for your CA certificate or enter the URL where your certificate is located. By default, no certificate is required.\n  |\n\nOnce you have entered valid credentials, you can use the same account any time you go to create a new Amazon Redshift Upsert DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains various options for specifying the data you want to pull into Domo\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Query Type\n  |\n Select a query type\n\n\n**Query**\n : Regular SQL query without parameters.\n\n\n**Query Parameter**\n : SQL query with parameters.\n  |\n|\n Query\n  |\n Enter the SQL query to use in selecting the data you want. For example,\n `SELECT * FROM Employee`  |\n|\n Fetch Size\n  |\n Enter the fetch size for memory performance. If it is blank, the default value will be 1000. If it throws out of memory for a value, decrease fetch size.\n  |\n|\n Query Parameter\n  |\n Enter the query parameter value. It is the initial value for query parameter. The last run date is optional and by default is '02/01/1700' if it is not provided. For example,\n `!{lastvalue:_id}!=1,!{lastrundate:start_date}!=02/01/1944`  |\n|\n Validate Type\n  |\n Select the validation type\n\n\n**No Validation**\n : It will not do any validation.\n\n\n**Validate Schema**\n : It will validate the previous schema with current schema, and it will fail the job run if the schema is not the same.\n  |\n|\n Validate By\n  |\n Select the validation cases\n\n\n**Column Case Sensitive**\n : If previous and current column names are the same but it is different by case sensitivity, it will not consider them as the same column name.\n\n\n**Column by Order**\n : If previous columns and current columns are not in the same order, it will not consider them as the same column name.\n  |\n|\n Boolean Format\n  |\n Select the boolean format for the data to return\n\n\n**1 = true, 0 = false**\n : It will return 1 for true, otherwise 0 for all the boolean data column.\n\n\n**t = true, f = false**\n : It will return t for true, otherwise f for all the boolean data column.\n\n\n**T = true, F = false**\n : It will return T for true, otherwise F for all the boolean data column.\n\n\n**true = true, false = false**\n : It will return true for true, otherwise false for the boolean data column.\n  |\n|\n Timeout Query (Optional)\n  |\n Enter the desired query timeout value.\n  |\n\n\n###\n Scheduling\n\nThe unique scheduling feature of this connector is the ability to merge (upsert) your data. This method will replace all updated rows, while any new rows will be appended.\n\nTo be able to Merge your updated data correctly, you must identify a Merge Key in your data. A Merge Key can be your primary key or a combination of columns that is unique in the DataSet and will be used to compare rows between different versions of your DataSet. You can use a\n\nCONCAT()\n\nfunction in the\n\nSELECT\n\nstatement to establish a complex Merge Key. If you are unsure where the Merge Key is for this DataSet, please consult the DBA who owns the database or your Domo Administrator.\n\n##\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure standard scheduling options, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931654\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003896\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon Redshift Upsert Connector\n\n", "article_total_view_count": "\n\n\n 4,727\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "amazon_redshift_upsert_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}