{"file_path": "../../raw_kb_v2\\article\\360042934374\\index.html", "content": {"title": "\n\n\n Understanding and Configuring Domo Single Sign-On Using SAML\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Users can sign in to\n\n\n Domo\n\n\n using either the built-in authentication system of\n\n\n Domo or using a Single Sign-On (SSO) solution from a supported provider.  Domo provides two such SSO solutions—Security Assertion Markup Language (SAML) authentication and OpenID Connect. Both SAML and OIDC Connect can run at the same time. This makes it easy to segment internal and external users. This is also useful for separating the SSO solutions you use for Domo access and\n\nEnabling SSO with OpenID Connect\n\n.\n\nUsing SAML, administrators can enable Single Sign-On into Domo. Once Single Sign-On has been enabled, new users are automatically provisioned from LDAP, and LDAP groups can be imported from an existing identity provider.\n\n\n To use SAML, you must have a cloud identity provider (IDP) or federation service in place that supports authentication via SAML 2.0. For more information about SAML 2.0, see\n\nhttp://en.m.wikipedia.org/wiki/SAML\\_2.0\n\nYou can add specific users to the Direct Sign-On List to enable them to bypass SSO and sign into Domo directly. These users can then toggle login modes (Direct or Single Sign-On) from the Domo login screen. This is especially useful in situations where you want to grant Domo access to contractors or non-employees who are not given accounts in the company’s email or directory system.\n\n\n You must have an \"Admin\" default security role or a custom role with \"Manage All Company Settings\" enabled to set up SAML. For more information about default roles, see\n\nManaging Custom Roles\n\n.\n\n\n Domo provides three methods of setting up SSO:\n\n **Manual Setup**\n . This is the \"traditional\" method for setting up SSO in Domo.\n* **Metadata Upload**\n . This method allows you to retrieve your configuration information and digital certificate just by entering the URL for your identity provider. Be aware that not all identity providers offer this service.\n* **Setup Wizard**\n . This wizard guides you through the difficult jargon and details of SSO configuration. The wizard offers context-based instructions for a number of leading identity provider services, including Okta, Ping, Microsoft Azure, Salesforce, and more.\n\nOf these methods, metadata upload is strongly recommended, as you only need to enter your identity provider URL—the rest of the work is done automatically. If this method is not supported by your identity provider, it is recommended you use the setup wizard. Manual setup is recommended only if neither of the other two methods meet your needs.\n\n\n This topic first explains the components of the Single Sign-On tab user interface in Domo. It then gives provides instructions for configuring SSO using the three available methods.\n\n\n**Notes:**\n\n Enabling SSO turns off the traditional Domo login. Users should typically be assigned to the application in your IDP before SSO is enabled to avoid interruption.\n* Once SSO is enabled, invited users may need to be assigned to Domo in the identity provider before they can sign in (depends on company IDP policies).\n* If SSO is enabled but you are unable to log in, you can log in with prior Domo credentials by going to\n **https://<subdomain>.domo.com/auth/index?domoManualLogin=true**\n . You must have an \"Admin\" default security role, a custom role with \"Manage All Company Settings\" enabled, or be on the Direct Sign On list to use this manual login. For more information about default roles, see\n\nManaging Custom Roles\n\n.\n* You can disable SSO at any time. This turns on the traditional email and password login. Users who had existing logins can use their old passwords or reset their passwords from the login page. Users with \"Admin\" security roles can also manually reset user passwords by going to the\n **People**\n sub-tab for the specific individual in Admin Settings and clicking\n **Reset Password**\n .\n* Users of the Domo Mobile application can log in to Domo by entering their company's subdomain, then entering their IDP username and password in the web view. SP initiated authentication is required for the Mobile App to work with SSO.\n* When SSO is turned on, it is not possible to directly change a user’s email address, even if you have an \"Admin\" default security role. This is because the email is the key used to match users logging in from SSO with users inside Domo. Changing it would cause the person to have a new user the next time they sign in, and all of their permissions would be lost. If you absolutely\n *must*\n change a user's email address (for example, perhaps a user gets married and their last name changes), the best way to do so is by using the\n **Bulk Import**\n option in the\n **More >**\n**Admin > Governance > People**\n sub-tab. For more information, see\n\nAdding Users to Domo\n\n.\n\n\n**Video - SAML Single Sign On (SSO)**\n\n\n Parts of the Single Sign-On tab\n----------------------------------\n\n\n The following table lists and describes the various components of the\n **More >**\n**Admin > Authentication > SAML (SSO)**\n tab in Domo:\n\n\n Component\n  |\n Description\n  |\n| --- | --- |\n|\n Revert All\n  |\n Reverts your SSO configuration back to the most recently saved settings.\n  |\n|\n Save Config\n  |\n Saves the current configuration.\n  |\n|\n Test Config\n  |\n Tests the current configuration.\n  |\n|\n Wizard option\n  |\n Opens the SSO configuration wizard. You can also open the wizard by clicking\n **Start Setup > Wizard**\n in the intro screen. (The intro screen only appears if you have not yet set up SSO.)\n  |\n|\n Manual Setup, Direct Sign-On List, and Attributes Tabs\n  |\n Provide access to different sections of the SSO screen.\n * **Manual Setup**\n . The tab open by default when you open the SSO screen (shown in the above screenshot). Here you can enter information from and for your IdP as well as specify a number of advanced settings.\n* **Direct Sign-On List**\n . Allows you to enable specific users to bypass SSO and sign into Domo directly.\n\nThese users can then toggle login modes (Direct or Single Sign-On) from the Domo login screen.\n* **Attributes**\n . Lists the attributes and formats accepted by Domo.\n |\n|\n Enable SSO\n  |\n The \"master switch\" for toggling SSO on or off in your instance.\n  |\n|\n \"Information from your IdP\" section\n  |\n Contains fields and options for information you will need to obtain from your identity provider and enter into Domo. These fields and options are as follows:\n - **Metadata Upload**\n . Allows you to retrieve your configuration information and digital certificate just by entering the URL for your identity provider. Be aware that not all identity providers offer this service. (If you click this link, the text changes to \"Manual entry.\" Click this if you want to configure SSO using manual entry.)\n- **Identity Provider Endpoint URL**\n . The URL where your SAMLRequest is sent. This URL is provided by your IDP or federation service.\n- **Entity ID**\n . The unique identifier of the Domo instance making the SAMLRequest. This is sometimes provided by the IDP as an \"Issuer ID\" or \"Identity ID\" and is usually in the format of a URL. This value is also referred to as the “SP Entity ID.” This field may not be needed in all configurations; in this case it can be left blank. Examples are given when you click the\n\nicon.\n- **X.509 Certificate**\n . The certificate that is signed by the identity provider and establishes trust between Domo and the IDP. This certificate is always issued by the IDP and is uploaded into Domo.\n\n*Note:**\n If you are using Google Chrome, the certificate needs to be in\n\n.pem\n\nformat. If you have a certificate in\n\n.cert\n\nformat, rename the file to include a\n\n.pem\n\nextension and upload it.\n\n|\n|\n \"Information your IdP may need\" section\n  |\n Contains fields and options for information you may need to enter into your identity provider. These fields and options are as follows:\n * **Metadata download**\n . Allows you to download an XML file that can then be uploaded to your IdP to complete your configuration. Be aware that not all identity providers offer this service.\n* **SAML Assertion Endpoint URL**\n . The endpoint where the IDP sends the SAML Request. You must copy and paste this URL into your identity provider to complete the setup. In some cases, you may only be required to enter your subdomain (for example, \"acmecorp\") in the IDP.\n* **Sign authentication requests**\n . Lets you sign authentication requests for Service Provider-initiated SSO. To enable this, you will need to...\n\n1. Download Domo's signing certificate. (A link appears when you check the\n\t **Sign authentication request**\n\t box.)\n\t2. Install the certificate at your IDP.\n\t3. Wait for confirmation from your IDP on the install.\n\t4. Click\n\t **Save**\n\t to begin signing authentication requests.\n |\n|\n Advanced Settings\n  |\n These settings are as follows:\n + **Only invited people can access Domo**\n . Limits access to Domo to only those invited to join Domo.\n\n*Note:**\n If you do not check this box, users will be created with the default security role of Priviliged. It is recommended that you change the default security role to Participant if you choose to let uninvited people access Domo. For more information, see\n\nDefault Security Role Reference\n\n.\n+ **On logout, direct users to the following URL:**\n Lets you specify a URL to redirect users to when they log out of Domo.\n+ **Use SAML Relay State to redirect**\n . Lets you use the SAML Relay State parameter to deep-link to specific Domo content. This is sometimes useful when you need to embed a number of cards on the same page. (See Sharing Cards Outside of Domo for more information.) However, not all IDPs support this option.\n+ **Import Groups from Identity Provider**\n . Allows Domo to import group membership data from the SAML assertion into Domo. These imported groups appear as “Directory Groups” in your “Groups” page, and can be used just like groups created in Domo. Because these groups come from your IDP, they cannot be edited in Domo. For this feature to be used, \"group\" must be passed as an attribute from your IDP.\n\n*Note:**\n For a group to be added to Domo from your IDP, a user needs to be a member of the group and sign in. This will add the directory group to Domo\n+ **Show Domo sign-in screen/Skip to identity provider**\n . Determines whether Domo's sign-in screen is shown or if the identity provider is shown instead.\n* **Note:**\n If \"Skip to identity provider\" is selected, users who are on the Direct Sign-On List will need to use the following URL in order to login with their Direct Sign-On credentials:\n\nhttps://<subdomain>.domo.com/auth/index?domoManualLogin=true\n* **Mixed Mode Login**\n . Allows the use of SSO for automating logins for the Embed feature set without changing the current user login experience. With this option selected, a user navigating to <instance>.\n\ndomo.com\n\nwill see the normal username/password sign-in options, not the SSO sign-in button.\n |\n\nConfiguring Single Sign-On\n----------------------------\n\nYou can configure Domo SSO using any of these methods:\n\n **Metadata Upload**\n .\n *Recommended*\n . Allows you to retrieve your configuration information and digital certificate just by entering the URL for your identity provider. Be aware that not all identity providers offer this service.\n* **Setup Wizard**\n .\n *Recommended if metadata upload is not supported by your IdP*\n . This wizard guides you through the difficult jargon and details of SSO configuration. The wizard offers context-based instructions for a number of leading identity provider services, including Okta, Ping, Microsoft Azure, Salesforce, and more.\n* **Manual Setup**\n . This is the \"traditional\" method for setting up SSO in Domo.\n\n\n###\n Metadata Upload\n\nMetadata upload is highly recommended for setting up Domo SSO, as it allows you to pull in all necessary information simply by entering your IdP's URL. If your IdP does not support this option, it is recommended you use the Setup Wizard as a next resort.\n\n\n**To set up SSO using Metadata Upload,**\n\n. Select\n **More**\n**> Admin > Authentication > SAML (SSO)**\n .\n\n\n If SSO has not yet been set up for your Domo, an intro screen appears listing the benefits of SSO. Otherwise, you are taken directly into the\n **Single Sign-On (SSO)**\n tab.\n2. (Conditional) Do one of the following:\n\n* If the intro screen appears, scroll to the bottom, click\n\t **Start Setup**\n\t , then click the\n\t **Metadata upload**\n\t tile.\n\t* If you are taken directly to the\n\t **Single Sign-On (SSO)**\n\t tab, click\n\t **Metadata upload**\n\t (found in the \"Information from your IdP\" section).\n3. In the\n **Metadata URL**\n field, enter the SAML metadata URL for your identity provider.\n\n\n###\n Setup Wizard\n\nThe SSO setup wizard is recommended if your identity provider does not support Metadata Upload as described in the preceding section.\n\n\n**To set up SSO using the Setup Wizard,**\n\n. Select\n **More**\n**> Admin > Authentication > SAML (SSO)**\n .\n\n\n If SSO has not yet been set up for your Domo, an intro screen appears listing the benefits of SSO. Otherwise, you are taken directly into the\n **Single Sign-On (SSO)**\n tab.\n2. (Conditional) Do one of the following:\n\n* If the intro screen appears, scroll to the bottom, click\n\t **Start Setup**\n\t , then click the\n\t **Wizard**\n\t tile.\n\t* If you are taken directly to the\n\t **Single Sign-On (SSO)**\n\t tab, click the bolded word \"wizard\"\n\n near the top of the tab.\n\n The Setup Wizard now opens.\n3. Follow the steps of the wizard to set up SSO in Domo.\n\n*Tip:**\n\nIf you need to close out of the wizard before you've completed your setup, don't worry—the wizard remembers the screen you ended on and will open that screen when you return.\n\n\n###\n Manual Setup\n\nTo properly implement Single Sign-On with SAML in Domo using manual setup, you must configure SSO in both your Identity Provider and in the\n **More >**\n**Admin > Authentication > SAML (SSO)**\n tab in Domo.\n\n\n**To configure Single Sign-On,**\n\n. Configure Single Sign-On for Domo in your IDP.\n\n\n Because different IDPs configure applications differently, it is best to consult the documentation for your particular IDP for setup. However, the following list explains how to configure certain SSO components that are common across most IDPs.\n\n\n|\n Component\n  |\n Instructions\n  |\n| --- | --- |\n|\n Integration Type\n  |\n Select SAML 2.0 as the Integration Type.\n  |\n|\n Application Logo\n  |\n If asked to supply an application logo, you can use the following:\n\n|\n|\n Identity Provider SSO URL\n  |\n The URL where Domo sends the SAMLRequest. Copy and paste this URL from the\n **SAML Assertion Endpoint URL**\n field in\n **More >**\n**Admin > Authentication > SAML (SSO)**\n in Domo.\n  |\n|\n Audience URI (SP Entity ID)\n  |\n Enter the URL for the intended audience.\n  |\n|\n Default Relay State\n  |\n Leave this field blank, as Domo does not use it in the app configuration.\n  |\n|\n Application Username\n  |\n Enter a user's email address as the username.\n  |\n|\n SAML Attributes\n  |\n When defining which attributes get passed to Domo, use the following names for each of the attributes. (All attribute names should be lowercase except for SAML\\_SUBJECT. The \"email\" attribute is required; all others are optional.)\n\n\n|\n Attribute Name\n  |\n Description\n  |\n Format\n  |\n| --- | --- | --- |\n|\n email\n  |\n Email\n  |\n\nsomeone@acme.com*\n\n|\n|\n email.secondary\n  |\n Email\n  |\n\nsomeone@acme.com*\n\n|\n|\n group\n  |\n Directory Groups\n  |\n*CN = Some Group, OU = Some Org, DC = Acme, DC = com*\n |\n|\n title\n  |\n Job Title\n  |\n*Product Manager*\n |\n|\n user.phone\n  |\n Personal Phone Number\n  |\n*Any format*\n |\n|\n desk.phone\n  |\n Desk Phone Number\n  |\n*Any format*\n |\n|\n name\n  |\n Full Name\n  |\n*Jon Smith*\n |\n|\n name.personal\n  |\n Personal Name (this field and the\n\nname.family\n\nfield are concatenated into\n\nname\n\n)\n  |\n*Jon*\n |\n|\n name.family\n  |\n Family Name (this field and the\n\nname.personal\n\nfield are concatenated into\n\nname\n\n)\n  |\n*Smith*\n |\n|\n\nemployee.id\n\n|\n Employee ID\n  |\n*521*\n |\n|\n hire.date\n  |\n Hire Date\n  |\n |\n|\n role\n  |\n Role\n  |\n*Instructional Designer*\n |\n|\n department\n  |\n Department\n  |\n*Engineering*\n |\n|\n timezone\n  |\n Time Zone\n  |\n |\n\n\n |\n|\n Certificate\n  |\n Download the certificate provided by the IDP. You will upload this certificate to Domo when configuring SSO in Domo.\n  |\n2. Ensure that appropriate users are given access to Domo in the IDP.\n3. In Domo, select\n **More**\n**> Admin**\n .\n\n\n The Admin Settings opens.\n4. Expand\n **Authentication**\n , then select\n **SAML (SSO)**\n .\n5. Click\n **Enable Single Sign-On**\n .\n6. In the\n **Identity Provider Endpoint URL**\n field, enter the URL where the SAMLRequest is to be sent.\n7. In the\n **Entity ID**\n field enter the identifier of the Domo instance making the SAML request. This should match the \"Audience URI\" you entered in your IDP.\n8. Upload the X.509 certificate by clicking\n\n, browsing to the certificate on your hard drive, and clicking\n **Open**\n .\n9. (Optional) If you want to automatically import groups from your IDP, check the box that reads\n **Import groups from identity provider**\n .\n10. Copy the URL from the\n **SAML Assertion Endpoint URL**\n field into the\n **Identity Provider SSO URL**\n in your IDP if you have not already done so.\n11. Click\n **Test Connection**\n to make sure everything is configured properly.\n12. Clicking\n **Test Connection**\n simulates an actual login with your credentials and verifies that the SAML Assertion was returned as expected.\n\n\n**Note:**\n The connection test does not work if you have not given yourself access to Domo in the IDP.\n13. (Optional) If you want to see the returned attributes, click\n **View Details**\n .\n14. Click\n **Save Changes**\n to enable SSO.\n\n\n This verifies that the test connection was successful and turns on SSO for your environment.\n15. Sign out of Domo, close your browser, and clear your browser cookies (or open a different browser).\n\n\n If you sign out and then sign back in without clearing cookies, a session token issue occurs that causes an error.\n\nAdding Users to Direct Sign-On\n----------------------------------\n\nYou can add specific users to the Direct Sign-On List to enable them to bypass SSO and sign into Domo directly. These users can then toggle login modes (Direct or Single Sign-On) from the Domo login screen. This is especially useful in situations where you want to grant Domo access to contractors or non-employees who are not given accounts in the company’s email or directory system.\n\n\n**To add users to the Direct Sign-On List,**\n\n. In\n **More >**\n**Admin > Authentication > SAML (SSO)**\n , click the\n **Direct Sign On List**\n header then the\n **Add Users to Direct Sign-On**\n button.\n2. Click in the\n **Search Users**\n field and locate the name of a user or group you want to add to the Direct Sign-on List.\n3. Click the name of the user or group to add it to the field.\n4. Repeat steps 2 and 3 as often as necessary to add the names of all desired users and groups to the field.\n5. (Optional) Add notes to the\n **Notes**\n field indicating why these users were added to the Direct Sign-On List.\n6. Click\n **Add**\n .\n\nThe names of all of the users and groups you added should now appear in a list in this tab. If you added any notes, these should appear as well. You can remove a user or group from the list by clicking the \"X\" next to it.\n\n\n**Note:**\n All Admin users in the instance can log in using the Direct Sign-On method without being added to the Direct Sign-On list. However, there must be at least one user in the Direct Sign-On List before the \"Use Direct Sign-On\" option will be shown during login.\n\n\n Transitioning to Single Sign-On\n---------------------------------\n\nIf you are transitioning from the built-in authentication system of Domo to Single Sign-On, consider the following:\n\n Before implementing Single Sign-On, ensure that the email addresses for accounts in Domo match the email addresses for accounts in your system.\n* When users sign in, Domo can identify users based only on their existing email addresses.\n* If a user logs in via Single Sign-On and the email address does not match the email address of an existing account, Domo creates a new account. For this account you must configure group memberships and content access.\n\nUsing Single Sign-On in Domo\n------------------------------\n\nWhen using Single Sign-On (SSO) in Domo, users sign in and sign out differently than when using the built-in authentication system of Domo.\n\n##\n Signing in to Domo when using Single Sign-On\n\n\n* If authenticated to their system, users can connect to Domo using their existing credentials.\n\n\n Depending on the type of directory, operating system, and Web browser, users may not have to provide credentials but are seamlessly signed in.\n* If not yet authenticated to their system when connecting to Domo, users are presented with a simple sign-in to their system before connecting in to Domo.\n\n\n###\n Signing out of Domo when using Single Sign-On\n\nTo completely sign out, you must sign out of Domo and close the Web browser.\n\n\n**To sign out of Domo when using Single Sign-On,**\n\n. Mouse over your user menu\n\n, then select\n **Sign Out.**\n\n\n After signing out, a sign in page appears.\n2. Close the Web browser.\n\n\n To complete the sign out process, close the Web browser.\n\n\n###\n Using Domo with Single Sign-On\n\nWhen using Domo with Single Sign-On, you cannot\n\n be sent a forgotten password email\n* change your password in your profile\n* see the\n **Security**\n tab for setting password requirements\n* see a user until the user has signed in to Domo\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042934374\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003044\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUnderstanding and Configuring Domo Single Sign-On Using SAML\n\n", "article_total_view_count": "\n\n\n 11,644\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:05 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "understanding_and_configuring_domo_single_signon_using_saml", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "implementing_sso", "url": "/s/topic/0TO5w000000ZanoGAC"}]}