{"file_path": "../../raw_kb_v2\\article\\8677917495959\\index.html", "content": {"Title": "Amazon Vendor Partner Connector", "Article Body": "Intro\n                       \n\n\n                         Amazon Vendor Partner Connector programmatically access the data on listings, orders, payments, reports, and more. Applications using Selling Partner API can increase selling efficiency, reduce labor requirements, and improve response time to customers, helping sellers grow their businesses. Vendor Partner API builds on the functionality of Amazon Vendor Partner Connector but provides features to improve usability and security for developers and the sellers they work with. This guide documents the Amazon Vendor Partner Connector.\n                        \n\n\n\n                         You connect to your Amazon Vendor Partner account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon Selling Partner connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n\n\n\n                         a DataSet Using a Data Connector\n                        \n\n                         .\n                        \n\n\n                        Best Practices\n                       \n\n\n                         For most reports, be conservative on date ranges. Only pull the data you need.\n                        \n\n\n                          Be prepared for some reports to take hours to complete; this is a limitation of the Amazon API.\n                         \n\n\n\n                          Be advised that years-old data takes much longer to retrieve.\n                         \n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your Amazon Vendor Partner account and create a DataSet, you must have the following:\n                       \n\n\n\n\n\n                            Parameter Name\n                           \n\n\n\n                            Where to find it\n                           \n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Credentials used to log into Seller Central\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Credentials used to log into Seller Central\n                           \n\n\n\n\n\n                        Connecting to Your\n                        \n                         Amazon Vendor Partner\n                        \n\n\n                        Account\n                       \n\n                        This section enumerates the options in the Credentials and Details panes on the Amazon Selling Partner Connector page. The components of the other panes on this page,\n                        \n\n\n                         Scheduling,\n                        \n\n\n                        and\n                        \n\n\n                         Name & Describe Your DataSet\n                        \n                        , are universal across most connector types and are discussed in greater length in\n                        \n\n\n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo\n                        \n                         Amazon Selling Partner\n                        \n                        Connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n\n                         Connect\n                        \n\n\n                        (or select\n                        \n\n\n                         Add Account\n                        \n\n\n                        if you have existing Amazon Vendor Partner accounts in Domo) to open the Amazon Vendor Partner OAuth screen where you can enter your Amazon Vendor Partner username and password. Once you have entered valid Amazon Vendor Partner credentials, you can use the same account any time you go to create a new\n                        \n                         Amazon Selling Partner\n                        \n                        DataSet. You can manage connector accounts in the\n                        \n\n\n                         Accounts\n                        \n\n\n                        tab in the Data Center. For more information about the accounts tab, see\n                        \n\n\n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n\n\n                           If you are already logged into\n                           \n                            Amazon Vendor Partner\n                           \n\n\n                           when you connect in Domo, you are authenticated automatically when you click\n                           \n\n\n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of amazon Vendor Partner.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n\n                         Report\n                        \n\n\n                        menu, along with various other fields which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the\n                            \n                             Amazon Selling Partner\n                            \n\n\n                            report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Get Catalog Items\n                               \n\n\n\n                                Retrieves details for an item in the Amazon catalog.\n                               \n\n\n\n\n\n                                Search Catalog Items\n                               \n\n\n\n                                Search for and return a list of Amazon catalog items and associated information.\n                               \n\n\n\n\n\n                                Create and Download Report\n                               \n\n\n\n                                Create an Amazon Report that is retrieved when Amazon has finished aggregating the information\n                               \n\n\n\n\n\n                                Get Report\n                               \n\n\n\n                                Retrieve the most recent version of the selected report\n                               \n\n\n\n\n\n                                List Reports\n                               \n\n\n\n                                Retrieve a list and status of reports in the queue.\n                               \n\n\n\n\n\n\n\n\n\n\n                             Country Code\n                            \n\n\n\n\n\n                             Select a Country code only for UK-EU Marketplace for others it will be NA\n                            \n\n\n\n\n\n\n\n                             Market Place\n                            \n\n\n\n\n\n                             Select the desired Marketplace.\n                            \n\n\n\n\n\n\n\n                             CSV Report Quote Character\n                            \n\n\n\n\n\n\n                              Select the quote character to use to delineate columns in the CSV file version of your report. Double Quote is the default character. If your report data contains double quotes, try selecting the\n                              \n                               Null Character\n                              \n                              option.\n                             \n\n\n\n\n\n\n\n\n                             Select Statuses\n                            \n\n\n\n\n\n                             Select the status you want to retrieve data for. You can select up to 10 statuses.\n                            \n\n\n\n\n\n\n\n                             SKU Selection Method\n                            \n\n\n\n\n\n                             Select the method to enter SKUs. Selecting\n                             \n                              All\n                             \n                             will return all available SKUs from your Inventory Supply. We will dynamically show SKUs based on the query date selected. To enter a list of SKUs yourself, use the\n                             \n                              Advanced\n                             \n                             option.\n                            \n\n\n\n\n\n\n\n                             Enter Seller SKUs\n                            \n\n\n\n\n\n                             Enter the list of SKUs you want to retrieve data for, separated by commas.\n                            \n\n\n\n\n\n\n\n                             Duration\n                            \n\n\n\n\n\n\n                              Select the duration for the report (a Single Date, or a Date Range).\n                             \n\n\n\n\n\n\n\n\n                             Days Back\n                            \n\n\n\n\n\n                             Enter the number of past days that should appear in the report. Specify either\n                             \n                              today\n                             \n                             (or\n                             \n                              0\n                             \n                             ),\n                             \n                              yesterday\n                             \n                             (or\n                             \n                              1\n                             \n                             ), or\n                             \n                              today-7\n                             \n                             (or\n                             \n                              7\n                             \n                             ) to get data for 7 days into the past.\n                            \n\n\n\n\n\n                           Date From\n                          \n\n                           Select report start date using relative or specific dates. Relative means the number of days from today or a specific date using the date selector.\n                          \n\n\n\n\n\n                             Start Date\n                            \n\n\n\n\n                            Specify whether the first date in your date range is specific or relative. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n\n                             End Date\n                            \n\n\n\n\n\n                             Specify whether the second date in your date range is specific or relative. You select the first date in your range in\n                             \n                              Start Date\n                             \n                             .\n                            \n\n\n\n\n\n\n\n                             Select Specific Start Date\n                            \n\n\n\n\n\n                             Select the first date in your date range.\n                            \n\n\n\n\n\n\n\n                             Select Specific End Date\n                            \n\n\n\n\n\n                             Select the second date in your date range.\n                            \n\n\n\n\n\n\n\n                             Days Back to Start From\n                            \n\n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Specify either\n                            \n\n\n                             today\n                            \n\n\n                            (or\n                            \n\n\n                             0\n                            \n                            ),\n                            \n\n\n                             yesterday\n                            \n\n\n                            (or\n                            \n\n\n                             1\n                            \n                            ), or\n                            \n\n\n                             today-7\n                            \n\n\n                            (or\n                            \n\n\n                             7\n                            \n                            ) to get data for 7 days into the past. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data from 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n\n                             Days Back to End At\n                            \n\n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Specify either\n                            \n\n\n                             today\n                            \n\n\n                            (or\n                            \n\n\n                             0\n                            \n                            ),\n                            \n\n\n                             yesterday\n                            \n\n\n                            (or\n                            \n\n\n                             1\n                            \n                            ), or\n                            \n\n\n                             today-7\n                            \n\n\n                            (or\n                            \n\n\n                             7\n                            \n                            ) to get data for 7 days into the past. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data from 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n\n                             Query Date Type\n                            \n\n\n\n\n\n                             Select the date type for the query.\n                             \n                              Created\n                             \n                             returns data based on the creation date.\n                             \n                              Last Updated\n                             \n                             will return data based on the date of the last update.\n                            \n\n\n\n\n\n\n\n                             Continue on Invalid SKU Error\n                            \n\n\n\n\n\n\n                              Amazon Selling Partner may return an error for invalid SKUs, causing the Domo dataset to stop importing with an error. Selecting '\n                              \n                               Skip Invalid SKUs\n                              \n                              ' will continue the dataset import if an invalid SKU error is encountered. Selecting '\n                              \n                               Warn About Invalid SKUs\n                              \n                              ' will stop dataset import with an error if an invalid SKU error is encountered.\n                             \n\n\n\n\n\n\n\n\n                             Query\n                            \n\n\n\n\n\n                             A comma-delimited list of words to search the Amazon catalog for.\n                            \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        A hybrid Selling Partner API application is an application that can make calls to both Selling Partner API and Amazon Marketplace Web Service (Amazon MWS). Use a hybrid application when your solution requires functionality from both services. When a seller authorizes your hybrid Selling Partner API application, they are (1) authorizing your Amazon MWS developer ID to make calls to Amazon MWS on their behalf, and (2) authorizing the application to make calls to Selling Partner API on their behalf.\n                       \n\n                        FAQ\n                       \n\n\n\n                        My Amazon store sells in multiple marketplaces across the world. How do I get all of my orders, inventory and other important Amazon MWS data?\n                       \n\n                        You will need to create an account for each marketplace. We recommend naming the accounts with the marketplace location: for example, 'United States' or 'Italy'. Once you have created the needed accounts, create connector datasets using each account to receive the data that matters to you. If you would like to join the data, use Domo's Magic ETL or Dataflow tools to bring the different marketplaces together.\n                       \n\n                        How should I configure the Orders or Order Items report?\n                       \n\n                        Due to API limitations, the connector can only be set up with Append mode. Select the desired start date for your historic backfill, and use a relative end date with a value of 'yesterday' or '1'. Set the connector to only run once per day. The connector will get the most current day's data, then start getting backfill data from the most recent data to older, one day at a time. The connector will run up to 24 hours, and then will remember where it left off in the historical backfill. The next day, when the connector runs again, it will get the most current day's data appended to it first, then pick up where it left off with the historical backfill. This pattern will continue until the connector has received all data for the historical backfill. Once all the backfill is completed, it will continue to append the most current days data, one day at a time. If the connector doesn't run or is unsuccessful during a run, it is designed to receive the data it missed in both the current and historical backfill.\n                       \n\n                        Can Domo schedule Amazon Vendor Reports on my behalf?\n                       \n\n                        No. The connector is not able to schedule Amazon MWS Reports on your behalf in the Amazon Vendor API. The connector will deliver all reports in the discovery dropdown for your convenience, but you may receive a \"Report not generated\" error if the report is not generated. The error message will contain the name of the report in the Amazon Vendor account that needs to be generated before the connector can run successfully. Generate the report and add it to the report scheduler in your Amazon Vendor dashboard and try again. The connector report 'Reports - Schedule List' lists all scheduled reports.\n                       \n\n                        How frequently should I run the connector schedule?\n                       \n\n                        The connector should only run once per day.\n                       \n\n                        Troubleshooting\n                       \n\n\n                         Make sure your authentication remains valid.\n                        \n\n                         Review the configuration to make sure that all required items have been selected.\n                        \n\n                         Review the Connector history for error messages.\n                        \n\n                         In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.", "Preview Article": "Click here to preview", "URL Name": "8677917495959", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003174", "Archived Date": "", "Language": "English", "Primary Version": "Amazon Vendor Partner Connector", "Article Total View Count": "2,434", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Amazon Vendor Partner Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}