{"file_path": "../../raw_kb_v2\\article\\360051062653\\index.html", "content": {"Title": "Magic ETL DataFlow Auto Append Processing", "Article Body": "Intro\n                       \n\n                        DataFlow Auto Append Processing is a new performance improvement introduced for Magic ETL. At the start of each execution, the system reviews the state of the DataFlow’s inputs and outputs, and for any changes to the DataFlows’ actions. Where possible, only new rows added to inputs since the last DataFlow execution will be processed by the new execution and appended to the output DataSet(s). As explained below, the system automatically identifies situations where all rows must be reprocessed to ensure data integrity. In ideal cases, these optimizations will reduce execution times by orders of magnitude. This article describes how to take full advantage of this feature in your data pipeline.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            There are significant behavioral differences in Magic ETL. Read the\n                            \n\n                              Behavior Changes and Feature Updates in Magic ETL\n                             \n\n                            article before converting mission-critical Magic ETL DataFlows.\n                            \n                             Failure to do so may risk an unintended change to your DataFlow’s behavior.\n                            \n\n\n\n\n\n\n\n\n\n                        How to tell if an execution was optimized\n                       \n\n                        In the\n                        \n                         History\n                        \n                        tab of each DataFlow, you will see a message when you hover over the\n                        \n                         Successful\n                        \n                        badge indicating that an execution was optimized. The run time and row counts may also indicate a DataFlow has been optimized.  For example, if your 10,000 row input DataSet had 100 rows appended to it, an optimized execution might show only 100 rows processed, while an execution where the optimization could not be applied would have shown 10,100 rows processed.\n                       \n\n                        How it works\n                       \n\n                        DataFlow executions are only optimized in this way if the system determines that appending new rows to the existing output DataSet(s) will result in the exact same data as an unoptimized execution. The following behaviors prevent a DataFlow from being optimized. Through understanding the circumstances that cannot be optimized, we hope to help you take advantage of DataFlow optimizations and thus streamline your data pipeline.\n                       \n\n                        Current Date Functions\n                       \n\n                        Any formula or tile configuration which depends on the current date and time will disable this optimization for all the transforms to which it is connected. Since the current date and time would be different with every execution, it is never possible to ensure that appending to existing output DataSets will be the same as re-executing from scratch. Functions like NOW(), TODAY(), CURDATE(), and the use of the\n                        \n                         Current Date and Time\n                        \n                        option on the Add Constants and Filter Rows tiles will disable DataFlow optimizations.\n                       \n\n                        If a date/time field in the data itself is an acceptable substitute for the current data and time (e.g. _BATCH_LAST_RUN_), use of that field instead will enable the DataFlow optimization.\n                       \n\n                        Aggregation tiles\n                       \n\n                        Tiles that do not process data row-by-row, but rather as a complete set, force the DataFlow to load all rows, and thus preventing optimized executions. For example, to determine whether a newly appended row is unique, all existing rows must be loaded during an execution in order to perform the comparisons needed to determine uniqueness.\n                       \n\n                        Aggregation tiles that prevent auto-optimization include:\n                       \n\n\n                         Group By\n                        \n\n                         Rank & Window\n                        \n\n                         Remove Duplicates\n                        \n\n                         Pivot (Uncollapse Columns)\n                        \n\n\n                        In most cases, DataFlow optimizations are not applicable to DataFlows that use these tiles. The exception is when the aggregation is the “lookup” side (non-outer side) of a Join. In that case, as long as the input to the aggregate tile does not change, the Join may still be optimized (see below).\n                       \n\n                        Joins\n                       \n\n                        Joins will be optimized when they meet the following criteria:\n                       \n\n\n                         Inputs to one side of the Join have been appended to, while the other side has stayed the same.\n                        \n\n                         The side of the Join that is unchanged (think of it as the lookup table) is not the “outer” part of the Join.\n                        \n\n\n                        For example, a Right Join may be optimized if only the right table changes.  An Inner Join will be optimized in most cases. A Full Outer Join will never be optimized.\n                       \n\n                        Union\n                       \n\n                        Unions may be optimized when all of their inputs have new data appended. If any input is wholly replaced, or is otherwise disqualified from optimizations (e.g. the use of a Current Date function exists along the input path to the Union step), then all inputs from the Union must be re-read in their entirety.\n                       \n\n                        Scripting Tiles\n                       \n\n                        Any use of the Python or R Scripting tiles disables this optimization entirely.", "Preview Article": "Click here to preview", "URL Name": "360051062653", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004582", "Archived Date": "", "Language": "English", "Primary Version": "Magic ETL DataFlow Auto Append Processing", "Article Total View Count": "5,113", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Magic ETL DataFlow Auto Append Processing\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}