{"file_path": "../../raw_kb_v2\\article\\4402405213975\\index.html", "content": {"title": "\n\n\n Microsoft Exchange REST Mailbox Only Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMicrosoft Exchange Server is a mail server and calendaring server. To learn more about the Microsoft Exchange API, visit their page (\n\nhttps://docs.microsoft.com/en-us/exc...s-and-contacts\n\n).\n\n\n You connect to your Microsoft Exchange account in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft Exchange connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Microsoft Exchange Mailbox mailbox and create a DataSet, you must have a Microsoft Exchange client ID and client secret. For information about obtaining these credentials, see\n\nhttps://docs.microsoft.com/en-us/outlook/rest/get-started\n\n. You must also have your Microsoft credentials (the email address, phone number, or Skype handle associated with your account, as well as your password).\n\n\n Connecting to Your Microsoft Exchange Account\n-----------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Microsoft Exchange Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to the Microsoft Exchange REST API. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Client ID\n  |\n Enter your Microsoft Exchange client ID.\n  |\n|\n Client Secret\n  |\n Enter your Microsoft Exchange client secret.\n  |\n\nFor information, see\n\nhttps://docs.microsoft.com/en-us/outlook/rest/get-started\n\n.\n\nAfter you have entered your API credentials, you are taken to the Microsoft OAuth screen where you are prompted to enter your Microsoft credentials. Once you have entered valid credentials, you can use the same account any time you go to create a new Microsoft Exchange DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Configuring Your Azure App\n\nTo create a connection with your Microsoft Exchange Mailbox account, you must first create a Microsoft Azure Web App to obtain the necessary client ID and secret.\n\n\n**To configure an Azure App**\n :\n\n\n 1. Log into the\n\nAzure Portal\n\n.\n\n\n 2. Click\n **Azure Active Directory > App Registrations > New Registration**\n .\n\n3. Fill out the registration form as follows:\n\n Name: Enter name for your application.\n* Supported account types: Select an option to specify who can use this application or access this API.\n* Redirect URI: Enter the redirect URI as:\n **https://oauth.domo.com/api/data/v1/oauth/providers/mail-exchange-rest-mailbox-only/exchange**\n .\n\n*Note:**\n The authentication response is sent to this URI after successfully authenticating the user. Providing the URI at this stage is optional and it can be changed later, but a value is required for most of the authentication scenarios.\n\n\n 4. Click\n **Register**\n . An overview of your registered App will appear. The\n **Application ID**\n that appears here is the\n **Client ID**\n you will enter in the\n **Credentials**\n pane in Domo.\n\n\n 5. Click\n **API Permissions >> +Add a permission**\n .\n\n6.\n **Request API permissions**\n section appears. Add the API permissions for your application.\n\n7. Now, click on\n **Certificates and secrets**\n . Certificates can be used as secrets to prove the application's identity when requesting a token. Also, can be referred to as public keys.\n\n\n 8. Click\n **+New client secret**\n .\n\n9. Specify the client secret description and the expiry period for your client secret, and click\n **Add**\n .\n\n\n 10. Copy the value and paste it into the\n **Client Secret**\n field in the\n **Connector credentials**\n section in Domo.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Microsoft Exchange report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Messages\n  |\n\nReturns message details like recipients, body, subject, size, importance, sender's name, received time, sent time, etc.\n\n|\n\n|\n|\n Folder\n  |\n Select the folder containing the content you want to import.\n  |\n|\n Search Type\n  |\n Select the search type.\n\n\n|  |  |\n| --- | --- |\n|\n Search\n  |\n Returns results based on search criteria. Use the Search query parameter to restrict the results of a request to match a search criterion.\n  |\n|\n Filters\n  |\n Filters results (rows). Use the Filter option to retrieve just a subset of a collection.\n  |\n\n|\n|\n Filter Type\n  |\n\nSelect Filter type. If the filter type is\n\n*Starts with**\n\n, then the connector will perform a\n\n*Starts with**\n\nmatch for the given inputs (from, subject). If the search type is\n\n*Equals**\n\n, then the connector will an perform exact search for the given inputs (from, subject).\n\n|\n|\n Subject (Optional)\n  |\n\nEnter the subject to find all the emails for the given subject.\n\n|\n|\n From (Optional)\n  |\n Enter the email id of the user to filter returned data specific to that user.\n  |\n|\n Search Option\n  |\n Select the desired search method. If you select\n **Custom Search**\n , you are prompted to enter a subject line and sender name for the search. If you select\n **Query**\n , you are prompted to enter a search query string.\n  |\n|\n Query\n  |\n Enter a Keyword Query Language (KQL) query. For more information about searchable email properties, KQL syntax, supported operators, and search tips, see the Microsoft Exchange user documentation.\n  |\n|\n Calendar Type\n  |\n Select whether you want to import a shared or personal (\n **Own**\n ) calendar.\n  |\n|\n Shared Calendar Search Type\n  |\n Select whether you want to search for shared calendars by name or email address.\n  |\n|\n Shared Calendars\n  |\n Select the shared calendar(s) you want to import into Domo.\n  |\n|\n Shared Users Email Address\n  |\n Enter the email address of the user whose calendar you want to retrieve.\n  |\n|\n File Type\n  |\n Select whether the attachment you are importing is a CSV, XLS, XLSX, JSON, or XML file.\n  |\n|\n File Name\n  |\n Enter the name of the attachment you want to import. If the file name contains an extension, you must include the extension.\n  |\n|\n File Password (Optional)\n  |\n If the file you are uploading is password-protected, enter the password here.\n  |\n|\n Delimiter\n  |\n Select the delimiter to use in parsing CSV files. If your desired delimiter is not in the menu, select\n **Other**\n then enter the delimiter in the\n **Custom Delimiter**\n field.\n  |\n|\n Custom Delimiter\n  |\n Enter the custom delimiter for your CSV file. Enter\n\n\\t\n\nfor tab or Unicode characters in\n\n\\uxxxx\n\nform (e.g.\n\n\\u005e\n\n).\n  |\n|\n Quote Character\n  |\n Select the desired quote character for parsing your CSV file. A double quote (\") is the CSV standard.\n  |\n|\n Custom Quote Character\n  |\n Enter the desired custom quote character. Enter\n\n\\t\n\nfor tab or Unicode characters in\n\n\\uxxxx\n\nform (e.g.\n\n\\u005e\n\n).\n  |\n|\n Escape Character\n  |\n Select the escape character to use in parsing CSV files. If your desired escape character is not in the menu, select\n **Other**\n then enter the escape character in the\n **Custom Escape Character**\n field.\n  |\n|\n Custom Escape Character\n  |\n Enter the custom escape character for your CSV file. Enter\n\n\\t\n\nfor tab or Unicode characters in\n\n\\uxxxx\n\nform (e.g.\n\n\\u005e\n\n).\n  |\n|\n Header Start Row (Optional)\n  |\n Enter the header row number. If you do not enter a number, the first row is considered the header row.\n  |\n|\n Data Start Row (Optional)\n  |\n Enter the starting data row number. If you do not enter a number, the first row after the header row is considered the starting row.\n  |\n|\n Footer Rows to Skip (Optional)\n  |\n If there are one or more rows at the bottom of the file you do not want to import, enter the number of rows to skip.\n  |\n|\n Sheet Name (Optional)\n  |\n If the Excel file you are uploading is found on a specific sheet, enter the sheet name here. If you do not enter a sheet name, the first sheet of the workbook will be used.\n  |\n|\n Date Field Key\n  |\n Enter the data tag in your JSON or XML file.\n  |\n|\n Sublist to Flatten\n  |\n Enter the lists you want to flatten, separated by commas.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4402405213975\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003217\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft Exchange REST Mailbox Only Connector\n\n", "article_total_view_count": "\n\n\n 4,650\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "microsoft_exchange_rest_mailbox_only_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}