{"file_path": "../../raw_kb_v2\\article\\360043430233\\index.html", "content": {"title": "\n\n\n Adding a Notebook Card\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can create a Notebook Card in Domo. Notebook cards are Cards containing text you enter. You can type or paste text in a Notebook Card. You can format text using bold, italics, strikethrough, and numbered and bulleted lists by selecting options in the toolbar. You can also add images, hyperlinks, tables, and dynamic Summary Numbers to Notebook Cards.\n\n*Note:**\n When you paste text certain formatting may be preserved, including bold, italics, lists, tables, font size, and headings. The formatting that is preserved varies, depending on the source. Typically, formatting associated with basic HTML tags is preserved, although styles may differ. Pasted images are stripped out. If you want to add images, use the Image Uploader.\n\n\n**Video - Notebook Cards**\n\nAdding Notebook Content\n-------------------------\n\n*To add a Notebook Card to Domo,**\n\n. Navigate to the page where you want the Notebook Card to appear.\n2. Click\n\n*> Create new Card**\n .\n\n\n A dialog appears with a number of card creation options to choose from.\n\n*Tip:**\n You can also open this dialog from anywhere in Domo by selecting\n\nin the app toolbar and selecting\n **Card**\n .\n3. Click\n **Notebook**\n .\n\n\n The Notebook create view appears.\n4. (Optional) To change the default title, click the title field and replace the text with your desired title text. You can also add a description and Smart Text.\n5. Enter your text in the blank field.\n6. Apply formatting and add tables, hyperlinks, images, and dynamic Summary Numbers as desired.\n\n\n The following table describes the available toolbar options:\n\n\n|\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Font Size Picker\n  |\n Lets you change the font size of selected text. Four sizes are available—\n **Header**\n (largest),\n **Title**\n ,\n **Subtitle**\n , and\n **Text**\n (smallest).\n  |\n|\n Styling Options\n\n|\n Lets you change the styling of selected text.\n\n* Click\n\n to apply bold style to the selected text.\n\t* Click\n\n to apply italic style to the selected text.\n\t* Click\n\n to apply strikethrough style to the selected text.\n\t* Click\n\n to open the color picker for the selected text. |\n|\n Bulleted List\n\n|\n Adds a bulleted list to the card. When you add a bulleted list, a new bullet item is added each time you hit Enter. To turn off the list, hit Enter or click the icon a second time.\n  |\n|\n Numbered List\n\n|\n Adds a numbered list to the card. When you add a numbered list, a new list item is added each time you hit Enter. To turn off the list, hit Enter or click the icon a second time.\n  |\n|\n Horizontal Alignment\n\n|\n Lets you change the horizontal alignment on the page of the line of text that currently contains the cursor. Note that this option is used to change the alignment of just one line, while the\n **Vertical Alignment**\n option changes the alignment of all text on the page.\n  |\n|\n Vertical Alignment\n\n|\n Lets you change the vertical alignment of all the text on the page. Note that this option is used to change the alignment of all text on the page, while the\n **Horizontal Alignment**\n option changes the alignment of just one line.\n  |\n|\n Table\n\n|\n Lets you add a table to the card. When you click this icon, a grid image appears; you can mouse over this image to select the desired number of rows and columns in the table then click the bottom-rightmost square to add the table. In the following example, the user wants a 3x3 table, so he mouses over the grid as shown here:\n\nThe user then clicks on the square in the bottom right to add the table.\n\n\n Tables in Notebook Cards size columns automatically depending on the amount of text entered. You can change column width manually by clicking and dragging on the column borders.\n\n\n When you click in a table cell, an options icon\n\nappears. Click on this to open an options menu for the table. These options are as follows:\n\n\n|  |  |\n| --- | --- |\n|\n Add column left\n  |\n Adds a column to the left of the selected row.\n  |\n|\n Add column right\n  |\n Adds a column to the right of the selected row.\n  |\n|\n Delete column\n  |\n Deletes the selected column.\n  |\n|\n Add row above\n  |\n Adds a row above the row with the cursor.\n  |\n|\n Add row below\n  |\n Adds a row below the row with the cursor.\n  |\n|\n Delete row\n  |\n Deletes the selected row.\n  |\n|\n Delete table\n  |\n Deletes the entire table.\n  |\n\n|\n|\n Summary Number\n\n|\n Lets you add a dynamically changing Summary Number to this card,\n\nsimilar to those that appear in most cards with charts\n\n. You choose the DataSet with data you want to summarize, along with the column and the desired aggregation type. You can also configure display options. Once you have added a Summary Number to your Notebook Card, it will update automatically anytime the data updates. The process for adding Summary Numbers to Notebook Cards is discussed in more detail later in this article.\n  |\n|\n Image Uploader\n\n|\n Opens the Image Uploader tool, which lets you select and upload an image from your computer. JPEGs, PNGs, and GIFs are all supported.\n\n\n You can delete an image by either selecting it or moving the cursor to the right of it then pressing Backspace/Delete.\n  |\n|\n Hyperlink\n\n|\n Lets you add a hyperlink to the card. When you add a hyperlink, you can define the action that takes place when a user clicks on it. These actions include either opening a specified web page or opening other content in Domo, either in the same browser tab or in a different tab. This is discussed in more detail later in this article.\n  |\n|\n Smart Text\n\n|\n Lets you add dynamically changing text to this Card. You can choose to display DataSet info, Filters, Segments, or Date range data. Once you have added the Smart Text to your Notebook Card, it will update automatically anytime the data updates. The process for adding Smart Text to Notebook Cards is discussed in more detail later in this article.\n  |\n7. Click\n **Done**\n when you are finished.\n\n\n You can close without creating a Notebook Card by clicking the \"x\" in the top right corner.\n\nAfter you click\n **Done**\n , a Notebook Card containing your text is added to Domo.\n\n\n Defining Hyperlink Actions\n----------------------------\n\nWhen adding a hyperlink to a Notebook Card, you can define the action that occurs when a user clicks on it. These actions may be either of the following:\n\n Opening other content in Domo, either in the same browser tab or in a different tab\n* Opening a specified web page\n\n***To configure specified Domo content to open when the link is clicked,****\n\n. Open the Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. In Section 1, select the\n ****Link to anything in Domo****\n radio button.\n4. In Section 2, click the\n ****Select Content****\n button.\n5. Locate the content you want to open when this card is clicked.\n6. Click\n ****Save****\n .\n7. (Optional) If you want the link to display with custom text, enter the desired text in the\n **Display as**\n field.\n8. (Optional) If you want the new content to open in a new browser tab when the card is clicked, check the\n ****Open link in a new tab****\n box.\n9. Click\n ****Save****\n again.\n\n***To configure an external web page to open when a card is clicked,****\n\n. Open the Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. In Section 1, select the\n ****Link to external web page****\n radio button.\n4. In Section 2, in the\n ****Web page address****\n field, enter the URL of the page you want to open when the card is clicked.\n5. (Optional) If you want the URL to open with a custom name, enter the name in the\n ****Display as****\n field.\n6. (Optional) If you want the new content to open in a new browser tab when the card is clicked, check the\n ****Open link in a new tab****\n box.\n7. Click\n ****Save****\n again.\n\nAdding Summary Numbers\n------------------------\n\nYou can add a Summary Number to your Notebook Card referencing a given DataSet column. Thereafter, anytime the underlying data changes, the Summary Number will change automatically. To add a Summary Number, you choose the DataSet with data you want to summarize, along with the column and the desired aggregation type. If you want, you can filter your selected column as well as configure display options. Once you have added a Summary Number to your Notebook Card, it will update automatically anytime the underlying data updates.\n\n\n Personalized Data Permissions (PDP) are respected when adding Summary Numbers to Notebook Cards. For more information about PDP, see\n\nPersonalized Data Permissions (PDP)\n\n.\n\n\n**To add a Summary Number to a Notebook Card,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n\n\n This opens the\n **Create Summary Number**\n dialog, in which you set all of the options for your Summary Number.\n3. In Section 1, do the following:\n\n1. In the\n\t **DataSet**\n\t field, select the DataSet containing the column you want to derive your Summary Number from.\n\t2. (Optional) In the\n\t **Label**\n\t field, enter a description that will appear when a user hovers over the Summary Number.\n\t3. In the\n\t **Data to summarize**\n\t menu, select the DataSet column you want to derive your Summary Number from.\n\t4. In the\n\t **Displayed by**\n\t field, select how you want the data to be aggregated.\n\n\n\t For example, if your Summary Number is to reflect a monetary value, you would probably want to select\n\t **Sum**\n\t or\n\t **Average**\n\t .\n\t5. (Optional) If you want to filter the values in the column, click\n\t **Add Filter**\n\t , choose the column you want to filter on, then configure your filters.\n\n\n\t Filter options differ depending on the type of data you're filtering.\n\n\t* (Conditional) If the selected column contains series data,\n\n\n\t\t\t1. Select the checkboxes for each series you want to pass your filters.\n\n\n\t\t\t You can select all of the checkboxes by clicking\n\t\t\t ****All****\n\t\t\t or deselect all of the checkboxes by clicking\n\t\t\t ****None****\n\t\t\t .\n\n\n\t\t\t You can filter the series that appear in the list by entering a keyword or a string of characters found in a keyword in the\n\t\t\t ****Filter by****\n\t\t\t field.\n\t\t\t2. Specify whether the items you have checked appear or do not appear in your chart by selecting\n\t\t\t ****In****\n\t\t\t or\n\t\t\t ****Not In****\n\t\t\t from the menu in the top right.\n\t\t\t3. Click\n\t\t\t ****Apply****\n\t\t\t .\n\t\t* (Conditional) If the selected column contains amount data,\n\n\n\t\t\t1. Do one of the following:\n\n\t\t\t+ If you want to filter amounts based on a range...\n\n\t\t\t\t1. Leave the dropdown menu in the upper right corner set to\n\t\t\t\t\t ****Range****\n\t\t\t\t\t .\n\t\t\t\t\t2. Select a condition statement from the menu.\n\n\n\t\t\t\t\t One or more fields may appear, depending on the condition statement.\n\t\t\t\t\t3. (Conditional) If one or more fields appeared when you selected a condition statement, enter the desired amounts in the fields.\n\n\n\t\t\t\t\t For example, if you wanted your Summary Number to reflect amounts between 200,000 and 300,000, you would select\n\t\t\t\t\t ****is between****\n\t\t\t\t\t from the menu, enter \"200,000\" in the first field, and enter \"300,000\" in the second field.\n\t\t\t\t+ If you want to filter amounts based on specific values from your DataSet...\n\n\t\t\t\t1. Select\n\t\t\t\t\t ****Selection****\n\t\t\t\t\t in the dropdown menu in the upper right corner.\n\t\t\t\t\t2. Check the boxes for all of the values you want to filter on.\n\n\n\t\t\t\t\t You can select all of the checkboxes by clicking\n\t\t\t\t\t ****All****\n\t\t\t\t\t or deselect all of the checkboxes by clicking\n\t\t\t\t\t ****None.****\n\t\t\t\t\t Or you can filter the values that appear in the list by entering a string of numbers in the\n\t\t\t\t\t ****Filter by****\n\t\t\t\t\t field. Finally, you can specify whether the items you have checked appear or do not appear in your chart by selecting\n\t\t\t\t\t ****In****\n\t\t\t\t\t or\n\t\t\t\t\t ****Not In****\n\t\t\t\t\t from the menu in the top right.\n\t\t\t2. Click\n\t\t\t ****Apply****\n\t\t\t .\n\t\t* (Conditional) If the selected column contains date data,\n\n\n\t\t\t1. Do one of the following:\n\n\t\t\t+ If you want to filter dates based on a range...\n\n\t\t\t\t1. Leave the dropdown menu in the upper right corner set to\n\t\t\t\t\t ****Range****\n\t\t\t\t\t .\n\t\t\t\t\t2. Select a condition statement from the menu.\n\n\n\t\t\t\t\t One or more fields may appear, depending on the condition statement.\n\t\t\t\t\t3. Enter the desired dates in the fields as necessary.\n\n\n\t\t\t\t\t For example, if you wanted your Summary Number to reflect dates between 1-31-2014 and 4-30-2015, you would select\n\t\t\t\t\t ****is between****\n\t\t\t\t\t from the menu, select January 1, 2014 in the first field, and select April 30, 2015 in the second field.\n\t\t\t\t+ If you want to filter dates based on specific dates from your DataSet...\n\n\t\t\t\t1. Select\n\t\t\t\t\t ****Selection****\n\t\t\t\t\t in the dropdown menu in the upper right corner.\n\t\t\t\t\t2. Check the boxes for all of the dates you want to filter on.\n\n\n\t\t\t\t\t You can select all of the checkboxes by clicking\n\t\t\t\t\t ****All****\n\t\t\t\t\t or deselect all of the checkboxes by clicking\n\t\t\t\t\t ****None.****\n\t\t\t\t\t Or you can filter the dates that appear in the list by entering a filter string in the\n\t\t\t\t\t ****Filter by****\n\t\t\t\t\t field. (For example, if you wanted to filter down to dates from 2010, you would enter \"2010\" into this field.) Finally, you can specify whether the dates you have checked appear or do not appear in your chart by selecting\n\t\t\t\t\t ****In****\n\t\t\t\t\t or\n\t\t\t\t\t ****Not In****\n\t\t\t\t\t from the menu in the top right.\n\t\t\t2. Click\n\t\t\t ****Apply****\n\t\t\t .\n4. In Section 2, do the following:\n\n1. In the\n\t **Display as**\n\t field, select the desired number format for the Summary Number.\n\n\n\t If you select\n\t **Number**\n\t , no special format is applied to the number. If you select\n\t **Currency**\n\t , a currency symbol will be appended to the number. If you select\n\t **Percentage**\n\t , a percent symbol will be appended.\n\t2. Do one of the following:\n\n\t* If you selected\n\t\t **Number**\n\t\t or\n\t\t **Percentage**\n\t\t in the previous step, choose the desired number of decimals in the\n\t\t **Decimals**\n\t\t menu.\n\t\t* If you selected\n\t\t **Currency**\n\t\t in the previous step...\n\n\t\t1. Select the desired currency symbol in the first dropdown menu.\n\t\t\t2. Select the desired number of decimals in the\n\t\t\t **Decimals**\n\t\t\t menu\n\t3. (Optional) If you want to abbreviate the number (e.g. \"200,000\" becomes \"2K\"), check the\n\t **Abbreviate**\n\t box.\n\t4. (Optional) If you want to use commas to separate thousands in the number, check the\n\t **Use thousands separator**\n\t box.\n\t5. Click\n\t **Save**\n\t .\n\nAdding Smart Text\n-------------------\n\nYou can add Smart Text to your Notebook Card referencing DataSet info, Filters, Segments, or Date range data. Thereafter, anytime the underlying data changes, the Smart Text will change automatically. Personalized Data Permissions (PDP) are respected when adding Smart Text to Notebook Cards. For more information about PDP, see\n\nPersonalized Data Permissions (PDP)\n\n.\n\n\n**Video - Smart Text Overview**\n\n\n**To add Smart Text to a Notebook Card,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n\n\n This opens the\n **Smart Text**\n menu, in which you select what data you would like to display.\n3. Select one of the following options:\n\n* **DataSet info**\n\t - Allows you to display the\n\t **Name**\n\t ,\n\t **Owner**\n\t , or\n\t **Date last updated**\n\t for a specific DataSet.\n\t* **Filters**\n\t - Allows you to display the filters applied to a column or\n\t **Display any filter**\n\t .\n\t* **Segments used**\n\t - Allows you to display the\n\t **Segment name**\n\t or\n\t **Segment description**\n\t of the visible Segments.\n\t* **Date range**\n\t - Allows you to display the\n\t **Date range**\n\t or\n\t **Graph by**\n\t dates.\n\n**Note:**\n\t The steps for configuring the different Smart Text options are listed in the sections below.\n4. Fill out the information in the\n **Apply logic to this text**\n menu.\n5. Click\n **Apply**\n .\n\n\n###\n DataSet Info Smart Text Configuration\n\nAllows you to display the\n **Name**\n ,\n **Owner**\n , or\n **Date last updated**\n for a specific DataSet.\n\n###\n DataSet Name Smart Text\n\n*To configure the DataSet info Name Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **DataSet info**\n .\n4. Search for and select the DataSet you want to use.\n5. Click\n **Choose DataSet**\n .\n6. Select\n **Name**\n .\n7. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Apply a\n\t **Prefix**\n\t .\n\t2. (Optional) Apply a\n\t **Suffix**\n\t .\n8. Click\n **Apply**\n .\n\n\n####\n DataSet Owner Smart Text\n\n*To configure the DataSet info Owner Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **DataSet info**\n .\n4. Search for and select the DataSet you want to use.\n5. Click\n **Choose DataSet**\n .\n6. Select\n **Owner**\n .\n7. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Apply a\n\t **Prefix**\n\t .\n\t2. (Optional) Apply a\n\t **Suffix**\n\t .\n8. Click\n **Apply**\n .\n\n\n####\n DataSet Date Last Updated Smart Text\n\n*To configure the DataSet info Date last updated Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **DataSet info**\n .\n4. Search for and select the DataSet you want to use.\n5. Click\n **Choose DataSet**\n .\n6. Select\n **Date last updated**\n .\n7. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Apply a\n\t **Prefix**\n\t .\n\t2. (Optional) Apply a\n\t **Suffix**\n\t .\n8. Click\n **Apply**\n .\n\n\n###\n Filters Smart Text Configuration\n\nAllows you to display the filters applied to a column or\n **Display any filter**\n .\n\n###\n Filter (Column Specific) Smart Text\n\n*To configure the Filters applied to a specific column Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **Filters**\n .\n4. Search for and select one or multiple columns you wish to show.\n5. Click\n **Select**\n .\n6. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Enter the\n\t **Default text**\n\t . The default is to show the name of the column if only one is selected or to display\n\t **Filters(x)**\n\t where x is the number of columns you have selected. (This will show when no filters are applied and in search results when searching for this Card.)\n\t2. (Optional) Apply a\n\t **Prefix**\n\t .\n\t3. (Optional) Apply a\n\t **Suffix**\n\t .\n\t4. (Optional) Enter the desired amount of\n\t **Values shown**\n\t . The default is\n\t **All**\n\t . (Any values selected that exceed the threshold will be shown in a tooltip.)\n7. Click\n **Apply**\n .\n\n\n####\n Filter (Display Any Filter) Smart Text\n\n*To configure the Filters Display any filter Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Check the box for\n **Display any filter**\n .\n4. Click\n **Select**\n .\n5. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Enter the\n\t **Default text**\n\t . The default is to show\n\t **Display any filter**\n\t . (This will show when no filters are applied and in search results when searching for this Card.)\n\t2. (Optional) Apply a\n\t **Prefix**\n\t .\n\t3. (Optional) Apply a\n\t **Suffix**\n\t .\n\t4. (Optional) Enter the desired amount of\n\t **Values shown**\n\t . The default is\n\t **All**\n\t . (Any values selected that exceed the threshold will be shown in a tooltip.)\n6. Click\n **Apply**\n .\n\n\n###\n Segments Used Smart Text Configuration\n\nAllows you to display the\n **Segment name**\n or\n **Segment description**\n of the visible Segments.\n\n###\n Segment Name Smart Text\n\n*To configure the Segments used Segment name Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **Segments used**\n .\n4. Click\n **Segment name**\n .\n5. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Apply a\n\t **Prefix**\n\t .\n\t2. (Optional) Apply a\n\t **Suffix**\n\t .\n6. Click\n **Apply**\n .\n\n\n####\n Segment Description Smart Text\n\n*To configure the Segments used Segment description Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **Segments used**\n .\n4. Click\n **Segment description**\n .\n5. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Apply a\n\t **Prefix**\n\t .\n\t2. (Optional) Apply a\n\t **Suffix**\n\t .\n6. Click\n **Apply**\n .\n\n\n###\n Date Range Smart Text Configuration\n\nAllows you to display the\n **Date range**\n or\n **Graph by**\n dates.\n\n###\n Date Range Smart Text\n\n*To configure the Date range Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **Date range**\n .\n4. Click\n **Date range**\n .\n5. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Enter the\n\t **Default text**\n\t . The default is to show\n\t **Date Range**\n\t . (This will show when no filters are applied and in search results when searching for this Card.)\n\t2. (Optional) Apply a\n\t **Prefix**\n\t .\n\t3. (Optional) Apply a\n\t **Suffix**\n\t .\n6. Click\n **Apply**\n .\n\n\n####\n Graph By Smart Text\n\n*To configure the Date range Graph by Smart Text,**\n\n. Create a new Notebook Card or open an existing Notebook Card and go into the editor by clicking\n **Edit**\n in the upper right corner.\n2. Click\n\nin the editor toolbar.\n3. Select\n **Date range**\n .\n4. Click\n **Graph by**\n .\n5. Fill out the\n **Apply logic to this text**\n menu.\n\n1. (Optional) Enter the\n\t **Default text**\n\t . The default is to show\n\t **Graph by**\n\t . (This will show when no filters are applied and in search results when searching for this Card.)\n\t2. (Optional) Apply a\n\t **Prefix**\n\t .\n\t3. (Optional) Apply a\n\t **Suffix**\n\t .\n6. Click\n **Apply**\n .\n\nEditing Notebook Cards\n------------------------\n\nFor information on how to edit a Notebook Card, see\n\nEditing a Notebook Card\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043430233\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004106\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAdding a Notebook Card\n\n", "article_total_view_count": "\n\n\n 5,600\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:22 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "adding_a_notebook_card", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "notebook_cards", "url": "/s/topic/0TO5w000000ZanwGAC"}]}