{"file_path": "../../raw_kb_v2\\article\\360042924094\\index.html", "content": {"Title": "Adding a Drill Path to Your Chart", "Article Body": "Intro\n                       \n\n                        After powering up a card, you can add layers of \"drill path\" by s\n                        \n\n                        etting filters on specific columns in your DataSet so, when a user clicks a graph element in the chart, they drill to another view that represents the underlying data for that column. You can add another layer of drill path to this view so that the user can drill to see additional details, and so on.\n                       \n\n                        Users can drill down into cards from the Details view or the Page view. However, drilldown is\n                        \n                         only\n                        \n                        available in the Page view when Domo Stories Dashboards are enabled. Also, you must enable\n                        \n                         Drill in place\n                        \n                        for the Card in the\n                        \n                         Card interaction settings\n                        \n                        dialog. For more information, see\n                        \n                         Settings Card Interactions\n                        \n                        .\n                       \n\n                        You can have as many drill path layers as your data allows. The \"bottom\" drill path layer of any chart is, by default, a table containing the data for the graph element you clicked. You can prevent drilling to the \"bottom\" drill path layer.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The bottom-layer data table is not available when drilling down into a Card from the Page level.\n                          \n\n\n\n\n                        You can also drill down from one DataSet to another, as long as the second DataSet contains the same category and series columns you filtered off of in the first DataSet. (The second DataSet does\n                        \n                         not\n                        \n                        need to contain the same value columns.) For example, if you had two DataSets that contained a column called \"Customers,\" you could create a top-level chart with \"Customers\" data using the first DataSet. Then, because you used the \"Customers\" column in the first DataSet, you could drill down to the second DataSet and filter off of the \"Customers\" column in that DataSet to see additional details.\n                       \n\n\n\n\n\n\n\n\n\n                            Notes:\n                           \n\n\n                             Calculations you create using Beast Mode are inherited when you drill from one view to another using the\n                             \n                              same\n                             \n                             DataSet. However, calculations are\n                             \n                              not\n                             \n                             inherited when you drill to a\n                             \n                              different\n                             \n                             DataSet. For more information about Beast Mode, see\n                             \n                              Adding a Beast Mode Calculation to Your Chart\n                             \n                             .\n                            \n\n                             You\n                             \n                              cannot\n                             \n                             create Beast Mode calculations on any card in a drill path\n                             \n                              except\n                             \n                             the top-level card. Calculations created on any other cards in a drill path will disappear after they are saved.\n                            \n\n                             Drilldown is not available for Funnel graphs.\n                            \n\n                             You cannot add Period-over-Period charts within a drilldown.\n                            \n\n\n                              When adding a fiscal calendar as part of a drill path, the fiscal calendar selection in the child pages MUST be the same as that of the parent card; otherwise the drill path won't work. For more information, see\n                              \n                               Using A Fiscal Calendar\n                              \n\n                             .\n                            \n\n\n\n\n\n\n                        If you create drill levels out of the desired sequence, don't worry—in the Drill Path view you can click and drag drill levels into the order you want, and the drill path for the card adjusts automatically.\n                       \n\n                        If PDP (Personalized Data Permissions) is enabled on a DataSet used in a drill layer, those policies are retained in the drill path. For example, if Brett, a member of the \"Western Region\" policy, goes to build a drill path on a PDP-affected card in which he is only allowed to see data for western states, his completed drill path will contain only information for those same states. For more information about PDP, see\n                        \n                         Creating and Deleting PDP Policies\n                        \n                        .\n                       \n\n                        This topic discusses how to incorporate drill path layers into a chart. For information about exploring existing drill path layers in a chart, see\n                        \n                         Drilling into Data\n                        \n                        .\n                       \n\n\n\n                          Video - Creating a Drill Path\n                         \n\n\n\n\n\n\n\n\n                         ​\n                        \n\n\n                        Adding a drill path to a chart\n                       \n\n                        When you add a drill path to a chart, you add a new view of the data in your DataSet. Each successive view is filtered from the previous view. So, for example, if your top-level view had bars for 2006, 2007, and 2008, your next layer down would filter off of the data in those rows.\n                       \n\n\n                         To add a drill path to a chart,\n                        \n\n\n\n\n                          Click the KPI card to open the Details view.\n                         \n\n\n\n                          Click\n                          \n                          , then select\n                          \n                           Edit Drill Path\n                          \n                          .\n                          \n                          A new page titled \"Drill Path\" opens.\n                         \n\n\n\n                          Click\n                          \n                           Add a view\n                          \n                          .\n                          \n                          A view opens that is similar to the Analyzer. For more information about the Analyzer interface, see\n                          \n                           Analyzer Layout\n                          \n                          .\n                         \n\n\n\n                          (Optional) Select a different DataSet by doing the following:\n                         \n\n\n\n                            Click\n                            \n                            next to the DataSet name.\n                           \n\n\n\n                            In the dialog that opens, select the DataSet you want to drill to.\n                           \n\n\n\n\n\n\n\n\n\n                                Notes:\n                               \n                               1) The new DataSet\n                               \n                                must\n                               \n                               contain the same category and series column name(s) you filtered off of in the original DataSet. The column data should also be the same; however, the column in the second DataSet may contain additional data items not found in the original DataSet. Value columns you have filtered off of in the original DataSet do\n                               \n                                not\n                               \n                               need to be present in the second DataSet. For more information about category, series, and value columns, see\n                               \n                                Understanding Chart Data\n                               \n                               .  2) If your DataSet contains more than one sheet and you want to connect to the data in another sheet, you must first re-upload the DataSet, being sure to select that sheet in the\n                               \n                                Review your Data\n                               \n                               dialog. This creates a new DataSet that you can connect to like any other DataSet.\n                              \n\n\n\n\n                            If your DataSets are compatible, a success message appears; otherwise an error message appears displaying the names of the columns not present in the second DataSet.\n                           \n\n\n\n\n\n                          Select the chart type you want to use for the new view.\n                          \n                          You can drill down from one chart type to another chart type. Any chart type works, even tables. This makes it possible to produce different views of the same basic DataSet.\n                         \n\n\n\n                          (Optional) Add filters, sorting, and Beast Mode transforms, if desired.\n                          \n                          For more information about filters, see\n                          \n                           Adding a Beast Mode Calculation to Your Chart\n                          \n                          .\n                         \n\n\n\n                          (Optional) Edit the chart properties for the new view, if desired.\n                          \n                          For more information about chart properties, see\n                          \n                           Applying and Resetting Chart Properties\n                          \n                          .\n                         \n\n\n\n                          Enter a title for the new view.\n                          \n                          For more information, see\n                          \n                           Editing the Name or Description of a Visualization Card\n                          \n                          .\n                         \n\n\n\n                          Power the new view by dragging the desired DataSet columns into the appropriate fields.\n                          \n                          For more information about applying DataSet columns, see\n                          \n                           Applying DataSet Columns to Your Chart\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Remember that for every new drill path you create, you are filtering off of a new column and all columns \"above\" it in the drill path. This means that you cannot\n                             \n                              usually\n                             \n                             add a column you are already filtering off of to a path; otherwise you encounter problems. The one exception to this is value columns. You can utilize the same value column in a drill path as desired; in fact, most drill paths require that you use the same value column for each successive drill path layer.\n                            \n\n\n\n\n\n\n                          Click\n                          \n                           Save this View.\n                          \n\n                          This closes the drill path\n                          \n                           Edit\n                          \n                          view, returning you to the Drill Path page. It is a good idea to test your new drill path by returning to the top-level page and clicking any of the graph elements. If successful, a new chart appears representing the data for the graph element you clicked.\n                         \n\n\n\n                          (Optional) Add subsequent drill path layers by returning to the Drill Path page and repeating steps 3 through 10.\n                         \n\n\n\n                          (Optional) Prevent drilling to the data drill path layer by clicking\n                          \n                           Prevent drilling to final data grid view\n                          \n                          .\n                         \n\n\n\n                        Editing an existing drill path\n                       \n\n                        You can go into an existing drill path and edit the data for any view in that path.\n                       \n\n\n                         To edit an existing drill path,\n                        \n\n\n\n\n                          Click the KPI card to open the Details view.\n                         \n\n\n\n                          Click\n                          \n                          , then select\n                          \n                           Edit Drill Path\n                          \n                          .\n                          \n                          The Drill Path page opens.\n                         \n\n\n\n                          Click\n                          \n                           Edit\n                          \n                          to the right of the drill view name.\n                          \n                          The drill path\n                          \n                           Edit\n                          \n                          view opens.\n                         \n\n\n\n                          Make your edits as desired.\n                         \n\n\n\n                          Click\n                          \n                           Save this View\n                          \n                          .\n                         \n\n\n\n                        Reordering a drill path\n                       \n\n                        You can change the sequence of levels in a drill path in the Drill Path page. Each level is represented as a tile; you can simply click and drag a tile to move it into a different position. When you do this, the drill path for the card adjusts automatically. Not that you\n                        \n                         cannot\n                        \n                        move the tiles for the top and bottom levels in a drill path, as these are integral components of the drill path structure.\n                       \n\n\n                         To reorder a drill path,\n                        \n\n\n\n\n                          Click the KPI card to open the Details view.\n                         \n\n\n\n                          Click\n                          \n                          , then select\n                          \n                           Edit Drill Path\n                          \n                          .\n                          \n                          The Drill Path page opens.\n                         \n\n\n\n                          Mouse over the tile for the drill level you want to move so that it highlights.\n                         \n\n\n\n                          Drag the tile to the desired location in the drill path.\n                         \n\n\n\n\n\n                          Video - Reordering a Drillpath\n                         \n\n\n\n\n\n\n\n\n\n                        Preventing drilling to the data drill path layer\n                       \n\n                        The \"bottom\" drill path layer of any chart is, by default, a table containing the underlying data for the graph element you clicked. You can prevent drilling to the \"bottom\" drill path layer.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n\n\n                                This option controls view-only access to drilling to the \"bottom\" drill path layer in the Chart view. The Table view still shows the data powering the chart, but not the full underlying data of the DataSet.\n                               \n\n\n\n\n\n                              The bottom-layer data table is not available when drilling down into a Card from the Page level.\n                             \n\n\n\n\n\n\n\n\n                         To prevent drilling to the data drill path layer,\n                        \n\n\n\n\n                          Click the KPI card to open the Details view.\n                         \n\n\n\n                          Click\n                          \n                          , then select\n                          \n                           Edit Drill Path\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Prevent drilling to final data grid view\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can further protect a card by selecting the\n                           \n                            Only the owner and administrators can edit this Card\n                           \n                           option.\n                          \n\n\n\n\n                        Deleting a view from a drill path\n                       \n\n                        You can go into a drill path and remove views from that drill path.\n                       \n\n\n                         To remove a drill path layer from a chart,\n                        \n\n\n\n\n                          Click the KPI card to open the Details view.\n                         \n\n\n\n                          Click\n                          \n                          , then select\n                          \n                           Edit Drill Path\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Remove\n                          \n                          to the right of the drill view name.\n                         \n\n\n\n                          Click\n                          \n                           Remove\n                          \n                          to confirm.\n                         \n\n\n\n                        Example 1\n                       \n\n                        Suppose a company called \"WidgetSoft\" sells products to different companies located in Florida and Georgia. The following spreadsheet records the sales of the salespeople, \"Jensen,\" \"Kohler,\" and \"Montoya,\" over a period of three days in January, with the specific amounts and customers for each sale:\n                       \n\n\n\n\n                        The manager of the sales team wants to create a single KPI card to represent all of the information in this spreadsheet. Because there is too much information here to show in one view, she decides to implement a drill path so that viewers can drill down and see successive views of different information. In the first view, she decides to show the amounts pulled in by Jensen, Kohler, and Montoya for the date range specified. She chooses \"Vertical Stacked Bar\" as the chart type and selects the \"Salesperson,\" \"Date,\" and \"Amount\" columns to power the chart. The resulting chart appears as follows:\n                       \n\n\n\n\n                        The manager begins to implement a drill path in the chart using the procedure provided in\n                        \n                         Adding a drill path to a chart\n                        \n                        . For the first drill path layer, she wants to show how much sales revenue was respectively pulled from Florida and Georgia. She adds a new view, selects Map as the chart type, drags the \"Amount\" column into the\n                        \n                         State Value\n                        \n                        field, and drags the \"State\" column into the\n                        \n                         State Name\n                        \n                        field. Even though she already used the \"Amount\" column, she can do so again because it is a value column. If she had chosen \"Salesperson\" or \"Date\" again, however, the drill path would not function correctly. The manager then saves the new view. If a user were to open the Details view for the chart and click the \"Jensen\" bar for 2011-01-06, the following new view would appear:\n                       \n\n\n\n\n                        In this view, the amounts for the two \"FL\" rows for this salesperson and date are aggregated. Hence, the value for Georgia is \"12.4k,\" the same as in the spreadsheet, but the value for Florida is \"15.86k,\" the sum of the two amounts.\n                       \n\n                        The manager decides to add a second drill path layer in which the customers for each state are shown. She goes back into the Drill Path screen and adds another new view. In this view, she selects \"Vertical Bar\" as the chart type and uses the \"Amount\" and \"Customer\" columns to power the chart. She does\n                        \n                         not\n                        \n                        select the \"State\" column because she is already filtering off of that column. She saves the new view. If a user were to open the Details view, click the \"Jensen\" bar for 2011-01-06 as before, then click the state of Florida, the following view would appear:\n                       \n\n\n\n\n                        This shows the two customers and the amounts they paid (second drill path layer) for the state of Florida (first drill path layer) for Jensen on January 6, 2011 (top-level view). If a user were to click the state of Georgia instead, only one bar would appear, because there is only one row that contains data for Jensen on January 6 for the state of Georgia.\n                       \n\n                        However, if that user were to drill down into the \"Kohler\" bar for January 8 on the top-level view, then click Georgia, two bars would appear, one for each customer.\n                       \n\n\n\n\n                        Example 2\n                       \n\n                        Suppose \"Office Guru\" sells office supplies to customers throughout the entire United States. The sales manager has created a simple, two-column \"Top Customers\" chart that shows the top ten highest-paying customers for the last four years. The data for this chart has been gleaned from a much larger DataSet, and appears as follows:\n                       \n\n\n\n\n                        The resulting Vertical Bar chart appears as follows:\n                       \n\n\n\n\n                        The manager wants to show more detail about these customers, in particular how much they are spending on different categories and subcategories of products. This information is found in the larger DataSet. The manager decides to drill down from the original, two-column DataSet to the larger, more detailed DataSet to show this information. A section of this larger DataSet appears in the following image, with the key columns indicated.\n                       \n\n\n\n\n                        To drill to this second DataSet, the sales manager first opens the\n                        \n                         Edit Drill Path\n                        \n                        screen for the \"Top Customers\" chart then selects\n                        \n                         Add a view\n                        \n                        . In the drill path\n                        \n                         Edit\n                        \n                        view, he selects his new DataSet, \"ordersheet.xls.\" A message appears stating that the DataSets are compatible because the category column from the first DataSet, \"Customer Name,\" is also found in the new DataSet. The manager picks a new chart type, Vertical Stacked Bar, and applies \"Sales\" to the\n                        \n                         Y Axis\n                        \n                        field, \"Product Category\" to the\n                        \n                         X Axis\n                        \n                        field, and \"Product Subcategory\" to the\n                        \n                         Series\n                        \n                        field. Because this DataSet contains more customer names than in the original chart, he applies filters so that only the top customers are represented.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           At this point, this preview shows the data for the entire DataSet, even though you set filters. This is because the filters are applied only when you drill.\n                          \n\n\n\n\n                        The manager clicks\n                        \n                         Save this View\n                        \n                        to add the view to the drill path for the chart.\n                       \n\n                        When a user clicks a bar in the \"Top Customers\" chart, a new view appears showing the amounts spent on specific types of product. The following screenshot shows the view for the customer named \"Karen Carlisle\":\n                       \n\n\n\n\n                        Drilling between maps\n                       \n\n                        With both U.S. state maps and latitude-longitude maps in which U.S. cities are represented, you can create \"zoomed\" drill layers by drilling down to the same map. For example, if you had a latitude-longitude map showing values per state and you added the same map as a drill layer, clicking any point in the country-level map would bring up a \"zoomed in\" state or region level that displayed all of the original data points from that state or region.\n                       \n\n                        Results from using this technique vary depending on the map type, your DataSet, and the specific columns you apply.\n                       \n\n                        For more information about U.S. state maps, see\n                        \n                         Latitude-Longitude Map\n                        \n                        .\n                       \n\n\n\n                          Video - Creating a Map Drill to Zip Code Using the Zips to FIPS Connector", "Preview Article": "Click here to preview", "URL Name": "360042924094", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004640", "Archived Date": "", "Language": "English", "Primary Version": "Adding a Drill Path to Your Chart", "Article Total View Count": "14,508", "": "", "Article Created Date": "10/24/2022, 10:18 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Adding a Drill Path to Your Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Analyzer\n              \n", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}