{"file_path": "../../raw_kb_v2\\article\\360042932414\\index.html", "content": {"title": "\n\n\n NetSuite Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe NetSuite Writeback connector uses a Domo DataSet to create records in your NetSuite account. Each row encapsulates a single NetSuite record (except when using Sublist Grouping, which is discussed later). The connector decides which values correspond to each field in NetSuite through a feature called Field Mapping (found under the\n **Configuration Field Mapping**\n tab). In this feature, you choose a DataSet column for each NetSuite field. The mapping is divided between required and optional fields. All required fields need a specified column to create your Writeback DataSet. Note that some records can have empty required fields and still successfully create the record. For optional fields, first use the searchable dropdown to choose which NetSuite field you wish for this row. Then, choose which column you wish to correspond to that field. Use the +/- buttons to add more optional rows.\n\n\n Some NetSuite records (such as \"Sales Order\" and \"Journal Entry\") require sublists in addition to fields. A sublist is essentially a line item for a record. For example, a commonly used sublist is the “Item” sublist for a sales order. Because the item requires many different additional values (e.g. Tax Code, Quantity, Price, etc.), it cannot be stored only as a field. The connector decides how to input sublists using a feature called Sublist Field Mapping (found under the\n **Configuration Sublist Mapping**\n tab). In this feature, you can choose which sublists you want in your record. Once you have chosen one, a tab will appear similar to the\n **Configuration Field Mapping**\n tab, containing the required fields and the optional fields for that sublist.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\n\n###\n Multiple sublist entries\n\nSome records may require multiple sublist entries to execute successfully. The NetSuite Writeback connector has two ways of doing this: (1) the plus and minus buttons in the top right corner of the\n **Sublist Field Mapping**\n tab and (2) through sublist grouping.\n\n###\n Plus and minus buttons (+/-)\n\nThe plus and minus buttons should be used if the values you want to enter into the different sublists are contained in the same row but different columns. In this case, simply add another mapping and choose which columns will map over for the new sublist entry.\n\n###\n Sublist grouping\n\nSublist grouping should be used if the values you want to enter into the different sublists are contained in the same columns but different rows. To get sublist grouping working for your DataSet, first choose a column to group by. This column should have the same value across each row that you want associated with that record. For example, let's say we had the following table:\n\n\n Customer Name\n  |\n Subsidiary\n  |\n item\n  |\n quantity\n  |\n| --- | --- | --- | --- |\n|\n Example Customer 1\n  |\n HH Inc.\n  |\n Apple\n  |\n 1\n  |\n|\n Example Customer 1\n  |\n HH Inc.\n  |\n Artichoke\n  |\n 5\n  |\n|\n Example Customer 2\n  |\n HH Inc.\n  |\n Basketball\n  |\n 3\n  |\n|\n Example Customer 2\n  |\n HH Inc.\n  |\n Bicycle\n  |\n 4\n  |\n|\n Example Customer 3\n  |\n HH Inc.\n  |\n Clarinet\n  |\n 6\n  |\n|\n Example Customer 3\n  |\n HH Inc.\n  |\n Camera\n  |\n 5\n  |\n|\n Example Customer 4\n  |\n HH Inc.\n  |\n Desk\n  |\n 2\n  |\n|\n Example Customer 4\n  |\n HH Inc.\n  |\n Dart\n  |\n 7\n  |\n\nTo create some Sales Orders with this DataSet, with records being divided based off of which customer bought items, you might choose the “Customer Name” column as the Group-By column, as that column divides the various rows. The connector will then create a new sublist for each row with the same customer name. The connector will pull data from the same columns as directed in the Sublist Mapping, but will just differ on the row. In this example, the connector will create four sales orders, each with two items:\n\n The first for Example Customer 1, with two items:\n\t+ Item: Apple, QTY: 1\n\t+ Item: Artichoke, QTY: 5\n* The second for Example Customer 2, with two items:\n\n+ Item: Basketball, QTY:  3\n\t+ Item: Bicycle, QTY: 4\n* The third for Example Customer 3, with two items:\n\n+ Item: Clarinet, QTY: 6\n\t+ Item: Camera, QTY: 5\n\n\n* The fourth for Example Customer 4, with two items:\n\n+ Item: Desk, QTY: 2\n\t+ Item: Dart, QTY: 7\n\n\n###\n Other considerations\n\n\n* The connector uses SQL to differentiate between values. For the SQL to function properly, the connector has to use a separator to divide different cells in the DataSet. The connector currently allows you to choose between multiple separators. Be sure to choose one that doesn’t appear in any data being entered into the sublist in question.\n* The connector expects field values to be equal across a group of rows, as these should be common throughout the whole record being created. Regardless of whether they are equal or not, the connector will use the field value in the first row.\n* Note that this grouping feature is used for all NetSuite Writeback DataSets, regardless of whether they have sublists or not. If you aren’t using sublists for your DataSet, be sure to choose a Group-By column that has a unique value in each row. If you choose one that isn’t unique across rows, the connector will either fail or miss some of the duplicate rows and you’ll miss out on some data in NetSuite.\n\n\n###\n Powering up the NetSuite WriteBack connector\n\nTo power up the connector, follow these steps:\n\n###\n Install the Bundle in NetSuite\n\n\n1. In NetSuite, go to\n **Customization > SuiteBundler > Search & Install Bundles**\n .\n2. Search for “Domo” in the\n **Keywords**\n section.\n3. Click on\n **Domo NetSuite Writeback**\n .\n4. Click\n **Install**\n .\n5. Go to\n **Customization > SuiteBundler > Search & Install Bundles > List**\n .\n6. Search for and click on\n **Domo NetSuite Writeback**\n .\n7. Check to see that its status is complete, signified by the green checkmark.\n\n\n####\n Create your token ID and token secret\n\n\n1. In Netsuite, choose the role you want to access data in.\n2. Go to your main page by clicking on the house icon in the top left corner of your screen.\n3. Click\n **Manage Access Tokens**\n in the\n **Settings**\n box in the bottom left corner.\n4. Click\n **New Access Token**\n and choose\n **Domo NetSuite Writeback Script**\n .\n5. [Optional] Choose a desired token name.\n6. Click\n **Save**\n .\n\nA token ID and token secret should appear underneath the other information. Store this information securely, since this information won’t be shown again.\n\n###\n Locate your account ID\n\n\n1. Go to\n **Setup > Integration > Web Services Preferences**\n .\n\nYour account ID should be found directly under \"Primary Information.\"\n\n###\n Locate your script ID and deployment ID\n\n\n1. Go to\n **Customization > Scripting > Scripts**\n .\n2. Find and click on\n **Domo NetSuite Writeback Script**\n . This can be done by looking through the results (which should be in alphabetical order) or by typing\n\nnetsuiteWriteback.js\n\ninto the\n **Script File**\n box at the top.\n3. Click the\n **Deployments**\n tab.\n4. Follow the instructions to get to the Script Deployment page.\n5. Locate the script ID and deployment ID under “External URL.”\n\n\n####\n Locate your Domo Client ID and Secret\n\n\n1. Log into your Domo developer account at\n\nhttps://developer.domo.com/login\n\n.\n2. Create a new client\n\n.\n3. Select the desired data and user application scope.\n4. Click\n ****Create****\n .\n\n\n####\n Configure your NetSuite Writeback DataSet\n\nTo configure your connection,\n\n. Find your Dataset IDs.\n\n1. Navigate to the Domo DataSet you wish to send to NetSuite.\n\t2. Locate the ID, which is located in the DataSet URL. For example, in the URL\n\n https://customer.domo.com/datasources/aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee/details/settings\n\n\n\t , the ID is\n\n aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee.\n2. Choose your NetSuite record.\n\n\n For a full list of NetSuite records, check out the NetSuite record browser (\n\nhttps://www.netsuite.com/help/helpcenter/en\\_US/srbrowser/Browser2016\\_1/script/record/account.html\n\n).\n3. Configure your Field Mapping.\n\n* For each field in the mapping section, you have two options to input values:\n\n\t+ Dataset Column: Simply choose a column you want mapped to this row. For more information on how this works, read the preceding sections in this article.\n\t\t+ Static Value Input: Use this feature if you want the same value for this field for every record that the connector creates. To use this option, check the box\n\t\t **Use Static Value**\n\t\t . The searchable dropdown will change to a text box containing the static value you want entered.\n\t\t+ If the specific column you choose contains NetSuite Internal IDs, check the box\n\t\t **Use NetSuite Internal IDs?**\n\t\t .\n\t\t+ To add more optional fields, click the + button on the right end of the optional field row. The + button adds another optional field to the bottom of the list.\n\t\t+ To remove optional fields, click the - button next to the + button. The - button removes the optional field row that button is a part of.\n4. Configure your Sublist Field Mapping.\n\n* Check the box beside each sublist you want in your record.\n\t* Note that a field mapping tab similar to the previous tab becomes visible.\n\t* Configure each sublist mapping using the guidelines in step 3.\n5. Advanced setup.\n\n* For the Group By column, choose the specific column you want the sublist grouping to group rows into. For more information on how Sublist Grouping works and the Group By column, read the preceding sections in this article.\n\t* For the separator, choose a character that does not occur in the sublist columns you’re grouping together.\n\nOther Panes\n-------------\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042932414\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004023\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nNetSuite Writeback Connector\n\n", "article_total_view_count": "\n\n\n 4,842\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:18 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "netsuite_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}