{"file_path": "../../raw_kb_v2\\article\\360043428233\\index.html", "content": {"title": "\n\n\n Domo Mobile Security\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo Mobile includes the following state-of-the-art security features.\n\n\n Customer access control\n-------------------------\n\nDomo has partnered with numerous Identity Providers (IdP) to enable customers to easily integrate Domo with customers’ existing SAML-based SSO and Multi Factor Authentication (MFA) solutions. In this model, Domo never has access to passwords used for gaining access to Domo’s services. When logging in, a Domo client is redirected to its own SSO system to authenticate. Domo then receives a cryptographic token indicating a successful authentication against that customer’s infrastructure. When a customer changes his/her password in his/her own company infrastructure, the changes automatically work with Domo, yet Domo never has access to a customer’s password.\n\n\n Single sign-on\n----------------\n\nThe user will be required to sign into the company identity provider when they initially log in, which will then give them access to the Domo mobile app.\n\n\n 2-factor authentication\n-------------------------\n\nDomo offers customers the option of implementing an extra layer of security by supporting multi-factor authentication. Domo supports this by having users register their mobile device phone number where they will receive an SMS message whenever Domo needs to authenticate them (or alert them of any discrepancy). In the event an authentication request is identified as anomalous or matches one or more elevated risk factors, Domo will send a unique authentication code to their registered SMS device. For users without a registered SMS device, additional authentication questions can be registered to provide for improved security authentication.\n\n\n Encryption\n------------\n\nDomo encrypts all customer data that is stored at persistent storage within Domo. For this purpose, Domo utilizes Advanced Encryption Standard (AES) algorithm with a key size of 256 bits.\n\n\n To protect our customers’ data as it is transmitted across untrusted networks, Domo uses a combination of secure protocols, including TLS, with only a limited number of trusted ciphers supported. SSH, and SFTP is also supported, where appropriate, for the secure transfer of data. Domo does not allow clear text or unencrypted data communication protocols. Domo’s best practice ensures that all Domo customers use at least one of the provided secured services (TLS, SSH, SFTP). We use TLS 1.2.\n\n\n IOS and Android native encryption is used for content we cache.\n\n\n Session management & timeout\n------------------------------\n\nWhen the user first logs in, we offer a session token that expires by default in 8 hours. This is configurable in hour increments with a min of 1 and a max of 24. Finer control around session token expiration times (making it possible to go down to 15-20 minutes) is currently under development.\n\n\n Customer audit logging\n------------------------\n\nAll end user activity in the Domo instance is logged. This log includes at a minimum, what action was taken, when it happened, and who initiated the action. Customers can then review these logs within their Domo instance at any time for user activity and anomalies and can filter this data by user, time, and event.\n\n\n Customers also have the ability to integrate their own Domo instance logs directly into their in-house Security Information Event Management (SIEM) tools and internal incident processes. This allows customers to consume the Domo instance logs within their own Security Operations Center (SOC), and achieve near real time visibility into all user actions in their instance.\n\n\n Third-party penetration testing\n---------------------------------\n\nDomo undergoes independent third-party application, mobile, system, and network penetration tests bi-annually. The executive reports detailing the scope, any findings, and the status of each finding is then made available to customers in our Independent Security Reports (ISR).\n\n\n Content control with export and download restrictions\n-------------------------------------------------------\n\nCopy/paste, downloading, and sharing of Domo content can be locked down upon customer request.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428233\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004324\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDomo Mobile Security\n\n", "article_total_view_count": "\n\n\n 4,878\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:37 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "domo_mobile_security", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "domo_mobile", "url": "/s/topic/0TO5w000000ZancGAC"}]}