{"file_path": "../../raw_kb_v2\\article\\360043434433\\index.html", "content": {"title": "\n\n\n Facebook Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo's Facebook connector can combine Facebook insights with data from any other source—finance analytics, CRM software, etc.—to target campaigns with unparalleled precision. Use this connector to retrieve data about posts, page fans, referrals, account information, and the like. To learn more about the Facebook API, visit their page (\n\nhttps://developers.facebook.com\n\n).\n\n\n This version of the Facebook connector allows you to retrieve only 30 days worth of Facebook data. The Advanced version allows you to retrieve more than 30 days worth of data and also includes more report types and configuration parameters. To learn about the Advanced version of the connector, see\n\nFacebook Advanced Connector\n\n.\n\n\n The Facebook connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Facebook account in the Data Center. This topic discusses the fields and menus that are specific to the Facebook connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector lets you retrieve data about Facebook impressions, followers, likes, and sentiment toward your company.\n  |\n|\n**Primary Metrics**\n | * Followers\n* Post likes\n* Trending posts\n* Reaction to posts\n* Audience demographics\n* Page ratings\n* Impressions\n* Views\n* Comments\n* Top post metrics over time\n |\n|\n**Primary Company Roles**\n | * Director of marketing\n* Social media manager\n* CMO\n* Sales and marketing teams\n |\n|\n**Average Implementation Time**\n |\n Typically less than an hour, but may take longer to get the right data in.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 4\n\n\n |\n\n\n Best Practices\n-----------------\n\n\n* Multiple accounts can be selected for reports. This is useful for large organizations with multiple locations or divisions.\n* Reports allow for custom date ranges to be selected.\n* This connector only provides 30 days worth of data. If you want to retrieve more data, use the\n\nFacebook Advanced connector\n\n.\n\nPrerequisites\n---------------\n\nTo connect to your Facebook account and create a DataSet, you must have the following:\n\n Your Facebook username or your telephone number\n* Your Facebook password\n\nConnecting to Your Facebook Account\n-------------------------------------\n\nThis section enumerates the options in the\n\nCredentials\n\nand\n\nDetails\n\npanes in the Facebook Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Facebook connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Facebook accounts in Domo) to open the Facebook OAuth screen where you can enter your Facebook username and password. Once you have entered valid Facebook credentials, you can use the same account any time you go to create a new Facebook DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Facebook when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Facebook.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Facebook report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Complete Page Insights\n  |\n Returns a full list of available insights for pages selected under\n **Accounts**\n .\n  |\n|\n Page Fans\n  |\n Returns information on users who have “liked” the pages selected under\n **Accounts**\n .\n  |\n|\n Page Fans by Age, Gender\n  |\n Returns information on users who have “liked” the pages selected under\n **Accounts**\n , broken down by age and gender.\n  |\n|\n Page Fans by City\n  |\n Returns information on users who have “liked” the pages selected under\n **Accounts**\n , broken down by city.\n  |\n|\n Page Fans by Country\n  |\n Returns information on users who have “liked” the pages selected under\n **Accounts**\n , broken down by country.\n  |\n|\n Page Fans by Like Source\n  |\n Returns information on users who have “liked” the pages selected under\n **Accounts**\n , broken down by the most common places that users can “like” the page.\n  |\n|\n Page Fans Online\n  |\n Returns information on users who have “liked” the pages selected under\n **Accounts**\n , broken down by the hours in which they are online.\n  |\n|\n Page Feed\n  |\n Returns a list of Posts on the pages selected under\n **Accounts**\n . This includes Posts created by the Page, and those created by other users.\n  |\n|\n Page Impressions by Age, Gender\n  |\n Returns information on users that have seen any content associated with the pages selected under\n **Accounts**\n , broken down by age and gender.\n  |\n|\n Page Impressions by City\n  |\n Returns information on users that have seen any content associated with the pages selected under\n **Accounts**\n , broken down by city.\n  |\n|\n Page Impressions by Country\n  |\n Returns information on users that have seen any content associated with the pages selected under\n **Accounts**\n , broken down by country.\n  |\n|\n Page Impressions by View Frequency\n  |\n Returns information on users that have seen any content associated with the pages selected under\n **Accounts**\n , broken down by the number of times they have seen the content.\n  |\n|\n Page Impressions Details\n  |\n Returns metrics relating to how many people saw or interacted with the pages selected under\n **Accounts**\n .\n  |\n|\n Page Info\n  |\n Returns information about pages selected under\n **Accounts**\n .\n  |\n|\n Page Interactions\n  |\n Returns metrics relating to how many users interacted with certain parts of the pages selected under\n **Accounts**\n .\n  |\n|\n Page Posts\n  |\n Returns information about posts on the pages selected under\n **Accounts**\n .\n  |\n|\n Page Post Lifetime Metrics\n  |\n Returns the lifetime metrics related to page posts selected under\n **Accounts**\n .\n  |\n\n\n |\n|\n Accounts\n  |\n Check the box for each page you want to pull data from. You can select all attributes for the entity by clicking\n **Select All**\n or clear all selected pages by clicking\n **Clear All**\n .\n  |\n|\n Period\n  |\n Select the time period for which insight metrics will be shown.\n\n\n |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n What version of the Facebook API does this connector use?\n\nThis connector uses version 2.2 of the Facebook API (\n\nhttps://graph.facebook.com/v2.2\n\n).\n\n####\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Complete Page Insights\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Fans\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Fans by Age, Gender\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Fans by City\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Fans by Country\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Fans by Like Source\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Fans Online\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Feed\n  |\n /\n *{page\\_id}*\n /feed\n  |\n|\n Page Impressions Details\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Impressions by Age, Gender\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Impressions by City\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Impressions by Country\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Impressions by View Frequency\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Info\n  |\n /\n *{page\\_id}*  |\n|\n Page Interactions\n  |\n /\n *{page\\_id}*\n /insights\n  |\n|\n Page Posts\n  |\n /\n *{page\\_id}*\n /posts\n  |\n|\n Page Post Lifetime Metrics\n  |\n /\n *{post\\_id}*\n /insights\n  |\n\n\n#####\n What kind of credentials do I need to power up this connector?\n\nYou need the email address and password associated with your Facebook account.\n\n####\n How do I know my Facebook credentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n####\n Do I need a certain kind of account to set up the connector?\n\nAny Facebook account can be used to set up the connector. However, you must be an administrator of the page(s) that you want to retrieve data for.\n\n####\n Can I get information about pages I am not an administrator for?\n\nNot with this connector. To retrieve public information about pages that you are not an administrator for, you need to use the\n\nFacebook Advanced connector\n\n.\n\n####\n How frequently will my data update?\n\nMost information about pages is updated every 24 hours. A small number of insight metrics are updated roughly every 15 minutes. It is recommended that DataSets usually be configured to run every 24 hours.\n\n####\n Why are the dates in Facebook's Insights UI and the dates in Domo sometimes different?\n\nOften people validate their DataSets by comparing the results of the connector to the statistics they can see in Facebook's Insights UI. When they are doing so, the dates are generally off by 1 day. For example, if the Facebook UI shows 1000 views for a page on March 3, the connector will report 1000 views with a date timestamp of March 4. This is because the API returns data for a time period that ends at the timestamp specified. In this example, there were 1000 views during the day that ended at Midnight on March 4, in other words, March 3. The Insights UI takes this into account and reports the 1000 views as having happened on March 3.\n\n####\n What is the difference between the Facebook and Facebook Advanced connectors?\n\nThe Facebook Advanced connector provides more reports than the Facebook connector. The Facebook connector's reports are limited to deal directly with pages. Reports about the user, domains, application monitoring and public page information are in the Advanced connector.\n\n\n The Facebook connector is also limited to return information about the last 30 days, while the Advanced connector allows the user to query data for any date range.\n\n####\n Are there any API limits I should be aware of?\n\nFacebook limits the number of calls that can be made each hour for each user and page. As long as you don't run the DataSet too often, the connector manages this for you.\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n* Be aware that when comparing page statistics in your Facebook DataSet to those found in Facebook’s Insights UI, the dates are generally off by 1 day. For example, if the Facebook UI shows 1000 views for a page on March 3, the connector will report 1000 views with a date timestamp of March 4. This is because the API returns data for a time period that\n *ends*\n at the timestamp specified. In this example, there were 1000 views during the day that ended at midnight on March 4—in other words, March 3. The Insights UI takes this into account, and reports the 1000 views as having happened on March 3.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043434433\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003477\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFacebook Connector\n\n", "article_total_view_count": "\n\n\n 11,646\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "facebook_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}