{"file_path": "../../raw_kb_v2\\article\\360043435173\\index.html", "content": {"title": "\n\n\n Google Contacts Connector\n\n\n", "article_body": "\n\n*Important:**\n\nDue to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. All pre-existing DataSets will continue to run normally. Current Connectors that rely on Google OAuth authentication will no longer be able to power up new DataSets. These connectors include the following:\n * Google BigQuery\n* Google Adwords via Google BigQuery\n* DoubleClick Campaign Manager via Google Cloud Storage (DTV2)\n* Google Cloud Storage\n* Google Contacts\n* Google Drive\n* Google Gmail\n* Google Admin SDK Reports\n\nIf you need to change a pre-existing Google OAuth DataSet, please use the corresponding Service Account connector. The following Service Account connectors are now available:\n\n Google BigQuery Service\n* Google Ads (fomerly AdWords) via Google BigQuery Service\n* Google Drive Service\n* Google Cloud Storage Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Admin SDK Reports Service\n\nAll other equivalent Google Service Account connectors are currently in development. Domo will communicate when these connectors become available. You will need to look for the Service Account equivalent connector in Data Center or the App Store and use that connector to get their data.\n\n\n Domo recommends that you proactively repower existing Google connections by creating new DataSets utilizing the new Service Account Key connectors as the connectors become available.  Domo will notify you if any further migration changes should arise.\n\n\n Intro\n-------\n\nGoogle Contacts is an online address book that integrates with other Google products such as Gmail, Google Calendar, and Google Drive. To learn more about the Google Contacts API, visit their page (\n\nhttps://developers.google.com/google...s/contacts/v3/\n\n).\n\n\n You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Contacts connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Google account and create a DataSet, you must have the username and password for your account.\n\n\n Connecting to Your Google Contacts Account\n--------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Contacts Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google Contacts connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google Contacts accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Contacts DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Details Pane\n\nThis pane contains a primary menu from which you select your desired Google Contacts report type.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Google Contacts report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Contacts\n  |\n Retrieves your list of contacts from Google.\n  |\n|\n Groups\n  |\n Retrieves your list of contact groups from Google.\n  |\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043435173\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003403\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Contacts Connector\n\n", "article_total_view_count": "\n\n\n 4,646\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "google_contacts_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}