{"file_path": "../../raw_kb_v2\\article\\1500009571721\\index.html", "content": {"title": "\n\n\n Amazon Advertising Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAmazon Advertising connects your brand to Amazon customers wherever they share, read, listen, purchase, research and download online, across devices. Use Domo's Amazon Advertising connector to retrieve entities reports, performance reports, and portfolio listings. To learn more about the Amazon Advertising API, visit their page (\n\nhttps://advertising.amazon.com/about-api\n\n).\n\n\n You connect to your Amazon Advertising account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon Advertising connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\n\n To connect to your Amazon Advertising account and create a DataSet, you must have your Amazon credentials (email address or phone number and password).\n\n###\n\nHow to create a new Amazon Advertising Account?\n\n*To add an Amazon Advertising account to Domo from the Accounts view:**\n\n\n 1. Navigate to the\n **Accounts**\n section of the\n\n\n**Data Center**\n\n\n by clicking on the Accounts icon in the left-hand pane in the Data Center.\n\n2. In\n **Accounts**\n , click\n **Add Account**\n .\n\n3. Select the desired Amazon Advertising connector and click\n\n\n**Connect**\n .\n\n4. Select the region of the Amazon marketplace you want to access, and click\n **Connect**\n .\n\n5. An Amazon login window will appear. Enter your Amazon credentials and log into your Amazon account.\n\n\n 6. An entry for the new Amazon Advertising account will appear in the\n **Accounts**\n view listing.\n\n\n**To add an\n\n\n Amazon Advertising\n\n\n account to Domo by adding a DataSet and entering new account information:**\n\n\n 1. While creating a new Amazon Advertising account, you need to select the region of the Amazon marketplace you want to access and click\n\n\n**Connect**\n .\n\n2. An Amazon login window will appear. Enter your Amazon credentials and log into your Amazon account.\n\n\n 3. As you add the Amazon Advertising account through the connector, an entry for the new account appears automatically in the\n **Accounts**\n view.\n\n###\n\nHow to associate my newly created Amazon Advertising account with an existing dataset?\n\nAssociating a newly created Amazon Advertising account with the existing DataSet:\n\n\n 1. Visit the\n **DataSets**\n page in the Data Center.\n\n2. Locate your existing DataSet that you want to associate with a new Amazon Advertising account.\n\n\n 3. The DataSet details will appear.\n\n\n 4. Click\n **Settings**\n tab. You will be redirected to the Connector's Credentials section.\n\n\n 5. Here, you can select your new Amazon Advertising account if it's already created, or you can create a new account to associate with your selected DataSet.\n\n\n 6. Click\n **Save**\n .\n\nConnecting to Your\n\nAmazon Advertising\n\nAccount\n-----------------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the\n\nAmazon Advertising\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo\n\nAmazon Advertising\n\nConnector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Amazon Advertising accounts in Domo) to open the Amazon OAuth screen where you can enter your Amazon email address and password. Once you have entered valid Amazon credentials, you can use the same account any time you go to create a new\n\nAmazon Advertising\n\nDataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\nIf you are already logged into Amazon when you connect in Domo, you are authenticated automatically when you click\n\n*Add account**\n\n. If you want to connect to an account that is different from the one you are logged into, you must first log out of the current Amazon account.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Profile\n  |\n Select the profile you want to retrieve data for.\n  |\n|\n Report\n  |\n\nSelect the Amazon Advertising report you want to run. The following reports are available:\n\n  |  |\n| --- | --- |\n|\n Entities Reports\n  |\n Retrieves a list of various entities like adGroups, campaigns, negative keywords etc, for the given advertising type.\n  |\n|\n Performance Report\n  |\n Returns details about the performance of adGroups, campaigns, productAds, etc. for the given advertising type.\n  |\n|\n List Portfolios\n  |\n Retrieves a list of portfolios.\n  |\n\n|\n|\n Advertising Type\n  |\n Select whether you want to retrieve data for brands, products, displays, or DSP campaigns.\n  |\n|\n Record Type\n  |\n Select the record type you want to retrieve.\n  |\n|\n State filters\n  |\n Select desired state filters.\n  |\n|\n Tactic for Specified Advertising Filter\n  |\n Select the advertising tactic you want to filter your data by.\n  |\n|\n Segment by Search Terms\n  |\n Select whether you want to break down your report by search term.\n  |\n|\n Segment by Placements\n  |\n Select whether you want to break down your report by placement.\n  |\n|\n Metrics\n  |\n Select all the metrics you want to pull data for.\n  |\n|\n Dimensions\n  |\n Select the dimensions to retrieve data for.\n  |\n|\n DSP Report Type\n  |\n Select the DSP report type to retrieve data for.\n  |\n|\n DSP Metrics\n  |\n Select the DSP metrics you want to pull data for.\n  |\n|\n Import Type\n  |\n Select the import type for your data. Import types are as follows:\n * **Delta**\n . This import type updates the\n\ndata for the last 14 days for each run. Dates selected will be only be used on the first run. Select 'Append' as your update mode.\n\nFor more information about update modes, see\n\nAdding a DataSet Using a Data Connector\n\n.\n* **Rolling**\n . This import type keeps a rolling window of a specified number of days of data. You can select a specific time period or use relative dates. When using this import type, be sure to select \"Replace\" as your update mode. For more information about update modes, see\n\nAdding a DataSet Using a Data Connector\n\n.\n* **Specific**\n . This import type retrieves data for specific dates for every run. This import type is not recommended.\n |\n|\n Date Selection\n  |\n Select the date format for your data.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n ****Days Back****\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ****************End Date****************\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****************Start Date****************\n and 5 for\n ****************End Date****************\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ****************Start Date****************\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****************Start Date****************\n and 5 for\n ****************End Date****************\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Time Period\n  |\n Specify the time period that you would like to receive data for.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n####\n\nI received an error \"An unknown scope was requested\" when authenticating my Amazon account. Or, when I try to create an account it opens an OAuth window, closes it, and fails with the message \"There was a problem creating your account. Please try again.\" What can I try?\n\nPlease verify that your app is whitelisted with Amazon. Find your \"Get started with the Amazon Advertising API\" email and make sure you have accepted the Amazon Advertising API License Agreement.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500009571721\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003231\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon Advertising Connector\n\n", "article_total_view_count": "\n\n\n 4,751\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "amazon_advertising_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}