{"file_path": "../../raw_kb_v2\\article\\000005128\\index.html", "content": {"Title": "Glossary — Data Literacy", "Article Body": "Intro\n                       \n\n                        This glossary provides definitions for terms used in the Data Literacy course, and many of the terms appear in other materials across Domo's education offerings.\n                       \n\n                        Glossary\n                       \n\n\n\n\n\n                            Term\n                           \n\n\n\n                            Definition\n                           \n\n\n\n\n\n\n\n                            Aggregation\n                           \n\n\n\n                            The process of combining values from different records together to get a summarized or higher-level view of the data. Aggregating data yields a result that is less detailed and less granular.\n                           \n\n\n\n\n\n                            Append\n                           \n\n\n\n                            A data accumulation/update method with which new incoming records are added to existing records in a dataset without modifying the existing records.\n                           \n\n\n\n\n\n                            Average\n                           \n\n\n\n                            The result of adding all values together and dividing by the number of records in the records set.\n                           \n\n\n\n\n\n                            Cardinality\n                           \n\n\n\n                            Describes the nature of the relationships between records in separate tables.\n                            \n\n\n                             Examples:\n                            \n                            many-to-one, meaning many records in a table relate to a single record in another table; many-to-many, meaning many records in a table relate to many other records in another table; one-to-one, meaning a record in a table relates to exactly one record in another table.\n                            \n\n\n\n\n\n                           Count\n                          \n\n                           Returns the number of values in the record set.\n                          \n\n\n\n                           Data\n                          \n\n                           Facts and statistics collected for reference or analysis.\n                           \n\n                           Data can be represented in various ways including numbers, text strings, dates, times, and Booleans (yes/no, true/false, 1’s/0’s).\n                          \n\n\n\n                           Data literacy\n                          \n\n                           Familiarity with basic data terms, data tables, the relationships between data tables, data visualizations, and storytelling with data.\n                          \n\n\n\n                           Data storytelling\n                           \n\n\n                           When we combine data and visualizations to tell an engaging and informative story with data, we move into the realm of data storytelling.\n                          \n\n\n\n                           Data tables\n                          \n\n                           Data are stored in tables consisting of rows and columns.\n                           \n\n                           A row is also called a record. Each column on the record contains a value pertaining to that record.\n                          \n\n\n\n                           Data visualization\n                          \n\n                           Leveraging graphics such as charts, diagrams, and pictures to demonstrate values, comparisons, and relationships in the data.\n                          \n\n\n\n                           Dimension tables\n                          \n\n                           Dimension tables contain data that further describe the rows in a fact table.\n                           \n\n\n                            Examples:\n                           \n                           A dimension table containing individual customer information could be used to further describe the customers referenced in a sales transactions table.\n                           \n\n\n\n\n                           Dimensions\n                          \n\n                           Values that describe a record (qualitative).\n                           \n\n\n                            Examples:\n                           \n                           product, name, ID, type, state, URL\n                          \n\n\n\n                           Fact table\n                          \n\n                           Fact or Transaction tables have records that represent an individual event or transaction.\n                           \n\n\n                            Examples:\n                           \n                           Sales transactions, support cases, or call center call logs.\n                          \n\n\n\n                           Foreign key\n                          \n\n                           A column or set of columns that matches the primary key of\n                           \n                           another table.\n                          \n\n\n\n                           Full outer join\n                          \n\n                           Returns all records from the left and right tables with records joined whenever the join condition is met.\n                          \n\n\n\n                           Granularity\n                          \n\n                           Refers to the level of detail or aggregation a record represents.\n                          \n\n\n\n                           Inner join\n                          \n\n                           Returns only the records from both joining tables that meet the join condition.\n                          \n\n\n\n                           Join\n                          \n\n                           Combines columns from multiple tables to create a new table where the join condition is met, meaning, the values in the joining columns in the two tables match.\n                           \n\n                           When joining tables, we refer to the two tables involved as left and right tables—the first table is the left table, and the second table is the right table.\n                           \n\n\n\n\n                           Left (outer) join\n                          \n\n                           Returns all records from the left table with records joined from the right table whenever the join condition is met.\n                          \n\n\n\n                           Maximum\n                          \n\n                           Returns the highest value among the record set.\n                          \n\n\n\n                           Metrics\n                          \n\n                           Measurable values, normally represented as numbers (quantitative).\n                           \n\n\n                            Examples:\n                           \n                           amount, quantity, views, clicks\n                           \n\n\n\n\n                           Minimum\n                          \n\n                           Returns the lowest value among the record set.\n                          \n\n\n\n                           Null\n                          \n\n                           Each cell in a table can contain a value or no value at all. When a cell contains no value, it is said to be null.\n                           \n\n                           Null is the absence of data. Null does not equal zero, and null does not equal null.\n                           \n\n\n\n\n                           Pillars of Data Visualization\n                          \n\n                           Message, audience, and medium are the three pillars of data visualization.\n                           \n\n                           These pillars help guide the creation and selection of\n                           \n                           data visualizations.\n                          \n\n\n\n                           Primary key\n                          \n\n                           A column or set of columns that uniquely identifies a record (row).\n                           \n\n                           Primary key columns cannot contain nulls.\n                           \n\n\n\n\n                           Qualitative data\n                          \n\n                           Descriptive data values. Often non-numeric but not always\n                           \n\n\n                            Examples:\n                           \n                           date, size, product name, feature\n                          \n\n\n\n                           Quantitative data\n                          \n\n                           Numeric data values on which mathematical functions\n                           \n                           can be performed.\n                           \n\n                           Metrics are a type of quantitative data.\n                           \n\n\n                            Examples:\n                           \n                           amount, quantity\n                           \n\n\n\n\n                           Right (outer) join\n                          \n\n                           The mirror image of left (outer) join — returns all records from the right table with records joined from the left table whenever the join condition is met.\n                          \n\n\n\n                           Sum\n                          \n\n                           Adds the values in a column together across the records in the record set.\n                          \n\n\n\n                           Unions\n                          \n\n                           The Union operator combines the result-set of two or more select statements into a single result set.", "Preview Article": "Click here to preview", "URL Name": "000005128", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005128", "Archived Date": "", "Language": "English", "Primary Version": "Glossary — Data Literacy", "Article Total View Count": "1,617", "": "", "Article Created Date": "2/16/2023, 1:09 AM", "First Published Date": "2/16/2023, 1:10 AM"}, "title": "\n              Glossary — Data Literacy\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Understanding Data\n              \n", "url": "/s/topic/0TO5w000000Zan0GAC"}, {"text": "\n\n               Data Literacy\n              \n", "url": "/s/topic/0TO5w000000ZanSGAS"}]}