{"file_path": "../../raw_kb_v2\\article\\360043433613\\index.html", "content": {"title": "\n\n\n Adobe Analytics Datafeed Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nData that is collected from websites or mobile apps, or is uploaded using web service APIs or data sources, is processed and stored in Adobe's Data Warehouse. This raw clickstream data forms the dataset used by Adobe Analytics. To learn more about the Adobe Analytics API, visit their page (\n\nhttps://marketing.adobe.com/develope...c-introduction\n\n).\n\n\n You import Adobe Analytics datafeed data by connecting to the Amazon Web Services (AWS) S3 bucket containing the data. You do this in the Data Center in Domo. This topic discusses the fields and menus that are specific to the Adobe Analytics Datafeed connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to an AWS S3 bucket and import Adobe Analytics datafeed data, you must have the following:\n\n Your AWS access key. You can find this in the\n ****Security Credentials****\n section of the AWS Console. Alternatively, if you are using IAM, you can find it under\n ****Users****\n .\n* Your AWS secret key, which was provided when you created your access key. You can generate a new secret key in the AWS Console.\n* The name of the AWS S3 Bucket you want to retrieve files from.\n\nConnecting to an AWS S3 Bucket and Pulling Adobe Analytics Data\n-----------------------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Adobe Analytics Datafeed Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Adobe Analytics account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter your AWS access key. For information about finding your access key, see \"Prerequisites,\" above.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. For information about finding your secret key, see \"Prerequisites,\" above.\n  |\n|\n\nBucket\n  |\n\nEnter the Amazon S3 Bucket you want to pull Adobe Analytics data from.\n  |\n|\n Region\n  |\n Select the S3 Bucket Region where your file is located.\n  |\n\n\n Once you have entered valid AWS credentials, you can use the same account any time you go to create a new Adobe Analytics Datafeed DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Adobe Analytics report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Daily\n  |\n Returns the most recent daily data.\n  |\n|\n Hourly\n  |\n Returns the most recent hourly data.\n  |\n\n|\n|\n Prefix (Optional)\n  |\n Enter a prefix to limit results to only those keys beginning with this prefix.\n  |\n|\n Quote Character\n  |\n Select the quote character used in your data.\n  |\n|\n Additional Columns\n  |\n Select whether you want additional columns (\"Browser Details,\" \"Event List,\" Unique ID,\" and \"Unique Visitor ID\") in your report.\n  |\n|\n Multiple Files\n  |\n Select whether you want to support multiple files. If you select\n **True**\n , multiple files will be processed during the first run.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433613\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003547\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAdobe Analytics Datafeed Connector\n\n", "article_total_view_count": "\n\n\n 4,691\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "adobe_analytics_datafeed_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}