{"file_path": "../../raw_kb_v2\\article\\360043439853\\index.html", "content": {"Title": "April 2018 Release Notes", "Article Body": "New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        New Data Center Enhancements\n                       \n\n                        Domo's updated Data Center makes it easy to find, organize, manage, and clean up all your data, giving users—especially Major Domos—clarity and control over their data.\n                       \n\n\n\n                          Find the DataSets you're looking for so you can understand and take action on them. Use search facets such as date, number of cards, and owner. Use our new sort-by menu to sort by Name, Number of Cards, Update Date, and Status. And by choosing to sort either Ascending or Descending, you can quickly find that DataSet you need, or maybe all those old, unused DataSets you want to delete.\n                          \n\n\n\n\n\n\n                          Use our new tagging functionality to really up your organizational game. Once you have DataSets tagged to get a better understanding of your DataSets, you can find them quickly and easily. Use tags to show which DataSets are works-in-progress and which are marked to be deleted at a future date.\n                          \n\n\n\n\n\n\n                          Take bulk actions on DataSets. When you hover over an item, select the checkbox that appears on the left. Once you have them selected, you can delete, run, tag, or change owner on these DataSets in bulk. Try holding down the Shift key to select many DataSets at once.\n                          \n\n\n\n\n\n\n                        Welcome to the new Data Center. Managing data has never been this much fun.\n                        \n\n                        For more information, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n                        SSO for Everyone\n                       \n\n                        Domo now includes tools that enable customers to quickly set up Single Sign-on (SSO) in their instance. SSO is widely considered the best way to access enterprise applications because it simplifies login, while improving management and security. But because of the complexity of SAML 2.0, managing organizational processes, and configuring Domo itself, setup can take a very long time. Now, with Domo's new SSO setup tools, you can confidently roll out SSO in a fraction of the time you could before. The two new tools are...\n                       \n\n\n\n\n                           Metadata upload\n                          \n                          . Using Metadata Upload, you can enter the URL for your identity provider. Domo then automatically retrieves its configuration information and digital certificate. Domo can provide information back to the identity provider as well. This is the easiest and most reliable way to configure your SSO.\n                          \n                           Be aware that not all identity providers offer this service.\n                          \n\n\n\n\n\n                           Wizard\n                          \n                          . A new wizard interface guides you through the difficult jargon and details of SSO configuration. The wizard offers context-based instructions for a number of leading identity provider services, including Okta, Ping, Microsoft Azure, Salesforce, and more.\n                          \n\n\n\n\n\n\n                        For more information about SSO, see\n                        \n                         Understanding and Configuring Domo Single Sign-On\n                        \n                        .\n                       \n\n                        Date Annotations\n                       \n\n                        You can add now add annotations to date items in any chart to provide the proper context for activity that took place on those dates. For example, you could add date annotations to a chart to help you remember why you had that great day of sales or how you were able to drive so much traffic over a particular weekend. These date annotations stay with their associated dates so your company knowledge stays with the data.\n                       \n\n                        Each annotation appears in an\n                        \n\n                          Annotations\n                         \n\n                        sidebar, with a colored flag that allows users to quickly match the annotation with its associated data point.\n                       \n\n                        This functionality is available\n                        \n\n                          only\n                         \n\n                        for charts containing date/time data.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Adding Date Annotations\n                        \n                        .\n                       \n\n                        Updated Licensing Manager\n                       \n\n                        The\n                        \n                         Licenses\n                        \n                        page in the Admin Settings now gives you a quick view of the licenses you've already paid for as well as the number of \"courtesy licenses\"—the number of users in your company using Domo in excess of your paid license count. You can now pay for these courtesy licenses right from Domo by clicking the\n                        \n                         Pay for Licenses\n                        \n                        button. This opens the self-service payments flow, where you can pay using a credit card or request an invoice from Domo.\n                       \n\n                        From the\n                        \n                         Licenses\n                        \n                        page, you can also view all of the Social users in your instance. If you want to upgrade these users, you can do so right from this view. To help inform your decisions, Domo provides information about when these users last logged in, who they report to, and their department and job titles. Because social users can request upgrades to full licenses of Domo, you can also view the list of social users who have requested licenses. You can easily approve or deny any of these requests and specify the Domo role each person receives. You can also email requesters about your decisions.\n                       \n\n                        These new license management features help you get all your people collaborating in Domo—for the good of the company.\n                       \n\n\n\n\n                        For more information about licensing, see\n                        \n                         Adding User Licenses in Domo\n                        \n                        .\n                       \n\n                        Mobile Help Center\n                       \n\n                        To provide better self-service for mobile users of Domo, we have added a Help Center within our iOS and Android applications. From the Help Center you can access any of our help resources—Domo University, Dojo, Knowledge Base, Developer Portal, or Domo Support—without ever having to leave your mobile applications. To access the Help Center, simply swipe right from the home screen and tap on\n                        \n                         Help Center\n                        \n                        .\n                        \n\n\n\n\n\n\n\n                        Mobile Alert Details\n                       \n\n                        To provide you with more context and information when sharing and viewing alerts, we have added a details screen for alerts on our iOS and Android applications. When viewing any alert on your mobile app you can tap into the alert to see the full details for that alert. You will be able to see who created the alert, the description, trigger history and alert criteria set for the alert.\n                       \n\n\n\n\n                        DataFlows Explain Plan\n                       \n\n                        SQL explain plans are now available for both MySQL and Redshift DataFlows. Get a better understanding about how your SQL queries run on the server, allowing you to optimize your queries for the best possible performance. To show the explain plan for SQL in a transform or output DataSet, you simply open up that transform or output DataSet and select\n                        \n                         Explain SQL\n                        \n                        in the menu in the bottom right corner.\n                       \n\n\n\n\n                        Use of explain plans is recommended for advanced SQL users only, as the generated steps are highly technical and complex.\n                       \n\n                        For more information about SQL DataFlows, see\n                        \n                         Creating an SQL DataFlow\n                        \n                        .\n                       \n\n                        Summary Number Alert Suggestions\n                       \n\n                        Alerts help you unlock the full power of Domo. Now, alert suggestions in Analyzer make creating those alerts even easier. When you save a card with a summary number in Analyzer, you are prompted to set an alert on that summary number. This way, you are always informed on your business and updates in your data.\n                       \n\n\n\n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n\n                          > Help Center\n                         \n\n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n                          \n                           \\support\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439853", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004431", "Archived Date": "", "Language": "English", "Primary Version": "April 2018 Release Notes", "Article Total View Count": "4,705", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              April 2018 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}