{"file_path": "../../raw_kb_v2\\article\\360042926454\\index.html", "content": {"Title": "Bitly Connector", "Article Body": "Intro\n                       \n\n                        Bitly is a URL-shortening, bookmarking service and link-sharing platform.  To learn more about the Bitly API, visit their website (\n                        \n                         https://dev.bitly.com/v4_documentation.html\n                        \n                        ).\n                       \n\n                        The Bitly connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to your Bitly account in the\n                        \n                         Data Center\n                        \n                        . This topic discusses the fields and menus that are specific to the Bitly connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Retrieving data about link statistics (such as number of clicks, countries providing click traffic, etc.)\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Number of clicks\n                             \n\n\n\n                              Number of encoders\n                             \n\n\n\n                              Countries providing the most traffic\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            Marketing analysts\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            Less than 1 hour\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your Bitly account and create a DataSet, you must provide credentials for Bitly, Facebook, or Twitter.\n                       \n\n                        Connecting to Your Bitly Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Bitly Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Bitly connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n                         Connect\n                        \n                        (or select\n                        \n                         Add Account\n                        \n                        if you have existing Bitly accounts in Domo) to open the Bitly OAuth screen where you can sign in to Bitly using Bitly, Facebook, or Twitter credentials.\n                       \n\n                        Once you have entered valid Bitly credentials, you can use the same account any time you go to create a new Bitly DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Report\n                         \n\n                        menu, along with various other menus and fields which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Bitly report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Link Clicks\n                               \n\n\n                               Returns the number of clicks for a given Bitlink.\n                              \n\n\n\n\n                                Link Countries\n                               \n\n\n                               Returns metrics about the countries referring click traffic to a given Bitlink.\n                              \n\n\n\n\n                                Link Encoders\n                               \n\n\n                               Returns users who have encoded a given Bitlink.\n                              \n\n\n\n\n                                Link Encoders by Count\n                               \n\n\n                               Returns users who have encoded this Bitlink, sorted by the number of clicks on each encoding user's link.\n                              \n\n\n\n                               Link Encoders Count\n                              \n\n                               Returns the number of users who have shortened (encoded) a given Bitlink.\n                              \n\n\n\n                               Link Information\n                              \n\n                               Returns metadata for a given Bitlink.\n                              \n\n\n\n                               Link Referrers\n                              \n\n                               Returns metrics about the pages referring click traffic to a given Bitlink.\n                              \n\n\n\n                               Link Referrers by Domain\n                              \n\n                               Returns metrics about the pages referring click traffic to a given Bitlink, grouped by referring domain.\n                              \n\n\n\n                               Link Referring Domain\n                              \n\n                               Returns metrics about the domains referring click traffic to a given Bitlink.\n                              \n\n\n\n                               Popular Links\n                              \n\n                               Returns the authenticated user's most-clicked Bitlinks (ordered by number of clicks) in a given time period.\n                              \n\n\n\n                               Popular Owned by Clicks\n                              \n\n                               Returns the top links to your tracking domain (or domains) created by users not associated with your account, ordered by clicks.\n                              \n\n\n\n                               Popular Owned by Shortens\n                              \n\n                               Returns the top links to your tracking domain (or domains) created by users not associated with your account, ordered by shortens.\n                              \n\n\n\n                               Referrers\n                              \n\n                               Returns aggregate metrics about the pages referring click traffic to all of the authenticated user's Bitlinks.\n                              \n\n\n\n                               Referring Domains\n                              \n\n                               Returns aggregate metrics about the domains referring click traffic to all of the authenticated user's Bitlinks.\n                              \n\n\n\n                               Shorten Counts\n                              \n\n                               Returns the number of Bitlinks created in a given time period by the authenticated user.\n                              \n\n\n\n                               User Clicks\n                              \n\n                               Returns the aggregate number of clicks on all of the authenticated user's Bitlinks.\n                              \n\n\n\n                               User Countries\n                              \n\n                               Returns aggregate metrics about the countries referring click traffic to all of the authenticated user's Bitlinks.\n                              \n\n\n\n\n\n\n\n\n\n\n                            Bitly Link\n                           \n\n\n                           Enter the Bitlink you want to retrieve information for.\n                          \n\n\n\n\n                            Unit\n                           \n\n\n                           Select whether data should be broken down by day, by hour, by week, etc.\n                          \n\n\n\n                           Number of Units\n                          \n\n                           Enter the number of units of the selected time unit that should be returned. For example, if you selected\n                           \n                            Month\n                           \n                           as the\n                           \n                            Unit\n                           \n                           and entered\n                           \n                            3\n                           \n                           for\n                           \n                            Number of Units\n                           \n                           , data would be returned for the last 3 months. If you enter\n                           \n                            -1,\n                           \n                           all units of time are returned.\n                          \n\n\n\n\n                            Time Zone\n                           \n\n\n                           Enter the desired time zone. You can enter this as an integer hour offset from UTC (from\n                           \n                            -14\n                           \n                           to\n                           \n                            14\n                           \n                           ) or as an actual time zone name. This defaults to Eastern Standard Time.\n                          \n\n\n\n\n                            Roll Up\n                           \n\n\n                           Choose whether to return data for multiple units rolled up to a single result instead of a separate value for each period of time.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042926454", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003797", "Archived Date": "", "Language": "English", "Primary Version": "Bitly Connector", "Article Total View Count": "4,655", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Bitly Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}