{"file_path": "../../raw_kb_v2\\article\\360043439293\\index.html", "content": {"Title": "DomoStats - DataSets and DataFlows", "Article Body": "Intro\n                         \n\n\n\n                        DomoStats gives you the freedom to explore how your team is using Domo. Because DomoStats is powered by a live Domo DataSet with no configuration, you can easily build cards, alerts, and workflows around the metrics you want to see as well as use the pre-built dashboard.\n                       \n\n                        This DomoStats app provides key insights into your organization's DataSets and DataFlows. Make sure your data is always fresh and contains the most relevant and up-to-date information. With this DomoStat's app, watch your DataSet and DataFlow success rates, get notified when DataSets fail to run, and see which DataSets are orphaned, duplicated, or broken to keep your Domo instance clean.\n                       \n\n\n\n\n                           Video - DomoStats DataSets and DataFlows Overview\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                        Requirements\n                       \n\n                        You must have Admin level access to download from the Appstore.\n                       \n\n                        Using the DomoStats App\n                       \n\n                        You can use the pre-built dashboard or build any of your own content using the DomoStats DataSets in the Data Center. When you first download the app, a new page is created titled DomoStats - DataSets and DataFlows. You'll need to power up the dashboard with the following steps:\n                       \n\n\n\n                          Navigate to the\n                          \n\n                            DomoStats - DataSets and DataFlows\n                           \n\n                          page.\n                         \n\n\n\n                          Select\n                          \n\n                            Connect Data\n                           \n\n                          .\n                          \n\n\n\n\n\n\n                          In the drop-down, select\n                          \n\n                            Connect\n                           \n\n                          to connect the page to the DomoStats DataSets or select\n                          \n\n                            Assign\n                           \n\n                          if you want to assign another Domo user to set up the data.\n                          \n\n\n\n\n\n\n                          In the last window, select\n                          \n                           Connect\n                          \n                          .\n                          \n\n\n\n\n\n                        The Dashboard\n                       \n\n                        Data\n                       \n\n                        The following data is included in the download of the DomoStats - DataSets and DataFlows app and can be found in the Data Center as a 'DomoStats' type DataSet.\n                       \n\n                        DataFlows include:\n                       \n\n\n\n                          DomoStats - DataSets & DataFlows with Owners v3\n                         \n\n\n\n                          DomoStats - DataSet and DataFlow History with DataSet Names and Owners v3\n                         \n\n\n\n                          DomoStats - DataSets with Owners v3\n                          \n\n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              All DataSets powering the app run once a day. Runtime is every 24 hours from when the app is first deployed. While the run frequency cannot be changed, you can edit the runtime in the DataSet settings. For more information on how to schedule DataSets, see\n                              \n                               DataSet Scheduling\n                              \n                              .\n                             \n\n\n\n\n\n\n\n                        Cards\n                       \n\n                        The following cards are included in the pre-built dashboard.\n                       \n\n\n\n\n\n                            Collection\n                           \n\n\n\n                            Card\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n                           Data Quality\n                          \n\n                           Avg Object Health\n                          \n\n                           Shows the average object health score across your Domo instance.\n                          \n\n\n\n                           Unhealthy Objects\n                          \n\n                           Displays DataSets below 100% health. Each DataSet begins with a score of 100%. For each point in each health category, the DataSet's health score is reduced by 10%.\n                           \n\n\n\n\n\n\n\n\n\n                                 Note:\n                                \n                                For more information on the point system for this card, please refer to the card description once downloaded.\n                               \n\n\n\n\n\n\n\n\n                           Broken Objects\n                          \n\n                           Displays the number of DataSets and DataFlows with a broken or not broken classification when last run.\n                          \n\n\n\n                           Behind Schedule Objects\n                          \n\n                           The number of DataSets and DataFlows that did not update within the scheduled window. These objects may appear to be running successfully, but in reality, they are behind schedule and need attention.\n                          \n\n\n\n                           Orphaned Objects\n                          \n\n                           The number of DataSets and DataFlows that have an owner assigned vs those that do not have an owner assigned.\n                          \n\n\n\n                           Duplicate Names\n                          \n\n                           The number of DataSets and DataFlows that share duplicate names in your instance.\n                          \n\n\n\n                           Data Availability\n                          \n\n                           Priority Broken DataSets\n                          \n\n\n                            Displays DataSets that threw an \"ERROR\" or \"INVALID\" status when last run sorted by the number of cards the DataSet is powering.\n                           \n\n\n\n\n                           % Broken by Owner\n                          \n\n                           Lists the DataSet and DataFlow owners with the percentage of their total DataSets that have a current \"ERROR\", \"INVALID\", \"NOT_RUNNABLE\", \"CANCELLED\", \"FAILED\", or \"REJECTED\" status.\n                          \n\n\n\n                           Broken Objects by Schedule Type\n                          \n\n                           Displays the number of DataSets and DataFlows for a given schedule type as well as the percentage of those objects that created an \"ERROR\", \"INVALID\", \"NOT_RUNNABLE\", \"CANCELLED\", \"FAILED\", or \"REJECTED\" status when last run.\n                          \n\n\n\n                           Broken DataSets by Connector Type\n                          \n\n                           Displays DataSets that generated an \"ERROR\", \"INVALID\", \"NOT_RUNNABLE\", \"CANCELLED\", \"FAILED\", or \"REJECTED\" status when they last tried to run grouped by DataSet connector type.\n                          \n\n\n\n                           Broken Obejcts Trend\n                          \n\n                           Shows DataSets or DataFlows that are reporting an \"ERROR\", \"INVALID\", \"NOT_RUNNABLE\", \"CANCELLED\", \"FAILED\", or \"REJECTED\" status grouped by their scheduled run type and plotted by the last run date.\n                          \n\n\n\n                           Data Updates\n                          \n\n                           Scheduled Updates\n                          \n\n                           Shows the times of day that DataSets and DataFlows have initiated updates over the last 7 days. The date range may need to be adjusted in Analyzer to include all of the data for the current day.\n                          \n\n\n\n                           Update Trends\n                          \n\n                           The percentage of DataSet and DataFlow updates that were successful over time.\n                          \n\n\n\n                           Update Details\n                          \n\n                           Provides the history of update details for all DataSets and DataFlows in the selected date range sorted by Start Time.\n                          \n\n\n\n                           Connector Run Times\n                          \n\n                           Displays the range of run times (in minutes) for DataSets of each data import type. Includes a breakdown of the fastest, slowest, and median run times for all DataSets of each import type.\n                          \n\n\n\n                           Object Run Times\n                          \n\n                           Displays the number of minutes used to run each DataSet and DataFlow. Includes a breakdown of the fastest, slowest, and median run times for each DataSet and DataFlow.\n                          \n\n\n\n                           Data Ownership and Expertise\n                          \n\n                           Inactive User Ownership\n                          \n\n                           The number of objects owned by Domo users that have not logged in for more than 30 days.\n                          \n\n\n\n                           Top 20 Object Owners\n                          \n\n                           Shows the number of DataSets and DataFlows owned by each of the top 20 DataSet owners.\n                          \n\n\n\n                           Owner by Connector Type\n                          \n\n                           The number of DataSets each user has created by DataSet connector type.\n                          \n\n\n\n                           Ownership by Department\n                          \n\n                           The number of objects owned by each department.\n                          \n\n\n\n                           Department by Connector Type\n                          \n\n                           The number of DataSets each department has created by DataSet type.\n                          \n\n\n\n                           Ownership by Role\n                          \n\n                           Shows the number of objects owned by users of each role.\n                          \n\n\n\n                           Role by Connector Type\n                          \n\n                           The number of DataSets each role has created by connector type.\n                          \n\n\n\n                           Objects and Owners\n                          \n\n                           Shows the details of all DataSets and DataFlows stored in the instance.\n                          \n\n\n\n                           Data Creation\n                          \n\n                           DataSet Creation Trend\n                          \n\n                           The number of DataSets created in each department by day.\n                          \n\n\n\n                           Top Connectors\n                          \n\n                           The number of existing objects by connector import type.\n                          \n\n\n\n                           DataSets Running Total\n                          \n\n                           Displays a running total of all DataSets created in your instance.\n                          \n\n\n\n                           DataSet Rows Updated\n                          \n\n                           Shows the number of rows updated on DataSets over time.\n                          \n\n\n\n                           Creators This Week\n                          \n\n                           The number of DataSets of each type that have been created per DataSet owner this week.\n                          \n\n\n\n                           New Department DataSets\n                          \n\n                           Shows the number of DataSets of each type that have been created by each department this week.", "Preview Article": "Click here to preview", "URL Name": "360043439293", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003040", "Archived Date": "", "Language": "English", "Primary Version": "DomoStats - DataSets and DataFlows", "Article Total View Count": "5,514", "": "", "Article Created Date": "10/24/2022, 9:05 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              DomoStats - DataSets and DataFlows\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Governance Tools\n              \n", "url": "/s/topic/0TO5w000000ZannGAC"}]}