{"file_path": "../../raw_kb_v2\\article\\360042934974\\index.html", "content": {"Title": "October 2018 Release Notes", "Article Body": "New Features and Enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Certified Content\n                       \n\n                        The more people you bring into Domo, the more people you have in your company making good business decisions. But how can you be sure that the content you're all looking at is the same? How do you know if you brought in the right data? Introducing certified content in Domo.\n                       \n\n                        Using the power of Certification Center, you can now certify your cards so your users know which content has been approved, just by looking at the card. Certified content gives your business the flexibility to customize certification to the specific needs of your company. This means that when your users see a certification badge, it’s been through a unique process tailored to your unique needs.\n                       \n\n                        Certifying a card is as easy as choosing\n                        \n                         Request certification\n                        \n                        from the wrench menu, selecting the appropriate certification process, and clicking\n                        \n                         Submit\n                        \n                        .\n                       \n\n                        While a card is in the approval process, a badge will appear on the card so users can check the status of the certification. Because it’s powered by Certification Center, anyone in the approval chain can send the request back if any changes need to be made. Once the card has been through the approval process, it will receive a certification badge so everyone knows they can and should make business decisions based off this card.\n                       \n\n                        Certified content in Domo. Not just content, but data you can bet your company on.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Certifying Content\n                        \n                        .\n                       \n\n                        Data Science and Scripting Actions in ETL\n                       \n\n                        Data Science actions are now available by request in ETL. Domo has made it possible for every data owner to leverage powerful data science functions in their DataFlows without the need to be an expert in data science modeling languages. This means you can enhance your data with powerful analytics just by adding the desired ETL action.\n                       \n\n                        The following data science functions/methods are available:\n                       \n\n\n\n                          Classification (including Random Forest Classification and Naive Bayes)\n                         \n\n\n\n                          Clustering (including K Means and K Median)\n                         \n\n\n\n                          Forecasting (including ARIMA)\n                         \n\n\n\n                          Multivariate\n                         \n\n\n\n                          Outlier Detection (including Standard Deviation and Mean Absolute Deviation)\n                         \n\n\n\n                          Prediction (including Linear Regression and Random Forest)\n                         \n\n\n\n                        In addition to all of the above, Python and R scripting actions are also available.\n                       \n\n\n\n\n\n                        Due to their complexity, Data Science and Scripting actions are currently available only by request. Please reach out to your CSM if you are interested in adding these actions to your company Domo instance.\n                       \n\n                        For more information, see\n                        \n                         ETL Actions: Scripting\n                        \n                        .\n                       \n\n                        Workbench 5 Beta Release\n                       \n\n                        We are excited to announce that a brand new version of Workbench is going into an OPEN BETA release on October 23rd. This version will provide a cleaner, easier-to-navigate user interface and a\n                        \n                         Home\n                        \n                        screen that shows you the status of all of your jobs (shown below).\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Connecting to Data Using Workbench 5\n                        \n                        .\n                       \n\n                        Insights and NLG Analysis\n                       \n\n                        Businesses collect massive amounts of data to inform their decision making. Using the story that the data tells them, business leaders are able to make critical decisions that impact their business. However, trying to find that story gets increasingly difficult as the size of the data grows at exponential rates, and the data changes every second.\n                        \n\n                        Now Domo makes it easier than ever to find insights in your data.\n                       \n\n\n\n                          NLG (Natural Language Generation) Analysis uses natural language to tell you what is interesting or exceptional about your data. Where analysts have had to review data using statistical tools and write summaries as data changes, Domo’s narratives automatically expose statistical information and interesting trends about your data, no matter the size of the DataSet or the frequency of updates, delivered in a language every business user can understand.\n                         \n\n\n\n                          With the new Insights feature, you can now view a number of automatically-generated alerts for any given card. Insights may be based on anomaly detection, discovered correlations, distribution mapping, and so on.\n                         \n\n\n\n                        Both of these features are now available in a new\n                        \n                         Insights\n                        \n                        feed that appears on the right side of the Details view for any KPI card. You can tailor your feed to show you the most meaningful Insights and NLG Analyses by rating each one using a \"thumbs up\" or \"thumbs down\" icon.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         KPI Card Details View\n                        \n                        .\n                       \n\n                        Alert Improvements\n                       \n\n                        Contextual Alerts\n                       \n\n                        Using Personalized Data Permissions is a great way to filter your data for different users. But just because it's useful doesn't mean it needs to be complex. With Contextual Alerts, by default any Alert you create automatically analyzes all the PDP policies that apply to the subscriber and notifies them accordingly. You no longer have to select specific policies to apply.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         PDP and Alerts\n                        \n                        .\n                       \n\n                        Filter Support for Alerts\n                       \n\n                        Now when you set filters on either a page or card, those filters are honored when you go to create an alert on that page or card. A new option appears in the Create Alert Wizard that lets you choose whether or not to set the alert on the filtered view of the card. You can find this option selected by default when you create an alert from a card or page on which filters have been applied.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Creating a Custom Alert for a KPI Card\n                        \n                        .\n                       \n\n                        Disabled Alerts\n                       \n\n                        Instantly learn when alerts are broken as well as how to correct the problem and get those alerts back up and running again. When an alert gets into a broken state, it becomes disabled and shows up in red. It also gives you clear directions on how to solve the problem.\n                       \n\n                        Payment Method Management\n                       \n\n                        Users can now instantly gain access to the full features of Domo simply by entering their billing information in Domo. This feature enables trial users to upgrade to full Domo and also enables existing customers to add Domo licenses at will. Domo accepts any form of payment card as well as corporate invoicing from directly in the product.\n                       \n\n                        Self-service payment is now available for all users and all platforms. Freemium users can access the feature by clicking on the\n                        \n                         Buy Full Domo\n                        \n                        button or by clicking on any of the locked features. Administrators of existing instances can add users to their instance by clicking on\n                        \n                         Licenses\n                        \n                        in the Admin Settings.\n                       \n\n                        Help Center Updates\n                       \n\n                        ,The following improvements have been made to our Help Center:\n                       \n\n\n                         To enable you to more quickly find the Domo University resources, videos, Knowledge Base articles, and Dojo content you need, the Domo Help Center icon has been moved out of the\n                         \n                         menu and into the top navigation bar.\n                         \n\n\n\n\n\n                         The navigation tiles in the Help Center have been updated to provide a cleaner and simpler experience. In addition, in the interest of making it easier to access our Video Library, a new \"How-to Videos\" tile has been added.\n                         \n\n\n\n\n\n                        For more information, see\n                        \n                         Getting Help\n                        \n                        .\n                       \n\n                        JSON Webhooks\n                       \n\n                        Our new JSON Webhook connector allows you to connect to data sources that push JSON-formatted data, such as IFTTT, Github,and Fitbit. Using JSON Webhooks, you can get access to real-time data from weather devices, vending machines, wearables, and more. The Webhook link includes a long-living single use token so anyone with the link can publish data to your DataSet.\n                       \n\n                        For more information, see\n                        \n                         JSON Webhook Connector\n                        \n                        .\n                       \n\n                        Ability to Disable Chart Preview\n                       \n\n                        Save time editing your cards by turning off the new\n                        \n\n                          Auto preview\n                         \n\n                        toggle in Analyzer. By default, any changes you make to a card in Analyzer are reflected instantly in the preview for that card. When you turn off\n                        \n\n                          Auto preview\n                         \n\n                        , the card preview does not refresh until you click the\n                        \n\n                          Run Preview\n                         \n\n                        button. Because you have control over when you refresh, you can choose when to apply your changes, resulting in a more efficient card-building experience.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Analyzer Layout\n                        \n                        .\n                       \n\n                        DataFlow Scheduling\n                       \n\n                        DataFlow scheduling allows you to schedule a day and/or time when a DataFlow will run. DataFlows that are configured with a schedule will only run when the scheduled time is due. Scheduling cannot be combined with the \"run automatically\" option.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         DataFlow Schedules\n                        \n                        .\n                       \n\n                        Mobile Instance Switching\n                       \n\n                        Domo is pleased to announce another tool to ensure an uninterrupted experience when running your business from your phone: mobile app instance switching. Now no matter how big your company is or how many Domo accounts you have, you can easily access them all while on the go from the palm of your hand without having to log out and back in.\n                       \n\n                        Update to the latest version of the Domo iOS or Android application and you're all set.\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking by clicking\n                        \n                        in the top navigation bar .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n                          \n                           /support\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042934974", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004427", "Archived Date": "", "Language": "English", "Primary Version": "October 2018 Release Notes", "Article Total View Count": "9,351", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              October 2018 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}