{"file_path": "../../raw_kb_v2\\article\\360043438213\\index.html", "content": {"Title": "Troubleshoot Single Sign-On Using SAML", "Article Body": "Intro\n                       \n\n                        This article provides troubleshooting for single sign-on using SAML, including Okta, ADFS, and PingIdentity, in the following categories:\n                       \n\n\n\n                          SAML requests and responses\n                         \n\n\n\n                          Basic troubleshooting\n                         \n\n\n\n                          Troubleshoot SAML requests\n                         \n\n\n\n                          Troubleshoot SAML responses\n                         \n\n\n\n\n\n                        SAML Requests and Responses\n                       \n\n                        Single sign-on (SSO) logins use a special communication protocol called SAML, which stands for Security Assertion Markup Language.\n                       \n\n                        The SAML request is a message sent from Domo to your IdP during login. This message contains identifying information about your Domo instance so that your IdP knows which system you are trying to log into. Depending on your settings in Domo, it may also contain a digital certificate to further authenticate that the login request originated from Domo.\n                       \n\n                        The SAML response is a message sent from your IdP to Domo during login. This message contains identifying information about the person logging in so that Domo knows which user you are. It also contains a digital certificate to confirm that the login response comes from your IdP.\n                       \n\n                        A typical SAML login works like this:\n                       \n\n\n                         Navigate to the URL of your Domo instance.\n                        \n\n\n                          Select\n                          \n                           Sign In\n                          \n                          .\n                          \n                          Domo redirects you to the IdP with a SAML request packet.\n                         \n\n\n\n                          The IdP authenticates whether you have permission to log in to Domo from its system.\n                          \n                          If you have permission, the IdP redirects you back to Domo with a SAML response packet.\n                         \n\n\n\n                          Domo verifies that the SAML response packet contains the correct authorization information from the IdP and allows you to log in.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n\n\n\n\n\n                              If\n                              \n                               Skip to Identity Provider\n                              \n                              is selected in your Domo SSO settings, you do not have to select\n                              \n                               Sign In\n                              \n                              during login; you are automatically redirected to the IdP's login page.\n                             \n\n\n\n                              If you have recently logged in to the IdP for Domo or another service, the IdP may skip the username and password prompt and immediately return you to Domo.\n                             \n\n\n\n                              If both of the above occur, the entire login process may be invisible to you, except for a possible 1-5 second delay while the redirects and other steps take place in the background.\n                             \n\n\n\n\n\n\n\n\n\n                        Basic Troubleshooting\n                       \n\n                        Before proceeding to advanced troubleshooting in the next sections, review these common causes of failed SAML logins:\n                       \n\n\n\n                          If you do not see the\n                          \n                           Sign In\n                          \n                          button when logging in:\n                         \n\n\n\n                            Make sure you enter the instance URL correctly. Entering an incorrect URL still takes you to a normal login page, even if there is no real Domo instance at that address.\n                           \n\n\n\n                            Check if\n                            \n                             Mixed-mode Sign-in\n                            \n                            is enabled in your Domo SSO settings; if it is, the product is working as intended. This option displays the regular login page for normal instance logins but allows IdP systems to initiate SSO logins, which is most commonly used for SSO-enabled embedding of cards in external systems where SSO is not desired for regular logins.\n                           \n\n\n\n\n\n\n\n                          If you receive an error when logging in, and the error displays on a Domo-branded webpage, the issue may be:\n                         \n\n\n\n                            The IdP redirected you to the wrong Domo login URL.\n                           \n\n\n\n                            The digital certificate sent by the IdP in the SAML response does not match the certificate that was uploaded to Domo for validating the origin of the SAML response.\n                           \n\n\n\n                            Your email attribute is not correctly defined in the SAML response.\n                           \n\n\n\n                            Your email attribute IS correctly defined in the SAML Response, but the email is not assigned to any existing users, and\n                            \n                             Only invited people can access Domo\n                            \n                            is selected in your Domo SSO settings. When this option is selected, users must be manually created and cannot be auto-generated when logging in via SSO.\n                           \n\n\n\n\n                         If you receive an error when logging in, and the error does NOT display on a Domo-branded webpage, the issue may be:\n                         \n\n\n                            The SAML Endpoint URL or Entity ID is incorrect in your Domo SSO settings.\n                           \n\n\n\n                            The IdP is expecting a signed SAML request, but\n                            \n                             Sign Authentication Requests\n                            \n                            is not enabled in your Domo SSO settings. Alternatively, the digital certificate loaded into the IdP does not match the certificate provided by Domo near where this setting is enabled.\n                           \n\n\n\n                            You do not have IdP permissions to use Domo. Typically, IdP systems have a permissions system built in to allow different users access to different tools, so users trying to log in to Domo must have permission to use Domo in the IdP settings.\n                           \n\n\n\n\n\n\n\n                        Troubleshoot SAML Requests\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            The following instructions are specific to the Google Chrome web browser.\n                           \n\n\n\n\n\n\n\n                        Collect a SAML Request\n                       \n\n\n                         Open a new Incognito window in Google Chrome.\n                        \n\n\n                          Right-click anywhere in the main window and select\n                          \n                           Inspect\n                          \n                          .\n                          \n                          Chrome opens the\n                          \n                           DevTools\n                          \n                          panel.\n                          \n\n\n\n\n\n\n                          In the\n                          \n                           DevTools\n                          \n                          panel, select the\n                          \n                           Network\n                          \n                          tab, and then select the\n                          \n                           Preserve log\n                          \n                          checkbox.\n                          \n\n\n\n\n\n\n                          Without closing the tab containing the\n                          \n                           DevTools\n                          \n                          panel, navigate to the URL for your Domo instance in the Incognito window.\n                         \n\n\n                         Select\n                         \n                          Sign In\n                         \n                         .\n                         \n                         You are redirected to your IdP's login page, and Domo sends a SAML request packets to your IdP.\n                        \n\n\n                          To retrieve the SAML request, go to the\n                          \n                           DevTools\n                          \n                          panel, find the\n                          \n                           Filter\n                          \n                          field in the\n                          \n                           Network\n                          \n                          tab, and enter the word \"SAML\".\n                          \n                          A network communication record displays in the list below the\n                          \n                           Filter\n                          \n                          field.\n                          \n\n\n\n\n\n\n                          Select the network communication record, then select the\n                          \n                           Headers\n                          \n                          tab.\n                          \n\n\n\n\n\n\n                          In the\n                          \n                           Response\n                          \n                          tab, go to the\n                          \n                           Form Data\n                          \n                          section. The block of text below this section is the SAML request in an encoded form.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Data is not encoded to protect the data, but rather to protect communication systems from misinterpreting the data as commands to execute.\n                           \n\n\n\n\n\n                        Decode a SAML Request\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Your SAML request contains sensitive data, so do not decode it using an online website. Instead, follow the steps below to decode your SAML request using the Chrome browser on a machine.\n                          \n\n\n\n\n\n\n                          After completing the\n                          \n                           previous procedure\n                          \n                          , copy the encoded SAML request from the\n                          \n                           Form Data\n                          \n                          section.\n                         \n\n\n\n                          In the\n                          \n                           DevTools\n                          \n                          panel, select the\n                          \n                           Console\n                          \n                          tab.\n                         \n\n\n\n                          Enter \"atob('\n                          \n                           SAMLRequestValue\n                          \n                          ')\" in the\n                          \n                           Console\n                          \n                          tab. Be sure to keep the single quotes and replace\n                          \n                           SAMLRequestValue\n                          \n                          with the encoded SAML value you copied in Step 1.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If your SAML value has line breaks, remove them after pasting.\n                            \n\n\n\n\n\n\n                          Press\n                          \n                           Enter\n                          \n                          on your keyboard.\n                         \n\n\n\n                        Chrome decodes the SAML request into its original XML format.\n                       \n\n                        Interpret a SAML Request\n                       \n\n                        Review these two items in your decoded, XML-formatted SAML request:\n                       \n\n\n                         Look for an entry similar to this:\n                         <saml2:Issuer xmlns:saml2=\"urn:oasis:names:tc:SAML:2.0:assertion\">some_text</saml2:Issuer>\n\n                          The text you have in place of\n                          \n                           some_text\n                          \n                          is the Entity ID for Domo, or the identifier that tells your IdP that Domo is the application you are trying to log into. This is the same value as the\n                          \n                           Entity ID\n                          \n                          field in your Domo SSO settings, which is usually the URL of your Domo instance, but some IdPs require a special identifier.\n                         \n\n\n\n                          If\n                          \n                           Sign Authentication Requests\n                          \n                          is enabled in your Domo SSO settings, look for an entry similar to this:\n                         \n<ds:X509Certificate>some_certificate</ds:X509Certificate>\n\n\n                          The text you have in place of\n                          \n                           some_certificate\n                          \n                          is the x.509 digital certificate that helps your IdP confirm that your login request came from Domo.\n                         \n\n\n\n                        Troubleshoot a SAML Request\n                       \n\n                        After collecting, decoding, and interpreting your SAML request, use the following troubleshooting steps to resolve any issues:\n                       \n\n\n                         The\n                         \n                          Entity ID\n                         \n                         is a value that you specify in the SSO settings for Domo to include in the SAML request. Your IdP must be able to recognize this value to verify that Domo is the system you are trying to log into.\n                         \n                          Typically, Domo is set up in your IdP system as an app with an Entity ID specified in the app settings. Check your IdP and make sure the Entity IDs match between the two systems. You may need to contact your IdP's support team for help finding the Entity ID for the app in their system.\n                         \n\n\n\n                          The\n                          \n                           x.509 digital certificate\n                          \n                          is a value provided by Domo that should be uploaded to your IdP's system in connection with the Domo app so that it knows what value to expect in the SAML request. You can download a copy of the certificate from the Domo SSO settings under\n                          \n                           Information your IdP may need\n                          \n                          .\n                         \n\n                          Verify that the certificate from the SAML request matches the certificate uploaded for the Domo app in your IdP system. If you have a certificate file, you can open it in a text editor for viewing.\n                         \n\n\n\n\n\n                        Troubleshoot SAML Responses\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            These instructions are specific to the Google Chrome browser.\n                           \n\n\n\n\n\n\n\n                        Collect a SAML Response\n                       \n\n\n\n                          Open a new Incognito window in Google Chrome and navigate to the URL for your Domo Instance.\n                         \n\n\n\n                          Select\n                          \n                           Sign In\n                          \n                          .\n                          \n                          You are redirected to your IdP's login page. Do not yet enter your credentials.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              If\n                              \n                               Skip to Identity Provider\n                              \n                              is selected in your Domo SSO settings,\n                             \n                             you are automatically redirected to the IdP's login page.\n                            \n\n\n\n\n\n\n                          Right-click anywhere in the main window and select\n                          \n                           Inspect\n                          \n                          .\n                          \n                          Chrome opens the\n                          \n                           DevTools\n                          \n                          panel.\n                          \n\n\n\n\n\n\n                          In the\n                          \n                           DevTools\n                          \n                          panel, select the\n                          \n                           Network\n                          \n                          tab, and then select the\n                          \n                           Preserve log\n                          \n                          checkbox.\n                          \n\n\n\n\n\n\n                          Without closing the tab containing the\n                          \n                           DevTools\n                          \n                          panel, enter your credentials for your IdP and continue until you reach the Domo error page.\n                          \n                          Your IdP sends a SAML response packet to your Domo instance.\n                         \n\n\n\n                          To retrieve the SAML request, go to the\n                          \n                           DevTools\n                          \n                          panel, find the\n                          \n                           Filter\n                          \n                          field in the\n                          \n                           Network\n                          \n                          tab, and enter the word \"SAML\".\n                          \n                          A network communication record displays in the list below the\n                          \n                           Filter\n                          \n                          field.\n                          \n\n\n\n\n\n\n                          Select the network communication record, then select the\n                          \n                           Headers\n                          \n                          tab.\n                          \n\n\n\n\n\n\n                          In the\n                          \n                           Response\n                          \n                          tab, go to the\n                          \n                           Form Data\n                          \n                          section. The block of text below this section is the SAML response in an encoded form.\n                         \n\n\n\n                        Decode a SAML Response\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Your SAML response contains sensitive data, so do not decode it using an online website. Instead, follow the steps below to decode your SAML request using the Chrome browser on a machine.\n                           \n\n\n\n\n\n\n                         After completing the\n                         \n                          previous procedure\n                         \n                         , copy the encoded SAML response from the\n                         \n                          Form Data\n                         \n                         section.\n                        \n\n\n                          In the\n                          \n                           DevTools\n                          \n                          panel, select the\n                          \n                           Console\n                          \n                          tab.\n                         \n\n\n\n                          Enter \"atob('\n                          \n                           SAMLResponseValue\n                          \n                          ')\" in the\n                          \n                           Console\n                          \n                          tab. Be sure to keep the single quotes and replace\n                          \n                           SAMLResponseValue\n                          \n                          with the encoded SAML value you copied in Step 1.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              If your SAML value has line breaks, remove them after pasting.\n                             \n\n\n\n\n\n\n\n                          Press\n                          \n                           Enter\n                          \n                          on your keyboard.\n                         \n\n\n\n                        Chrome decodes the SAML response into its original XML format.\n                       \n\n                        Interpret a SAML Response\n                       \n\n                        Review these two items in your decoded, XML-formatted SAML response:\n                       \n\n\n                         Look for an entry similar to this:\n                         <ds:X509Certificate>some_certificate</ds:X509Certificate>\n                         The text you have in place of\n                         \n                          some_certificate\n                         \n                         is the x.509 digital certificate that helps your IdP confirm that your login request came from Domo.\n                        \n\n\n                          Look for an entry similar to this:\n                         \n<saml2:Attribute Name=\"email\"><saml2:AttributeValue>some_email</saml2:AttributeValue></saml2:Attribute>\n\n\n                          The text you have in place of\n                          \n                           some_email\n                          \n                          is your email address, which is how Domo identifies exactly who is logging in. The\n                          \n\n                            <saml2:Attribute>\n                           \n\n                          and\n                          \n\n                            <saml2:AttributeValue>\n                           \n\n                          tags can contain more information than what is shown in the example above, but it's important that the\n                          \n                           Name=\"email\"\n                          \n                          exists within the\n                          \n                           <saml2:Attribute>\n                          \n                          tag.\n                         \n\n\n\n                        Troubleshoot a SAML Response\n                       \n\n                        After collecting, decoding, and interpreting your SAML response, use the following troubleshooting steps to resolve any issues:\n                       \n\n\n\n                          The\n                          \n                           x.509 digital certificate\n                          \n                          is a value provided by your IdP that should be uploaded to the SSO settings in your Domo instance so that Domo knows what value to expect in the SAML response. You may need to work with your IdP's support team to learn where to retrieve the certificate on their end. This is usually a .pem, .cer, or .cert file.\n                         \n\n                          Verify that the certificate from the SAML response matches the certificate uploaded to your SSO settings in Domo.\n                         \n\n                          This certificate must be included in the SAML response.\n                         \n\n\n\n                          The\n                          \n                           user email address\n                          \n                          is a value from the user's profile within the IdP. The SAML settings in the IdP should be configured to include this Attribute with the SAML Response. You may need to work with your IdP's support team to learn how to set up that configuration in their system.\n                         \n\n                          Verify that the email address from the SAML response matches your primary email address in Domo.\n                         \n\n                          This email attribute must be included in the SAML response.", "Preview Article": "Click here to preview", "URL Name": "360043438213", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003045", "Archived Date": "", "Language": "English", "Primary Version": "Troubleshoot Single Sign-On Using SAML", "Article Total View Count": "2,974", "": "", "Article Created Date": "10/24/2022, 9:05 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Troubleshoot Single Sign-On Using SAML\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Implementing SSO\n              \n", "url": "/s/topic/0TO5w000000ZanoGAC"}]}