{"file_path": "../../raw_kb_v2\\article\\360042928074\\index.html", "content": {"Title": "ADP Connector", "Article Body": "Intro\n                       \n\n                        ADP Workforce Now is a web-based human resources (HR) application designed especially for midsize businesses.  Use Domo's ADP connector to import reports from ADP Workforce Now. To learn more about the ADP API, visit their page at\n                        \n                         https://developers.adp.com/\n                        \n                        .\n                       \n\n                        You connect to your ADP account in the Data Center. This topic discusses the fields and menus that are specific to the ADP connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important\n                            \n\n                             :\n                            \n                            Certain Connectors require an API usage fee charged to you by the company, not Domo, depending on your accounts with that company. Use of this Connector may require an API usage fee.\n                           \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your ADP account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The network username and password for your ADP account\n                         \n\n\n\n                          The PKCS12-formatted Mutual Authentication Certificate store generated for your ADP account (must be encoded in Base 64)\n                         \n\n\n\n                          The password needed to open your Mutual Authentication Certificate\n                         \n\n\n\n\n                         A Set up guide and instructions to get started:\n                        \n\n\n\n\n                          Introduction to ADP\n                         \n\n\n\n                          Getting started\n                         \n\n\n\n                        Connecting to Your ADP Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the ADP Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your ADP account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Network Username\n                           \n\n\n\n                            Enter the network username for your ADP account.\n                           \n\n\n\n\n\n                            Network Password\n                           \n\n\n\n                            Enter the network password for your ADP account.\n                           \n\n\n\n\n\n                            Mutual Authentication Certificate\n                           \n\n\n\n                            Paste the Base 64-encoded PKCS12-formatted certificate store that was generated for your account. The certificate\n                            \n                             must\n                            \n                            be encoded in Base 64.\n                           \n\n\n\n\n\n                            Certificate Password\n                           \n\n\n\n                            Enter the password needed to open your Mutual Authentication Certificate.\n                           \n\n\n\n\n\n\n                         Once you have entered valid ADP credentials, you can use the same account any time you go to create a new ADP DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Creating a Mutual Authentication Certificate\n                       \n\n                        A Certificate Signing Request (CSR) is required for accessing ADP Application Programming Interfaces (APIs) and authenticating users with single sign-on (SSO). A private key and matching Web Services (WS) Certificate is required to access ADP web services. The WS Certificate provides client information to ADP and the matching private key confirms the authenticity of the client.\n                       \n\n                        To generate the WS Certificate, a CSR needs to be generated by the client. During the CSR generation, the private key and matching public key are created. The CSR is submitted to the ADP Web Services Certificate Authority (currently run by Sectigo/Comodo) and they return the WS Certificate. Many software tools store the private key and the WS Certificate in one Personal Information Exchange Format (PFX), also known as a P12 file.\n                       \n\n                        Open Secure Sockets Layer (OpenSSL) is an open-source tool. Although ADP has tested the commands based on the OS, configuration settings, and other environmental factors, the commands and configuration may have to be adjusted. Clients will need to check and support the OpenSSL tool from their own IT department.\n                       \n\n                        Clients need to ensure that every time new private and public keys are created, they are managed properly. If they are generated more than once, each key pair must be stored (possibly in different directories) so there is no confusion. In addition, the returned Web Services Certificate (which also contains the public key) must be managed properly (stored in the directory that has the matching private key). For more information, see\n                        \n                         https://developers.adp.com/articles/general/generate-a-certificate-signing-request\n                        \n                        .\n                       \n\n\n                         To complete a Certificate Signing Request, do the following:\n                        \n\n\n\n                         Download OpenSSL Light for Windows at:\n                         \n                          http://slproweb.com/products/Win32OpenSSL.html\n                         \n                         . Mac users can open Terminal and jump to the OpenSSL commands in step 5.\n                        \n\n                         To install OpenSSL, follow the instructions in the Install Wizard.\n                        \n\n                         Open\n                         \n                          cmd.exe\n                         \n                         .\n                        \n\n                         Go to the location where you installed OpenSSL and at the command line, type\n                         \n                          cd C:\\Program Files (x86)\\OpenSSL-Win32\\bin (or C:\\Program Files\\OpenSSL-Win64\\bin for 64-bit)\n                         \n                         .\n                        \n\n                         Generate the CSR:\n                         \n\n\n                            openssl genrsa -out companyname_auth.key 2048\n                           \n\n\n\n                            openssl req -new -key companyname_auth.key -out companyname_auth.csr\n                           \n\n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               Your CSR must not request S/MIME capabilities.\n                              \n\n\n\n\n\n\n\n                         Enter the following information into your CSR. Leave the challenge password blank.\n                         \n\n                           Country Name.\n                          \n\n                           State or Province Name.\n                          \n\n                           Locality Name.\n                          \n\n                           Organization Name (must be the same string used by your organization when registered with ADP.)\n                          \n\n                           Common Name (use something meaningful, such as CompanyName Corp Mutual SSL or whatever best describes the usage and identifies this as the Mutual SSL Authentication certificate.)\n                          \n\n                           Challenge password (leave this field blank.)\n                          \n\n\n\n                         After you have created your CSR, you have two options for submitting it to ADP for signing. If you’re currently in the process of implementing ADP APIs, you can email your CSR to your assigned ADP implementation representative for signing. Otherwise, follow these steps to submit your request directly to ADP Security Services:\n                         \n\n                           Open the\n                           \n                            ADP Certificate Signing Tool\n                           \n                           (no login is required.)\n                          \n\n                           Choose\n                           \n                            Authentication and transaction signing\n                           \n                           for the certificate type.\n                          \n\n                           Enter your technical contact’s email.\n                          \n\n                           Enter your company name and ADP client ID.\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               If you are an ADP Workforce Now client, your ADP client ID is all the characters to the right of the @ symbol in your ADP Workforce Now login name. If you don't know your ADP client ID, contact your ADP representative.\n                              \n\n\n\n\n\n                           Enter your technical contact’s first and last name and a group distribution list to be automatically notified when the generated certificate is reaching its two-year expiration date.\n                          \n\n                           Paste the complete contents (including\n                           \n                            BEGIN CERTIFICATE REQUEST\n                           \n                           and\n                           \n                            END CERTIFICATE REQUEST\n                           \n                           ) of your CSR into the CSR text box.\n                          \n\n                           Click\n                           \n                            Submit\n                           \n                           .\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               It might take up to a week to sign the CSR.\n                              \n\n\n\n\n\n\n\n                         Save the signed certificate from ADP into a file named\n                         \n                          companyname_auth.pem\n                         \n                         in the same location that you initially created the CSR (\n                         \n                          C:\\Program Files (x86)\\OpenSSL-Win32\\bin\n                         \n                         ).\n                        \n\n                         If you are using Windows/IIS, use the following command to get the key and certificate in\n                         \n                          PKCS12 format:\n                          \n                          openssl pkcs12 -export -out companyname_auth.pfx -name “Company Name Mutual SSL” -inkey companyname_auth.key -in companyname_auth.pem\n                         \n\n\n                         Enter the\n                         \n                          Export Password\n                         \n                         .\n                        \n\n\n                        The resulting certificate and key should be in the file\n                        \n                         companyname_auth.pfx\n                        \n                        that you'll reference for Mutual SSL authentication.\n                       \n\n\n                         To convert the .pfx file to base64 encoded string do the following:\n                        \n\n\n\n                         Windows (Use PowerShell):\n                        \n\n\n\n[convert]::ToBase64String((Get-Content -path \"your_pfx_file_path\" -Encoding byte)) > \"output_file_name.txt\"\n\n\n\n\n                         Linux:\n                        \n\n\n\nbase64 \"your_pfx_file_path\" > \"output_file_name.text\"\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Make sure you safeguard the .key, .pfx, and .jks files. Anyone that possesses these confidential files has access to the web service.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu from which you select an ADP Workforce Now report to import, along with several other configuration options.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the ADP Workforce Now report you want to import into Domo.\n                           \n\n\n\n\n\n                            Filter Query (Optional)\n                           \n\n\n\n                            Enter a\n                            \n                             $filter\n                            \n                            query to filter the fields in your report. Please include only the specific query, not the\n                            \n                             $filter=\n                            \n                            portion of the parameter string. For more information about building queries, see ADP's developer documentation at\n                            \n                             https://developers.adp.com/\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Query (Optional)\n                           \n\n\n\n                            Enter a\n                            \n                             $select\n                            \n                            query for your report. Please include only the specific query, not the\n                            \n                             $select=\n                            \n                            portion of the parameter string. For more information about building queries, see ADP's developer documentation at\n                            \n                             https://developers.adp.com/\n                            \n                            .\n                           \n\n\n\n\n\n                            Unmask Data (Optional)\n                           \n\n\n\n                            When this box is checked, returned data will not be masked, so long as specified account has access to view all the data.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Using SFTP Export\n                       \n\n                        One of the easiest ways to get your ADP data into Domo is by using ADP's SFTP export capability. To do this, you will first need to request SFTP Export from the ADP Reporting module, then set up an SFTP server for use in pulling reports. You will only need to go through this setup process once. There is a small one-time fee (around $200-$300). Once the server is set up, you can pull any number of reports with no additional fee.\n                       \n\n                        To pull reports, you build them in ADP, specify that they be sent via SFTP, and finally pull them into Domo using the CSV Advanced or SFTP connectors.\n                       \n\n                        Setting up SFTP\n                       \n\n\n                         To set up an SFTP server for use in pulling ADP reports,\n                        \n\n\n\n                         Work with your ADP representative to request SFTP Export from the ADP Reporting module.\n                         \n\n                         Your ADP representative will send you a Statement of Work (SOW) to fill out. The following PDF shows an example of this:\n                         \n\n\n\n\n\n\n\n                         Enter the details for your SFTP server.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              If you like, Domo can host your SFTP server. If you are interested, please reach out to your CSM for more information.\n                              \n\n\n\n\n\n\n\n\n\n                          When requested, send ADP a report to use in testing the setup. (Any ADP report should work.)\n                          \n\n                          ADP will then send a test and ask you to confirm receipt.\n                         \n\n\n\n                          Confirm receipt of the test you have been sent.\n                         \n\n\n\n                        Once you confirm receipt, the server is live and you can begin using it to pull reports into Domo.\n                       \n\n                        Pulling Data into Domo Using SFTP\n                       \n\n\n                         To pull a report into Domo using the SFTP server you have set up,\n                        \n\n\n\n\n                          Build a report in ADP's reporting tool.\n                         \n\n\n\n                          Schedule the report in step 7 in the ADP report builder.\n                         \n\n\n\n                          In the\n                          \n                           Distribution\n                          \n                          settings, specify that the report be sent via SFTP.\n                         \n\n\n\n                          Use Domo's\n                          \n                           Microsoft Excel SFTP Push\n                          \n                          ) to pull the report into Domo.\n                         \n\n\n\n\n                         SFTP Server Setup Instructions (for CSMs)\n                        \n\n\n                          For information about creating an SFTP account for a client, go to\n                          \n                           Requesting an SFTP Account\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360042928074", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003656", "Archived Date": "", "Language": "English", "Primary Version": "ADP Connector", "Article Total View Count": "2,865", "": "", "Article Created Date": "10/24/2022, 9:14 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              ADP Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}