{"file_path": "../../raw_kb_v2\\article\\360056318074\\index.html", "content": {"Title": "Domo Governance Datasets Connector", "Article Body": "Intro\n                       \n\n                        The Domo Governance Datasets Connector provides information about the users, groups, DataSets, DataFlows, Pages, Cards, Beast Modes, and PDP policies in your Domo instance. Use this information together with data from DomoStats to find out how your organization is using Domo. Use the Domo Governance Datasets Connector to integrate your Domo Governance Datasets data in minutes.\n                       \n\n                        You import Domo Governance DataSets in the Data Center. This topic discusses the fields and menus that are specific to the Domo Governance Datasets connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To pull in Domo Governance DataSets using this connector, you need your Customer Name and Domo API Key.\n                       \n\n                        Connecting to Your Domo Governance Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Domo Governance Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your Domo Governance DataSets account. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Customer\n                          \n\n                           Enter your customer name. Your customer name is the part in the URL that before .\n                           \n                            domo.com\n                           \n                           . Ex: If your Domo instance is located at\n                           \n\n\n                              https://some-customer.domo.com\n                             \n\n\n                           , then your customer name is \"some-customer\".\n                          \n\n\n\n                           Domo Access Token\n                          \n\n                           Domo Access Token. See\n                           \n                            Managing Access Tokens\n                           \n                           for details.\n                          \n\n\n\n\n                        Once you have entered valid Domo Governance DataSets credentials, you can use the same account any time you go to create a new Domo Governance DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Using the Domo Governance DataSets will make the owner of the token show in the Activity Logs that they have visited every Card and Dashboard every day.\n                           \n\n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Domo Governance DataSets report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Beast Modes\n                              \n\n\n                                Contains the definitions of all beast modes in your Domo instance. The report is divided into two sections. The first section contains all beast modes saved to the dataset. The second section contains all beast modes that exist only on the card. If the beast mode is used in the card's summary number and also saved to the dataset, it will appear in this section as well.\n                               \n\n\n\n                                  Fields\n                                 \n\n                                : Card ID, Card Title, Dataset ID, Dataset Name, Beast Mode ID, Beast Mode Name, Beast Mode Formula, Beast Mode Status, Beast Mode Saved to Dataset, Beast Mode Applied to Summary Number\n                               \n\n\n\n\n                               Beast Modes with Fields\n                              \n\n\n                                Similar to the Beast Modes report with an additional field. Contains the definitions of all beast modes in your Domo instance. The report is divided into two sections. The first contains all beast modes saved to the dataset. The second contains all beast modes that exist only on the card. If the beast mode is used in the card's summary number but is also saved to the dataset, it will also appear in this section. Field used indicates the field on which beast mode applied.\n                               \n\n\n                                 Fields\n                                \n                                : Card ID, Card Title, Dataset ID, Dataset Name, Beast Mode ID, Beast Mode Name,\n                                \n                                Beast Mode Formula, Beast Mode Status, Beast Mode Saved to Dataset, Beast Mode Applied to Summary Number, Fields Used\n                               \n\n\n\n\n                               Cards\n                              \n\n\n                                Contains a listing of all cards in your Domo instance, who owns them, and what page(s) they reside on.\n                               \n\n\n                                 Fields\n                                \n                                : Card ID, Title, Card Type, Owner User ID, Owner Name, Page, Page ID, Last Modified Date/Time, Locked\n                               \n\n\n\n\n                               Cards and Datasets\n                              \n\n\n                                Contains a listing of all cards in your Domo instance, who owns them, and what page(s) they reside on. Also, tells you which datasets power the cards.\n                               \n\n\n                                 Fields\n                                \n                                : Card ID, Title, Card Type, Owner User ID, Owner Name, Page, Page ID, Last Modified Date/Time, Locked, Dataset ID, Dataset Name\n                               \n\n\n\n\n                               Card Fields With Beast Modes and Drill Views\n                              \n\n\n                                Contains a listing of all cards in your Domo instance, who owns them, and datasource on which cards are built and is beast mode applicable.\n                               \n\n\n                                 Fields\n                                \n                                : Card ID, Card Name, Owner ID, Owner Name, Description, Datasource ID, Datasource Name, Field Name, Is Beast Mode, Beast Mode Name, Field Type\n                               \n\n\n\n\n                               Dataflow Details\n                              \n\n\n                                Contains a listing of all dataflows, dataflow type, owner information, all input and output dataset information, and execution status. Also, contains input and output datasets.\n                               \n\n\n                                 Fields\n                                \n                                : Dataflow ID, Name, Description, Database ProcessingType, DAP Dataflow ID, Document Version, Owner ID, Owner, Run State, Last Execution Preview Rows, Last Execution DAP ID, Last Execution Begin Time, Last Execution End Time, Last Execution Last Updated Time, Last Execution Failed, Last Execution State, Last Execution Dataflow Version, Created Date/Time, Last Modified Date/time, Number of Inputs, Number of Outputs, Execution Count, Execution Success Count, Hydration State, Enabled, Editable, Draft, Restricted, Input Dataset ID, Input Dataset Name, Execute on Update, Output Dataset ID, Output Dataset Name\n                               \n\n\n\n\n                               Dataflows\n                              \n\n\n                                Contains a listing of all dataflows, dataflow type, owner information, all input and output dataset information, and execution status.\n                               \n\n\n                                 Fields\n                                \n                                : Dataflow ID, Name, Description, Database ProcessingType, DAP Dataflow ID, Document Version, Owner ID, Owner, Run State, Last Execution Preview Rows, Last Execution DAP ID, Last Execution Begin Time, Last Execution End Time, Last Execution Last Updated Time, Last Execution Failed, Last Execution State, Last Execution Dataflow Version, Created Date/Time, Last Modified Date/time, Number of Inputs, Number of Outputs, Execution Count, Execution Success Count, Hydration, State, Enabled, Editable, Draft, Restricted\n                               \n\n\n\n\n                               Dataset Schemas\n                              \n\n\n                                Contains column names and types for all datasets in Domo.\n                               \n\n\n                                 Fields\n                                \n                                : Dataset ID, Name, Row Count, Column Count, Owner ID, Owner Name, Dataset Created Date/Time, DataSet Last Touched Date/Time, DataSet Last Updated Date/Time,\n                                \n                                Report Last Run, Type, Display ProcessingType, Data Provider ProcessingType, Description, Card Count, PDP Enabled, Column Name, Column Type, Column ID\n                               \n\n\n\n\n                               Dataset Schemas with Tags\n                              \n\n\n                                Contains column names and types for all datasets in Domo. Also, includes column description and column tags.\n                               \n\n\n                                 Fields\n                                \n                                : Dataset ID, Name, Row Count, Column Count, Owner ID, Owner Name, Dataset Created Date/Time, DataSet Last Touched Date/Time, DataSet Last Updated Date/Time,\n                                \n                                Report Last Run, Type, Display ProcessingType, Data Provider ProcessingType, Description, Card Count, PDP Enabled, Column Name, Column Type, Column ID, Column Description,\n                                \n                                Column Visible, Column Order, Columg Tags, Column Reference DataSource Id\n                               \n\n\n\n\n                               Datasets\n                              \n\n\n                                Contains information about datasets in Domo, including owner, number of rows, number of cards using the dataset, dataset type, etc.\n                               \n\n\n                                 Fields\n                                \n                                : Dataset ID, Name, Description, Row Count, Column Count, Owner ID, Owner Name, Dataset Created Date/Time, DataSet Last Touched Date/Time, DataSet Last Updated, Date/Time, Report Last Run,Type, Display ProcessingType, Data Provider ProcessingType, Card Count, PDP Enabled\n                               \n\n\n\n\n                               Groups\n                              \n\n\n                                Contains a listing of all groups in Domo and number of members in each group.\n                               \n\n\n                                 Fields\n                                \n                                : Group ID, Group Name, Number of Members, Default Group\n                               \n\n\n\n\n                               Pages\n                              \n\n\n                                Contains information about the pages in Domo, including owner, number of cards, parent page, and number of child pages.\n                               \n\n\n                                 Fields\n                                \n                                : Page ID, Title, Owner User ID, Owner Name, Number of Cards on Page, Parent Page ID, Parent Page Title, Number of Child Pages\n                               \n\n\n\n\n                               Pages and Cards\n                              \n\n\n                                Contains page information as well as information about the cards residing on each page.\n                               \n\n\n                                 Fields\n                                \n                                : Page ID, Title, Owner User ID, Owner Name, Number of Cards on Page, Parent Page ID, Parent Page Title, Number of Child Pages, Card ID, Card Title,\n                                \n                                 Collection, Collection ID, Number of Cards in Collection\n                                \n\n\n\n\n\n                               Pages and Users\n                              \n\n\n                                Contains page information as well as the information about users and groups that have access to each page.\n                               \n\n\n                                 Fields\n                                \n                                : Page ID, Title, Owner User ID, Owner Name, Number of Cards on Page, Parent Page ID, Parent Page Title, Number of Child Pages, User ID, User Name, Group ID, Group Name\n                               \n\n\n\n\n                               PDP\n                              \n\n\n                                Lists the PDP policies applied for all datasets.\n                               \n\n\n                                 Fields\n                                \n                                : PDP Enabled, Dataset ID, Dataset Name, PDP Policy ID, PDP Policy Name, Filter Field Name, Filter Field Value, User ID, User Name, Group ID, Group Name\n                               \n\n\n\n\n                               Users\n                              \n\n\n                                Contains information about all users in Domo.\n                               \n\n\n                                 Fields\n                                \n                                : User ID, Name, Title, Security Profile, Email, Phone Number, Employee Number, Created Date, Last Updated Date\n                               \n\n\n\n\n                               Users and Groups\n                              \n\n\n                                Contains details about users and their group memberships.\n                               \n\n\n                                 Fields\n                                \n                                : Group ID, Group Name, Number of Members, Active, Default Group, User ID, User Name\n                               \n\n\n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360056318074", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003304", "Archived Date": "", "Language": "English", "Primary Version": "Domo Governance Datasets Connector", "Article Total View Count": "5,871", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Domo Governance Datasets Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}