{"file_path": "../../raw_kb_v2\\article\\4530782510871\\index.html", "content": {"Title": "Drag-and-Drop Apps", "Article Body": "Intro\n                       \n\n                        Drag-and-Drop Apps bring the power of the Appstore to your Dashboard. You can now add Domo Bricks right from your dashboard editor, so you no longer have to go back and forth from the Appstore to your dashboard—you can stay in context with the rest of your dashboard content while adding cards from the Appstore.\n                       \n\n                        For more information about Domo Bricks, see\n                        \n                         Domo Bricks\n                        \n                        .\n                       \n\n                        Adding a Drag-and-Drop App\n                       \n\n                        You can add a Drag-and-Drop App by selecting the\n                        \n                        icon that appears on the right side of the dashboard view when the dashboard edit mode is open, then dragging it to the desired location on the dashboard. You can then select the desired Domo Brick. The Domo Brick you select will then be added to this location on the dashboard.\n                       \n\n\n                         To add a Drag-and-Drop App,\n                        \n\n\n\n\n                          On the dashboard where you want to add a Drag-and-Drop App, select\n                          \n                           Edit Dashboard\n                          \n                          in the\n                          \n                          menu in the top right corner of the Page.\n                          \n\n\n\n\n\n\n\n\n                          Click and drag the\n                          \n                          icon from the toolbar on the right side of the Page to the location on the Page where you want the new layout.\n                          \n\n\n                          When you drag the App icon over a border, it highlights to indicate you can put the App there. In the example below, the user is dragging the icon over the line directly beneath the \"Group 1\" layout.\n                          \n\n\n\n\n                          Once you drop the\n                          \n                          icon onto a border, the\n                          \n                           Select an App\n                          \n                          dialog opens.\n                         \n\n\n                         Search for the Domo Brick you want to add to the Dashboard.\n                        \n\n                         Select the App from the list and click\n                         \n                          Get\n                         \n                         .\n                         \n                         A pop-up window will display letting you know the app is being created.\n                         \n\n\n\n\n\n                         The App is now inserted into your Dashboard.\n                        \n\n                         Save your Dashboard by clicking the\n                         \n                          Save\n                         \n                         button in the top right-hand corner.\n                        \n\n                         You can now edit and customize the App by hovering over it and selecting\n                         \n                          Edit Card\n                         \n                         from the drop-down menu.\n                        \n\n\n                        For more information on editing Domo Bricks, see\n                        \n                         Domo Bricks\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "4530782510871", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004089", "Archived Date": "", "Language": "English", "Primary Version": "Drag-and-Drop Apps", "Article Total View Count": "4,789", "": "", "Article Created Date": "10/24/2022, 9:20 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Drag-and-Drop Apps\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Card And Dashboard Management\n              \n", "url": "/s/topic/0TO5w000000ZanDGAS"}]}