{"file_path": "../../raw_kb_v2\\article\\360052722114\\index.html", "content": {"title": "\n\n\n AWS Data Exchange V2 Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAWS Data Exchange makes it easy to find, subscribe to, and use third-party data in the cloud. You can access datasets from qualified data providers that include category-leading brands such as Reuters, who curate data from over 2.2 million unique news stories per year in multiple languages; Change Healthcare, who process and anonymize more than 14 billion healthcare transactions and $1 trillion in claims annually; Dun & Bradstreet, who maintain a database of more than 330 million global business records; and Foursquare, whose location data is derived from 220 million unique consumers and includes more than 60 million global commercial venues. Use Domo's Data Exchange Connector to import data into Domo from your Amazon S3 bucket. With the powerful datasets from AWS combined with the ability to visualize and create business solutions in Domo, you can create high-value solutions by combining your own data with external datasets. This connector lists only the AWS Data Exchange datasets that you've subscribed to and approved. To learn more about the Amazon S3 API, visit their page (\n\nhttp://docs.aws.amazon.com/AmazonS3/latest/API/Welcome.html\n\n).\n\n\n You connect to your AWS Data Exchange V2 account in the Data Center. This topic discusses the fields and menus that are specific to the AWS Data Exchange V2 connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n****Primary Use Cases****\n |\n This connector is an excellent choice for retrieving flat files when APIs are not an option.\n  |\n|\n****Primary Metrics****\n |\n N/A\n  |\n|\n****Primary Company Roles****\n | * Data specialists\n* Marketing roles\n* Finance roles\n* Anyone who has data stored in S3\n |\n|\n****Average Implementation Time****\n |\n Less than an hour if you have the correct file types in S3.\n  |\n|\n****Ease of Use (on a 1-to-10 scale with 1 being easiest)****\n |\n 4\n  |\n\nBest Practices\n----------------\n\nUnderstanding the data stored in S3 and its relation to other S3 databases will be a huge asset in using this connector.\n\n\n Prerequisites\n---------------\n\nTo connect to your AWS Data Exchange V2 account and create a DataSet, you must have the following:\n\n Your AWS access key. You can find this in the\n ****Security Credentials****\n section of the AWS Console. Alternatively, if you are using IAM, you can find it under\n ****Users****\n .\n* Your AWS secret key, which was provided when you created your access key. You can generate a new secret key in the AWS Console.\n\nYour AWS Access Key and Secret Key should also have AWS Data Exchange Full access.\n\n##\n Creating a User with the Proper Permissions\n\nYou must create a user with the proper permissions in the IAM Amazon Console before you can connect to S3 data in Domo.\n\n\n****To configure your user:****\n\n\n 1. In the Identity and Access Management Amazon Console, click\n **Users**\n .\n\n2. Click on the\n **Add User**\n button.\n\n3. Add a new user, setting options as follows:\n\n In the\n **Details**\n pane, check the box for\n **Programmatic Access**\n under\n **Select AWS access type**\n .\n* In the\n **Permissions**\n pane, select\n **Attach existing policies directly**\n , then check the box for either\n **AmazonS3FullAccess**\n or\n **AmazonS3ReadOnlyAccess**\n .\n\n\n Customer-managed policies\n *do not work*\n .\n\n Click\n **Next: Tags**\n button to add tags. Adding tags is optional.\n* In the\n **Review**\n pane, click\n **Create User**\n .\n\n4.  Once your user is created, copy the access and secret keys to use in the\n **Credentials**\n pane in Domo.\n\n\n Connecting to Your AWS Data Exchange V2 Account\n-------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the AWS Data Exchange V2 Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your AWS Data Exchange V2 account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter your AWS access key. For information about finding your access key, see Prerequisites above.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. For information about finding your secret key, see Prerequisites above.\n  |\n\n\n Once you have entered valid AWS Data Exchange V2 credentials, you can use the same account any time you go to create a new AWS Data Exchange V2 DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane lists the AWS Data Exchange datasets along with the different parameters that you can select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n List Data Sets\n  |\n Select the datasets. This connector lists only the AWS Data Exchange datasets that you've subscribed to and approved.\n  |\n|\n Region\n  |\n Select the AWS region where the AWS Data Exchange is available. Visit\n\nAWS Regional Services List\n\nto get a detailed and updated list of the regions.\n  |\n|\n What asset type would you like to import?\n  |\n Select the asset type that you would like to parse and import\n  |\n|\n Select the delimiting character\n  |\n Select the delimiting character used in your file. If your delimiter is not listed select 'Other.'\n  |\n|\n Specify your delimiter\n  |\n Enter the character used to delimit your character separated values (CSV) text.\n  |\n|\n Quote Character\n  |\n Select the desired quote character for parsing CSV files. (Double quote is the default quote character for CSV standard)\n  |\n|\n Custom Quote Character\n  |\n Enter the desired CSV Quote character.\n  |\n|\n Escape Character\n  |\n Select the desired escape character for parsing CSV files.\n  |\n|\n Custom Escape Character\n  |\n Enter the desired CSV escape character.\n  |\n|\n Enter the WorkBook Sheet Name\n  |\n Enter the WorkBook Sheet Name.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360052722114\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003910\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAWS Data Exchange V2 Connector\n\n", "article_total_view_count": "\n\n\n 4,690\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "aws_data_exchange_v2_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}