{"file_path": "../../raw_kb_v2\\article\\4404766005655\\index.html", "content": {"Title": "COVID-19 Connector", "Article Body": "Intro\n                        \n\n\n\n\n                         Use Domo's COVID-19 connector to get statistics from WHO and Johns Hopkins University regarding the current outbreak of novel coronavirus disease (COVID-19). Understanding how rapidly the virus is expanding, see testing trends worldwide or locally, and gain insights to know when it's safe to get people back to work. Stay up-to-date on the latest news and statistics about the coronavirus and COVID-19 with Domo's COVID-19 connector.\n                        \n\n\n                        This topic discusses the fields and menus that are specific to the\n                        \n                         COVID-19\n                        \n                        connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        The\n                        \n                         COVID-19\n                        \n                        connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector is useful for getting the updates on current corona virus stats and testing trends worldwide when planning travelling or direct interaction with people.\n                           \n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              HR roles, especially those involved in event planning\n                             \n\n\n\n                              Anyone interested in getting corona virus updates\n                             \n\n\n                             Medical practitioners\n                            \n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            Less than 1 minute\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            1\n                           \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        None. As this data is a public connector, there is no need to enter connection information.\n                       \n\n                        Creating a Covid-19 DataSet\n                       \n\n                        To create a Covid-19 DataSet, simply select the report you wish to retrieve in the\n                        \n                         Details\n                        \n                        pane. Then schedule updates and name and describe your new DataSet in the\n                        \n                         Scheduling\n                        \n                        and\n                        \n                         Name & Describe Your DataSet\n                        \n                        panes. These panes are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This connector provides reports based on the data collected\n                        \n                         from WHO and Johns Hopkins University. The following reports are available:\n                        \n\n\n\n\n\n\n\n\n\n\n                              Field\n                             \n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n                            Domo Data\n                           \n\n\n                             The DOMO data is a cleansed and enhanced version of the COVID-19 stats.\n                            \n\n\n\n\n                                DOMO Covid Additional Metrics Data\n                               \n\n                                Returns the data about Covid19 additional metrics from the DOMO repository.\n                               \n\n\n\n                                Domo Covid Additional Metrics (all time)\n                               \n\n                                Returns the all time data about Covid19 additional metrics from the DOMO repository.\n                               \n\n\n\n                                DOMO Covid Current Snapshot Tracker Data\n                               \n\n                                Returns the data about Covid19 current snapshot tracker from the DOMO repository.\n                               \n\n\n\n                                DOMO Covid Time Series Tracker Data\n                               \n\n                                Returns the data about Covid19 time series tracker from the DOMO repository.\n                               \n\n\n\n                                DOMO Covid US County Time Series Tracker Data\n                               \n\n                                Returns the data about Covid19 US county level time series tracker from the DOMO repository.\n                               \n\n\n\n\n\n\n\n                            Johns Hopkins University Center for Systems Science and Engineering (JHUCSSE) Data\n                           \n\n\n                             The JHU data come directly from John Hopkins University (JHU), based on the data they publish at their Coronavirus Research Center.\n                            \n\n\n\n\n                                JHU Covid Daily Report\n                               \n\n                                Returns the data about daily case reports from the JHU CSSE data repository.\n                               \n\n\n\n                                JHU Covid Time Series Confirmed\n                               \n\n                                Returns the data about daily time series summary of confirmed cases from the JHU CSSE data repository.\n                               \n\n\n\n                                JHU Covid Time Series Deaths\n                               \n\n                                Returns the data about daily time series summary of deaths from the JHU CSSE data repository.\n                               \n\n\n\n                                JHU Covid Time Series Recovered\n                               \n\n                                Returns the data about daily time series summary of recovered cases from the JHU CSSE data repository.\n                               \n\n\n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n                        Reach out to Domo Support if you experience issues with this connector.\n                       \n\n                        FAQs\n                       \n\n                        What kind of credentials do I need to power up this connector?\n                       \n\n                        No credentials needed.\n                       \n\n                        What kind of data does this connector provide?\n                       \n\n                        The COVID-19 connector gets the statistics from WHO, Johns Hopkins University, Worldometer and others about the current outbreak of novel coronavirus disease (COVID-19), and provides you the latest statistics. You can get the statistics about confirmed cases, recovered cases, deaths, and daily reports from the Domo repository as well as Johns Hopkins University repository.\n                       \n\n                        From where does this connector collect the data?\n                       \n\n                        The JHU data come directly from John Hopkins University (JHU), based on the data they publish at their\n                        \n                         Coronavirus Research Center\n                        \n                        . This data is provided exactly as JHU publishes and could change without knowledge of Domo. This data updates once nightly.\n                        \n                        The DOMO data is a cleansed and enhanced version of the COVID-19 stats, and powers the\n                        \n                         Coronavirus (COVID-19) Tracker\n                        \n                        .\n                       \n\n                        How this connector is useful to me?\n                       \n\n                        The COVID-19 connector provides you the accurate data which is monitored by a team at Domo, analyzing the evolving epidemic. Benefits of using this connector:\n                       \n\n\n                         The data is collected by blending the Worldometer and Johns Hopkins data to get the most current information. We actually have an alert tracking the updates for information. The data is refreshed roughly every ten minutes and is a blend of current day worldometer with JHU history. If one site is down, we can also toggle quickly between the sources.\n                        \n\n                         The data is cleansed and aligned continuously by fixing inconsistent country names, aligning latitude/longitude or fixing errors, replacing nulls with zero etc. So, the issues are corrected as they are found. As a result, you get the benefit of cleaner and easier to use data.\n                        \n\n                         You always get the enriched data as we have added additional metrics like first date after 100 cases for countries or calculating new cases, deaths, and recoveries for each historical day. We are also now exposing some additional metrics we compile including test results, stay at home orders, economic data and more.\n                        \n\n\n                        How often can the data be updated?\n                       \n\n                        The COVID-19 connector updates automatically as the data updates in the repository.", "Preview Article": "Click here to preview", "URL Name": "4404766005655", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003220", "Archived Date": "", "Language": "English", "Primary Version": "COVID-19 Connector", "Article Total View Count": "2,344", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              COVID-19 Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}