{"file_path": "../../raw_kb_v2\\article\\360043439573\\index.html", "content": {"Title": "March 2016 Release Notes", "Article Body": "Note:\n                           \n                           Depending on the product version you are using, the documentation may include information about features that may not be available or may have changed.\n                          \n\n\n\n\n                        New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Appstore\n                       \n\n\n                         Take your data to the next level with visuals and insight you\n                        \n\n                         never knew you’d been missing. In Domo’s Appstore\n                        \n\n                         you’ll find an App for whatever road you’re ready to travel.\n                        \n\n                         With over 1,000 Apps, you can quickly find an App that addresses your particular\n                        \n\n                         question. With enhanced discovery capabilities you can search and filter Apps for over 27 i\n                        \n\n                         ndustries, 14 roles, 8 departments, and 38 activities.\n                        \n\n\n\n                         Apps now support advanced visualizations and enhanced power-up flows. In just a\n                        \n\n                         few steps, you’ll have your App connected to your data.  If desired, you can even\n                        \n\n                         assign the power-up task to someone else in your org.\n                        \n\n\n                        New for this release, all Apps now initially deploy with sample data so you can take the time to look over the cards before you connect them to live data. In addition to our QuickStart Apps, you can also power Card Builder Apps and custom Apps by selecting DataSets with matching columns and data types.\n                       \n\n                        Developer Portal\n                       \n\n                        Domo's developer portal gives you access to all the tools and documentation you need to build, manage, and connect in Domo. Using the developer portal, you can build Domo Apps, customize your Domo instance with APIs and add-ons, and create your own connectors for delivering customized reports.\n                       \n\n                        For more information and documentation about each of these tools, please visit\n                        \n                         https://developer.domo.com\n                        \n                        .\n                       \n\n                        App Studio Tools\n                       \n\n                        Create advanced interactive visualizations that connect to Domo, allowing you to tell powerful data-driven stories.  Domo is releasing two tools that you can use immediately at no charge.\n                       \n\n                        Known limitations of custom Apps:\n                       \n\n\n\n                          Apps cannot use columns that have been created using Beast Mode calculations.\n                         \n\n\n\n                          Apps do not support all Export commands (Excel, CSV, PPT).\n                         \n\n\n\n                          Cards containing custom Apps cannot be duplicated.\n                         \n\n\n\n                          Apps do not support Alerts.\n                         \n\n\n\n                          Publish to Slideshow is not supported. View as Slideshow\n                          \n                           is\n                          \n                          supported.\n                         \n\n\n\n                        App Design Studio\n                       \n\n                        This tool leverages all the capabilities of Adobe Illustrator to create your design and layer on data-driven pieces.  Combine graphic assets with any of our 100+ library of Widgets—pieces of code that can connect to data.  However, there is no need to understand code.  Domo will write the code for you!\n                       \n\n                        Once you upload your design to Domo, you can connect to any of your DataSets to power your design and have it update on your schedule.  Custom Apps behave like other cards in Domo, letting you move, share, collaborate via Buzz, or view on mobile devices.\n                        \n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Requires a Creative Cloud account from Adobe and access to Illustrator 2014 or 2015 CC.\n                          \n\n\n\n\n\n\n\n                        App Dev Studio\n                       \n\n                        This tool provides maximum flexibility for creating Custom Apps.  It is best suited for developers with web-based programming experience such as HTML, CSS, or JavaScript.  Any application that can run on the web can be created as a Custom App and run in Domo.\n                       \n\n                        The App Dev Studio is built on top of an open web platform.  This gives users the power to build rich, complex logic with JavaScript, make animations with CSS Transitions, or even build 3D creations in Canvas.  In addition, we support all major web frameworks and libraries, including React, Angular, Webpack, Lodash, etc.  Domo also provides an optional utility library called domo.js that provides useful functions common to Custom Apps.\n                       \n\n                        With a unified REST API, you have access to query data or users inside of your Domo instance.\n                       \n\n                        Using our Command Line Interface (CLI), you can login to Domo, initialize new designs, or run a local dev server.\n                       \n\n\n                         Git -\n                        \n\n                         http://git-scm.com/downloads\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            App Dev Studio has the following requirements:\n                           \n\n\n\n\n\n\n\n                                On Windows, the installer will also install \"git bash,\" which you should use as your terminal when running all future commands.\n                               \n\n\n\n\n\n                              Node.js via \"brew install node\" on OS X or via download -\n                              \n                               https://nodejs.org/\n                              \n\n\n\n\n                                You can verify that Node is properly installed on your path by opening your terminal and typing \"node --version.\"\n                               \n\n\n\n\n\n                              OS X Only - Accept the XCode License \"sudo xcodebuild -license\"\n                             \n\n\n\n                              Windows Only - git bash\n                             \n\n\n\n                              Make sure your firewall isn't blocking the npm registry (\n                              \n                               https://www.npmjs.com/\n                              \n                              )\n                              \n\n                              .\n                              \n\n\n\n\n\n\n\n\n\n                        Card Builder\n                       \n\n                        Domo's Card Builder tool provides the simplest way to build Apps in Domo. It allows you to choose from a large variety of card designs to visualize your data. You can also use this tool to answer specific business questions by grouping your cards into collections.\n                       \n\n                        Connector Dev Studio\n                       \n\n                        Data is the foundation of everything you do in Domo.  In order to build that foundation, connectors are available to access all your relevant data. A connector pulls data from a data source and makes it accessible inside Domo. Connectors can be set up to pull data on a schedule and append or replace the existing content from that data source.\n                       \n\n                        To support data sources that are not available in Domo’s current catalog of connectors, Domo has created an intuitive web-based Connector Dev Studio for building custom connectors. The connector development process leverages the JavaScript language in conjunction with added convenience methods. If you are familiar with JavaScript, it is possible to build a connector now.\n                       \n\n                        Domo's Connector Dev Studio utilizes an intuitive four-step process, as follows:\n                       \n\n\n\n                          You upload images for thumbnails to represent this connector.\n                         \n\n\n\n                          You configure your user authentication. Available options include\n                          \n                           None\n                          \n                          (for public data sources),\n                          \n                           Username and Password\n                          \n                          ,\n                          \n                           API Key\n                          \n                          , and\n                          \n                           OAuth 2.0\n                          \n                          . Once you have set up your user authentication, you can test it to make sure it works correctly.\n                         \n\n\n\n                          You configure the reports that users will be able to build using your connector.\n                         \n\n\n\n                          You define how the data is processed by adding your own data processing script. You can enter a test query to see a preview of a report.\n                         \n\n\n\n                        Two sample connectors are provided in the Connector Dev Studio to help get you started.\n                       \n\n                        Domo APIs\n                       \n\n                        Domo Application Program Interfaces (APIs) make it easier to administer your data and users, giving you the power and flexibility to get the most out of Domo. The following APIs are available:\n                       \n\n\n\n\n                           Authentication\n                          \n                          . We're all about protecting your data. That's why in order to access your Domo instance through an API, you'll need to authenticate. Domo uses OAuth 2.0 as an authentication framework, and you can get authentication tokens easily via the developer portal.\n                         \n\n\n\n\n                           Data\n                          \n                          . With Domo's data APIs you can create DataSets, list all DataSets, read or update metadata for a specified DataSet, delete a DataSet, or push or pull data to/from a specified DataSet.\n                         \n\n\n\n\n                           Users\n                          \n                          . User APIs allow you to manage users in your Domo instance. You can create users, get information about a user, list all users, update information for a user, or delete a user.\n                         \n\n\n\n                        New iOS App\n                       \n\n                        Domo has been hyper-focused on the modern business executive since we began. That person is not tied down to a desk, they are often on the move. In February we released our new Mobile Web experience to provide a mobile optimized experience for iOS and Android users in a mobile browser.\n                       \n\n                        We are now releasing a new native iOS app. We have been crazy hard at work creating this amazing new app. We went to the drawing board with the goals of creating an amazing design on top of a faster, more intuitive experience. With this app you get the same new features we introduced with Mobile Web, such as filtering cards through Analyzer and support for Publication Groups, and we are introducing an innovative Home experience. With Home, you can see trending content, personalize your daily hotlist of critical content, and discover new people or new cards as they are created or shared with you.\n                       \n\n                        The new app is available in the Apple App Store now! Go get it.\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439573", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004457", "Archived Date": "", "Language": "English", "Primary Version": "March 2016 Release Notes", "Article Total View Count": "2,406", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              March 2016 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}