{"file_path": "../../raw_kb_v2\\article\\360043429353\\index.html", "content": {"Title": "Spark Line Chart", "Article Body": "Intro\n                       \n\n\n\n                        A Spark Line chart is basically the same thing as a standard Line chart except that it a) does not include axes, providing a simple and uncluttered view of rises and falls in your data, and b) includes a built-in gauge that shows the degree of change in the chart data. For example, the following screenshots shows a Spark Line chart in which the COGS value has fallen 74.35% from an initial value of $6.68K.\n                       \n\n\n\n\n                        By default, the gauge shows the degree of change between the first and last data items in the chart; however, you can change this to show the degree of change for the last two data items if you want. You can also change other aspects of Spark Line charts, such as whether the degree of change is a percentage or a value, whether it appears as green or red, the fill color for the chart, etc. You can make all of these changes in the Chart Properties for the chart.\n                       \n\n                        As with most other chart types, Spark Line charts include hover labels that show the specific data for each data point. So even though there are no axes, users can still ascertain values for data points by mousing over them. For more information about hover labels, see\n                        \n                         Formatting Data Label and Hover Text in Your Chart\n                        \n                        .\n                       \n\n                        Powering Spark Line charts\n                       \n\n                        Spark Line charts require only two columns or rows of data from your DataSet—one for categories (generally dates or times) and one for values. As with most other Line charts, categories are represented along the horizontal axis and values are represented on the vertical axis (though these are not shown in a Spark Line chart for the sake of simplicity). To build a Spark Line in Analyzer, you drag your category column into the \"X Axis\" field and your value column into the \"Y Axis\" field.\n                       \n\n                        For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your Spark Line chart. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        Customizing Spark Line charts\n                       \n\n                        You can customize the appearance of a Spark Line chart by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        . The unique properties of Spark Line charts include the following:\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Background Fill\n                           \n\n\n\n                            Specifies the background fill color for the chart. If\n                            \n                             Default\n                            \n                            is selected, no background color is used.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Value Options > Hide\n                           \n\n\n\n                            Hides the summary value in the chart. (This is the\n                            \n                             first\n                            \n                            number that appears in the chart's built-in gauge. For example, in the screenshot of the chart at the top of this article, the value is 6.68K.)\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Options > Value\n                           \n\n\n\n                            Indicates how the chart's summary value is derived. You can choose from any of the following options for this property:\n                           \n\n\n\n\n\n                                First Value\n                               \n\n\n\n                                The summary value is the first value on your line.\n                               \n\n\n\n\n\n                                Last Value\n                               \n\n\n\n                                The summary value is the last value on your line. This is the default option.\n                               \n\n\n\n\n\n                                Sum\n                               \n\n\n\n                                The summary value is the sum of all values on the line.\n                               \n\n\n\n\n\n                                Average\n                               \n\n\n\n                                The summary value is the average of all values on the line.\n                               \n\n\n\n\n\n                                Minimum\n                               \n\n\n\n                                The summary value is the minimum value on the line.\n                               \n\n\n\n\n\n                                Maximum\n                               \n\n\n\n                                The summary value is the maximum value on the line.\n                               \n\n\n\n\n\n                                Count\n                               \n\n\n\n                                The summary value is a count of the number of values on the line.\n                               \n\n\n\n\n\n\n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Options > Size\n                           \n\n\n\n                            Specifies the size of the summary value in the chart. You can choose from\n                            \n                             Medium\n                            \n                            (default) or\n                            \n                             Small\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Options > Value Format\n                           \n\n\n\n                            Determines the general number format for your chart's summary value. Options include\n                            \n\n                              Number\n                             \n\n                            (which includes no special formatting),\n                            \n\n                              Currency\n                             \n\n                            (in which a currency symbol is affixed), and\n                            \n\n                              Percentage\n                             \n\n                            (in which a percent symbol is affixed).\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Options > Divide Value By\n                           \n\n\n\n                            Refers to the number that the gauge value is to be divided by, if any. This option is useful when the value is very large and you want to abbreviate it by dividing by a common number. For example, if the gauge value represented millions of dollars, you could choose to divide by millions—the gauge value would then be reduced to more comprehendible single digits. When you choose to divide by\n                            \n\n                              Percentage\n                             \n\n                            , the gauge value is multiplied by 100.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Options > Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places used in the summary value. You can choose from\n                            \n\n                              Default\n                             \n\n                            ,\n                            \n\n                              None\n                             \n\n                            , and options for numbers of decimal places (from \".0\" to \".00000\"). By default, Domo automatically determines the optimal number of decimal places for the gauge value. When you select\n                            \n\n                              None\n                             \n\n                            , the value is rounded to the nearest whole number.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Options > Negative Numbers\n                           \n\n\n\n                            Determines the format for negative numbers.\n                           \n\n                            If you select\n                            \n\n                              -100\n                             \n\n                            , negative values have a minus symbol affixed. If you select\n                            \n\n                              (100)\n                             \n\n                            , negative values are enclosed in parentheses.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Hide\n                           \n\n\n\n                            Hides the change value in the chart. (This is the\n                            \n                             second\n                            \n                            number that appears in the chart's built-in gauge. For example, in the screenshot of the chart at the top of this article, the value is -74.35%.)\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Value\n                           \n\n\n\n                            Specifies whether the change value is a percent change (default) or a difference in values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Data\n                           \n\n\n\n                            Specifies whether the change value is derived from the first and last values in the chart (default) or the last two values in the chart.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Size\n                           \n\n\n\n                            Specifies the size of the change value in the chart. You can choose from\n                            \n                             Medium\n                            \n                            (default) or\n                            \n                             Small\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Size > Direction Indicator\n                           \n\n\n\n                            Specifies whether the symbol used to represent change in the change value is an arrow (default), a curved arrow, or a triangle. Examples of all three of these are shown at right.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Change Values > Reverse Color Direction\n                           \n\n\n\n                            By default, if your change value is positive, the value appears green; if it is negative, the value appears red. By setting the\n                            \n                             Reverse Color Direction\n                            \n                            property, you can switch this default behavior. This is useful for gauges in which low values are ideal (such as a gauge that keeps track of workplace accidents).\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Value Format\n                           \n\n\n\n                            Determines the general number format for your chart's change value. Options include\n                            \n\n                              Number\n                             \n\n                            (which includes no special formatting),\n                            \n\n                              Currency\n                             \n\n                            (in which a currency symbol is affixed), and\n                            \n\n                              Percentage\n                             \n\n                            (in which a percent symbol is affixed).\n                           \n\n\n\n\n\n\n\n\n\n\n                                 Note:\n                                \n                                The\n                                \n                                 Number\n                                \n                                and\n                                \n                                 Currency\n                                \n                                options will\n                                \n                                 not\n                                \n                                work unless you set\n                                \n                                 Change Value Options > Value\n                                \n                                to\n                                \n                                 Value Change\n                                \n                                .\n                               \n\n\n\n\n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Hover Format\n                           \n\n\n\n                            Determines the number format for your chart's hovers (i.e. the text that appears when you mouse over a data point in the chart). Options include\n                            \n\n                              Number\n                             \n\n                            (which includes no special formatting),\n                            \n\n                              Currency\n                             \n\n                            (in which a currency symbol is affixed), and\n                            \n\n                              Percentage\n                             \n\n                            (in which a percent symbol is affixed).\n                            \n\n                            For more information about hovers, see\n                            \n                             Formatting Data Label and Hover Text in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Hover Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places that appear in values in your chart's hovers (i.e. the text that appears when you mouse over a data point in the chart).\n                            \n\n                            For more information about hovers, see\n                            \n                             Formatting Data Label and Hover Text in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Positive Color\n                           \n\n\n\n                            Specifies the color used when the degree of change in your chart is positive.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Change Value Options > Negative Color\n                           \n\n\n\n                            Specifies the color used when the degree of change in your chart is negative.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Line Options > Style\n                           \n\n\n\n                            Determines whether the line in your chart is angular (\n                            \n                             Plain\n                            \n                            ) or curved.\n                            \n                             Plain\n                            \n                            is the default.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Line Options > Thickness\n                           \n\n\n\n                            Determines whether the line in your chart is thin (default), medium, or thick. The example at right shows a Spark Line chart in which\n                            \n                             Thick\n                            \n                            has been selected.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Line Options > Hide Area Fill\n                           \n\n\n\n                            Hides the area fill in the chart. The example at right shows a chart in which this has been done.", "Preview Article": "Click here to preview", "URL Name": "360043429353", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004696", "Archived Date": "", "Language": "English", "Primary Version": "Spark Line Chart", "Article Total View Count": "4,811", "": "", "Article Created Date": "10/24/2022, 10:23 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Spark Line Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}