{"file_path": "../../raw_kb_v2\\article\\360043433593\\index.html", "content": {"title": "\n\n\n Adobe Analytics Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAdobe Analytics helps you create a holistic view of your business by turning customer interactions into actionable insights. Domo's Adobe Analytics connector allows you to retrieve data through prebuilt reports or customized reports or by submitting a query to the Adobe Analytics API. You can then combine metrics with data from CRM, POS, or any other system to make faster, better-informed business decisions. To learn more about the Adobe Analytics API, visit\n\n\n https://marketing.adobe.com/developer/en\\_US/get-started/introduction/c-introduction\n\n\n .\n\nYou connect to the Adobe Analytics API in the Data Center.\n\nThis topic discusses the fields and menus that are specific to the Adobe Analytics connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\n\n To connect to the Adobe Analytics and create a DataSet, you must have the Client ID and Client Secret associated with your Adobe Analytics account.\n\n\n Visit\n\nAdobe Oauth Connection\n\ndocumentation to learn more about obtaining your Client ID and Client Secret.\n\n\n###\n\nCreating a new OAuth project in Adobe Developer Console\n\nTo create a new OAuth project in Adobe Developer Console, do the following:\n\n. Log into\n\nhttps://console.adobe.io/projects\n\n.\n2. Click\n **Create new project**\n button.\n3. Click on\n **Add API**\n to start using the Adobe services.\n\n\n 4. The APIs available to you will be listed in the\n **Add an API**\n window. Select\n **Adobe Analytics**\n .\n\n5. Now, you need to select the authentication type. Select\n **OAuth**\n here.\n\n6. Select the\n **Web**\n platform to configure the API.\n\n\n Enter the\n **redirect URI**\n as\n **https://oauth.domo.com/api/data/v2/oauth/providers/adobe-analytics-oauth/exchange**\n\n\n Enter the\n **Redirect URI pattern**\n as\n **https://oauth//.domo//.com/api/data/v2/oauth/providers/adobe-analytics-oauth/exchange**\n\n\n 7. Click\n **Save configured API**\n .\n\n\n Connecting to the Adobe Analytics API\n----------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n\n\n and\n **Details**\n\n\n panes in the Adobe Analytics connector page. The components of the other panes in this page,\n\n\n**Scheduling**\n and\n\n\n**Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\nThis pane contains fields for entering credentials to connect to the Adobe Analytics API. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Client ID\n  |\n Enter the client ID associated with your Adobe Analytics account.\n  |\n|\n Client Secret\n  |\n Enter the client secret associated with your Adobe Analytics account.\n  |\n\nOnce you have entered valid credentials, you can use the same account any time you go to create a new Adobe Analytics DataSet. You can manage connector accounts in the\n\n\n**Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n\nDetails Pane\n\nThis pane contains two menus,\n\n\n**Report Suite**\n\n\n and\n\n\n**Report Type**\n , which allow you to select a predefined Adobe Analytics report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Company\n  |\n Enter your company's name as featured on Adobe Analytics, which is used as a parameter for the\n\nCompany.GetEndpoint\n\nmethod (see\n\nhttps://github.com/AdobeDocs/analyti...GetEndpoint.md\n\n)\n  |\n|\n Report Suite\n  |\n Select the Adobe Analytics Report Suite you want to pull data from.\n  |\n|\n Predefined Report\n  |\n Select an Adobe Analytics report type. The following table lists all of the available predefined reports:\n\n\n|  |  |\n| --- | --- |\n|\n Base Metrics\n  |\n Returns data about page views; average time spent on website; unique visitors by month, week, and day; new visitors; etc.\n  |\n|\n Commerce Metrics\n  |\n Returns data about number of visits, orders, checkouts, revenue, new and returning customers, etc.\n  |\n|\n Existing Customer Campaigns\n  |\n Returns data about visits, orders, and revenue, broken down by existing customer campaign.\n  |\n|\n Existing Customer Products\n  |\n Returns data about existing customer visits, orders, checkouts, and revenue, broken down by product.\n  |\n|\n Mobile Device Types\n  |\n Returns data about mobile views, visits, and daily unique visitors, broken down by device type.\n  |\n|\n Mobile Metrics\n  |\n Returns metrics about mobile device usage, such as device type, OS, views, visits, and daily unique visitors.\n  |\n|\n Natural Search Conversion\n  |\n Returns data about number of visits, orders, and revenue, broken down by natural search keyword.\n  |\n|\n Natural Search Visits\n  |\n Returns data about number of visits, page views, and daily unique visitors, broken down by natural search keyword.\n  |\n|\n New Visitor Best Campaigns\n  |\n Returns data about visits, orders, revenue, and units, broken down by new visitor campaign.\n  |\n|\n New Visitor Geo\n  |\n Returns data about visits, orders, revenue, and units, broken down by region.\n  |\n|\n New Visitor Geo Country\n  |\n Returns data about visits, orders, revenue, and units, broken down by country.\n  |\n|\n New Visitor Keywords\n  |\n Returns data about visits, orders, revenue, and units, broken down by paid search keyword.\n  |\n|\n New Visitor Products\n  |\n Returns data about new customer visits, orders, checkouts, revenue, units, etc., broken down by product.\n  |\n|\n New Visitor Traffic Source\n  |\n Returns data about visits, orders, revenue, and units, broken down by referrer type.\n  |\n|\n Page Effectiveness\n  |\n Returns data about page visits, entries and exists, bounces, and bounce rate, broken down by page.\n  |\n|\n Page Metrics\n  |\n Returns data about page views, visits, daily unique visitors, and exists, broken down by page.\n  |\n|\n Paid Search Conversion\n  |\n Returns data about visits, orders, and revenue, broken down by paid search keyword.\n  |\n|\n Paid Search Visits\n  |\n Returns data about page views, daily unique visitors, and visits, broken down by paid search keyword.\n  |\n\n|\n\n\n###\n\nOther Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n-------\n\n\n####\n\nQ: When should I use this connector?\n\n\n A: This connector has been deprecated and cannot be used to power up any new datasets.\n\n\n####\n Q: I successfully created an Adobe Analytics OAuth account, but about two weeks later I got an alert: \"Account Adobe Analytics OAuth Account has been Deactivated\". Why is this happening and what can I do about it?\n\nA: Adobe Analytics OAuth has a refresh token that expires after two weeks (see\n\nAdobe documentation\n\nfor details.) This causes Adobe OAuth to no longer authenticate after two weeks. This is an Adobe limitation. Older datasets use WSSE authentication (Username:Company, Password), but Adobe has deprecated WSSE authentication. Please contact Adobe support to request a resolution to this issue.\n\n###\n\nQ: My Adobe\n\nAnalytics datasets are failing intermittently and displaying unhelpful error messages like\n\n\"Unable to complete report at this time. Please try again later.\" What should I do?\n\n\n A: This error originates on\n\n\n Adobe\n\n\n ’s end. Unfortunately, it is nothing we at Domo have direct control over, but we are working with\n\n\n Adobe\n\n\n to improve these types of errors. That said, you can take steps to alleviate the occurrence of these errors, which include reducing the number of connectors, the frequency at which they try to pull data, and the size of their requests. Attempting to schedule requests to run at different times can also help. Another possible solution is to use the “retry” setting in the connector.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433593\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003548\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAdobe Analytics Connector\n\n", "article_total_view_count": "\n\n\n 11,965\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "adobe_analytics_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}