{"file_path": "../../raw_kb_v2\\article\\000005090\\index.html", "content": {"title": "\n\n\n e-Stat Third Party Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\ne-Stat is the one-stop service for official statistics of Japanese government.\n\n\n The e-Stat Connector allows you to import various official statistics such as Population Estimates, Labour Force Survey, GDP, etc. into your Domo instance. You can compare these statistics with your own data or analyze this information as external factors.\n\n\n In addition to the API, e-Stat offers data in Excel or PDF format. However, the connector only supports data retrieval through the API.\n\n\n You connect to your e-Stat account in the Data Center. This topic discusses the fields and menus that are specific to the e-Stat Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your e-Stat account and create a DataSet, you must have the following:\n\n The Application ID for your e-Stat account\n\nTo find how to register as a user with e-Stat and how to get the application ID, refer to\n\n利用ガイド\n\n.\n\n\n Connecting to your e-Stat Account\n-----------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the e-Stat Connector page. The components of the other panes in this page, Scheduling and Name & Describe Your DataSet, are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your e-Stat account.\n\n\n The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n API Key\n  |\n Enter your Application ID retrieved from the my page of e-State.\n  |\n\nFor information about obtaining these credentials, see\n **Prerequisites**\n above.\n\n\n After you have entered the valid LINE MUSIC Analytics credentials, you can use the same account any time you go to create a new LINE MUSIC Analytics DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, refer to\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Data Selection Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select..\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the report you want to run. The following reports are available:\n * **統計表表示IDで取得**\n\nRetrieve a statistics table by its ID. Statistics table is a dataset provided by e-Stat.\n |\n|\n 統計表表示ID\n  |\n Enter the ID that identify the statistics table. You can find the ID in the detail page of statistics table you want to import.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, refer to\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What is needed to use the connector?\n\nYou must register as a user with e-Stat and obtain an Application ID.\n\n###\n Are there any API limits that I need to be aware of?\n\nThere are no limits currently.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 000005090\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005090\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\ne-Stat Third Party Connector\n\n", "article_total_view_count": "\n\n\n 4,160\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 12/28/2022, 6:11 AM\n\n\n", "first_published_date": "\n\n\n 12/28/2022, 6:29 AM\n\n\n"}, "title": "estat_third_party_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}