{"file_path": "../../raw_kb_v2\\article\\360042929234\\index.html", "content": {"title": "\n\n\n Crimson Hexagon Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Crimson Hexagon is an enterprise social media analytics company providing insights for brand strategy, market research, and more.\n\nTo learn more about the Crimson Hexagon API, visit their page (\n\nhttp://apidocs.crimsonhexagon.com/re...ce#results-api\n\n).\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector helps you answer business questions regarding consumer trends, sentiment, competitors, and category-level conversations.\n  |\n|\n**Primary Metrics**\n | * Mentions volume over time\n* Net sentiment\n* Emotions breakdown\n* Social engagement\n* Mentions by geography\n* Demographic breakdowns.\n |\n|\n**Primary Company Roles**\n | * Marketing VP\n* Marketing director\n* Marketing manager\n |\n|\n**Average Implementation Time**\n |\n ~1 hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 3\n  |\n\nYou connect to your Crimson Hexagon account in the Data Center. This topic discusses the fields and menus that are specific to the Crimson Hexagon connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n**Note:**\n Access to the Crimson Hexagon Monitor API is required to use this connector.\n\n\n Best Practices\n----------------\n\n\n* It's recommended that you deploy reports for the same monitor for comparison.\n* Deploy reports for a monitor over a consistent time period.\n* Social reports only pertain to monitors of the specified social platform (i.e. the Facebook reports will only return data for Facebook monitors).\n\nPrerequisites\n---------------\n\nTo connect to your Crimson Hexagon account and create a DataSet, you must have your Crimson Hexagon username and password. You must also reach out to Crimson Hexagon support to enable API access for your username.\n\n\n Connecting to Your Crimson Hexagon Account\n--------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Crimson Hexagon Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Crimson Hexagon account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter your Crimson Hexagon username.\n  |\n|\n Password\n  |\n Enter your Crimson Hexagon password.\n  |\n\n\n Once you have entered valid Crimson Hexagon credentials, you can use the same account any time you go to create a new Crimson Hexagon DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Crimson Hexagon report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Authors\n  |\n Returns information related to the Twitter authors who have posted in a given monitor. Author information is currently only available for monitors with Twitter content.\n  |\n|\n Day and Time\n  |\n Returns volume information aggregated by time of day or day of the week, depending on the parameters set by the requesting user. The \"numberOfDocuments\" field shows the total volume of posts for each date.\n  |\n|\n Demographics Age\n  |\n Returns age information about authors in a monitor.\n  |\n|\n Demographics Ethnicity\n  |\n Returns ethnicity information (calculated using US census data and definitions) about authors in a monitor. The information in this endpoint is only available to US-based customers. Users from non-US customers attempting to access this endpoint will receive an error response.\n  |\n|\n Facebook Admin Posts\n  |\n Returns posts made by the administrator(s) of a targeted Facebook page in a Facebook Social Account Monitor.\n  |\n|\n Facebook Page Likes\n  |\n Returns the cumulative daily like totals for a targeted Facebook page in a Facebook Social Account Monitor as of the selected dates.\n  |\n|\n Facebook Total Activity\n  |\n Returns information about actions made by users and admins for that page.\n  |\n|\n Geography All Resources\n  |\n Returns all the geographical locations that you may use to filter monitor results. For API endpoints that take a filter parameter, you may use the information from this endpoint to filter results based on the geolocation fields included in this response. Each of the other geography resources endpoints provides more granular views of information that appears in this endpoint.\n  |\n|\n Geography Cities\n  |\n Returns all the cities or urban areas defined in the given country that you may use to filter monitor results. Cities and urban areas may span multiple states or regions.\n  |\n|\n Geography States\n  |\n Returns all the states or country regions defined in the passed in country that you may use to filter monitor results.\n  |\n|\n Instagram Followers\n  |\n Returns the cumulative daily follower count for a targeted Instagram account in an Instagram Social Account Monitor as of the selected dates.\n  |\n|\n Instagram Sent Media\n  |\n Equivalent to Twitter Sent Posts and Facebook Admin Posts, but for media sent by admins in a targeted Instagram account.\n  |\n|\n Instagram Total Activity\n  |\n Returns information about actions made by users and admins for the selected account. The requested monitor must be an Instagram Social Account Monitor.\n  |\n|\n Interest Affinities\n  |\n Returns information about the authors in a monitor and their affinity with a range of pre-defined topics. Errors specific to this endpoint are related to the number of posts required to calculate affinities. There must be at least 250 tweets in the selected date range to use Affinities. Each interest must have a minimum of 5 posts and average at least 5 authors per day.\n  |\n|\n Monitor Audit\n  |\n Returns audit information about the selected monitor, sorted from most to least recent.\n  |\n|\n Monitor Detail\n  |\n Returns detailed metadata about the selected monitor, including category information.\n  |\n|\n Monitor List\n  |\n Returns a list of monitors accessible to the requesting (default) or selected user along with metadata related to those monitors. This endpoint provides the most convenient access to the unique monitor IDs used for requests to other endpoints.\n  |\n|\n Monitor Results\n  |\n Returns the results of a given monitor's analysis.\n  |\n|\n Monitor Results by City\n  |\n Returns the selected monitor's result volume grouped by the cities in the selected country or the whole world.\n  |\n|\n Monitor Results by Country\n  |\n Returns the selected monitor's result volume grouped by country.\n  |\n|\n Monitor Results by State\n  |\n Returns the selected monitor's result volume grouped by the states in the selected country. State information requires the\n **Country**\n parameter to return results.\n  |\n|\n Monitor Training Posts\n  |\n Returns a list of the training posts for a given opinion monitor. The selected monitor must be an opinion monitor; requests for other monitor types will return an error. By default, all training posts for all categories in a monitor will be returned; however you may pass a category ID in your request to get training posts from a specific category. This endpoint is subject to the same content restrictions as other endpoints that return posts.\n  |\n|\n Posts\n  |\n Returns information about posts in a monitor. For Twitter and Google+ content, we are currently unable to show title and contents information via the API.\n  |\n|\n Team List\n  |\n Returns a list of teams accessible to the requesting user.\n  |\n|\n Top Sites and Content Resources\n  |\n Returns volume information related to the sites and content sources (e.g. Twitter, Forums, Blogs, etc.) in a monitor.\n  |\n|\n Twitter Engagement Metrics\n  |\n Returns information about the top hashtags, mentions, and retweets in a monitor. Whereas the Twitter Total Engagement endpoint requires a Twitter Social Account Monitor, this endpoint requires a standard Buzz or Opinion monitor with Twitter content.\n  |\n|\n Twitter Followers\n  |\n Returns the cumulative daily follower count for a targeted Twitter account in a Twitter Social Account Monitor as of the selected dates.\n  |\n|\n Twitter Sent Posts\n  |\n Returns information about posts sent by the owner of a target Twitter account in a Twitter Social Account Monitor.\n  |\n|\n Twitter Total Engagement\n  |\n Returns information about retweets, replies, and @mentions (collectively, engagement) for a targeted Twitter account in a Twitter Social Account monitor.\n  |\n|\n Word Cloud\n  |\n Returns an alphabetized list of the top 300 words in a monitor. This data is generated using documents randomly selected from the pool defined by the submitted start, end, and filter parameters. The words included in the response are the 300 words most frequently used in the documents, excluding common stopwords. Note that we are counting the total number of times each word appears in the documents, not the number of posts in which each word appears.\n  |\n\n|\n|\n Monitor Name\n  |\n Select the name of the monitor you want to pull data for.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Use Local Time\n  |\n Select\n **True**\n to use the time local to the publishing author of a post instead of converting that time to the time zone of the selected monitor.\n  |\n|\n Report Daily Results\n  |\n Select\n **True**\n to have results aggregated by day of week instead of time of day.\n  |\n|\n Country Name\n  |\n Select the country you want to pull data for.\n  |\n|\n Daily\n  |\n Select\n **True**\n to have results aggregated daily instead of across the selected date range.\n  |\n|\n Team Name\n  |\n Select the team you want to pull data for.\n  |\n|\n Hide Excluded\n  |\n If you select\n **True**\n , categories set as hidden will not be included in category proportion calculations.\n  |\n|\n Geo Tagged\n  |\n Select\n **True**\n to return only geo-tagged documents.\n  |\n|\n Extended Limit\n  |\n Select\n **True**\n to increase the returned posts limit from 500 to 10,000.\n  |\n|\n Filter\n  |\n Enter a pipe-separated list of\n\nfield:value\n\npairs to filter results.\n\n\n For example:\n\n'site:\n\nblogspot.com\n\n,\n\nwordpress.com\n\n|keywords:android|geolocation:USA.NY.New York;GBR.Greater London.London'`\n |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nAfter selecting the report and monitor type, if you are not able to see the desired monitor, confirm the monitor type in your Crimson Hexagon account.\n\n\n FAQ\n-----\n\n\n#####\n Do I need a certain kind of account with the data service to set up the connector?\n\nNo. Any Crimson Hexagon account with access to collected data should be usable to set up this connector.\n\n####\n How often can the data be updated?\n\nDatasets should be set to update once a day.\n\n####\n Are there any API limits that I need to be aware of?\n\nThe Crimson Hexagon API limits each authenticated user to 120 requests per minute. Note that a single dataset run may make multiple requests to the API.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929234\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003531\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCrimson Hexagon Connector\n\n", "article_total_view_count": "\n\n\n 4,657\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "crimson_hexagon_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}