{"file_path": "../../raw_kb_v2\\article\\360056653654\\index.html", "content": {"title": "\n\n\n Get Back to Work Solution\n\n\n", "article_body": "\n\nIntro\n-------\n\nGetting back to work after the COVID-19 pandemic is easy with Domo's Get Back to Work Solution. Get Back to Work is an ecosystem of apps designed to help you safely reopen your workplace. Domo helps create a continuously safe work environment by allowing employees to self-screen using a contact checklist and report a safe or unsafe temperature check. Employers can manage hotspots in the office using contact tracing and all of this information flows through one central location, the Command Center.\n\n*Note:**\n This feature is available\n *on-demand and paid*\n .\n\nTo request this feature be enabled,\n\n Reach out to your Domo Customer Success Manager or Account Executive.\n* If you do not have contact information for your CSM or AE, contact Domo Support. For information on how to contact Support, please see:\n\nGetting Help\n\nCommand Center\n----------------\n\nThe Command Center is the main Dashboard in Domo that houses all of the Get Back to Work Apps for your company. There are nine modular apps that are available based on your company's needs:\n\n Temperature Scanning\n* Contact Tracing\n* Safe Worker\n* CEO View\n* Location Readiness\n* COVID-19\n* Facilities Management\n* Safety Training\n* Productivity\n\n*Centralize all your data and measurements.**\n\n\n Stay on top of key metrics as your team gets back to work, with a real-time summary of risk to business continuity, productivity, and insights to employee wellness.\n\n\n###\n Temperature Scanning\n\nAssess key health-related symptoms of employees and guests entering your facilities.\n\n\n**Monitor employee health.**\n\n\n Track employee health with at-home self-assessment and entrance checks through handheld touchless or automated thermometers at each entrance to your building to address in real-time any potential issues.\n\nThe Temperature Scanning App integrates with the\n\nSafe Worker App\n\nto complete the check-in process. There are two sections to the Temperature screening App:\n\n Employee\n* Guest\n\n###\n Employee\n\nThis is where you will scan the QR Code from the employee's Safe Worker app. This will show that they passed the questionnaire and you can proceed with taking their temperature.\n\n\n**Note:**\n When taking the employee's temperature, the employer will set what is the acceptable threshold (such as 100°F) you will then mark whether they are above or below that threshold, you will not record their actual temperature.\n\n\n If the temperature check is failed, an incident is automatically created. The employee will not be able to fill out the questionnaire on their app again until an Admin has marked the incident as resolved.\n\n###\n Guest\n\nIf you have visitors to your office, you can have them fill out the same questionnaire that the employees have in their app, or you can create custom questions. It will have them fill out the following information:\n\n First Name\n* Last Name\n* Email\n* Badge #\n\nOnce this information is collected, it will ask the questions determined by the employer. It will then have you enter whether their temperature is above or below the threshold set. For more information on the implementation of the app, see\n\nTemperature Scanning\n\n.\n\n##\n Contact Tracing\n\nAnalyze employee contact and re-trace interactions when health-related risks or exposures are detected.\n\n\n**Track potential exposures.**\n\n\n Prevent the spread of disease with technology to monitor your employees' contact with others and any potential exposures, then proactively notify people of exposures that might affect them. Our Contact Tracing app is what you will use to visualize and analyze the data points that are captured as your employees use the Safe Worker and Temperature Scanning apps. The Contact Tracing app allows you to accurately monitor and respond to incidents as they occur. For more detailed information on the app see\n\nContact Tracing\n\n.\n\n\n###\n Safe Worker\n\nEmpower business interactions, self-assessments of work readiness, and check-ins through a mobile app.\n\n\n**Keep employees informed.**\n\n\n Provide daily check-in procedures and surveys, ensure consistent and direct communication to employees via push notification, and create a hub for updates, potential exposures with an app right on the employee's phone.\n\n\n####\n Employer\n\nYou are able to configure the questions you would like your employees to answer before they come into the office. Example questions are:\n\n Have you experienced any of the following symptoms: difficulty breathing, fever, chills, shaking, muscles pain, headache, sore throat, loss of taste, or smell?\n* Is your temperature above 100°F?\n* Have you traveled out of the country within the last 21 days?\n\nDomo does not store what the employees' symptoms are or what their temperature is. If they answer yes to any of the questions, an incident is created in the app so that an Admin can follow up with the employee. The employee will not be able to fill out the questionnaire on their app again until an Admin has marked the incident as resolved.\n\n\n You can also send out a mass message to specific groups (such as your team) or to the company as a whole. This is a quick and easy way to alert everyone in case there is an incident at your office.\n\n###\n Employee\n\nThe Safe Worker app allows you to check-in and lets your employers know if you will be coming into the office that day. The following are the steps you will take inside the app:\n\n. Answer the symptom-related questions that have been determined by your employer.\n2. Answer if you plan to work today.\n3. Select where you will be working from (Office, Remote, or Other.)\n\n\n**Note:**\n You have the option to enable location sharing in the app. This is not turned on by default and must be selected by the employee. This feature is useful for companies that have remote workers (such as delivery drivers) as this allows you to see the possible interaction points they have outside of the office space.\n4. Enter in a check-in status.\n5. Show the QR Code (located in the bottom right-hand corner of the app) at your office to show you passed the questionnaire for the day. The QR Code has a timestamp and will expire 24 hours after the questionnaire is completed.\n\n\n###\n CEO View\n\nReview executive level metrics, provide the business' pulse, and measure the effectiveness of hybrid workplaces. The CEO View App is a powerful tool to help CEO's and other leaders get the real-time information they need to make critical decisions. The CEO View App consists of a beautifully formatted Dashboard of all the information that’s most important to them. It’s completely customizable in both content and layout to meet the needs of busy executives. For more information on the implementation of the app, see\n\nCEO View\n\n.\n\n\n###\n Location Readiness\n\nUnderstand COVID-19's impacts on specific regions and monitor key metrics for facility readiness by locale. Use the Location Readiness App to view COVID-19 related data for a County or State. By default, the application shows data related to the United States. By searching for a County or State, all of the sections (Summary, Testing, Social Distancing, and Projections) will return data for the specific County or State you’ve selected. For more information on the implementation of the app, see\n\nLocation Readiness\n\n.\n\n\n###\n COVID-19\n\nSee COVID-19 related trends and statistics from across the world that ensure you're informed and responsive.\n\n\n###\n Facilities Management\n\nKeep work-spaces safe with sanitation/sterilization protocols and response plans for detected exposures. For more information on the implementation of the app, see\n\nFacilities Management\n\n.\n\n\n###\n Safety Training\n\nTrain employees with protocols and behavioral requirements before they return to shared environments. The Safety Training App allows your company to stay on top of important app training that will help ensure best practices for going back to work and staying safe during times of uncertainty. It allows for quick module trainings and an easy way to view your team’s progress when it comes to staying up-to-date on important safety information. For more information on the implementation of the app, see\n\nSafety Training\n\n.\n\n\n###\n Productivity\n\nMonitor the efficiency and utilization of enablement systems to measure the effectiveness of hybrid location approaches. The Productivity App helps you to understand productivity trends in your business over time as well as how many of your employees are working in the office, working from home, and on PTO/quarantine. With the Productivity App, you can define productivity indicators and track them in real-time to see how your teams are doing. The system calculates your highest productivity over the last 90 days, then tells you your current percentage of attainment to that high. You can see participation in each activity, and even compare productivity estimates for when people are working in the office versus working at home. For more information on the implementation of the app, see\n\nProductivity\n\n.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360056653654\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004138\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGet Back to Work Solution\n\n", "article_total_view_count": "\n\n\n 2,422\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:24 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "get_back_to_work_solution", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}