{"file_path": "../../raw_kb_v2\\article\\360042931234\\index.html", "content": {"title": "\n\n\n YouTube Reporting Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nYouTube Reporting supports predefined and Jobs reports that contain a comprehensive set of YouTube Analytics data for a channel or content owner. Use Domo's Youtube Reporting Connector to download bulk data sets that you can query with the YouTube Analytics API. To learn more about the YouTube API, visit their page (\n\nhttps://developers.google.com/youtube/analytics/\n\n).\n\n*Note:**\n There are currently 5 YouTube Connectors available in Domo. The difference between these may be difficult to understand, so here is an explanation of each:\n\n\n* **YouTube Reporting Connector -**\n This is our entry-level YouTube Connector. It requires only a Google username and password to authenticate. Most Domo users should use this Connector to retrieve YouTube data.\n* **YouTube Reporting Enterprise Connector -**\n This is the enterprise version of the YouTube Reporting Connector. This report has a few additional reports and requires you to enter a Google Client ID and Client Secret in addition to a basic Google username and password.\n* **YouTube Enterprise Advanced Connector -**\n This is Domo's most advanced YouTube Connector. (This is the only version of the YouTube Enterprise Connector; there is no Connector simply called \"YouTube Enterprise.\") It requires a Google Client ID and Client Secret as well as a Google username and password. It provides more reports and options than the other YouTube Connectors but is also more complicated and much more difficult to configure. This Connector is recommended for advanced users only.\n* **YouTube Reporting Partition Connector**\n**-**\n This offers the same reports as the YouTube Reporting Connector, with the added ability to use Partitioning in the DataSet.\n* **YouTube Reporting Enterprise Partition Connector**\n**-**\n This offers the same reports as the YouTube Reporting Enterprise Connector, with the added ability to use Partitioning in the DataSet.\n\nYou connect to your YouTube Reporting account in the Data Center. This topic discusses the fields and menus that are specific to the YouTube Reporting Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n**Note:**\n When you create a report using this Connector, a job is created and takes 24 hours to return data.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Pulling all video metrics across channels, devices, location so you can understand how people are consuming video content on YouTube.\n  |\n|\n**Primary Metrics**\n | * Number of views\n* Watch minutes total\n* Number of red views\n* Red watch minutes total\n* Number of likes and dislikes\n* Number of comments\n* Number of shares\n* Number of clicks\n |\n|\n**Primary Company Roles**\n | * Content creators\n* Digital asset managers\n* Digital marketers\n* Content asset managers\n |\n|\n**Average Implementation Time**\n |\n If you pull just out-of-the-box, standard reports, you could have any report up and running within a couple of hours. If you need more than 180 days of history or if you want to pull in millions of rows, implementation could take up to 30 hours.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 5\n  |\n\nBest Practices\n----------------\n\n\n* In order to pull metrics for a channel, the owner of the provided credentials must be the owner of that channel.\n* If you are using Content Manager or are pulling metrics \"On behalf of the content owner,\" you should use the YouTube Reporting Enterprise Connector. This will allow you to pull metrics for channels that you are not the direct owner of. Additionally, YouTube can update metrics for any report for up to 30 days of that activity. It is recommended that you set up up the Connector to replace at least 35 days of history. To build history beyond 180 days, you must setup a recursive DataFlow to capture that information going forward. For more information, see\n\nCreating a Recursive/Snapshot Magic ETL DataFlow\n\n.\n* DataSets should run only ONCE within a 24-hour period because the data is updated only once a day.\n* When you first power up the Connector, you can choose to retrieve \"Predefined Reports.\" These reports can be used to get analytics data about the provided YouTube channel. Whenever a report is selected for the first time (meaning first dataset using this report), Domo creates a YouTube reporting job. All data before that day is considered \"historical data.\" YouTube only returns 30 days worth of historical data. For example, if the first \"Device and OS\" report dataset is created on August 31st, only data up to August 1st will be available. This historical data will typically be available in a couple days after the dataset's creation. Every day after, data from two days prior will be available. Using the previous example, this means August 31st's data will be available on September 2nd and September 1st's data will be available on September 3rd, and so forth. By the end of September this dataset will have 2 months worth of data (August's data and September's data). However, the historical data will only be available for 30 days. This means around October, the data from August would no longer be available from YouTube. In contrast, all the data after the dataset's creation (so August 31st and after) will be available for 60 days from YouTube\n\n.\n\nPrerequisites\n---------------\n\nTo connect to your YouTube account and create a DataSet, you must have a Google email address and password.\n\n\n Connecting to Your YouTube Reporting Account\n----------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the YouTube Reporting Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo YouTube Reporting Connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing YouTube Reporting accounts in Domo) to open the YouTube Reporting OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new YouTube Reporting DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of your Google account.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu from which you can select a Jobs report or predefined report. If you select a predefined report, various other menus may or may not appear depending on the configuration options you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the YouTube Reporting report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Jobs\n  |\n Returns a list of reporting jobs that have been scheduled for a channel or content owner.\n  |\n|\n Video and Channel Names\n  |\n Returns the names of all videos and channels for your account.\n  |\n|\n Predefined Report\n  |\n Returns a predefined report type.\n  |\n\n|\n|\n Call on Behalf of Content Owner\n  |\n Select\n **Yes**\n if you are planning to retrieve a predefined report for another user (whose ID you will enter in the\n **Content Owner ID**\n field). Select\n **No**\n if you are the content owner for the report you plan to pull.\n  |\n|\n Content Owner ID\n  |\n Enter the content owner ID for the user with content you want to pull. To find your content owner ID, you must be a member of an MCN (Multi-Channel Network). For more information, see\n\nhttps://support.google.com/youtube/answer/2737059?hl=en\n\n.\n\n\n To find your content owner ID, do the following:\n 1. Log into YouTube.\n2. Click your profile picture in the top right.\n3. Select\n **Studio**\n in the dropdown menu.\n4. Copy the portion of the page URL following\n\no=\n\n.\n\n\n For example, if the page URL was\n\nhttps://www.youtube.com/dashboard?o=abc123\\_qrs\\_654\n\n, the content owner ID would be\n\n\n abc123\\_qrs\\_654\n\n.\n\n|\n|\n Report Types\n  |\n Select the predefined report you want to run. The list of reports available to you is based on what you are authorized to see. For this reason, we do not offer a list of report descriptions for this Connector.\n  |\n|\n Retrieve Video and Channel Names\n  |\n Select\n **True**\n if you want your report to return video and channel names when IDs are present; otherwise select\n **False**\n .\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n YouTube only allows you to pull 30 days of history when setting up a specific report for the first time. When you first run a report, it may take 24-48 hours before data is available. Additionally, YouTube can update their metrics for any report for up to 30 days for historical data (data for days prior to using a specific report for the first time) and 60 days for non-historical data.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931234\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003336\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nYouTube Reporting Connector\n\n", "article_total_view_count": "\n\n\n 3,928\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "youtube_reporting_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}