{"file_path": "../../raw_kb_v2\\article\\360043038714\\index.html", "content": {"title": "\n\n\n Using Upsert in Workbench 5.1\n\n\n", "article_body": "\n\nIntro\n=======\n\nUsing upsert in Workbench allows you to identify a smaller subset of new or updated rows and push them to an existing Domo DataSet. Upsert is a type of SQL merge that can be used to dramatically increase the performance of data ingestion in certain use cases. To use this update method, you must have a key, either primary or composite, to uniquely identify each row of data. Additionally, there must be a method to identify the subset of rows to send to Domo, such as a where clause in an ODBC job. Once the subset of rows is identified, Domo will compare the key column(s) to determine if the row already exists in your DataSet and\n *update*\n those existing records. Rows that do not exist will be\n *appended*\n .\n\n\n Upsert typically works best when the DataSet is very large, the data is updating frequently, and the data contains a unique primary or composite key.\n **Any efficiency gained by using upsert is realized when instead of sending all rows, only the new or updated rows are sent.**\n Proper use of upsert can have significant positive impacts on performance and efficiency of your Workbench job as well as requiring fewer resources on your database or file storage system. Improper use can negatively impact performance and run time.\n\n\n How to Use Upsert\n===================\n\nTo use the upsert function in Workbench, you should already have an existing Workbench job and a healthy DataSet in Domo. For more information on how to create a Workbench job, see\n\nCreating a Job in Workbench 5.1\n\n.\n\n. Navigate to the\n **Configure**\n tab.\n2. Set the\n **Update Method**\n to\n **Append**\n .\n\n*Note:**\n If this is a NEW Workbench job, you must run the job for the first time on\n **Replace**\n to create the DataSet. After this first initial run, you can switch to\n **Append**\n .\n3. Click on the\n **Schema**\n tab and you will now see an\n **Upsert Key**\n column.\n4. Select the checkbox(es) for the corresponding columns that represent the primary or composite key.\n\n\n**Tip:**\n Date or datetime columns are not recommended for the Upsert Key as they are not always unique.\n\n\n In the following image, the `Transaction ID` is completely unique per transaction so that will be selected. Now, Workbench will always reference `Transaction ID` to see if a transaction id exists and update it or if it does not add that new row.\n\n\n**Note:**\n If you do not see Upsert Key after following these steps, contact Domo Support and provide the Domo DataSet ID to verify upsert is enabled. See\n\nContacting Technical Support\n\nfor more information.\n5. Next, navigate back to the\n **Configure**\n tab and click\n **edit**\n under processing to bring up your query.\n6. Add logic to ensure you're only pulling a smaller subset of data that could be new or updated.\n\n\n In this example, we know that our data could be updated within 7 days of the transaction, so we are pulling the last 7 days' worth of transactions to capture any updated rows as well as any new ones each day. This is only one simple example of many different ways to identify the \"change data\" or \"delta\".\n7. Click\n **Apply**\n .\n8. Run Preview to ensure the appropriate records are returned.\n9. (Optional) Job scheduling should be reviewed and adjusted accordingly.\n\nYour Workbench upsert job is now properly configured and will update or add new information based on the data returned by the query.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043038714\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004882\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUsing Upsert in Workbench 5.1\n\n", "article_total_view_count": "\n\n\n 5,320\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:34 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "using_upsert_in_workbench_51", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_51", "url": "/s/topic/0TO5w000000ZapUGAS"}]}