{"file_path": "../../raw_kb_v2\\article\\360042925114\\index.html", "content": {"title": "\n\n\n World Map\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn Domo, you can create a World Map that represents data for world nations. A World Map requires two data columns or rows from your DataSet: one containing country names or two-letter ISO codes (such as AU for Australia) and the other containing the values for each country. These values are represented in your map by varying colors, each corresponding to a specific range. Ranges are determined automatically based on the distribution of values in your data and are represented by a legend, which automatically appears beside the map. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n All nations and most territories are represented. For a list of countries and their corresponding ISO codes, see\n\nSupported Country Codes\n\n.\n\n*Note:**\n When multiple instances of a single region occur in a DataSet, the values for that region are summed to show a single value for the region in the map. For example, if your DataSet contained three rows for \"Georgia,\" the values for the rows would be summed, and the Georgia region in the map would show the total value. You\n *cannot*\n turn off this automatic aggregation in maps.\n\nFor information about Continental or Regional maps, see\n\nU.S. County Map/U.S. State Map\n\n.\n\n\n For troubleshooting information when an area in your map does not show data, but there is data, see\n\nTroubleshooting\n\n.\n\n*Video - Map Charts**\n\nPowering World Maps\n---------------------\n\nIn the Analyzer, you choose the columns containing the data for your map. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how data from a typical column-based spreadsheet is converted into a World Map:\n\nCustomizing World Maps\n------------------------\n\nYou can customize the appearance of a World Map by editing its\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of World Maps include the following:\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Theme > Theme\n  |\n Allows you to change the color theme for the map. For more information about setting colors, see\n\nChanging the Default Colors in Your Chart\n\n.\n  |\n —\n  |\n|\n General > Balanced Distribution\n  |\n Adjusts maps to include a balanced number of items within each range. This is helpful in spreading values across each range when your data contains extreme outliers.\n\n\n The pair of maps in the screenshots at right show how\n **Balanced Distribution**\n works. (These are country maps for Canada, not World maps, but the principle is the same.) In these maps, the values of most of the Canadian provinces are in the range of 100 to 1500. The outlier, Alberta, has a value of 10,000.\n **Balanced Distribution**\n has not been turned on in the top map, so a skewed version of the data is shown—Alberta appears dark and all of the other provinces appear light. In the bottom map, the user has turned on\n **Balanced Distribution**\n , so Alberta is grouped into the same range as the province with the next highest value.\n  |\n\n\n |\n|\n General > Auto Zoom to Data\n  |\n Zooms in on the region of your map with data. In the example at right, the only states with data are Utah, Arizona, Colorado, and New Mexico, so the map zooms on them automatically. This option will not work if all of the regions in your map with data are not adjacent. For example, if the map at right showed Oregon as having data, the auto-zoom would not work because Oregon is not adjacent to any of the other states with data.\n  |\n\n|\n|\n General> Hide No Data Items\n  |\n Hides all items in your map without data. In the example at right, the only states with data are Utah, Arizona, Colorado, and New Mexico, so the map hides all other states. Unlike the \"Auto Zoom to Data\" property, this will work even if there are regions not adjacent to other regions.\n  |\n\n|\n|\n General > Hide Abbreviated Legend\n  |\n Hides the legend shown at the bottom of maps in some views.\n  |\n —\n  |\n|\n General > Override Maximum Value\n  |\n Lets you specify the maximum value for a map or Heat Map.\n\n\n By default, Domo uses the highest value in the DataSet as the maximum value. However, by setting this property you can override this value.\n  |\n —\n  |\n|\n Hover Legend > Hide Legend\n  |\n Hides the legend that normally appears on the right side of a map in the Details view.\n  |\n —\n  |\n|\n Hover Legend > Hide Total\n  |\n Hides the \"Total\" section of the legend that appears on the right side of a map in the Details view. The example shows a map in which this has been done.\n  |\n\n|\n|\n Hover Legend > Hide Values\n  |\n Hides the value and percent of total value in the legend that appears on the right side of a map in the Details view. The example shows a map in which this has been done.\n  |\n\n|\n|\n Data Label Settings > Text\n  |\n Specifies text for the data labels. This property is the \"on switch\" for data labels—you must specify text for them to appear.\n  |\n —\n  |\n|\n Data Label Settings > Font Size\n  |\n Allows you to increase or decrease the data label font size. The \"Default\" font size falls between the largest and second-smallest font sizes. For more information, see\n\nChanging the Font Size in Your Chart\n\n.\n  |\n —\n  |\n|\n Data Label Settings > Text Color\n  |\n Lets you determine the text color for your map data labels. If you select \"Default,\" the color will be automatically determined based on the background color. This is shown in the example at right, in which the data labels on darker areas appear white and those on lighter areas appear dark red.\n  |\n\n|\n|\n Data Label Settings > Value Abbreviation\n  |\n Determines whether data label values are abbreviated (the default being 3 significant digits) or not.\n  |\n —\n  |\n|\n Data Label Settings > Fill\n  |\n Lets you add a colored fill to your map data labels. The example at right shows a chart in which a pale blue fill color with 60% transparency has been added.\n  |\n\n|\n|\n Data Label Settings > Fill Color\n  |\n Lets you specify the color for the fill in your map data labels. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Data Label Settings > Fill Transparency Percent\n  |\n Lets you specify the fill transparency for map data labels. You can specify any number between 0 and 100, in which 0 is completely opaque and 100 is completely transparent. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Hover Text > Hover Text\n  |\n Lets you set the text that appears in map hovers. A variety of macros for showing map values in your hovers is available. For more information and a list of available macros, see\n\nFormatting Data Label and Hover Text in Your Chart\n\n.\n  |\n —\n  |\n|\n Hover Text > Always Show Over Map\n  |\n Specifies whether hover text specified using the\n **Hover Text**\n option is turned on for your chart.\n  |\n —\n  |\n|\n Values > Label Format\n  |\n Determines the general number format for hover text and legend items in maps.\n  |\n —\n  |\n|\n Values > Decimal Places\n  |\n Determines the number of decimal places used in decimal values in hover text and legend items in maps.\n  |\n —\n  |\n|\n Values > Negative Numbers\n  |\n Determines the format for negative numbers in hover text and legend items in maps\n  |\n —\n  |\n|\n Cities > Cities\n  |\n Shows whether cities and city names are shown on the map. The closer a map is zoomed, the more cities are shown.\n\n\n The first example at right shows an \"unzoomed\" map of the United States. Note that only two cities are shown in Texas. In the second example, the map is zoomed to show only Texas, and many more cities are shown.\n  |\n\n\n |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042925114\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004914\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nWorld Map\n\n", "article_total_view_count": "\n\n\n 5,103\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/31/2022, 7:21 PM\n\n\n", "first_published_date": "\n\n\n 10/31/2022, 7:39 PM\n\n\n"}, "title": "world_map", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}