{"file_path": "../../raw_kb_v2\\article\\360048717414\\index.html", "content": {"Title": "Domo Snowflake Partner Connect", "Article Body": "Intro\n                       \n\n                        Domo is now available as part of Snowflake's Partner Connect Program.\n                       \n\n                        If you are an existing Snowflake customer, you can experience Domo by signing up for a free Domo trial account directly from Snowflake and securely live-query your Snowflake tables from Domo. Experience Domo's rich storytelling dashboards and mobile-first visualizations powered by your Snowflake data and make it actionable by utilizing alerts.\n                       \n\n                        You can find more information about Snowflake's Partner Connect Program,\n                        \n                         here\n                        \n                        .\n                       \n\n                        Creating a Domo Trial account from Snowflake Partner Connect\n                       \n\n\n\n                          Ensure you are logged into Snowflake as the Account Admin Role.\n                          \n\n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              The default role used when logging into the Snowflake website is a sys admin role.\n                             \n\n\n\n\n\n\n\n                          Click on\n                          \n                           partner connect\n                          \n                          in the header.\n                         \n\n\n\n                          Find and select the Domo tile.\n                         \n\n\n\n                          Review the objects that will be created in your Snowflake account to properly configure your connection. Click\n                          \n                           Connect\n                          \n                          .\n                         \n\n\n\n                          Go through the wizard steps and enter your full name and email address to set up your Domo Trial account.\n                         \n\n\n\n                          Create a password for your Domo Trial account.\n                         \n\n\n\n                          Upon a successful password creation and activation, you will be logged into the newly created Domo account. Sample data from your Snowflake account will be connected.\n                         \n\n\n\n                        FAQs\n                       \n\n                        What are the limitations of a Domo Free trial account created via Snowflake Partner Connect?\n                       \n\n                        Free trial accounts created via Snowflake Partner Connect are similar in nature to regular Domo 30-day free trial instances with one addition. Domo trial accounts created from Snowflake Partner Connect have the Snowflake writeback connector enabled which allows users to write data back to their Snowflake data warehouse if needed.\n                       \n\n                        Why am I unable to create a Domo Trial account from Snowflake Partner Connect?\n                       \n\n\n\n                          Domo does not support new account sign-ups from personal email addresses (e.g.\n                          \n                           '@gmail.com\n                          \n                          ' or\n                          \n                           '@yahoo.com'\n                          \n                          ). If your Snowflake account is owned by a personal email address, you will be unable to complete the sign-up process. Please contact Domo Support to create a Trial account tied to your business email.\n                          \n                          For more information on contacting Support, see\n                          \n                           Getting Help\n                          \n                          .\n                         \n\n\n\n                          Domo blocks email accounts of certain domains from creating Free Trial Domo accounts as mandated by Domo's Terms and Conditions.\n                         \n\n\n\n                          If you have previously set up a Free Trial account from a specified Snowflake account, you will not be able to create a new Domo Trial account.\n                         \n\n\n\n                          If the Snowflake account is also present as a user in Domo, the user will be prompted to connect to Snowflake via their existing Domo account.\n                         \n\n\n\n                        Am I only restricted to Snowflake Sample data in the newly created Domo account?\n                       \n\n                        No, the connection to Snowflake data is made for illustrative purposes only. Using Domo's federated connection, you can set up a new live query to your non-sample data.\n                       \n\n                        See\n                        \n                         Domo Federated Query\n                        \n                        for more information.", "Preview Article": "Click here to preview", "URL Name": "360048717414", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003151", "Archived Date": "", "Language": "English", "Primary Version": "Domo Snowflake Partner Connect", "Article Total View Count": "4,702", "": "", "Article Created Date": "10/24/2022, 9:10 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Domo Snowflake Partner Connect\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}