{"file_path": "../../raw_kb_v2\\article\\360042926434\\index.html", "content": {"title": "\n\n\n AppNexus Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAppNexus is a global technology company whose cloud-based software platform enables and optimizes programmatic online advertising. To learn more about the AppNexus API, visit their page (\n\nhttps://wiki.appnexus.com/display/documentation/APIs\n\n).\n\n\n The AppNexus API will get you access to the reporting API for the Ad Delivery and Campaign Management environment. From here you'll be able to get reporting on your campaigns by a number of dimensions and metrics. Virtually any metric or dimension available by the AppNexus Web Console will be allowed via the API.\n\n\n You connect to your AppNexus account in the Data Center. This topic discusses the fields and menus that are specific to the AppNexus connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is helpful for monitoring campaign ad impressions and clicks.\n  |\n|\n**Primary Metrics**\n | * Impressions\n* Clicks\n* CTR\n* CPM\n |\n|\n**Primary Company Roles**\n | * Data specialists\n* Analysts\n |\n|\n**Average Implementation Time**\n | * Credentials - 15 minutes or less (unless AppNexus hasn't permissioned your username for API calls).\n* Configuring the connector - 5 minutes for pre-configured reports. 60 minutes for each custom report.\n* Most runs of the connector will run in less than an hour.\n |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 5\n  |\n\nBest Practices\n----------------\n\n\n* The AppNexus API may limit your API calls for fields and metrics that don't \"play nicely\" together. For example, Device API calls don't work well with Network Analytics reporting.\n* This connector is easy to use if you can find what you need in the pre-configured reports. If you must use the Custom Reporting and JSON text box, you should have a good knowledge of JSON API calls. It is suggested you use the console to ensure the metrics you are attempting to select in JSON work well together.\n* If you intend to append the report each day, it is suggested you just pull yesterday's data and schedule the report to run daily.\n\nPrerequisites\n---------------\n\nTo connect to your AppNexus account and create a DataSet, you must have the username and password you use to log into the\n\nAppNexus Console\n\n. You'll need to ensure that your credentials are properly permissioned by AppNexus. They may make you take an API quiz in order to submit calls with your credentials.\n\n\n Connecting to Your AppNexus Account\n-------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the AppNexus Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your AppNexus account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into the AppNexus Console.\n  |\n|\n Password\n  |\n Enter the password you use to log into the AppNexus Console.\n  |\n\n\n Once you have entered valid AppNexus credentials, you can use the same account any time you go to create a new AppNexus DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the AppNexus report you want to run.  You have access to 5 preconfigured reports: \"Advertisers,\" \"Campaigns,\" \"Line Items,\" \"Members,\" and \"Pixels.\" If the fields provided in these 5 preconfigured reports are not all you need, you can use the \"Custom\" report type and provide your own JSON API call in the text box.\n\n\n The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Advertisers\n  |\n Retrieves data about advertisers in the account.\n  |\n|\n Campaigns\n  |\n Retrieves data about campaigns controlled by the account.\n  |\n|\n Custom Report\n  |\n Returns a custom report, which you query using JSON.\n  |\n|\n Line Items\n  |\n Retrieves data about line items tracked by the account.\n  |\n|\n Members\n  |\n Retrieves data about members of the AppNexus account.\n  |\n|\n Pixels\n  |\n Retrieves data about conversion pixels managed by the account.\n  |\n\n|\n|\n Start Days\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **End Days**\n to create a range of represented days. For example, if you entered\n\n10\n\nfor\n **Start Days**\n and\n\n5\n\nfor\n **End Days**\n , the report would contain data for 10 days ago up until 5 days ago. Use 0 for today.\n\n\n |\n|\n End Days\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Start Days**\n to create a range of represented days. For example, if you entered\n\n10\n\nfor\n **Start Days**\n and\n\n5\n\nfor\n **End Days**\n , the report would contain data for 10 days ago up until 5 days ago. Use 0 for today.\n  |\n|\n Interval\n  |\n Select the interval for which certain statistics columns will be calculated. This does not affect which items will be displayed in the report.\n  |\n|\n Report JSON\n  |\n Enter the JSON query for your custom report. For more information about JSON, see the\n\nAppNexus documentation\n\n.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nEnsure you have API access for the credentials you supply.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042926434\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003799\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAppNexus Connector\n\n", "article_total_view_count": "\n\n\n 2,370\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "appnexus_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}