{"file_path": "../../raw_kb_v2\\article\\360043431253\\index.html", "content": {"title": "\n\n\n Google Ads via Google BigQuery Service Connector\n\n\n", "article_body": "\n\n\n****Important****\n****:****\n Due to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. To create new Google AdWords via Google BigQuery DataSets, use this connector. All pre-existing AdWords via BigQuery DataSets will continue to run normally.\n\nIntro\n-------\n\nGoogle Ads (formerly Google AdWords) is an online advertising service. Use Domo's Google Ads via BigQuery Service connector to transfer and pull data from a specific project into Domo. To successfully configure this connector, you must first configure a Google BigQuery script within your Google Ads account. The steps for doing this are provided later in this article.\n\n\n For more information about the Google Ads API, see\n\nhttps://developers.google.com/adword...s/guides/start\n\n.\n\n\n This topic discusses the fields and menus that are specific to the Google Ads via Google BigQuery Service connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to a BigQuery service account, you must have a Google BigQuery service account JSON key. To generate a key, do the following:\n\n. In the GCP Console, open the\n **IAM & Admin**\n page.\n2. Click\n ****Service accounts****\n in the left-hand navigation pane.\n3. Select your project and click\n ****Open****\n .\n4. Click\n ****Create Service Account****\n .\n5. Enter a name and description for the service account.\n6. Click\n ****Create****\n .\n\n*Note:**\n You may need the “BigQuery Admin” role in the service account permissions dialog. Please consult with your Google administrator for additional guidance.\n7. Select\n ****Project Owner****\n .\n8. Click\n ****Continue****\n .\n9. Click\n ****Create key****\n .\n10. Select\n ****JSON****\n as the key type.\n11. Click\n ****Create****\n .\n\nA private key will be saved to your computer.\n\n\n Connecting to Google Ads via Google BigQuery\n----------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Ads via Google BigQuery Service Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to Google Ads via BigQuery. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Service Account Key JSON\n  |\n Copy and paste the JSON for your BigQuery service account key. For information about creating a key, see \"Prerequisites,\" above.\n  |\n\nOnce you have entered a valid key, you can use the same account any time you go to create a new Google Ads via BigQuery Service DataSet. You can manage connector accounts in the\n ****Accounts****\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a number of fields and menus you can use to configure your report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Project ID\n  |\n Enter the name of the specific project you want to add your DataSet to. You can find this in your Google Cloud Console in the project info.\n  |\n|\n DataSet ID\n  |\n Enter a name for your DataSet. You can choose any name you want.\n  |\n|\n Report\n  |\n Select the AdWords report type to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account Performance\n  |\n Returns all statistics aggregated by default at the account level.\n  |\n|\n Ad Customizers Feed Item\n  |\n Provides statistics for feed items used in Ad Customizers. Statistics are aggregated at the feed item level.\n  |\n|\n Ad Performance\n  |\n Returns all statistics aggregated at the ad level.\n  |\n|\n Ad Group Performance\n  |\n Returns all statistics aggregated by default at the ad group level.\n  |\n|\n Age Range Performance\n  |\n Returns all Display Network and YouTube Network statistics aggregated by age range.\n  |\n|\n Audience Performance\n  |\n Returns performance data from interests and remarketing lists for Display Network and YouTube Network ads, and remarketing lists for search ads (RLSA), aggregated at the audience level.\n  |\n|\n Automatic Placements Performance\n  |\n Returns all statistics aggregated at the placement level.\n  |\n|\n Bid Goal Performance\n  |\n Returns statistics for your portfolio bid strategies.\n  |\n|\n Budget Performance\n  |\n Returns all statistics aggregated by default at the budget level.\n  |\n|\n Call Metrics Call Details\n  |\n Returns data for call tracking of call-only ads or call extensions.\n  |\n|\n Campaign Ad Schedule Target\n  |\n Summarizes the performance of campaigns by AdSchedule criteria.\n  |\n|\n Campaign Criteria\n  |\n Returns campaign-level criteria.\n  |\n|\n Campaign Group Performance\n  |\n Returns the overall performance statistics of campaigns that you have included in campaign groups.\n  |\n|\n Campaign Location Target\n  |\n Summarizes the performance of campaigns by location-based campaign criteria.\n  |\n|\n Campaign Negative Keywords Performance\n  |\n Retrieves attributes of keyword-based NegativeCampaignCriterion objects.\n  |\n|\n Campaign Negative Placements Performance\n  |\n Retrieves attributes of placement-based NegativeCampaignCriterion objects.\n  |\n|\n Campaign Negative Locations\n  |\n Retrieves attributes of location-based NegativeCampaignCriterion objects.\n  |\n|\n Campaign Performance\n  |\n Returns all statistics aggregated by default at the campaign level.\n  |\n|\n Campaign Shared Set\n  |\n Returns all relationships between SharedSet objects and campaigns.\n  |\n|\n Click Performance\n  |\n Returns all stats aggregated at each click level.\n  |\n|\n Creative Conversion\n  |\n Returns statistics on free clicks.\n  |\n|\n Criteria Performance\n  |\n Returns all statistics aggregated at the ad group criteria level.\n  |\n|\n Destination URL\n  |\n Returns all statistics aggregated at the destination URL level.\n  |\n|\n Display Keyword Performance\n  |\n Returns all Display Network and YouTube Network statistics aggregated at the keyword level.\n  |\n|\n Display Topics Performance\n  |\n Returns all Display Network and YouTube Network statistics aggregated at the topic level.\n  |\n|\n Final URL\n  |\n Returns all statistics aggregated at the final URL level.\n  |\n|\n Gender Performance\n  |\n Returns all statistics aggregated by gender along with automatic audience performance.\n  |\n|\n Geo Performance\n  |\n Returns all statistics aggregated at the country/territory level, one row per country/territory.\n  |\n|\n Keywordless Category\n  |\n Returns keywordless ads (dynamic search ads) statistics aggregated by category.\n  |\n|\n Keywordless Query\n  |\n Returns keywordless ads (dynamic search ads) statistics based on search terms.\n  |\n|\n Keywords Performance\n  |\n Returns all statistics aggregated at the keyword level.\n  |\n|\n Label\n  |\n Lists all labels for your account.\n  |\n|\n Landing Page\n  |\n Returns all statistics aggregated by default by the UnexpandedFinalUrlString.\n  |\n|\n Marketplace Performance\n  |\n Returns all statistics of ads displayed on the Marketplace, aggregated by default at the account level.\n  |\n|\n Paid Organic Query\n  |\n Returns a holistic view of your search stats across ads and organic listings at the query level.\n  |\n|\n Parental Status Performance\n  |\n Returns statistics aggregated at the parental status level.\n  |\n|\n Placeholder\n  |\n Returns statistics for feed-based ad extensions.\n  |\n|\n Placeholder Feed Item\n  |\n Returns all statistics at the feed-item level.\n  |\n|\n Placement Performance\n  |\n Returns all statistics aggregated at the placement level.\n  |\n|\n Product Partition\n  |\n Returns shopping campaign statistics aggregated at the product partition (ID field) level.\n  |\n|\n Search Query Performance\n  |\n Returns all statistics aggregated at the search terms level.\n  |\n|\n Shared Set\n  |\n Returns all SharedSet objects that can be shareable across campaigns.\n  |\n|\n Shared Set Criteria\n  |\n Returns criteria for each Shared Set.\n  |\n|\n Shopping Performance\n  |\n Returns shopping campaign statistics aggregated at the product (OfferId field) level.\n  |\n|\n Top Content Performance\n  |\n Returns statistics for top content bid modifier criteria.\n  |\n|\n URL Performance\n  |\n Returns all statistics aggregated at the URL and criterion level.\n  |\n|\n User Ad Distance\n  |\n Returns statistics aggregated by the user's distance from your location extensions.\n  |\n|\n Video Performance\n  |\n Returns statistics for your account's upgraded AdWords for Video campaigns.\n  |\n\n|\n|\n Date Range\n  |\n Select the date range for the data in your report.\n  |\n|\n Fields\n  |\n Check the boxes for all fields you want to import into your report.\n  |\n|\n Segments\n  |\n Check the boxes for all segments you want to import into your report.\n  |\n\nOnce you have entered data into all of the fields and selected options from the menus, your Google Ads script will appear automatically in the\n **Query preview**\n pane. Copy this script and paste it into Google Ads as explained in the next section.\n\n\n Configuring a BigQuery Script in Google Ads\n---------------------------------------------\n\nThis section explains how to configure a BigQuery script in Google Ads. After you have configured the script, you should be able to use the BigQuery Service connector to pull in data just as you would any other connector.\n\n\n**To configure a BigQuery script in Google Ads,**\n\n. Configure your connector settings as explaned above.\n2. Copy the script from the\n **Query Preview**\n pane.\n3. Sign into your account in Google Ads.\n4. Click the wrench icon in the top right corner of the screen.\n5. Click\n **Scripts**\n (which is found under \"Bulk Actions\").\n6. Click the plus button to create a new script.\n7. Name the script, then click\n **Authorize**\n .\n8. Select\n **Advanced APIs**\n .\n9. Check the\n **Bigquery**\n box.\n10. Paste the script you copied in step 4 into the textbox.\n11. Click\n **Preview**\n .\n12. (Conditional) If any error messages appear after you preview, follow their instructions.\n\n\n For example, you may be prompted to click on another link to authorize BigQuery or reauthorize.\n13. Click\n **Run**\n when your configuration is successful.\n\n\n Google Ads now takes you back to the main page, where you are prompted to set up how often a script runs.\n14. Click the pencil icon under \"Frequency,\" then set the schedule for your script.\n15. Return to the Google Ads via Google BigQuery Service connector page in Domo and continue configuring the connector.\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nIf the data doesn't seem to be updating, make sure your Google Ads script runs before the connector runs. Otherwise, the same data will be pulled again.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431253\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003773\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Ads via Google BigQuery Service Connector\n\n", "article_total_view_count": "\n\n\n 4,739\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_ads_via_google_bigquery_service_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}