{"file_path": "../../raw_kb_v2\\article\\360042931854\\index.html", "content": {"title": "\n\n\n Snowflake Using Key Pair Authentication Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSnowflake is data warehouse software that makes it easy to bring together all your data and make it available to all of the users and systems that need to analyze it. You can use Domo's Snowflake Using Key Pair Authentication connector to retrieve data from a specified warehouse, database, and database schema by inputting an SQL query. For more information about the Snowflake API, go to\n\nhttps://docs.snowflake.net/manuals\n\n.\n\n\n This version of the Snowflake connector is essentially the same as the standard\n\nSnowflake connector\n\nexcept that it supports using key pair authentication rather than the typical username/password authentication. This authentication method requires a 2048-bit (minimum) RSA key pair. You can generate the public-private key pair using OpenSSL. Steps for generating the key pair are provided below. The public key is assigned to the Snowflake user who will use the Snowflake client.\n\n\n The Snowflake Using Key Pair Authentication connector is a \"Database\" connector, meaning it retrieves data from a database using a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n **Database**\n in the toolbar at the top of the window.\n\n\n This topic discusses the fields and menus that are specific to the Snowflake Using Key Pair Authentication connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to a Snowflake database and create a DataSet, you must have the following:\n\n The full name of your account (provided by Snowflake). This is the portion of your Snowflake URL immediately following\n\nhttps://\n\n.\n\n\n Note that your full account name may include additional segments that identify the region and cloud platform where your account is hosted. The following table provides account name examples by cloud platform/region. For each row, it assumes your account name is \"xy12345.\"\n* The username used to connect to your Snowflake host\n* Your Snowflake private key\n* The passphrase used to encrypt the private key file, if you created an encrypted key\n\n\n###\n Configuring the public/private key pair\n\nTo configure the public/private key pair, follow these steps:\n\n. From the command line in a terminal window, generate a private key.\n\n\n You can generate either an encrypted version of the private key or an unencrypted version of the private key.\n\n\n\t* To generate an unencrypted version, use the following command:\n\n\n\t`$ openssl genrsa -out rsa_key.pem 2048`\n\t* To generate an encrypted version, use the following command:\n\n\n\t`$ openssl genrsa 2048 | openssl pkcs8 -topk8 -inform PEM -out rsa_key.p8`\n\n\n\t It is typically safer to generate an encrypted version.\n\n\n\t If you use the second command to encrypt the private key, then OpenSSL prompts for a passphrase used to encrypt the private key file. We recommend using a strong passphrase to protect the private key. Record this passphrase in a secure location. You will input it when connecting to Snowflake. Note that the passphrase is only used for protecting the private key and will never be sent to Snowflake.\n\n\n\t The following is a sample PEM private key:\n\n\n\t`-----BEGIN ENCRYPTED PRIVATE KEY-----\n\n\n\t MIIE6TAbBgkqhkiG9w0BBQMwDgQILYPyCppzOwECAggABIIEyLiGSpeeGSe3xHP1\n\n\n\t wHLjfCYycUPennlX2bd8yX8xOxGSGfvB+99+PmSlex0FmY9ov1J8H1H9Y3lMWXbL\n\n\n\t ...\n\n\n\t -----END ENCRYPTED PRIVATE KEY-----`\n2. From the command line, generate the public key by referencing the private key. Assuming the private key is encrypted and contained in the file named “rsa\\_key.p8”, use the following command:\n\n\n`$ openssl rsa -in rsa_key.p8 -pubout -out rsa_key.pub`\n\n\n The following is a sample PEM public key:\n\n\n`-----BEGIN PUBLIC KEY-----\n\n\n MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAy+Fw2qv4Roud3l6tjPH4\n\n\n zxybHjmZ5rhtCz9jppCV8UTWvEXxa88IGRIHbJ/PwKW/mR8LXdfI7l/9vCMXX4mk\n\n\n ...\n\n\n -----END PUBLIC KEY-----`\n3. Copy the public and private key files to a local directory for storage. Record the path to the files. Note that the private key is stored using the PKCS#8 (Public Key Cryptography Standards) format and is encrypted using the passphrase you specified in the previous step; however, the file should still be protected from unauthorized access using the file permission mechanism provided by your operating system. It is your responsibility to secure the file when it is not being used.\n4. Assign the public key to the Snowflake user using\n\nALTER USER\n\n. For example:\n\n\n`alter user jsmith set rsa_public_key='MIIBIjANBgkqh...';`\n\n*Notes:**\n\n* Only security administrators (i.e. users with the SECURITYADMIN role) or higher can alter a user.\n\t* Exclude the public key header and footer in the SQL statement.\n5. Verify the user’s public key fingerprint using DESCRIBE USER:\n\n\n Property\n  |\n Value\n  |\n Default\n  |\n Description\n  |\n| --- | --- | --- | --- |\n|\n Name\n  |\n JSMITH\n  |\n null\n  |\n Name\n  |\n|\n RSA\\_PUBLIC\\_KEY\\_FP\n  |\n SHA256:nvnONUsfiuycCLMXIEWG4eTp4FjhVUZQUQbNpbSHXiA=\n  |\n null\n  |\n Fingerprint of user's RSA public key.\n  |\n|\n RSA\\_PUBLIC\\_KEY\\_2\\_FP\n  |\n null\n  |\n null\n  |\n Fingerprint of user's second RSA public key.\n  |\n\n\n**Note:**\n For more information about the RSA\\_PUBLIC\\_KEY\\_2\\_FP property, see\n\nKey Rotation\n\n.\n6. Modify and execute the sample code, below. The code decrypts the private key file and passes it to the Snowflake driver to create a connection:\n\t* Update the security parameters:\n\t\t+ <path> specifies the local path to the private key file you created.\n\t* Update the session parameters:\n\t\t+ <user> specifies your Snowflake login name.\n\t\t+ <account> specifies the name of your account (provided by Snowflake).\n\t* The sample code is as follows:\n\n`import java.util.Properties;\n\n\n\t import java.sql.Connection;\n\n\n\t import java.sql.Statement;\n\n\n\t import java.sql.ResultSet;\n\n\n\t import java.sql.DriverManager;\n\n\n\t import java.io.File;\n\n\n\t import java.io.FileInputStream;\n\n\n\t import java.io.DataInputStream;\n\n\n\t import java.util.Base64;\n\n\n\t import java.security.spec.PKCS8EncodedKeySpec;\n\n\n\t import java.security.KeyFactory;\n\n\n\t import java.security.PrivateKey;\n\n\n\t import javax.crypto.EncryptedPrivateKeyInfo;\n\n\n\t import javax.crypto.SecretKeyFactory;\n\n\n\t import javax.crypto.spec.PBEKeySpec;`\n\n\n\t`public class TestJdbc\n\n\n\t {\n\n\n\t public static void main(String[] args)\n\n\n\t throws Exception\n\n\n\t {\n\n\n\t File f = new File(\"<path>/rsa_key.p8\");\n\n\n\t FileInputStream fis = new FileInputStream(f);\n\n\n\t DataInputStream dis = new DataInputStream(fis);\n\n\n\t byte[] keyBytes = new byte[(int) f.length()];\n\n\n\t dis.readFully(keyBytes);\n\n\n\t dis.close();`\n\n\n\t`String encrypted = new String(keyBytes);\n\n\n\t String passphrase = System.getenv(\"PRIVATE_KEY_PASSPHRASE\");\n\n\n\t encrypted = encrypted.replace(\"-----BEGIN ENCRYPTED PRIVATE KEY-----\", \"\");\n\n\n\t encrypted = encrypted.replace(\"-----END ENCRYPTED PRIVATE KEY-----\", \"\");\n\n\n\t EncryptedPrivateKeyInfo pkInfo = new EncryptedPrivateKeyInfo(Base64.getMimeDecoder().decode(encrypted));\n\n\n\t PBEKeySpec keySpec = new PBEKeySpec(passphrase.toCharArray());\n\n\n\t SecretKeyFactory pbeKeyFactory = SecretKeyFactory.getInstance(pkInfo.getAlgName());\n\n\n\t PKCS8EncodedKeySpec encodedKeySpec = pkInfo.getKeySpec(pbeKeyFactory.generateSecret(keySpec));\n\n\n\t KeyFactory keyFactory = KeyFactory.getInstance(\"RSA\");\n\n\n\t PrivateKey encryptedPrivateKey = keyFactory.generatePrivate(encodedKeySpec);`\n\n\n\t`String url = \"jdbc:snowflake://<account>.\n\n snowflakecomputing.com\n\n \";\n\n\n\t Properties prop = new Properties();\n\n\n\t prop.put(\"user\", \"<user>\");\n\n\n\t prop.put(\"account\", \"<account>\");\n\n\n\t prop.put(\"privateKey\", encryptedPrivateKey);`\n\n\n\t`Connection conn = DriverManager.getConnection(url, prop);\n\n\n\t Statement stat = conn.createStatement();\n\n\n\t ResultSet res = stat.executeQuery(\"select 1\");\n\n\n\t res.next();\n\n\n\t System.out.println(res.getString(1));\n\n\n\t conn.close();\n\n\n\t }\n\n\n\t }`\n\n\n####\n Key Rotation\n\nSnowflake supports multiple active keys to allow for uninterrupted rotation. Rotate and replace your public and private keys based on the expiration schedule you follow internally.\n\n\n Currently, you can use the RSA\\_PUBLIC\\_KEY and RSA\\_PUBLIC\\_KEY\\_2 parameters for ALTER USER to associate up to 2 public keys with a single user.\n\n\n To rotate your keys,\n\n. Complete the steps in Using Key Pair Authentication to...\n\n\n\t* Generate a new private and public key set.\n\t* Assign the public key to the user. Set the public key value to either\n\n RSA\\_PUBLIC\\_KEY\n\n or\n\n RSA\\_PUBLIC\\_KEY\\_2\n\n (whichever key value is not currently in use).\n\n\n\t For example:\n\n\n\t`alter user jsmith set rsa_public_key_2='JERUEHtcve...';`\n2. Update the code to connect to Snowflake. Specify the new private key.\n\n\n Snowflake verifies the correct active public key for authentication based on the private key submitted with your connection information.\n3. Remove the old public key from the user profile. For example:\n\n\n`alter user jsmith unset rsa_public_key;`\n\nConnecting to your Snowflake account\n--------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Snowflake Using Key Pair Authentication Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Snowflake account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Account Name\n  |\n Enter the account name for your Snowflake account. For information about finding your account name, see\n\nPrerequisites\n\n.\n  |\n|\n Username\n  |\n Enter the username associated with your Snowflake account.\n  |\n|\n Private Key\n  |\n Enter your private key. For more information about generating your private key, see\n\nConfiguring the public/private key pair\n\n.\n  |\n|\n Passphrase\n  |\n Enter the passphrase used to encrypt the private key file, if you created an encrypted key.\n  |\n|\n Role\n  |\n Enter your user role.\n  |\n\nAfter you have entered valid Snowflake credentials, you can use the same account in Domo any time you create a Snowflake Using Key Pair Authentication DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a number of fields and menus for entering your SQL query and specifying the location of the data you want to retrieve.\n\n\n Parameter\n  |\n Description\n  |\n| --- | --- |\n|\n Query\n  |\n Enter the SQL query to use to retrieve your data. You can use the\n **Query Helper**\n parameter to help you write a usable SQL query. To use the\n **Query Helper**\n , do the following:\n 1. Select your desired warehouse, database, database schema, database table, and table columns in each menu.\n2. Copy the SQL statement that appears in the\n **Query Helper**\n field.\n3. Paste the copied SQL statement into the\n **Query**\n field.\n |\n|\n Warehouses\n  |\n Select the warehouse containing the data you want to retrieve. The list populates with all of the warehouses you have access to based on your credentials.\n  |\n|\n Databases\n  |\n Select the database containing the data you want to retrieve. The list populates with all of the databases you have access to based on your credentials.\n  |\n|\n Database Schema\n  |\n Select the database schema containing the data you want to retrieve. The list populates with all of the schemas you have access to based on your credentials.\n  |\n|\n Database Tables (Optional)\n  |\n Select the database table you want to retrieve. The list populates with all of the tables you have access to based on your credentials. If you do not select a database table, the connector retrieves your entire database schema.\n  |\n|\n Table Columns (Optional)\n  |\n Select the table columns you want to retrieve. The list populates with all of the columns you have access to based on your credentials. If you do not select a table column, the connector retrieves your entire selected database table.\n  |\n|\n Query Helper (Optional)\n  |\n When you select warehouses, databases, schemas, tables, etc. from the above menus, a usable SQL query is built for you in this field. Copy and paste the SQL statement in this field into the\n **Query**\n field. For more information, see\n **Query**\n , above.\n  |\n|\n Fetch Size (Optional)\n  |\n Enter a fetch size for memory performance. If this field is left blank, the default value of 1000 will be used. If the DataSet throws an \"Out of memory\" error, try decreasing the fetch size.\n  |\n|\n Convert Null Values to empty string\n  |\n Selecting this would change all the null values from the source table in Snowflake to empty strings in Domo\n  |\n|\n Convert Timezone\n  |\n Selecting a timezone here tells the connector about the timezone of the source data. The connector converts the Timestamp values from the selected timezone to UTC using this information.\n  |\n\n\n###\n\nOther Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n Are there any API limits I should be aware of?\n\nThis depends on your server configuration.\n\n####\n How frequently will my data update?\n\nAs often as needed.\n\n####\n What should I be aware of while writing a query?\n\nMake sure that all the words, table names, and field names are correctly spelled. Refer to the Query Helper field for query help.\n\n####\n Why can't I connect to my Snowflake database? Do I need to whitelist any IP addresses?\n\nBefore you can connect to a Snowflake database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses for Connectors\n\n.\n\n####\n Is this a Production-level connector?\n\nThis connector is designed for small/medium DataSets and proof of concept work for large DataSets.\n\n####\n Why are the lists of warehouses, databases, schemas, etc. not populating correctly?\n\nYou only see content that that you have access to based on the user role entered for your account in Snowflake. If you aren’t seeing something you are expecting, make sure that role has access to that warehouse, database, table. etc.\n\n\n If you do not enter a role in Snowflake, the SYSADMIN role is used by default.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931854\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003872\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSnowflake Using Key Pair Authentication Connector\n\n", "article_total_view_count": "\n\n\n 5,781\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "snowflake_using_key_pair_authentication_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}