{"file_path": "../../raw_kb_v2\\article\\360057087393\\index.html", "content": {"Title": "Creating a Recursive/Snapshot DataFlow in Magic ETL", "Article Body": "Intro\n                       \n\n                        A \"recursive\" or \"snapshot\" DataFlow is a DataFlow that uses itself as an input.\n                       \n\n                        DataFlows (both SQL and Magic ETL) cannot append data natively like Connectors. However, if you need to create a DataFlow that appends data, you can do so by running it once and then using the output as part of the input for the next run. By doing this, every time the DataFlow runs, it includes the data from before and also appends the new data onto itself.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           There are significant behavioral differences in Magic ETL. Read the\n                           \n\n                             Behavior Changes and Feature Updates in Magic ETL\n                            \n\n                           article before converting mission-critical Magic ETL DataFlows.\n                           \n                            Failure to do so may cause an unintended change to your DataFlow’s behavior.\n                           \n\n\n\n\n\n\n                         Video - What is a Recursive DataFlow?\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            If a recursive DataFlow is edited incorrectly, you could lose ALL historical data. To avoid this any time you are editing, create an additional DataSet that is a copy of your historical DataSet. This DataSet will remain static. If anything happens to your historical DataSet, you will have a backup from before you began editing.\n                           \n\n\n\n\n\n                        To create a recursive DataFlow in Magic ETL:\n                       \n\n\n                         Create and run a Magic ETL DataFlow.\n                         \n\n\n\n\n\n                         Once the DataFlow has finished running, load the output DataSet as an input DataSet.\n                         \n                         The Output tile will show the output DataSet name followed by \"1.\"\n                         \n\n\n\n\n                         You should now have two DataSets in the DataFlow—the updating original DataSet and the historical DataSet.\n                         \n                         You now need to find a column to use as a constraint. This helps determine when to replace data in your historical DataSet with new data. Constraint columns are normally ID columns or date columns or have other unique identifiers. In this example, we use the `Date` column as a constraint.\n                         \n\n\n                         Use\n                         \n                          Select Columns\n                         \n                         to select only the constraint column.\n                         \n\n\n\n\n\n                         Use\n                         \n                          Remove Duplicates\n                         \n                         to return a unique list of constraints.\n                         \n\n\n\n\n\n                         Use an Outer Join to combine your new data to the historical DataSet. If you selected the historical DataSet on the left side of the join, as shown below, use a\n                         \n                          Left Outer\n                         \n                         Join. If you select the historical DataSet on the right side of the join, use a\n                         \n                          Right Outer\n                         \n                         Join. (Do not select\n                         \n                          Inner Join\n                         \n                         , as this could result in a loss of data.) If the date columns are named the same you will notice a warning in Step 3. If you are doing a Left Outer Join then you can auto-fix the right table, and if you are doing a Right Outer Join you can auto-fix the left table. This will add the conflicting column to the Alterations section and will allow you to rename the column if you would like to keep it or drop it altogether. In this situation, we will rename it to “Delete if not null” for our next step.\n                         \n\n\n\n\n\n\n\n\n                         Filter any rows from your DataSet where the new date column is not null.\n                         \n                         This returns only rows from the historical DataSet that do not exist in the new updating DataSet. You can do this by adding a Filter Rule or by adding a Formula Rule as shown in the examples below.\n                         \n\n\n\n\n\n                          Add Filter Rule:\n                         \n\n\n\n\n\n\n                          Add Formula Rule:\n                         \n\n\n\n\n\n\n                         Use\n                         \n                          Select Columns\n                         \n                         to remove the extra date column.\n                         \n\n\n\n\n\n                         Use\n                         \n                          Append\n                         \n                         to join the historical DataSet and new updating DataSet. If all steps have been done correctly, both DataSets will show \"No changes.\"\n                         \n                         Make sure not to forget to choose how you would like the data to be handled if the data types don't match between columns that should be combined. For more information about this option you can find it here under the \"Append Rows (Union)\" section:\n                         \n                          Behavior Changes and Feature Updates in Magic ETL\n                         \n                         .\n                         \n\n\n\n\n\n                         Connect the\n                         \n                          Append\n                         \n                         tile to your output. Once complete, your ETL should look like the following:\n                         \n\n\n\n\n\n                        Troubleshooting/FAQ\n                       \n\n                        See\n                        \n                         Top 5 issues Users Experience with DataFlows\n                        \n                        to see common issues and errors seen when building DataFlows.", "Preview Article": "Click here to preview", "URL Name": "360057087393", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004573", "Archived Date": "", "Language": "English", "Primary Version": "Creating a Recursive/Snapshot DataFlow in Magic ETL", "Article Total View Count": "7,288", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Creating a Recursive/Snapshot DataFlow in Magic ETL\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}