{"file_path": "../../raw_kb_v2\\article\\360062526733\\index.html", "content": {"title": "\n\n\n Salesforce Pardot to Salesforce Pardot SSO Connector Migration\n\n\n", "article_body": "\n\nIntro\n-------\n\nBeginning on February 15, 2021, Pardot’s user authentication system will be discontinued and all users will be required to use Salesforce Single Sign-On (SSO). The users who are not enabled with Salesforce SSO by February 15, 2021 will lose the ability to log into Pardot until they are connected to a Salesforce user. This only impacts the way users authenticate to Pardot.\n\n\n Domo users with Pardot DataSets need to migrate to the Salesforce Pardot SSO Connector because Salesforce is going to force them to use SSO.\n\n\n####\n*What is happening?*\n\nSalesforce will require Salesforce Single Sign-On to access Pardot beginning on February 15, 2021. See\n\nPardot User Migration Overview\n\nfor more information.\n\n###\n*What is the impact of this change?*\n\n\n* Beginning on February 15, 2021, you will need to use Domo’s Salesforce Pardot Connector with Single Sign-On Support (com.domo.connector.pardot.oauth) to create new DataSets for Pardot.\n* Current DataSets using Domo’s Salesforce Pardot Connector (com.domo.connector.pardot) will need to be migrated to the Single Sign-On version by February 15, 2021 to prevent disruptions of service.\n\n\n####\n*What do I need to do?*\n\nIf you no longer need your Pardot DataSets, then no action is required on your part.\n\n\n If you are using the non-SSO version of the Salesforce Pardot Connector (com.domo.connector.pardot) and need to keep using your Pardot DataSets, you will need to do the following:\n\n Contact Domo Support to request your DataSets to be migrated. Please include the DataSet ids of the DataSets. Domo Support will contact you once the DataSets are completely migrated.\n* Create a Pardot OAuth Account. You can create this account at any time.\n* Once the DataSets are migrated and you have created your Pardot OAuth Account, associate the new Account with your migrated DataSets.\n* Run your DataSets.\n\n\n####\n*Will there be an outage of my Pardot DataSets during the migration?*\n\nYour Pardot DataSets will not run between the time they are migrated to the new Connector version, and the time you associate them with the new OAuth Account.\n\n###\n*What happens if I don’t migrate my DataSets by February 15, 2021?*\n\nIf you do not migrate your DataSets by February 15, 2021, your DataSets will continue to run until Salesforce’s hard cutover in June. However, Salesforce will be implementing rolling outage windows from February 2021 until the hard cutover. See\n\nPardot User Migration Overview\n\nfor more information.\n\n###\n*What should I do if I run into issues?*\n\nPlease contact Domo Support if you have any questions, or if you have issues with your migrated DataSets.\n\n###\n*How do I create a Salesforce Pardot OAuth Account?*\n\nCreating a Salesforce Pardot OAuth account\n *:*\n\n\n 1. In the Data Center, click on the\n **Accounts**\n icon in the left-hand pane.\n\n2. The Accounts section will appear.\n\n\n 3. Click\n **Add Account**\n .\n\n4. Select the\n **Salesforce Pardot OAuth Account.**\n\n5. The Log in window for Salesforce Pardot will appear. Enter your business unit and concurrency unit. Click\n **Connect**\n .\n\n6. You will then be prompted to enter your Salesforce username and password in a separate OAuth window.\n\n7. Enter your Salesforce credentials, and click\n **Login**\n to finish creating the Account.\n\n###\n*How do I associate the new Account with my DataSets?*\n\nAssociating the new OAuth account with Pardot DataSets:\n\n\n 1. In the Data Center, click on the\n **DataSets**\n icon in the left-hand pane.\n\n2. Locate your existing DataSet that you want to associate with a new Salesforce Pardot OAuth account.\n\n\n 3. The DataSet details will appear.\n\n\n 4. Under\n **Settings**\n , look for the\n **Credentials**\n . You will now be able to select the Salesforce Pardot OAuth Account that you have previously created.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360062526733\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003254\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSalesforce Pardot to Salesforce Pardot SSO Connector Migration\n\n", "article_total_view_count": "\n\n\n 2,377\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "salesforce_pardot_to_salesforce_pardot_sso_connector_migration", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}