{"file_path": "../../raw_kb_v2\\article\\360043434973\\index.html", "content": {"title": "\n\n\n JIRA Rest API Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nJIRA helps teams get organized and work together to build incredible products, but product teams are just one part of your organization. With Domo, you can combine data from multiple sources into a single platform--pulling data from product development, marketing, sales, operations, and finance for a real-time, holistic view of your business. Once your data is in Domo, you can get stunning, dynamic JIRA visualizations with real-time data, on any device.\n\n\n Domo's JIRA connector allows you to connect to your JIRA account to extract data from JIRA. You can import data including issue tracking, completed tickets per team, ticket resolution time, and project management metrics, using either custom or predefined queries. To learn more about the JIRA API, see\n\nhttps://developer.atlassian.com/jira...e-query-issues\n\n.\n\n\n The JIRA Rest API Connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your JIRA account in the Data Center. This topic discusses the fields and menus that are specific to the JIRA connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n | * Tracking progress and movement of tickets\n* Number of tickets assigned to specific users or groups\n* Seeing if too many tickets of a certain type are open (bugs)\n |\n|\n**Primary Metrics**\n | * Bug / issue / ticket tracking (by age, type, status, submitter)\n* Completed tickets per team\n* Ticket resolution time\n* Project management metrics (tracking individual tasks of a larger project or epic).\n |\n|\n**Primary Company Roles**\n |\n Product managers\n  |\n|\n**Average Implementation Time**\n |\n This can vary wildly depending on the implementation and the user's level of knowledge of their JIRA system.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 7\n  |\n\nBest Practices\n----------------\n\n\n* You should usually use \"Replace\" with the JIRA connector, as \"Append\" does not work well.\n* If the query is for data across a long time period, scheduling should be kept to a minimum (once a day). For shorter queries, more frequent updates are appropriate.\n\nPrerequisites\n---------------\n\nTo connect to your JIRA account and create a DataSet, you must have the following:\n\n The username and password/API key you use to log into JIRA. The\n\nJira cloud users must use an API Key. You can create one here:\n\nhttp://id.atlassian.com\n* The URL for your company's JIRA instance\n* The JQL query you will use to pull data (if you are building a custom report)\n\nCredentials are received upon account creation. A JIRA Admin is likely to have created username and passwords for most users in your company if you use an on-premise JIRA implementation.\n\n##\n SSO\n\nSingle Sign-On (SSO) credentials will NOT work. However, you can work around SSO limitations by doing the following:\n\n. Have your JIRA administrator create a local account with a username and password specifically for API use.\n2. Create an API key at\n\nhttp://id.atlassian.com/\n\n.\n3. On the JIRA connector page in Domo, enter the API key you created instead of the password. (Depending on the account, you may need to enter your username or JIRA account email address as the username.)\n\nConnecting to Your JIRA Instance\n----------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the JIRA Rest PAI Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your JIRA instance. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into your JIRA instance.\n  |\n|\n Password\n  |\n Enter the password you use to log into your JIRA instance. The\n\nJira Cloud users must use an API Key. You can create one here:\n\nhttp://id.atlassian.com\n\n\n |\n|\n Server URL\n  |\n\nEnter the URL for your JIRA instance (for example,\n\nonjira.mycompany.com\n\n).\n\n|\n\nOnce you have entered valid JIRA credentials, you can use the same account any time you go to create a new JIRA Rest API DataSet. You can manage connector accounts in the\n\nAccounts\n\ntab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\n\n This pane contains a primary\n\n*Reports**\n\nmenu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the\n\n\n report you want to run. The following reports are available:\n\n\n|\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Issue Query\n  |\n Allows the user to query issues using JQL (JIRA Query Language).\n  |\n|\n Boards\n  |\n Returns a list of scrum boards.\n  |\n|\n Board Sprints\n  |\n Returns a list of sprints for the selected board.\n  |\n|\n Sprint Issues\n  |\n Returns issues for the selected sprints.\n  |\n|\n Fields\n  |\n Returns a list of fields used in the user's JIRA account.\n  |\n|\n Group Members\n  |\n Returns a list of users that belong to the specified group. You must have admin access to run this report.\n  |\n|\n Projects\n  |\n Returns a list of all projects the user has access to.\n  |\n|\n Project Versions\n  |\n Returns a list of all versions of the specified project.\n  |\n\n|\n|\n JQL Query\n  |\n\nEnter a JQL query to pull custom data.\n\n\n Jira Documentation\n\n.\n\n\n|\n Description\n  |\n Query Examples\n  |\n| --- | --- |\n|\n All issues created at the start of the month, 3 months ago.\n  |\n created >= STARTOFMONTH(-3)\n  |\n|\n All issues created at the start of the day, 10 days ago.\n  |\n created >= STARTOFDAY(-10)\n  |\n|\n All issues updated since a specific date.\n  |\n updated >= '2020-01-01'\n  |\n|\n All issues assigned to me.\n  |\n assignee = currentUser()\n  |\n|\n All issues for project 'Some Project' that are closed\n  |\n project = 'Some Project'\n\nand status = closed\n  |\n|\n All issues reported by a specific user\n  |\n reporter = '\n\nuser.name\n\n'\n  |\n\n|\n|\n Data Option\n  |\n\n\n Data Option\n  |\n Description\n  |\n| --- | --- |\n|\n Comments Report\n  |\n Returns JIRA tickets with their related comments.\n  |\n|\n Changelog Report\n  |\n Returns changelogs per issue applicable to the query. The Changelog report is only available to Jira Cloud users.\n  |\n|\n Labels Report\n  |\n Returns labels for issues applicable to the query.\n  |\n|\n Linked Issues Report\n  |\n Returns linked issues for issues applicable to the query.\n  |\n|\n Sprint Report\n  |\n Returns details of sprints for issues applicable to the query.\n  |\n|\n Standard Ticket Report\n  |\n Returns columns for nearly every parameter for JIRA tickets, such as issue summary and description, creation date, resolution date, impacted customer name, environment, etc.\n  |\n|\n Ticket History Report\n  |\n Returns historical information about tickets.\n  |\n|\n Worklog Report\n  |\n Returns worklogs per issue applicable to the query.\n  |\n\n|\n|\n Filter Type\n  |\n Select to include or exclude specific fields from the returned dataset.\n  |\n|\n Flatten All Fields\n  |\n Select which fields you want to see expanded in data.\n  |\n|\n Reset Schema\n  |\n Select this checkbox to include only columns that are imported in the current execution.\n\nThis option only works for the\n **Replace**\n update method.\n  |\n|\n Group Name\n  |\n Enter the group that contains the users you wish to retrieve. This report requires an Administrator account.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n FAQs\n\n\n####\n When should I use this connector?\n\nThe JIRA REST API connector allows you to connect to a JIRA server instance and bring your JIRA data into Domo. This connector requires a local username and password.\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |  |\n Endpoint URL(s)\n  |\n| --- | --- | --- |\n|\n Agile API:\n  |\n Agile Boards\n  |\n /rest/agile/1.0/board\n  |\n|\n Board Sprints\n  |\n /rest/agile/1.0/board/{boardId}/sprint\n  |\n|\n Sprint Issues\n  |\n /rest/agile/1.0/board/{boardId}/sprint/{SprintId}/issue\n  |\n|\n Fields\n  |  |\n /rest/api/2/field\n  |\n|\n Group Members\n  |  |\n /rest/api/2/group/member\n  |\n|\n Issue Query\n  |  |\n /rest/api/2/search\n  |\n|\n Projects\n  |  |\n /rest/api/2/project\n  |\n|\n Project Versions\n  |  |\n /rest/api/2/project/{projectId}/versions\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the username, password, and server URL for your Jira instance.\n\n###\n Domo is reporting that my Jira credentials are invalid. What am I doing wrong?\n\nPossible reasons for this error include:\n\n Your Jira server has not had API access enabled. Contact your Jira administrator to ensure that API access is turned on.\n* You're using your email address instead of your actual Jira username. In many cases, these may be the same; however, it's not uncommon for \"\n\nuser.name@company.com\n\n\" to be your email while \"\n\nuser.name\n\n\" is your actual username.\n\n\n####\n Can I use my SSO account to login?\n\nSSO implementations are not supported in Jira. However you can work around these limitations.\n\n Jira Server – Your Jira administrator can create a local account with a user name and password specifically for API use.\n* Jira Cloud – You can create an API key at\n\nATLASSIAN\n\n. On the connectors page, enter the API key you’ve created instead of the password.\n\n\n Note: Depending on your account, you may need to enter your username or your Jira account email address as the username.\n\n\n####\n How frequently will my data update?\n\nData from Jira's servers is usually made available to the API immediately.\n\n###\n How do I know if my query is right?\n\nJira's platform provides a handy tool to verify if your query is valid. An easy way to access this tool is simply to do a search in Jira's search bar. Once on the search screen, you will see a green check box next to the query string for your search to indicate that it is valid. Otherwise you will see a red X. You can switch back to the basic search functionality to build a query from the available selectors, and then switch again to advanced to see the resulting query.\n\n###\n I keep running into connection errors (gateway timeout, bad gateway, connection timed out, connection reset, etc...). How do I fix that?\n\nThe most common cause of connection errors is that your Jira server has too much load to handle your requests. Contact your Jira administrator to see about allocating more resources to your Jira server.\n\n###\n Can this connector pull custom fields?\n\nBecause Jira returns so much data, the connector enables you to specify fields either as inclusive or exclusive. If you choose inclusive, only the fields you specify will be returned. If you choose exclusive, all fields will be returned except for those that you specify.\n\n\n**Note**\n : Field ids must be entered. If the field names are entered, then they will be ignored.\n\n###\n How can I pull the data from boards?\n\nSelect the report type as\n **Agile API**\n and the agile report as\n **Agile Boards**\n to get the list of all agile boards you have access to.\n\n###\n Can I use OAuth on this connector?\n\nIf you wish to use OAuth on Jira instances, use the Jira Cloud connector. Jira Cloud connector supports OAuth2 authentication. You can authenticate to the Jira Cloud connector with the same credentials you use to log into your Jira account online.\n\n\n Troubleshooting\n-----------------\n\n\n* Jira requires a fair amount of configuration from the side of the JIRA admin to ensure that API access is enabled. Common issues include setting the timeouts too short or not providing sufficient resources to the JIRA server.\n* If users have trouble understanding how to format JQL, the easiest thing is to log into the JIRA front end. Via the search bar, JIRA provides a tool that can construct a JQL query with preset filters. After constructing your query, if you hit the\n **Advanced**\n button, JIRA presents you with your selections in JQL format.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043434973\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003416\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nJIRA Rest API Connector\n\n", "article_total_view_count": "\n\n\n 5,212\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "jira_rest_api_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}