{"file_path": "../../raw_kb_v2\\article\\000005048\\index.html", "content": {"title": "\n\n\n Flex Map v2 User Guide\n\n\n", "article_body": "\n\nIntro\n-------\n\nFlex Map v2 is a premium app available in the Appstore. Its main purpose is to display your data in different ways on a map to gain geographical and relational insights from the data. The app can map out various sets of locations and related data for those locations, create and display geographical territories to show the boundaries inside which mapped locations lie, and display heat maps to correlate locations with important metrics or demographics.\n\n\n Before you begin using the app, make sure you have completed all the required configurations. Learn about these in the\n\nFlex Map v2 Implementation Guide\n\n.\n\n*Important:**\n Flex Map v2 is not the same as Flex Map v1. Learn about how to use that app in the\n\nFlex Map v1 User Guide\n\n.\n\nThis guide provides information for using Flex Map v2 in the following topics:\n * App navigation\n* Pin Layers\n* Map Layers\n* Favorites\n* Saved Maps\n* Heatmaps\n* Map Settings\n* Data Settings\n* User permissions and features\n* Interacting with the map\n* Demo notes\n\nApp Navigation\n------------------\n\nMap controls display on the right side of the screen.\n\n\n The table below describes each of the map controls.\n\n\n|\n Icon\n  |\n Tool Description\n  |\n| --- | --- |\n|\n\n|\n**Zoom in**\n /\n **out —**\n Allows you to adjust the zoom level for the map.\n  |\n|\n\n|\n**Reset bearing to north —**\n Resets the map's orientation to display north at the top.\n  |\n|\n\n|\n**Undo**\n /\n **Redo —**\n Unmakes or remakes a change to the map.\n  |\n|\n\n|\n**Export —**\n Enables you to export your map as an image, PowerPoint file, or PDF.\n  |\n|\n\n|\n**Return to default —**\n Returns the map to its default settings.\n  |\n|\n\n|\n**Clear Map —**\n Clears the map of all layers.\n  |\n|\n\n|\n**Save Map —**\n Saves the current map configuration.\n  |\n\n\n At the top of the screen are the main menu and the search bar.\n\n\n You can access most of the app's features from the main menu, by opening the hamburger menu. Each feature is described later in this guide.\n\n\n* After you open the main menu, you can\n\n*Close**\n it to return to the default screen.\n* After you open any feature, you can\n\n*Expand**\n or\n\n*Collapse**\n the feature interface or\n\n*Close**\n it to return to the default screen.\n* Use the search bar to find locations from your connected data and display them temporarily on the map so you can favorite them. Learn more about\n\nFavorites\n\nbelow.\n\nPin Layers\n--------------\n\nIn the main menu, select\n **Pin Layers**\n to open the search interface.\n\nHere, you can create Layers, a subset of the locations data connected to the app.\n\n\n The following table describes the tools in the\n **Pin Layers**\n menu:\n\n\n|\n Icon\n  |\n Tool Description\n  |\n| --- | --- |\n|\n\n|\n**Group —**\n Creates a new group.\n  |\n|\n\n|\n**Item —**\n Creates a new item.\n  |\n|\n\n|\n**Clone —**\n Copies the currently selected Pin Layer. The copied layer displays at the bottom of the Pin Layer list, with the name formatted as\n *Name of*\n*Pin Layer*\n - copy.\n  |\n|\n\n|\n**List —**\n Shows the list of individual locations that are currently being displayed.\n  |\n\n\n###\n Creating a Pin Layer\n\n\n1. Select\n\n*Item**\n to create a new Pin Layer.\n\n\n The\n **New Pin Layers**\n**Search**\n interface displays.\n2. Select the list and choose a column from your data to begin filtering down the connected locations data to a subset of the data you want to display on the map. If your data is not connected, complete the necessary configuration by following the steps in the\n\nFlex Map v2 Implementation Guide\n\n.\n3. Below the selected column, select whether to include locations that are\n **In**\n or\n **Not In**\n the values you select from the column.\n4. (Optional) To apply more filtering criteria, select\n **Item**\n again to add another Pin Layer to the current layers.\n\t* First, select whether the Pin Layer has an\n\t **And**\n\t or an\n\t **Or**\n\t filter.\n\n An\n\t *And*\n\t filter combines current Pin Layers with previous Pin Layers so that only locations that meet all\n\t *And*\n\t criteria display.\n\n\n\t Using an\n\t *Or*\n\t filter adds all locations that match that filter along with any other filters that are set.\n\t* Next, choose the category of additional Layer:\n\t **Parent Id**\n\t ,\n\t **Latitude**\n\t ,\n\t **Longitude**\n\t ,\n\t **Location Name**\n\t , or\n\t **City**\n\t .\n Two more options,\n **Channel Type**\n and\n **Channel Group**\n , only display if more than one Pin Layer is pinned.\n\nYou can\n\n*Delete**\n any Pin Layer to remove that filter.\n5. Select\n **List**\n to view the results based on the search criteria.\n6. (Optional) Select the star icon next to any result to add it to the\n **Favorites**\n section of the app.\n7. After adding all of your filters, note the three buttons added to the\n **Pin Layers**\n menu:\n **Select Icon**\n ,\n **Select Color**\n , and\n **Save**\n .\n\n\n####\n Adding Icons and Colors\n\nYou can choose to display specific locations or landmarks on the map with the icon selection palette. You can only use one icon per Pin Layer. If you want to add another icon, create a new Pin Layer.\n\n. Choose\n **Select Icon**\n in the\n **Pin Layers**\n menu.\n\n\n The icon palette opens.\n2. Select an icon to add to the Pin Layer.\n3. (Optional) Go to the\n **Size**\n tab of the palette to adjust the size of the icon.\n\n\n You can also choose to make an icon static or dynamic. If the icon is dynamic, the size changes with the zoom level of the map.\n\nThe icon displays on the map. If it doesn't display, adjust the zoom level.\n4. In the\n **Pin Layers**\n menu, choose\n **Select Color**\n to choose the display color for your search.\n5. Select\n **Save**\n in the\n **Pin Layers**\n menu to save your search.\n\n\n The\n **Save Pin Layers Search**\n modal displays.\n6. Enter a\n **Name**\n and choose a\n **Folder**\n or\n **Group**\n to save the search in or create one.\n7. Select\n **Save**\n .\n\nYou can now access your search in a list of created searches and groups under the\n\n*Group**\n icon in the\n **Pin Layers**\n menu. You can also access all saved items from the\n **Saved Maps**\n section of the main menu.\n\n##\n Groups and Items\n\nIn Flex Map v2, groups are folders that hold and organize items you create.\n\n\n When you select\n\n*Group**\n in the\n **Pin Layers**\n menu, you create a folder that displays in the groups list. You can then name and open the group and drag any items into the group. You can also nest folders by dragging a group into another group.\n\n\n After you save an Item or search inside a folder or group, you can interact with it.\n\n\n Select\n\n*View**\n /\n **Hide**\n on a search to toggle it on or off. When a search is on, the locations of the search display on the map.\n\nRemove an item or group by selecting\n\n*Delete**\n .\n\n*Important:**\n If you delete a group, all items inside the group, including nested items, are also deleted.\n\nYou can edit an Item or search at any time in\n **Pin Layers**\n .\n\n*Note:**\n App admins see an additional option for items and groups: the\n **Share**\n button. Admins can share items and groups with other app users. Learn more about admin functionality under\n\nUser Permissions and Features\n\n.\n\nMap Layers\n--------------\n\nMap Layers in the Flex Map v2 app are data driven from values stored in KML or GeoJSON, so interaction with them is more limited than other items in the app. The purpose of Map Layers is to display constantly updated lines or shapes on the map with their associated metrics, which are read directly from the uploaded layer file. For example, you may want to display shipping routes and their attributes from an outside system.\n\n\n To begin, the data for layers must be correctly prepared. Learn how to do that in the\n\nFlex Map v2 Implementation Guide\n\n.\n\n##\n Creating a Map Layer\n\n\n1. In the main menu, select\n **Map Layers**\n .\n2. Select\n\n*Item**\n .\n\n\n The new Layers interface displays.\n3. In the\n **Map Layers**\n menu, there are three icons on the left side:\n\n*Circle**\n ,\n\n*Polygon**\n , and\n\n*Polyline**\n .\n\nWhen you select\n\n*Circle**\n , you can create a colored circle on the map with the area and radius provided. Adjust the size of the circle by clicking and dragging the orange dots on the perimeter of the circle. You can also click and drag the entire shape. Change the color of the circle by using the\n **Select Color**\n icon. If you want to start over, select\n\n*Circle**\n again to delete it.\n\nThe second of the three icons is\n\n*Polygon**\n and allows you to create a shape with numerous sides. To use the tool, select\n\n*Polygon**\n and choose a point on the map where you want the shape to begin. Keep adding points to the map until you achieve the shape you want. To finish the shape, select the last orange dot that you placed. You can move the entire shape by clicking inside it and dragging. To adjust the shape, click and drag the orange dots. To change the color, use the\n **Select Color**\n icon. To delete the shape, select\n\n*Polygon**\n again.\n\nThe last icon is\n\n*Polyline**\n , which allows you to determine the total distance traveled along a path. You can create this path by clicking on the map, which leaves a trail of orange dots for every marker you place. When you are done, select the last orange marker you placed; the total distance of the polyline displays. To start over, select\n\n*Polyline**\n again.\n\nFavorites\n-------------\n\n*Favorites**\n is where you can find any locations favorited in the app, allowing you to quickly find important locations when you return to the app. You can add locations to\n **Favorites**\n in a few ways.\n\n\n If you enter a term in the main search bar of the app, a list of matching locations returns. You can then select the star icon next to a location to favorite it.\n\n\n You can also favorite currently displayed locations in the\n **List**\n screen of the\n **Pin Layers**\n section.\n\n\n When viewing\n **Favorites**\n , you can create Groups and add favorited items to them, like you can for searches and Heatmaps. You can remove locations from\n **Favorites**\n by selecting\n\n*Delete**\n for the location.\n\n\n Select\n\n*View**\n /\n **Hide**\n to toggle a favorited location on and off.\n\nAdmin users can share favorited locations here by selecting\n **Share**\n for the location.\n\n\n Saved Maps\n--------------\n\nAny user can save the current configuration of territories and searches at any time by selecting\n\n*Save Map**\n in the map controls. When you save a map, you are prompted to enter a name for it.\n\n\n You can see all of the maps by going to\n **Saved Maps**\n in the main menu. Here, you can add saved maps to Groups or delete them like other items in the app.\n\n\n Admin users can also share saved maps by selecting\n **Share**\n on a saved map.\n\nHeatmaps\n------------\n\nYou can find\n **Heatmaps**\n in the main menu. Follow the steps below to create a new Heatmap.\n\n*Note:**\n Heatmaps only take effect after you save them.\n\n\n1. Select\n **Create a New Heatmap**\n .\n2. Select a\n **Heatmap Layer**\n .\n3. Select a\n **Heatmap Metric**\n .\n4. Under\n **Color Range**\n , select\n\n*Edit Range**\n .\n\t* Select the colored rectangle to choose and apply a color to a certain range.\n\n\n\t Manually input the numerals for the range.\n\n\n\t Remove any range by selecting\n\t **Delete**\n\t .\n\t* Above the ranges, you can\n\n**Reset to default**\n\t ,\n\n**Clear all**\n\t , and\n\n**Add new**\n\t .\n\t* Make sure to select\n\t **Apply Range**\n\t to save your changes.\n5. To activate the Heatmap, select\n **Save**\n .\n\nYou can then name your Heatmap and save it to a new or existing folder or Group.\n\n\n Select\n\n*View**\n /\n **Hide**\n to display the new Heatmap on the map.\n\n\n Depending on the column you choose for the Heatmap, the map legend displays different numerical ranges.\n\n*Note:**\n Only one Heatmap can display at a time, unlike searches where many can display at one time.\n\nMap Settings\n------------------\n\n*Map Settings**\n is the final option in the main menu.\n\n\n If you are a card owner or app admin, you can determine certain map behaviors rendering options, including rendering Pin Layers in standard cluster mode or allowing all pins to render individually on the map. You also have access to new Map Layers in the\n **Base Layer**\n menu.\n\nData Settings\n-----------------\n\n\n**Note:**\n This section is only visible on the main menu for card owners and app admins.\n\nIf you are a card owner or app admin, you have total control over the data that is available to the map for locations and Heatmap metrics.\n\n\n From the main menu, select\n **Data Settings**\n to view two options:\n\n The\n **Search and Display Preferences**\n allow you to customize what is shown on your map.\n* **Heatmap Metric Mapping**\n allows you to define metrics for your Heatmap Layers and associate them with a color scale on the map.\n\n##\n Search and Display Preferences\n\nWhen you select\n **Search and Display Preferences**\n , the settings grid displays. There are three sections in the settings:\n **Schema**\n ,\n **Display Order**\n , and\n **Tooltip Order**\n .\n\nIn the\n **Schema**\n section, you can configure what you see in and on the map from your core Locations DataSet. The Schema settings have five editable elements:\n\n **SearchInclude**\n is the list of fields that you want to be available in the\n **Pin Layers**\n search builder. Check the boxes for the fields you want to include.\n* **Static Label**\n allows you to choose one field to display directly under the Pin on the map.\n* **DisplayInclude**\n displays the chosen fields on the detail view of a selected Pin.\n* **TooltipInclude**\n allows you to include the selected fields' value in the tooltip when you hover over a Pin on the map.\n* **DisplayType**\n lets you tell Flex Map what type of data is in the field so it can handle special exceptions like links and images.\n\nAfter you update any setting, select\n\n*Expand**\n and then\n **Save & Close**\n to return to the app where your updates are live.\n\n\n In the\n **Display Order**\n section, you can configure the order of your display fields by dragging and dropping them.\n\n\n Make sure to\n **Save & Close**\n .\n\nIn the\n **Tooltip Order**\n section, you can also drag and drop the fields into the order that you want.\n\n\n Make sure to\n **Save & Close\n **.****\n\n\n###\n Heatmap Metric Mapping\n\nThe\n **Heatmap Metric Mapping**\n settings allow you to define and choose the metric fields you want to allow the app user to build off in the\n **Heatmaps**\n section of Flex Map v2.\n **Heatmap Metric Mapping**\n has the same three sections as\n **Search and Display Preferences**\n :\n **Schema**\n ,\n **Display Order**\n , and\n **Tooltip Order**\n .\n\nIn the\n **Schema**\n section, you can configure what you see in and on the map from your Heatmaps DataSet. The\n **Schema**\n settings have five editable elements:\n\n **Use as Metric**\n is the list of fields that you want to use as metrics in\n **Heatmaps**\n . Check the boxes for the fields you want to include.\n* **DisplayInclude**\n displays the chosen fields on the detail view of a selected Pin.\n* **TooltipInclude**\n allows you to include the selected fields' value in the tooltip when you hover over a Pin on the map.\n* **Label**\n allows you to rename your metrics fields for better picklist selections in the builder.\n* **Aggregation**\n allows you to select the aggregation method.\n\nAfter you update any setting, select\n\n*Expand**\n and then\n **Save & Close**\n to return to the app where your updates are live.\n\n\n In the\n **Display Order**\n section, you can configure the order of your display fields by dragging and dropping them.\n\n\n Make sure to\n **Save & Close**\n .\n\nIn the\n **Tooltip Order**\n section, you can also drag and drop the fields into the order that you want.\n\n\n Make sure to\n **Save & Close\n **.****\n\nUser Permissions and Features\n---------------------------------\n\nThe app supports three user levels: Admin, Standard, and View-only.\n\n Admin users can create, edit, and delete items in the app, share items they create in the app with members of Domo Groups, create custom Map Layers, and configure a default map and a default center. See\n\n\n Map Settings\n\n, above.\n* Standard users can create, edit, and delete their own items, and view items that admins share with them. They can't share items, create Map Layers, or set defaults.\n* View-only users can view items that admins share with them. They can't create, edit, or delete items. They also cannot share items or set defaults.\n\n\n To learn more, see the\n\nFlex Map v2 Implementation Guide\n\n.\n\nInteracting with the Map\n----------------------------\n\nAfter you create searches, Map Layers, and Heatmaps, you can interact with these items on the map.\n\n\n Searches display as colored dots on the map called Pins. If a Pin represents an individual location, it is a small dot without a number in the middle. If it represents a cluster of locations, the dot is larger and has a number in the middle representing the number of grouped locations.\n\n\n* Zoom into a clustered Pin to see the distinct locations.\n* Selecting a clustered Pin zooms into that location by one level.\n* Selecting an individual Pin opens a details panel that shows additional information for that location. If the additional information includes URLs, the URLs are colored orange and are clickable. If the additional information includes a link to an image, the image displays in the details panel.\n* Hovering over an individual Pin displays a tooltip for that location which card owners and admins can configure in the\n\n*Data Settings**\n\n.\n\nMap Layers display on the map as a filled-in border around the geographical area.\n\n Hovering over the territory displays the name of the location you are hovering over. Heatmaps display as multi-colored areas filled in with colors representing the value of the Heatmap metric.\n* Hovering over the Heatmap displays a tooltip with the metric that the color of the area represents.\n* Selecting a Heatmap area brings up a tooltip showing all related Heatmap metrics for that area.\n* A legend of what each of the Heatmap's colors represents displays in the lower-left corner of the map.\n\nEnter a term in the search bar at the top of the screen to view all the Pins that match your search entry.\n\n\n You can use this to quickly find a single location, a group of locations, or to create a favorite by selecting the star next to the location in the search results.\n\n*Note:**\n Admins see options to\n **Set as Default**\n and\n **Set as Center**\n at the bottom of the app.\n\n\n* Selecting\n **Set as Default**\n saves any displayed searches, Map Layers, and Heatmaps as the map default. This means that any user who loads the app views these default items when the app loads, as long as the items have been shared with them.\n* Selecting\n **Set as Center**\n sets the current view of the map as the default center. This means, for example, that an admin can set the contiguous United States as the default view, zoom in, and then save the revised view so that other users view it when they open the app.\n\nDemo Notes\n--------------\n\nOne way to demo the app is to upload a DataSet to power pin locations based on lat/long and Heatmap metrics.\n\n\n Then show how to build territories and save searches and Heatmaps.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 000005048\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005048\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFlex Map v2 User Guide\n\n", "article_total_view_count": "\n\n\n 2,493\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/4/2022, 11:29 PM\n\n\n", "first_published_date": "\n\n\n 12/8/2022, 9:15 PM\n\n\n"}, "title": "flex_map_v2_user_guide", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}