{"file_path": "../../raw_kb_v2\\article\\360042931614\\index.html", "content": {"Title": "Amazon Redshift SSH Connector", "Article Body": "Intro\n                       \n\n                        Amazon Redshift is a hosted data warehouse project that is part of the larger cloud computing platform Amazon Web Services.  You can use Domo's Amazon Redshift SSH Connector to create a secure, encrypted connection with your Redshift database to bring your data into Domo and start making better decisions. Simply input your own SSH credentials and write a query to pull the data you need, and ready to go. For more information about the Redshift API, visit their website. (\n                        \n                         http://docs.aws.amazon.com/redshift/..._commands.html\n                        \n                        )\n                       \n\n                        The Amazon Redshift SSH connector is a \"Database\" connector, meaning it retrieves data from a database based on a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n                        \n                         Database\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to your Redshift database in the\n                        \n                         Data Center\n                        \n                        . This topic discusses the fields and menus that are specific to the Redshift SSH connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           Depending on your network's structure, you may need to whitelist any IP addresses necessary for the data connector to retrieve data. Contact your IT administrator for assistance.\n                          \n\n\n\n\n                        Prerequisites\n                       \n\n                        To connect to a Redshift database and create a DataSet, you must have the following:\n                       \n\n\n\n                          The hostname of the UNIX server you are SSH-tunneling through\n                         \n\n\n\n                          The SSH username and password for your UNIX account\n                         \n\n\n\n                          The SSH port number\n                         \n\n\n\n                          The SSH private key\n                         \n\n\n\n                          The Redshift database hostname or IP address\n                         \n\n\n\n                          The Redshift database name\n                         \n\n\n\n                          The username and password you use to log into your Redshift database\n                         \n\n\n\n                          The port number for the Redshift database\n                         \n\n\n\n                          The Redshift database name\n                         \n\n\n\n                        CA certificate text or URL path is required\n                        \n                         only\n                        \n                        if you select\n                        \n\n                          Certificate String\n                         \n\n                        or\n                        \n\n                          URL Path\n                         \n                         ,\n                        \n                        respectively, in the\n                        \n\n                          Certificate Format\n                         \n\n                        menu.\n                       \n\n\n\n\n\n\n\n\n                             Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys (in PEM format) generated by OpenSSL.\n                            \n\n\n\n\n\n\n                        Creating a Redshift account\n                       \n\n                        To create a Redshift user account, contact your Redshift Database Administrator (DBA) and have them follow these directions:\n                        \n\n                        By default, only the master user that you created when you launched the cluster has access to the initial database in the cluster. To grant other users access, you must create one or more user accounts. Database user accounts are global across all the databases in a cluster; they do not belong to individual databases.\n                        \n\n                        Use the\n                        \n                         CREATE USER\n                        \n                        command to create a new database user. When you create a new user, you specify the name of the new user and a password. A password is required. It must have between 8 and 64 characters, and it must include at least one uppercase letter, one lowercase letter, and one numeral.\n                        \n\n                        For example, to create a user named GUEST with password ABCd4321, issue the following command:\n                        \n\n\n                         create user guest password 'ABCd4321';\n                        \n\n\n                        Whitelisting IP addresses\n                       \n\n                        Before you can connect to a Redshift database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n                        \n                         Whitelisting IP Addresses for Connectors\n                        \n                        .\n                       \n\n                        Connecting to Your Redshift Database Using SSH\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Redshift SSH Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector.\n                        \n\n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your database. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            SSH Server Hostname\n                           \n\n\n\n                            Enter the hostname of the UNIX server you are SSH-tunneling through.\n                           \n\n\n\n\n\n                            SSH Username\n                           \n\n\n\n                            Enter the username for your UNIX account.\n                           \n\n\n\n\n\n                            SSH Password\n                           \n\n\n\n                            Enter the password for your UNIX account.\n                           \n\n\n\n\n\n                            SSH Port\n                           \n\n\n\n                            Enter the port number used for SSH.\n                           \n\n\n\n\n\n                            SSH Private Key\n                           \n\n\n\n                            Enter the SSH private key.\n                           \n\n\n\n\n\n                            Database Hostname\n                           \n\n\n\n                            Enter the Redshift database hostname or URL.\n                           \n\n\n\n\n\n                            Database Name\n                           \n\n\n\n                            Enter the Redshift database name.\n                           \n\n\n\n\n\n                            Database Username\n                           \n\n\n\n                            Enter your username for the Redshift database.\n                           \n\n\n\n\n\n                            Database Password\n                           \n\n\n\n                            Enter your password for the Redshift database.\n                           \n\n\n\n\n\n                            Database Port\n                           \n\n\n\n                            Enter the Redshift database port number.\n                           \n\n\n\n\n\n                            Certificate Format\n                           \n\n\n\n                            Select the certificate format. If you do not want to include a certificate, select\n                            \n                             No Certificate\n                            \n                            . If you select\n                            \n                             Certificate String\n                            \n                            , you must paste the text for your certificate in the\n                            \n                             Certificate\n                            \n                            field. If you select\n                            \n                             URL Path\n                            \n                            , you must enter the URL where your certificate is located in the\n                            \n                             Certificate\n                            \n                            field.\n                           \n\n\n\n\n\n                            Certificate\n                           \n\n\n\n                            Paste the text for your CA certificate or enter the URL where your certificate is located. This is optional. If you do not want to include a certificate, select\n                            \n                             No Certificate\n                            \n                            in the\n                            \n                             Certificate Format\n                            \n                            menu.\n                           \n\n\n\n\n\n                        Once you have entered valid Redshift credentials, you can use the same account any time you go to create a new Redshift SSH DataSet. You can manage connector accounts in the\n                        \n                         Accounts\n                        \n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        In this pane you create an SQL query to pull data from your database. You can also choose a specific database table and columns and specify which columns you want to appear in your report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Query\n                           \n\n\n\n                            Enter the Structured Query Language (SQL) query to use in selecting the data you want. For example:\n                           \n\n\n                             select * from Employee\n                            \n\n\n\n\n\n\n                            Fetch Size\n                           \n\n\n\n                            Enter the fetch size for memory performance. If you leave this blank, a default value of 1000 is used. If you get an \"Out of Memory\" error, decrease the fetch size.\n                           \n\n\n\n\n\n                            Database Tables\n                           \n\n\n\n                            Select the database table you want to appear in your report.\n                           \n\n\n\n\n\n                            Table Columns\n                           \n\n\n\n                            Select all table columns you want to appear in your report.\n                           \n\n\n\n\n\n                            Query Helper\n                           \n\n\n\n                            Based on the selected columns in the\n                            \n                             Table Columns\n                            \n                            field, the Query Helper builds a sample query for you. You can revise the query if desired.\n                           \n\n\n\n\n\n                            Boolean Format\n                           \n\n\n\n                            Select the Boolean format to be used. The following table describes the available formats:\n                           \n\n\n\n\n\n                                1/0\n                               \n\n\n\n                                True values return\n                                \n                                 1\n                                \n                                , and false values return\n                                \n                                 0\n                                \n                                .\n                               \n\n\n\n\n\n                                t/f\n                               \n\n\n\n                                True values return\n                                \n                                 t\n                                \n                                , and false values return\n                                \n                                 f\n                                \n                                .\n                               \n\n\n\n\n\n                                T/F\n                               \n\n\n\n                                True values return\n                                \n                                 t\n                                \n                                , and false values return\n                                \n                                 f\n                                \n                                .\n                               \n\n\n\n\n\n                                true/false\n                               \n\n\n\n                                True values return\n                                \n                                 true\n                                \n                                , and false values return\n                                \n                                 false\n                                \n                                .\n                               \n\n\n\n\n\n\n\n\n\n                            Query Timeout\n                           \n\n\n\n                            Enter the connector timeout value in minutes.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n                        If you run into connection issues...\n                       \n\n\n\n                          Verify the connection works using pgAdmin.\n                         \n\n\n\n                          Confirm all of the necessary Domo IPs have been whitelisted (see\n                          \n                           Whitelisting IP addresses,\n                          \n                          above).\n                         \n\n\n\n                          Run a profile on the SQL query.", "Preview Article": "Click here to preview", "URL Name": "360042931614", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003899", "Archived Date": "", "Language": "English", "Primary Version": "Amazon Redshift SSH Connector", "Article Total View Count": "4,846", "": "", "Article Created Date": "10/24/2022, 9:16 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Amazon Redshift SSH Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               Database Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaojGAC"}]}