{"file_path": "../../raw_kb_v2\\article\\360043429793\\index.html", "content": {"title": "\n\n\n Properties Available for Most Charts\n\n\n", "article_body": "\n\nIntro\n-------\n\nRefer to this topic to find information about chart properties available for most chart types, such as those for configuring data labels and hovers, scale markers, value and category scale labels, and so on.\n\n\n \"General\" Properties\n----------------------\n\nThe properties in the following table are found in the\n **General**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Font Size\n  |\n Allows you to increase or decrease the font size for category and value scale labels in many chart types.\n\n\n For Textboxes, a number of sizes are available ranging from Small to XX-Large. If you select\n **Default**\n , the size is chosen that best matches the amount of available space. So, if you had the maximum amount of space available, the \"XX-Large\" size would be used.\n\n\n For more information, see\n\nChanging the Font Size in Your Chart\n\n.\n  |\n —\n  |\n|\n Portrait View Legend Position\n  |\n Determines where legends appear in charts in portrait view. By default, legends appear on the bottom of the chart in this view. For more information, see\n\nChanging the Legend Position in Your Chart\n\n.\n  |\n —\n  |\n|\n Landscape View Legend Position\n  |\n Determines where legends appear in charts in landscape view. By default, legends appear on the right of the chart in this view. If you select\n **Auto**\n , the legend appears to the right of the chart if it contains 10 or fewer items. Otherwise it appears at the bottom of the chart. For more information, see\n\nChanging the Legend Position in Your Chart\n\n.\n  |\n —\n  |\n|\n Reverse Legend Layout Order\n  |\n Reverses the order in which legend items appear.\n  |\n —\n  |\n|\n Disable Animation\n  |\n Turns off the animations that play when the viewing a chart in the Details view.\n  |\n —\n  |\n\n\"Grid Lines\" Properties\n-------------------------\n\nThe properties in the following table are found in the\n **Grid Lines**\n category in Chart Properties for most kinds of charts.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Zero Line Color\n  |\n Determines the color for the \"zero line\" on most single-axis charts. You can enter either the name of the color or the hexadecimal color code (such as\n\nFF0000\n\nfor red). This attribute does not work if the zero line is also the baseline (that is, the chart must contain negative values). In the example, this property has been set to\n\nred\n\n.\n  |\n\n|\n|\n Zero Line Width\n  |\n Determines the width of the \"zero line\" on most single-axis charts, in pixels. This attribute does not work if the zero line is also the baseline (that is, the chart must contain negative values). In the example, this property has been set to\n\n5\n\n.\n  |\n\n|\n|\n Calculated Line\n  |\n Lets you set an additional grid line that denotes the median or average value in the chart. In the example, the user has selected\n **Average**\n .\n  |  |\n\n\"Data Label Settings\" Properties\n----------------------------------\n\nThe properties in the following table are found in the\n **Data Label Settings**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Text\n  |\n Specifies text for data labels. This property is the \"on switch\" for data labels—you must specify text for them to appear.\n\n\n For more information about creating data label text, including a list of available macros, see\n\nFormatting Data Label and Hover Text in Your Chart\n\n.\n  |\n —\n  |\n|\n Position\n  |\n Determines where data labels are shown in relation to their corresponding data items.\n\n\n Available positions differ between chart types. For example, Pie and Funnel graphs include\n **Outside Leaders**\n and\n **Outside Arranged Leaders**\n options. Leaders are lines that connect data labels to their associated data items in the graph. If you select\n **Outside Leaders**\n , diagonal leaders are used; if you select\n **Outside Arranged Leaders**\n , the leaders are horizontal.\n\n\n The example shows a chart in which the data label position is set to\n **Inside Top**\n for a Vertical Bar graph.\n  |\n\n|\n|\n Fill\n  |\n Lets you add a colored fill to your data labels. The example at right shows a chart in which a red fill color with 45% transparency has been added.\n  |\n\n|\n|\n Fill Color\n  |\n Lets you specify the color for the fill in your data labels. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Fill Transparency Percent\n  |\n Lets you specify the fill transparency for data labels. You can specify any number between 0 and 100, in which 0 is completely opaque and 100 is completely transparent. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Rotate\n  |\n Lets you rotate data labels 90 degrees. The example at right shows a chart in which this has been done.\n  |\n\n|\n|\n Justification\n  |\n Determines the justification for multi-line data labels—either\n **Left**\n ,\n **Center**\n , or\n **Right**\n . For information about creating data label text, see\n\nFormatting Data Label and Hover Text in Your Chart\n\n. The example graph includes multi-line data labels that have been left-justified (by selecting\n **Left**\n for the\n **Justification**\n property).\n  |\n\n|\n|\n Show When Zero\n  |\n Determines whether data labels are shown for graph elements with a value of 0.\n  |\n —\n  |\n|\n Use Scale Format\n  |\n Determines whether data labels use the same formatting that has been set for the value scale.\n  |\n —\n  |\n|\n Use Scale Abbreviation\n  |\n Determines whether data labels use the same scale abbreviation that has been set for the value scale.\n  |\n —\n  |\n|\n Percent Value Decimal Places\n  |\n Determines the number of decimal places used in percentage values in data labels.\n  |\n —\n  |\n|\n Allow Overlap\n  |\n Determines whether data labels are still shown when they overlap.\n  |\n —\n  |\n|\n Show Data Labels On\n  |\n Determines whether data labels appear for lines, bars, or both in line-bar combination charts.\n  |\n —\n  |\n\n\"Hover Text Settings\" Properties\n----------------------------------\n\nThe properties in the following table are found in the\n **Hover Text Settings**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Hover Text\n  |\n Lets you set the text that appears in chart hovers. A variety of macros for showing chart values in your hovers is available. For more information and a list of available macros, see\n\nFormatting Data Label and Hover Text in Your Chart\n\n.\n  |\n —\n  |\n|\n Use scale format\n  |\n Determines whether hovers use the same formatting that has been set for the value scale. This property overrides the\n **Hover Format**\n ,\n **Divide Value By**\n ,\n **Decimal Places**\n , and\n **Negative Numbers**\n properties.\n  |\n —\n  |\n|\n Use scale abbreviation\n  |\n Determines whether hovers use the same scale abbreviation that has been set for the value scale.\n  |\n —\n  |\n|\n Hover Format\n  |\n Determines whether values in hovers have currency or percent symbols affixed. This property is overridden by the\n **Use scale format**\n property.\n  |\n —\n  |\n|\n Divide Value By\n  |\n When set, values in hovers are divided by the specified factor. This option is useful when the values in your chart are very large and you want to abbreviate them by dividing by a common number. For example, if the values in your chart represented millions of dollars, you could choose to divide by millions—all of the values in the hovers would then be reduced to more manageable single digits. When you choose to divide by\n **Percentage**\n , the numbers in the value scale are multiplied by 100. This property is overridden by the\n **Use scale format**\n property.\n  |\n —\n  |\n|\n Decimal Places\n  |\n Determines the number of decimal places in values in hovers. This property is overridden by the\n **Use scale format**\n property.\n  |\n —\n  |\n\n\"Value Scale\" Properties\n--------------------------\n\nThe properties in the following table are found in the\n **Value Scale**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Title\n  |\n Determines whether labels appear alongside value scales. For more information, see\n\nAdding Scale Titles to Your Chart\n\n. The example shows a Grouped Bar with Line chart in which value scale labels are used to distinguish the line and bar data.\n  |\n\n|\n|\n Show Label\n  |\n Determines whether labels appear for value items.\n  |\n —\n  |\n|\n Label Format\n  |\n Determines the general number format for value scale numbers and data labels. For more information, see\n\nFormatting Values in Your Chart\n\n.\n  |\n —\n  |\n|\n Divide Scale By\n  |\n Refers to the number that values in the value scale are to be divided by, if any. This option is useful when the numbers on your value scale are very large and you want to abbreviate them by dividing by a common number. For example, if all of the numbers on the value scale represented millions of dollars, you could choose to divide by millions—all of the numbers on the scale would then be reduced to more manageable single digits. When you choose to divide by\n **Percentage**\n , the numbers in the value scale are multiplied by 100.\n  |\n —\n  |\n|\n Decimal Places\n  |\n Determines the number of decimal places used in decimal values. You can choose from\n **Default**\n ,\n **None**\n , and options for numbers of decimal places (from \".0\" to \".00000\"). By default, Domo automatically determines the optimal number of decimal places for each number in the chart. When you select\n **None**\n , all values are rounded to the nearest whole number.\n  |\n —\n  |\n|\n Negative Numbers\n  |\n Determines the format for negative numbers. If you select\n **-100**\n , all negative numbers have a minus symbol affixed. If you select\n **(100)**\n , all negative numbers are enclosed in parentheses.\n  |\n —\n  |\n|\n Max\n  |\n Determines the maximum values on a value scale. For more information, see\n\nSetting the Minimum or Maximum Value on Your Chart's Value Scale\n\n.\n  |\n —\n  |\n|\n Min\n  |\n Determines the minimum values on a value scale. For more information, see\n\nSetting the Minimum or Maximum Value on Your Chart's Value Scale.\n\n|\n —\n  |\n|\n Divisions\n  |\n Determines the number of value scale gridlines in a chart. For more information, see\n\nSpecifying the Number of Value Scale Gridlines in Your Chart\n\n. The example shows a chart with eight value scale gridlines.\n  |\n\n|\n|\n Log Scale\n  |\n Determines whether the value scale increments logarithmically. On a logarithmic scale, each successive increase is exponential. These scales are useful when you have a wide range of data that doesn't fit well on a regular linear scale. The example shows a chart that uses a logarithmic scale to handle a wide range of data.\n  |\n\n|\n|\n Include Zero\n  |\n Determines whether a line for \"0\" appears in the chart.\n  |\n —\n  |\n\n\"Category Scale\" Properties\n-----------------------------\n\nThe properties in the following table are found in the\n **Category Scale**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Title\n  |\n Determines whether labels appear alongside category scales. For more information, see\n\nAdding Scale Titles to Your Chart.\n\nThe example shows a chart in which a category scale label is used.\n  |\n\n|\n|\n Show Label\n  |\n Determines whether labels appear for category items.\n  |\n —\n  |\n|\n Tiered Dates\n  |\n Determines whether multiple levels of dates are shown and, if so, how many. You can have up to 3 levels of dates. For example, if the dates in your chart were represented by week and you selected\n **3 Tiers**\n , the timeline would continue to show weekly data but the weeks would be broken out into monthly divisions, and the months would be broken out into quarters, as shown in the screenshot.\n\n\n For more information about Tiered Dates, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |  |\n|\n Date Output Format\n  |\n Determines how dates appear in the chart. For more information, see\n\nAdding Filters to Your Chart\n\n.\n  |\n —\n  |\n|\n Label Interval\n  |\n The interval at which labels appear for items on the category scale when there are too many items to show. By default, when there are more labels than fit on the category scale, Domo automatically trims out enough labels to prevent label overlapping. However, you can specify the interval at which labels are trimmed. For example, if you wanted every third label to appear in your chart and all others to be trimmed, you would enter\n `3`\n in the\n **Label Interval**\n field. The example shows a chart in which the user set the\n **Label Interval**\n property to\n `8`\n , so a label appears for every eighth item in the chart.\n  |\n\n|\n|\n Max Label Length\n  |\n Determines the maximum number of characters that appear for each category label. This property does not work unless a value is also entered for\n **Max Rotated Label Length**\n . The example shows a chart in which the\n **Max Label Length**\n has been set to\n `5`\n .\n  |\n\n|\n|\n Allow Label Rotation\n  |\n Determines whether labels are rotated if necessary in most kinds of Line charts.\n  |\n —\n  |\n|\n Max Rotated Label Length\n  |\n Determines the maximum number of characters that appear when labels are rotated. This property does not work unless a\n **Max Label Length**\n value is specified.\n  |\n —\n  |\n|\n Never Use Time Scale\n  |\n Determines which type of time scale is used in supported chart types with time data. By default, when time data is used in supported charts, such as Line and Bar charts, Domo automatically makes it appear using a\n\ndate grain\n\nappropriate for your data. This is shown in the first example at right, in which the timeline takes date data spanning several months and shows it by month. If there are periods with no data, gaps are shown accordingly in the timeline. If you check this box, however, date data appears as it does in your DataSet, using individual dates and applying the\n **Date Output Format**\n setting. This is shown in the second example at right, in which the time scale uses individual dates, as in the DataSet. If there are periods with no data, gaps are not shown for those periods in the timeline.\n  |\n\n\n |\n|\n Show Tiered or Extra Categories\n  |\n In the event that your chart includes either\n\nadditional dimensions\n\n, this option determines whether the extra category names appear above (default) or below the chart. In the example at right, the names appear below.\n  |  |\n\n\"Trellis/Tiered Dates\" properties\n-----------------------------------\n\n\n|\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Show As\n  |\n Lets you either turn on trellis categories or tiered dates in most chart types. When you turn on trellis categories, new fields in which you can drag and drop additional series are added above the chart preview. When you turn on tiered dates, multiple levels of dates are activated in your chart. Both of these features are discussed in\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n —\n  |\n|\n Tiered Date Levels\n  |\n Determines how many levels of dates are shown. You can have up to 3 levels of dates. For example, if the dates in your chart were represented by week and you selected\n **3 Levels**\n , the timeline would continue to show weekly data but the weeks would be broken out into monthly divisions, and the months would be broken out into quarters, as shown in the screenshot.\n\n\n For more information about tiered dates, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n\n|\n|\n Divider Color\n  |\n Lets you specify the color for the dividing lines in your trellis chart or tiered dates chart. In the example at right, the dividing lines have been set to blue-green.\n  |\n\n|\n|\n Mid Word Title Wrap\n  |\n Determines whether category name titles wrap in the middle of words and not just on spaces.\n  |\n —\n  |\n|\n Show Tiered or Extra Categories\n  |\n Determines whether the extra category names appear above (default) or below your trellis or tiered dates chart. In the example at right, the names appear below.\n  |\n\n|\n|\n Maximum Bars\n  |\n Sets the maximum bars to be displayed in each group. This can be used with the \"Sort on Totals\" property to create a Top 10 type chart.\n  |  |\n\n\"Number Format\" Properties\n----------------------------\n\nThe properties in the following table are found in the\n **Number Format**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Currency Symbol\n  |\n Refers to the symbol for currency numbers. The default currency symbol is \"$.\" You must select\n **Currency**\n as your label format for this to work. For more information, see\n\nFormatting Values in Your Chart\n\n.\n  |\n —\n  |\n|\n Currency Symbol Position\n  |\n Determines whether a currency symbol appears before or after its value. The default currency symbol position is\n **Before**\n . You must select\n **Currency**\n as your label format for this to work. For more information, see\n\nFormatting Values in Your Chart\n\n.\n  |\n —\n  |\n|\n Decimal Separator\n  |\n Determines the symbol for separate decimal values. The default decimal separator is a period.\n  |\n —\n  |\n|\n Thousands Separator\n  |\n Determines the symbol for separate thousands in large numbers. The default thousands separator is a comma.\n  |\n —\n  |\n\n\"Scale Marker\" Properties\n---------------------------\n\nThe properties in the following table are found in the\n **Scale Marker**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Text\n  |\n Lets you specify text to replace the default word \"GOAL\" that normally appears above the top left corner of the chart when a scale marker has been set. If the graph contains a legend, an item for the scale marker is added to the legend with this text (unless you hide it by checking the\n **Scale Marker > Hide in Legend**\n box).\n\n\n The example shows a chart in which \"MONTHLY TARGET\" has been entered as the custom text.\n  |\n\n|\n|\n Scale\n  |\n In dual-scale graphs, lets you specify whether the goal in the graph is associated with the left or right scale.\n  |\n —\n  |\n|\n Type\n  |\n Lets you specify whether the scale marker consists of a single line, a range of values, or a set of quantiles.\n  |\n —\n  |\n|\n Value Type\n  |\n Lets you determine how the scale marker line is calculated. A range of options is available, such as minimum and maximum, average, standard deviation, and more. If you select\n **Manual**\n (the default), you enter the desired value in the\n **Value**\n field. Otherwise the value is calculated from the data in the graph.\n  |\n —\n  |\n|\n Value\n  |\n Lets you specify the value of your scale marker line when you have selected\n **Manual**\n (or\n **Default)**\n for\n **Value Type**\n . This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Percentile Value\n  |\n Lets you calculate the value of your line based on a specified percentile value between 0 and 100. This option is available only when you select\n **Line**\n in the\n **Type**\n menu and\n **Percentile**\n in the\n **Value Type**\n menu.\n  |\n —\n  |\n|\n Percentage Of\n  |\n Lets you specify whether your percentage is derived from the maximum, minimum, average, or median value of the chart. This option is available only when you select\n **Line**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Value Type**\n menu.\n  |\n —\n  |\n|\n Percentage Value\n  |\n Lets you specify the percentage value calculated from the maximum, minimum, average, or median value of the chart (as selected in the\n **Percentage Of**\n field). This option is available only when you select\n **Line**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Value Type**\n menu.\n  |\n —\n  |\n|\n Standard Deviations\n  |\n Lets you calculate your scale marker value based on a specified number of standard deviations from the mean. If you enter a positive value, your scale marker value will be above the mean. If you enter a negative value, your scale marker value will be below the mean.\n  |\n —\n  |\n|\n Color\n  |\n Lets you specify the color of your scale marker line, together with the color of the goal value that appears above the top left corner of the graph. This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n\n\n In the example, the user has selected a red-orange color for the line and value.\n  |\n\n|\n|\n Width\n  |\n Lets you specify the width of your scale marker line—either\n **Thin**\n (the default),\n **Medium**\n , and\n **Thick**\n . This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n\n\n In the example, the user has selected\n **Thick**\n for this option.\n  |\n\n|\n|\n Style\n  |\n Lets you select whether your scale marker line appears solid (default) or dashed. This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n\n\n In the example, the user has selected\n **Dashed**\n for this option.\n  |\n\n|\n|\n Upper Value Type\n  |\n Lets you determine how the upper boundary of your scale marker range is calculated. A range of options is available, such as minimum and maximum, average, standard deviation, and more. If you select\n **Manual**\n (the default), you enter the desired value in the\n **Upper Value**\n field. Otherwise the value is calculated from the data in the graph.\n  |\n —\n  |\n|\n Upper Value\n  |\n Lets you select the value for the upper line in your scale marker range. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n\n\n |\n —\n  |\n|\n Upper Percentile Value\n  |\n Lets you calculate the value of your range's upper boundary based on a specified percentile value between 0 and 100. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentile**\n in the\n **Upper**\n**Value Type**\n menu.\n  |\n —\n  |\n|\n Upper Percentage Of\n  |\n Lets you specify whether the percentage for your range's upper boundary is derived from the maximum, minimum, average, or median value of the chart. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Upper**\n**Value Type**\n menu.\n  |\n —\n  |\n|\n Upper Percentage Value\n  |\n Lets you specify the percentage value for your range's upper boundary calculated from the maximum, minimum, average, or median value of the chart (as selected in the\n **Upper**\n**Percentage Of**\n field). This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Upper**\n**Value Type**\n menu.\n  |\n —\n  |\n|\n Upper Standard Deviations\n  |\n Lets you calculate your upper range boundary's value based on a specified number of standard deviations from the mean. If you enter a positive value, your scale marker value will be above the mean. If you enter a negative value, your scale marker value will be below the mean.\n  |\n —\n  |\n|\n Lower Value Type\n  |\n Lets you determine how the lower boundary of your scale marker range is calculated. A range of options is available, such as minimum and maximum, average, standard deviation, and more. If you select\n **Manual**\n (the default), you enter the desired value in the\n **Lower Value**\n fields. Otherwise the value is calculated from the data in the graph.\n  |\n —\n  |\n|\n Lower Value\n  |\n Lets you select the value for the lower boundary in your scale marker range. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Lower Percentile Value\n  |\n Lets you calculate the value of your range's lower boundary based on a specified percentile value between 0 and 100. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentile**\n in the\n **Lower**\n**Value Type**\n menu.\n  |\n —\n  |\n|\n Lower Percentage Of\n  |\n Lets you specify whether the percentage for your range's lower boundary is derived from the maximum, minimum, average, or median value of the chart. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Lower**\n**Value Type**\n menu.\n  |\n —\n  |\n|\n Lower Percentage Value\n  |\n Lets you specify the percentage value for your range's lower boundary calculated from the maximum, minimum, average, or median value of the chart (as selected in the\n **Lower**\n**Percentage Of**\n field). This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Lower**\n**Value Type**\n menu.\n  |\n —\n  |\n|\n Lower Standard Deviations\n  |\n Lets you calculate your lower range boundary's value based on a specified number of standard deviations from the mean. If you enter a positive value, your scale marker value will be above the mean. If you enter a negative value, your scale marker value will be below the mean.\n  |\n —\n  |\n|\n Fill Color\n  |\n Lets you select the fill color for your scale marker range. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Fill Transparency Percent\n  |\n Lets you enter an transparency percentage for the fill in your scale marker range. This should be a value between 0 and 100. The higher the value, the more transparent the fill. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Border Color\n  |\n Lets you select the border color for your scale marker range. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Border Style\n  |\n Lets you select whether the borders of your scale marker range appear solid (default) or dashed. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Number of Quantiles\n  |\n Lets you specify the number of quantiles that appear in your chart. You can specify any number between 3 and 10. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n\n\n The example shows a Line chart in which 6 quantiles (sextiles) have been added.\n  |\n\n|\n|\n Quantile Line Color\n  |\n Lets you specify the color for your quantiles. The default is gray. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Quantile Line Style\n  |\n Lets you specify whether your quantiles are solid (default) or dashed. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n —\n  |\n|\n Quantile Fill Color\n  |\n Lets you select a fill color for the spaces between your quantiles. If you select\n **Default**\n , no fill color is applied. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n\n|\n|\n Quantile Fill Transparency Percent Start\n  |\n Lets you select the transparency for the upper portion of your quantiles. You can enter a value from 0 (totally opaque) to 100 (totally transparent). This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n\n\n In the example at right, this property has been set to\n\n10\n\n.\n  |\n\n|\n|\n Quantile Fill Transparency Percent End\n  |\n Lets you select the transparency for the lower portion of your quantiles. You can enter a value from 0 (totally opaque) to 100 (totally transparent). This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n\n\n In the example at right, this property has been set to\n\n10\n\n.\n  |\n\n|\n|\n Decimal Places\n  |\n Lets you specify the number of decimal places in the goal value, both in the title as well as in the hover text.\n  |\n —\n  |\n|\n Value Abbreviation\n  |\n Lets you specify whether values are abbreviated based on the scale marker abbreviation (default) or 3 significant digits.\n  |\n —\n  |\n|\n Hide in Legend\n  |\n Lets you prevent a scale marker item from being added to the legend (if the graph contains a legend).\n  |\n —\n  |\n|\n Hide Title\n  |\n Hides the goal text and value that normally appear over the top left corner of the graph.\n  |\n —\n  |\n\n\n \"Data Table\" Properties\n-------------------------\n\nThe properties in the following table are found in the\n **Data Table**\n category in Chart Properties.\n\n\n Option\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Show Data Table\n  |\n Allows you to include a data table under your chart. This data table appears in the Details view of the chart (though\n *not*\n in the page view). This property is available for most vertical chart types.\n\n\n The example at right shows a chart in which the data table option has been enabled.\n  |\n\n|\n|\n Auto Abbreviate Values\n  |\n Allows you to abbreviate values in the data table.\n  |\n —\n  |\n\n\"Full Size Settings\" Properties\n---------------------------------\n\n\n|  |  |  |\n| --- | --- | --- |\n|\n Full Size Settings\n  |\n\nAllows you to set custom sizing on tables in the card view when the \"Full Size\" option is selected—anywhere from 1 to 6 card sizes in both width and height. For more information about card sizing, see\n\nChanging the Size of Cards in a Page\n\n.\n\n\n The first table in the example at right shows a table in the card view that has been set to a 4-card width by a 1-card height. The second table has been set to a 3-card width by a 3-card height.\n\n|\n\n|\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429793\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005024\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nProperties Available for Most Charts\n\n", "article_total_view_count": "\n\n\n 2,969\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/2/2022, 9:00 PM\n\n\n", "first_published_date": "\n\n\n 11/2/2022, 9:04 PM\n\n\n"}, "title": "properties_available_for_most_charts", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_properties", "url": "/s/topic/0TO5w000000ZaodGAC"}]}