{"file_path": "../../raw_kb_v2\\article\\360058532353\\index.html", "content": {"title": "\n\n\n Safety Training\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Safety Training App allows your company to stay on top of important app training that will help ensure best practices for going back to work and staying safe during times of uncertainty. It allows for quick module trainings and an easy way to view your team’s progress when it comes to staying up-to-date on important safety information. Safety Training consists of 2 Apps:\n\n. Safety Training\n2. Safety Training - Content Builder\n\n\n**Note:**\n This app is part of the\n\nGet Back to Work Solution\n\nand is available\n *on-demand and paid*\n .\n\nTo request this feature be enabled,\n\n Reach out to your Domo Customer Success Manager or Account Executive.\n* If you do not have contact information for your CSM or AE, contact Domo Support. For information on how to contact Support, please see:\n\nGetting Help\n\nThe Safety Training app includes three main screens:\n **Home**\n ,\n **Completed**\n , and\n **My Team**\n . The Home screen acts as the app’s main landing page, allowing you to view your pending training modules, the number of completed modules, and your average pass percentage. The Completed screen allows you see all of the trainings you've completed, along with your pass percentage for each. The My Team screen is available for managers to view their reports' trainings including how many trainings have been completed, the total pass percentage, and any overdue trainings.\n\n\n###\n Home screen\n\nUtilize the app’s main view to also complete required trainings from your organization. Search for a specific module using the search bar or use the tags:\n **Video**\n ,\n **Training**\n , or\n **All**\n , to narrow down your module results. To begin a training, simply select the\n **Begin training**\n button on a module. You’ll be taken to an overview of the module so you can ensure that you’re completing the correct one. Begin taking a quiz by selecting the\n **Take quiz**\n button and once you’ve completed a quiz, view your results and close the module. Your completed quiz should now appear in the\n **Completed**\n tab in the app.\n\n\n###\n Completed tab\n\nThe Completed tab shows all of your completed modules. You can search for a specific module using the search bar or use the tags:\n **Video**\n ,\n **Training**\n , or\n **All**\n , to find a specific type of training module.\n\n\n###\n My Team tab\n\nThe My Team tab shows your team’s training progress and displays the statuses of modules you’ve assigned out to the team. View the total number of training modules in progress, the number of overdue training modules, and completed training modules. Use the\n **Training Your Team is Required to Complete**\n section to view the results for completed modules. Use the tags:\n **In Progress**\n ,\n **Overdue**\n ,\n **Completed**\n , or\n **All**\n , to narrow down your search results.\n\nClick the\n **View Results**\n button located on a module to view information about the module such as due date, status, question count, and participants. The completion bar shows the percent of modules completed and lets you view the individual result for each of your team members.\n\nThe Safety Training App allows for quick module trainings and an easy way to view your team’s progress when it comes to staying up to date on important safety information.\n\n\n Safety Training - Content Builder App\n---------------------------------------\n\nThe Safety Training – Content Builder App works in conjunction with the Safety Training App, allowing you to create new module content for your company and team to complete and review.\n\n\n###\n Edit modules\n\nThe app allows you to view previously created training compliance modules and to create new ones. All of your created modules appear with their module name, due date, % completed, status, and the number of questions included. To edit a previously made module, select the\n **Edit**\n button in the module display. Edit the\n **Module Name**\n ,\n **Thumbnail Image**\n ,\n **Due Date**\n ,\n **Description**\n ,\n **Add Media**\n , and change questions. You can also select the\n **Active**\n slider to make the module active in the Safety Training App for your team to see and review.\n\n\n###\n Create modules\n\nTo create a new training module, select the\n **Create new training module**\n button located at the top right of the app. A module is comprised of the\n **Module Name**\n , a\n **Thumbnail Image**\n , a\n **Due Date**\n , and\n **Description**\n . Include module content like videos, quiz questions, and the percent needed to pass the module off. Quiz question types include true or false, single selection, or multiple selections. Enter the question into the text box and then choose and/or type in the correct answer. Copy or delete questions and select the\n **Active**\n slider to choose whether or not your module will be active in the Training Compliance App. Once you’ve created a new module, it will become visible in the app’s main screen.\n\nUse the Safety Training – Content Builder app to create meaningful training modules for your team to complete and use as learning milestones when it comes to your company’s overall wellbeing.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360058532353\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004133\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSafety Training\n\n", "article_total_view_count": "\n\n\n 2,363\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:24 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "safety_training", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}