{"file_path": "../../raw_kb_v2\\article\\360043434553\\index.html", "content": {"title": "\n\n\n Pinterest Ads Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nPinterest Ads help you get your products and content in front of more people as they search, browse and discover on Pinterest. Use Domo's Pinterest Ads connector to retrieve delivery metrics and object information for your Pinterest Ads account. To learn more about the Pinterest API, visit their page (\n\nhttps://developers.pinterest.com/docs/getting-started/introduction/?\n\n).\n\n\n You connect to your Pinterest account in the Data Center. This topic discusses the fields and menus that are specific to the Pinterest Ads connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Pinterest account and create a DataSet, you must have credentials for the account (the email address you use to log into Pinterest and your Pinterest password) OR Facebook or Google credentials.\n\n\n Connecting to your Pinterest account\n--------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Pinterest Ads Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials pane\n\nThe Domo Pinterest Ads connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Pinterest Ads accounts in Domo) to open the Pinterest OAuth screen where you can enter your Pinterest credentials. Once you have entered valid Pinterest credentials, you can use the same account any time you go to create a new Pinterest Ads DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Pinterest when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Pinterest.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Pinterest report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Board Details\n  |\n This report returns a board object.\n  |\n|\n Board Pins\n  |\n This report returns a board's pin objects.\n  |\n|\n Conversion Quality Health Metrics\n  |\n This report returns a list of conversion quality health metrics.\n  |\n|\n Delivery Metrics\n  |\n This report returns delivery metrics for the selected object. If a metric has no value, it may not be returned in the metrics dictionary.\n  |\n|\n Delivery Metrics' Definitions\n  |\n This report returns a list of all the names and definitions of Pinterest's delivery metrics.\n  |\n|\n Most Clicked Pins\n  |\n This report returns a list of pins from the specified domain.\n  |\n|\n Object Information\n  |\n This report returns a list containing the object information for the selected object type.\n  |\n|\n Pins\n  |\n This report returns a list containing information about the authenticated user's Pins.\n  |\n|\n Users\n  |\n This report returns information about the authenticated user.\n  |\n|\n User Metrics\n  |\n This report returns metrics for the authenticated user.\n  |\n|\n User's Boards\n  |\n This report returns a board summary about the authenticated user.\n  |\n|\n Users Top Pin Metrics Client\n  |\n This report returns analytics data about the authenticated user's top pins (limited to the top 100).\n  |\n|\n Users Top Video Pin Metrics\n  |\n This report returns analytics data about the authenticated user's top video pins (limited to the top 100).\n  |\n\n|\n|\n Board\n  |\n Select the Board to report on.\n  |\n|\n Advertiser\n  |\n Select the advertiser you want to retrieve data for.\n  |\n|\n Select Health Type\n  |\n Select the health type to return the data on.\n  |\n|\n Object Type\n  |\n Select the type of object you want to retrieve data for.\n  |\n|\n Select All or Some\n  |\n Select whether you want to retrieve all objects of your selected object type or only a specified number.\n  |\n|\n Granularity\n  |\n Select the desired granularity for your report. The following options are available:\n * **Day**\n . Metrics are broken down daily.\n* **Hour**\n . Metrics are broken down hourly. This data is real-time and may be inexact.\n* **Total**\n . Metrics are aggregated over a specified date range.\n |\n|\n Conversion Report Time\n  |\n Select the date by which the conversion metrics returned from this report will be reported. There are two dates associated with a conversion event—the date that the user interacted with the ad, and the date that the user completed a conversion event.\n  |\n|\n View Window Days\n  |\n Select the number of days to use as the conversion attribution window for a \"view\" action.\n  |\n|\n Engagement Window Days\n  |\n Select the number of days to use as the conversion attribution window for an \"engagement\" (i.e. close-up or save) action.\n  |\n|\n Click Window Days\n  |\n Select the number of days to use as the conversion attribution window for a \"click\" action.\n  |\n|\n Select Display Names As Column Names\n  |\n Select if you want to use display names as column names instead of internal names.\n  |\n|\n Domain\n  |\n Enter the domain name to query.\n  |\n|\n Aggregation\n  |\n Select the period to aggregate the data over.\n  |\n|\n Entity Status\n  |\n Select the entity status to report on.\n  |\n|\n Campaign\n  |\n Select the campaign you want to retrieve data for.\n  |\n|\n Ad Group\n  |\n Select the ad group you want to retrieve data for.\n  |\n|\n Pin Promotion\n  |\n Select the pin promotion you want to retrieve data for.\n  |\n|\n Product Group Ids\n  |\n Select the product groups.\n  |\n|\n Include All Advertisers Your User Has Access To?\n  |\n Select whether you want your report to include all advertisers your authenticated user has access to.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the Pinterest Ads API does this connector use?\n\nThis connector uses version 5 of the Pinterest Ads API.\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n Board Details\n  |\n /boards/{boardId}\n  |\n|\n Board Pins\n  |\n /boards/{boardId}/pins\n  |\n|\n Conversion Quality Health Metrics\n  |\n /measurement/conversion\\_quality/health\n  |\n|\n Delivery Metrics\n  |\n /{objectType}/{objectId}/delivery\\_metrics\n  |\n|\n Delivery Metrics' Definitions\n  |\n /resources/delivery\\_metrics/\n  |\n|\n Most Clicked Pins\n  |\n /domains/{domain}/pins/top/clicks/\n  |\n|\n Most Repinned Pins\n  |\n /domains/{domain}/pins/top/repins\n  |\n|\n Object Information\n  |\n /{objectParent}/{objectId}/{ObjectType}\n  |\n|\n Pins\n  |\n /users/{user}/pins\n  |\n|\n Users\n  |\n /v3/users/me\n  |\n|\n User Metrics\n  |\n /partners/analytics/users/{me}/metrics\n  |\n|\n User's Boards\n  |\n /users/{user}/boards/feed/\n  |\n|\n Users Top Pin Metrics Client\n  |\n /partners/analytics/users/{me}/pins/top/\n  |\n|\n Users Top Video Pin Metrics\n  |\n /partners/analytics/users/{me}/pins/top/video\n  |\n\n\n####\n How do I know my login credentials are secure?\n\nDomo uses the OAuth process to connect to Pinterest, so your credentials are never seen or stored by Domo. You can revoke Domo's access to your Pinterest account at any time.\n\n###\n How often can the data be updated?\n\nDataSets should be set to update once a day.\n\n###\n Are there any API limits I should be aware of?\n\nPinterest allows up to 1000 API requests for a user per hour. A single dataset run may need to make multiple requests.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043434553\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003457\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nPinterest Ads Connector\n\n", "article_total_view_count": "\n\n\n 4,721\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "pinterest_ads_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}