{"file_path": "../../raw_kb_v2\\article\\1500009323241\\index.html", "content": {"Title": "Scheduler Implementation Guide", "Article Body": "Intro\n                       \n\n                        Thank you for your interest in the Scheduler app! This guide will help you prepare and connect your data to the app. The main purpose of the Scheduler app is to allow for a broad variety of scheduling use-cases, as opposed to other offerings in the market which are targeted towards very specific business needs. Follow the steps below to prepare your data for the app and how to set up the app in the Admin set-up section. The app will need to be connected to DataSets output by the Scheduler, as well as the Form Builder app.\n                        \n\n\n\n\n\n                        ExternalAppointments DataSet\n                       \n\n                        The\n                        \n                         ExternalAppointments\n                        \n                        DataSet, output by the Scheduler app, is a list of end-users that should be allowed to use the app to book a follow-up appointment using their customer ID. This DataSet is not utilized for initial appointments, but even if a Scheduler only offers initial appointments this DataSet mapping should still be configured. The\n                        \n                         ExternalAppointments\n                        \n                        DataSet includes the following column IDs:\n                       \n\n\n\n                          customerId\n                         \n\n\n\n                          questionnaireSessionId\n                         \n\n\n\n                          startDateTime\n                         \n\n\n\n                          endDateTime\n                         \n\n\n\n                          serviceId\n                         \n\n\n\n                          serviceName\n                         \n\n\n\n                          locationId\n                         \n\n\n\n                          locationName\n                         \n\n\n\n                          resourceId\n                         \n\n\n\n                          resourceName\n                         \n\n\n\n                        These will be used later on to map the DataSet to your Scheduler app.\n                       \n\n                        For follow-up appointments, the customerId field is validated against the list of customer IDs in the mapped DataSet. If a customer ID is entered but is not loaded in the\n                        \n                         ExternalAppointments\n                        \n                        DataSet, then the end-user will not be able to proceed to the next step.\n                        \n\n\n\n\n\n                        MaskedCustomerInfo DataSet\n                       \n\n                        This DataSet is a companion to the\n                        \n                         ExternalAppointments\n                        \n                        DataSet and will return the masked first and last name of the customer Id entered into the Scheduler. The\n                        \n                         MaskedCustomerInfo\n                        \n                        DataSet is taken from the\n                        \n                         ExternalAppointments\n                        \n                        DataSet and then put into a Beast Mode to mask the first and last name, an example of this Beast Mode will be shown below. The\n                        \n                         MaskedCustomerInfo\n                        \n                        DataSet should include the following column IDs:\n                       \n\n\n\n                          customerId\n                         \n\n\n\n                          firstName\n                         \n\n\n\n                          lastName\n                         \n\n\n\n                        These will be used later on to map the DataSet to your Scheduler app.\n                       \n\n                        If a customer ID is entered but is not loaded in this DataSet then the end-user will not be able to proceed to the next step in the Scheduler.\n                        \n\n\n\n\n\n                        Here is a sample Beast Mode to generate the masked first and last names:\n                       \n\n\n                         firstName:\n                        \n\n\n                        CONCAT(left(`firstName`, 1), left(REGEXP_REPLACE(`firstName`,'.','*'),LENGTH(`firstName`)-1))\n                       \n\n\n                         lastName:\n                        \n\n\n                        CONCAT(left(`lastName`, 1), left(REGEXP_REPLACE(`lastName`,'.','*'),LENGTH(`lastName`)-1))\n                       \n\n                        InviteCodes DataSet\n                       \n\n                        This DataSet maps the invite codes, which allows only invited end-users to schedule their appointments. This applies to initial appointments only and is enabled through the Admin set-up.\n                        \n\n\n\n\n\n\n                        When enabled, the Scheduler will only allow codes that are populated in the\n                        \n                         inviteCodes\n                        \n                        column of the DataSet.\n                        \n\n\n\n\n\n\n                        The\n                        \n                         InviteCodes\n                        \n                        DataSet includes the following column:\n                       \n\n\n\n                          inviteCode\n                         \n\n\n\n                        This will be used later on to map the DataSet to your Scheduler app.\n                       \n\n                        Wiring Your Data to the App\n                       \n\n                        After the data is ready for the app, you can now deploy the app from the Appstore and connect your data. If you have access to the app asset, deploy the asset from the Asset Library to the desired page in Domo. If the app has been deployed for you with sample data, navigate to the app, click on the wrench icon in the top right corner of the app, and select\n                        \n                         Edit Card\n                        \n                        .\n                       \n\n                        On the\n                        \n                         Edit Card\n                        \n                        screen, that you will get to from one of the two methods explained above, you can re-name the app at the top of the screen. Scroll down below the app and you should see a series of tabs that represent each of the DataSets the app needs in order to run. The first tab\n                        \n                         EXPORTCOLUMNS\n                        \n                        will come from your output Form Builder DataSet, be sure to match up all of the correct column IDs from the DataSet. Repeat this same step for the\n                        \n                         EXPORTFILTERS\n                        \n                        ,\n                        \n                         EXPORTSFORMS\n                        \n                        ,\n                        \n                         EXPORTGROUPS\n                        \n                        ,\n                        \n                         EXPORTITEMS\n                        \n                        ,\n                        \n                         EXPORTSECTIONS\n                        \n                        ,\n                        \n                         EXPORTSUBMITTEDUSERS\n                        \n                        , and\n                        \n                         EXPORTTAGS\n                        \n                        tabs, being sure to match up all of the correct columns IDs from the DataSets. The following DataSets will be output from the Scheduler and mapped to the app:\n                        \n                         ExternalAppointments\n                        \n                        ,\n                        \n                         MaskedCustomerInfo\n                        \n                        , and\n                        \n                         InviteCodes\n                        \n                        . Each of these should have corresponding tabs in the\n                        \n                         Edit Card\n                        \n                        screen, while setting these up be sure to match up all of the correct column IDs from the DataSets. Scroll up to the top and click\n                        \n                         Save & Finish\n                        \n                        and your app should now be ready to set up.\n                       \n\n                        Embedding the Scheduler App\n                       \n\n                        Follow these steps to set up the Scheduler app in embed:\n                       \n\n\n\n                          Create a new Role in the Domo instance called\n                          \n                           Embed User\n                          \n                          with\n                          \n                           only\n                          \n                          the following three grants enabled:\n                         \n\n\n\n                            Embed Content\n                           \n\n\n\n                            Use AppDB\n                           \n\n\n\n                            View DomoApps\n                           \n\n\n\n\n\n                          Create an account in Domo and assign it to the ‘Embed User’ role.\n                         \n\n\n\n                            Remove grants from this user for everything\n                            \n                             except\n                            \n                            for the Scheduler app.\n                           \n\n\n\n\n\n                          Log in as the\n                          \n                           Embed User\n                          \n                          .\n                         \n\n\n\n                          Enable the Domo Everywhere link on the asset using the\n                          \n                           Embed User\n                          \n                          .\n                         \n\n\n\n                        Domo Groups and Permissions\n                       \n\n                        A list of groups and the permissions needed will be outlined below. Each of these groups will need to be added to your Domo instance.\n                       \n\n\n\n                          _FB_CreateForms_\n                         \n\n\n\n                            For Form Builder creation access.\n                           \n\n\n\n\n\n                          _FB_CreateTemplate_\n                         \n\n\n\n                            For Form Builder Template creation access.\n                           \n\n\n\n\n\n                          _Scheduler_Admin_\n                         \n\n\n\n                            For accessing the Admin section of the Scheduler.\n                           \n\n\n\n\n\n                          _SMS_ADMIN_\n                         \n\n\n\n                            Campaigns Admin.\n                           \n\n\n\n\n\n                          _SMS_USER_\n                         \n\n\n\n                            Campaigns user.\n                           \n\n\n\n\n\n                          Embed User Group\n                         \n\n\n\n                            Add the\n                            \n                             Embed User\n                            \n                            to this group, the\n                            \n                             Embed User\n                            \n                            is used to create the public embed links.\n                           \n\n\n\n\n                             Only\n                            \n                            the\n                            \n                             Embed User\n                            \n                            should be in this group.\n                           \n\n\n\n                            Share the Schedulers that need public embed links with this group.\n                           \n\n\n\n\n\n                        Admin Set-up\n                       \n\n                        List-View\n                       \n\n                        The Admin portion of the app can be accessed by selecting the\n                        \n                         Admin\n                        \n                        option from the landing screen. The default Admin view is the\n                        \n                         Manage Schedule\n                        \n                        or list-view, the\n                        \n                         New Item\n                        \n                        button will take you back to the landing page, while the\n                        \n                         Admin Settings\n                        \n                        button will take you to the app set-up.\n                       \n\n                        The list-view has four options: today, this week, this month, or past. Your appointments will be shown from soonest to furthest (i.e., a 4/1/21 appointment will be shown before a 4/21/21 one). Search for an appointment by first and last name, email, and phone number. You can also filter your list-view using the filter by location, service, and/or resource options. A list of pre-populated locations, services, and resources can be filtered on—these are dependent upon your set locations, services, and resources in the\n                        \n                         Admin Settings\n                        \n                        portion of the Scheduler.\n                       \n\n                        Delete appointments by selecting the ‘trashcan’ icon next to a line-item. Appointments can be re-scheduled by going through the formal scheduling process from the app landing screen.\n                        \n\n\n\n\n\n                        Admin Settings\n                       \n\n                        The Admin Settings screen has nine different set-up options:\n                        \n                         Set up Workflow\n                        \n                        ,\n                        \n                         Edit Locations\n                        \n                        ,\n                        \n                         Edit Services\n                        \n                        ,\n                        \n                         Edit Resources\n                        \n                        ,\n                        \n                         Edit Availability\n                        \n                        ,\n                        \n                         Edit Inventories\n                        \n                        ,\n                        \n                         Add Questionnaire\n                        \n                        ,\n                        \n                         Customize Confirmation\n                        \n                        , and\n                        \n                         Customize Settings\n                        \n                        . Each of the options provides you with the ability to have complete control over the way your Scheduler app functions and looks to end-users.\n                        \n\n\n\n\n\n                        Set up Workflow\n                       \n\n                        Control the order that your Location, Service, and Resource appears in the app by dragging and dropping each item as you want desire. Hide options by selecting or un-selecting the checkbox next to each title. Choose to include a Form Builder questionnaire in your workflow, if desired. The\n                        \n                         show any\n                        \n                        slider, when turned on, will show end-users all of the available options included (i.e., all locations will be shown). Limit who has access to the Scheduler by checking the\n                        \n                         Invitations required for appointment scheduling\n                        \n                        ; this will only allow users who have a unique ID, generated by the app, to schedule an appointment.\n                        \n\n\n\n\n\n                        Edit Locations\n                       \n\n                        Add new locations to your Scheduler by selecting the ‘Add New Location’ button from the upper right-corner of the screen. Locations include the name of the location, address, associated resources, and associated resources. Locations are required to have both a resource and service, incomplete items will be marked with a red incomplete tag and will not be visible to users in the app.\n                       \n\n                        Edit existing locations by selecting the down arrow on a line-item and delete locations by selecting the trashcan icon. If changes are made in the Edit Locations screen, a save and reset button will appear at the bottom of the page prompting you to either reset or save your changes. Hide locations that you do not want to appear for users by selecting the ‘hide’ checkbox on each line-item.\n                       \n\n                        Set a location as private by selecting the ‘Private’ checkbox. Once this checkbox has been selected, you should be able to see an Invite ID, this is how users will be able to schedule for that private location in the app.\n                       \n\n                        Note that a location will be hidden in the Scheduler app once all of its associated inventory has been used up.\n                       \n\n\n\n\n\n\n                        Admins also have the ability to preview the availability by location. Select the ‘eye’ icon in the expanded location view. The calendar view will be shown as well the max # of appointments.\n                       \n\n\n\n\n                        Edit Services\n                       \n\n                        Add new services to your Scheduler by selecting the\n                        \n                         Add New Service\n                        \n                        button from the upper right-corner of the screen. Services include the service name, description of the service, estimated service duration, booking type, inventory, inventory usage, associated resources, and associated locations. The estimated service duration is how long the service will take for each appointment (i.e., 1.5 equals 1 hour and 30 minutes). The booking type can be set as either an initial or follow-up appointment, follow-up appointments are only available if the user has already completed/scheduled their initial appointment. If you are setting the service up as a follow-up, three additional options will be shown: follow-up at least, follow-up at most, and follow-up parent services. Follow-up at least is the follow-up appointment must be scheduled\n                        \n                         this\n                        \n                        number of days after the initial; follow-up at most is the max number of days that a follow-up appointment can be scheduled after the initial. The follow-up parent services are the associated services that can be scheduled according to the selected initial service. The inventory is the associated inventory set in the\n                        \n                         Edit Inventories\n                        \n                        screen. The inventory usage is how many items from the inventory the service requires per booking. Services are required to have both a resource and location, incomplete items will be marked with a red incomplete tag and will not be visible to users in the app.\n                       \n\n                        Edit existing services by selecting the down arrow on a line-item and delete services by selecting the trash icon. If changes are made in the\n                        \n                         Edit Services\n                        \n                        screen, a save and reset button will appear at the bottom of the page prompting you to either reset or save your changes. Hide services that you do not want to appear for users by selecting the\n                        \n                         hide\n                        \n                        checkbox on each line-item.\n                        \n\n\n\n\n\n                        Edit Resources\n                       \n\n                        Add new resources to your Scheduler by selecting the\n                        \n                         Add New Resource\n                        \n                        button from the upper right-corner of the screen. Resources include the resource name, description of the resource, double booking, associated locations, and associated services. Double-booking is the max concurrent number of bookings allowed for the resource. Resources are required to have both a location and service, incomplete items will be marked with a red incomplete tag and will not be visible to users in the app.\n                       \n\n                        Edit existing resources by selecting the down arrow on a line-item and delete resources by selecting the trash icon. If changes are made in the\n                        \n                         Edit Locations\n                        \n                        screen, a save and reset button will appear at the bottom of the page prompting you to either reset or save your changes. Hide resources that you do not want to appear for users by selecting the ‘hide’ checkbox on each line-item.\n                        \n\n\n\n\n\n                        Edit Availability\n                       \n\n                        Add company availability to the Scheduler through default or custom schedules. Default schedules will apply to all users who are not added to custom schedules. Custom schedules will override default schedules and will only apply to users added to it. Add a new schedule by selecting the ‘Add Schedule’ button from the upper-right corner of the screen and choose to either add a new default or custom schedule.\n                       \n\n                        Start and end dates can be set—this will define the periods of time in which appointments will be available to end-users. If this is left blank, all dates will be available.\n                       \n\n                        Select what time zone you’d like all appointments to be available in: Alaskan, Arizona, Central, Eastern, Hawaiian, Mountain, or Pacific time.\n                       \n\n                        The Time Slot Interval selection determines the time allocated to each time slot which users can select when booking an appointment. For example, an interval of 15 minutes on a schedule that runs between 8am and 9am will present these options: 8:00am, 8:15am, 8:30am, and 8:45am.\n                        \n\n\n\n\n\n\n                        Default schedules include the schedule name, the\n                        \n                         repeats weekly on\n                        \n                        days, blackout periods, and available hours. Default schedules can be edited at any time and deleted by selecting the\n                        \n                         trash\n                        \n                        icon on the line-item.\n                        \n\n\n\n\n\n\n                        Blackout periods define whether days before or after certain dates are excluded for booking appointments. Select the\n                        \n                         Everything Before\n                        \n                        checkbox and the date to make everything\n                        \n                         before\n                        \n                        the selected date unavailable. Select the\n                        \n                         Everything After\n                        \n                        checkbox and the date to make everything\n                        \n                         after\n                        \n                        the selected date unavailable. Custom blackout dates include periods or single days, for example I could make just April 19, 2021 unavailable in the Scheduler or I could make April 19-April 21 unavailable; multiple periods and days can be added. All of the blackout dates will appear in the bottom of the modal.\n                        \n\n\n\n\n\n\n                        Custom schedules are set up almost exactly the same way as default schedules, but any added custom schedules will override existing default schedules in the Scheduler. The\n                        \n                         Schedule Resources\n                        \n                        field is available for custom schedules; this is where you can add and restrict resources that will be included. Add users to the schedule by searching for their name and then selecting their name from the search results.\n                        \n\n\n\n\n\n                        Edit Inventories\n                       \n\n                        Add new inventories to your Scheduler by selecting the\n                        \n                         Add Inventory\n                        \n                        button from the upper-right corner of the screen. Inventories include the inventory name, inventory description, the current inventory (based on the number of users scheduled with that inventory item and added inventory amount), and the modify inventory amount which allows you to add or remove from the current inventory. Inventories can be edited at any time and deleted by selecting the trash icon from the line-item. Services can also be associated with inventories; select the ‘+’ button next to Services and add the service and the amount per location.\n                        \n\n\n\n\n\n                        Edit Languages\n                       \n\n                        Additional languages can be enabled in the ‘Edit Languages’ screen. The currently available language options include English, Spanish, Haitian Creole, and Japanese. One language can be set as the default, using the single-select button, and multiple languages can be enabled in the app. Select a language and begin translating the fields to the associated text fields in the app. The areas that will need to be translated include Buttons, InviteLabels, FollowUpLabels, InformationLabels, DateTimeLabels, ConfirmationLabels, BookingErrors, Titles, and Descriptions. Once a text field has been updated, the language you have made the change will show a warning indicator letting admin users know that a field(s) have been changed. The other enabled languages will also show the number of fields that were changed, in case they need to be updated according to your changes.\n                       \n\n\n\n\n\n\n                        Add Questionnaire\n                       \n\n                        New questionnaires can be added by selecting the\n                        \n                         Add a New Form Builder DataSet\n                        \n                        button on the screen; from here you’ll be able to select an output DataSet from your Form Builder app that contains the questionnaire you want included in the app.\n                        \n\n\n\n\n\n\n                        Once you’ve selected a DataSet, you’ll be able to preview what the questionnaire will look like to end-users in the Scheduler app.\n                        \n\n\n\n\n\n\n\n\n\n\n                        Customize Settings\n                       \n\n                        Customize the way the app appears to end-users in the Scheduler app including adding a logo, customizing the color palette, and editing the app name.\n                       \n\n                        Upload a new logo to be displayed in the app by selecting the ‘Upload’ button in the Add/Edit Logo section. Customize the color palette by selecting a primary and secondary color and primary and secondary font color; you’ll see a preview of the colors. Add or edit the app name that’s displayed throughout the app as well.\n                       \n\n\n\n\n\n\n                        Other Settings\n                       \n\n                        Enable the address auto-complete functionality in the Scheduler in the ‘Other Settings’ tab. In order for this to be enabled, you will need to have a Mapbox token. Copy and paste your token into the text box, this feature will allow users to show suggestions when entering their address and allow them to select an option to autocomplete the additional address fields.\n                       \n\n\n\n\n                        Using the App\n                       \n\n                        Once you’ve gone through the Admin set-up, you should now be able to allow end-users to schedule appointments either in Domo or using private embed.", "Preview Article": "Click here to preview", "URL Name": "1500009323241", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004124", "Archived Date": "", "Language": "English", "Primary Version": "Scheduler Implementation Guide", "Article Total View Count": "4,740", "": "", "Article Created Date": "10/24/2022, 9:23 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Scheduler Implementation Guide\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}