{"file_path": "../../raw_kb_v2\\article\\360056655374\\index.html", "content": {"Title": "Facilities Management", "Article Body": "Intro\n                       \n\n                        This guide provides an overview of the Facilities Management App. In addition, it contains recommendations on best practices and tutorials for getting started.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This app is part of the\n                             \n                              Get Back to Work Solution\n                             \n                             and is available\n                             \n                              on-demand and paid\n                             \n                             .\n                            \n\n\n\n\n                            To request this feature be enabled,\n                           \n\n\n\n                              Reach out to your Domo Customer Success Manager or Account Executive.\n                             \n\n\n\n\n                               If you do not have contact information for your CSM or AE, contact Domo Support. For information on how to contact Support, please see:\n                               \n                                Getting Help\n                               \n\n\n\n\n\n\n\n\n\n                        Prerequisites\n                       \n\n                        Before you can start using the Facility Management application to its fullest extent, you must first add the\n                        \n                         _FacilitiesAdmin_\n                        \n                        group to your Domo instance. Members of the\n                        \n                         _FacilitiesAdmin_\n                        \n                        group have additional features available to them in the application, such as creating notifications, locations, tasks, and teams.\n                       \n\n                        Facility administrators\n                       \n\n                        Facility administrators are Domo users who are members of the\n                        \n                         _FacilitiesAdmin_\n                        \n                        group. If you are not a facility administrator, continue to the\n                        \n                         Facility workers\n                        \n                        section.\n                       \n\n                        Getting started\n                       \n\n                        In this section, we'll be going over a few key basics of the Facility Management application. Including adding new teams, adding new locations, and adding new tasks. If you're the first and/or only Facility Administrator to use the application, your first time opening should look similar to the image below.\n                       \n\n                        Because no teams, locations, or tasks have been created, all of the daily stats in the\n                        \n                         Daily COVID-19 Defense Efforts\n                        \n                        section will be empty. In this section, we'll be going over creating each one of these items so you can see the status of each of your facilities.\n                       \n\n\n\n\n                        Adding new Teams\n                       \n\n                        Teams are groups managed inside your Domo instance. To create a new team from scratch, you must first add a new Domo group in the Admin Settings of your Domo instance. To learn how to add a group to Domo, see the documentation\n                        \n                         here\n                        \n                        .\n                       \n\n                        To create a new team:\n                       \n\n\n                         Click the\n                         \n                          Create New\n                         \n                         button on the home screen, or\n                        \n\n                         Open the menu by clicking the\n                         \n                         button in the top left corner and then clicking\n                         \n                          Create Team\n                         \n                         .\n                        \n\n\n                        This will take you to the\n                        \n                         New Team\n                        \n                        web form:\n                       \n\n\n\n\n                        Because no teams have been added, the\n                        \n                         Current Teams\n                        \n                        list is empty. To add a team, select it in the combo box titled\n                        \n                         Teams\n                        \n                        and then click\n                        \n                         Create Team\n                        \n                        . Those teams will now appear in the\n                        \n                         Current Teams\n                        \n                        list and the\n                        \n                         Manage Teams\n                        \n                        view (accessed via the\n                        \n                        menu).\n                       \n\n\n\n\n                        Adding new floor plans\n                       \n\n                        Before you can add individual locations to your facilities, you must first add a floor plan. Floor plans are typically a single floor of a single building, but you can configure them to your liking.\n                       \n\n                        As an example: if your facility is a single building that has a single floor, your floor plan could be the entire building. Subsequent locations could be a conference room, a common area, or a specific employee's workspace.\n                       \n\n                        To add a floor plan, open the\n                        \n                        menu and click\n                        \n                         Add New Floor Plan\n                        \n                        . This will take you to the\n                        \n                         New Floor Plan\n                        \n                        web form:\n                       \n\n\n\n\n                        Once on this screen, follow these steps to create a floor plan:\n                       \n\n\n                         Define the type of floor plan by choosing an option in the combo box titled\n                         \n                          What type of floor plan is this?\n                         \n                         (e.g. campus, building, etc.) The options in this combo box are determined by the locations DataSet used by many applications in the\n                         \n                          Get Back To Work Solution\n                         \n                         .\n                        \n\n                         Once you've selected a type for your floor plan, a new set of combo boxes will appear. These help specify exactly which part of your campus or facility this floor plan is located.\n                         \n\n\n\n\n                         Starting from the top, select the location of the floor plan associated with each of the fields listed. Depending on which\n                         \n                          type\n                         \n                         you selected in the first step, you may see fewer/additional combo boxes appear.\n                         \n\n                         As an example: if you're creating a floor plan for\n                         \n                          Floor 1\n                         \n                         of\n                         \n                          Building 808\n                         \n                         , which is located in\n                         \n                          American Fork, Utah\n                         \n                         the combo boxes would be filled like this:\n                         \n\n\n\n\n\n                         Once you've filled in all visible combo boxes, upload the image of your floor plan. SVG and image file types are supported; SVG files may offer a more feature-rich experience (which we'll see when adding locations.)\n                         \n\n\n\n\n\n                         Once you've uploaded the floor plan image, click the\n                         \n                          Create Floor Plan\n                         \n                         button to complete the process.\n                        \n\n\n                        Adding new locations\n                       \n\n                        After adding a floor plan for your facility, you may now add new locations. You'll be automatically redirected to the\n                        \n                         New Locations\n                        \n                        view after creating a floor plan, or you can manually navigate there by opening the\n                        \n                        menu and clicking\n                        \n                         Create Location\n                        \n                        .\n                       \n\n\n\n\n                        To create a new location:\n                       \n\n\n                         Select a floor plan in the combo box labeled\n                         \n                          Select a floor plan...\n                         \n\n\n                         Select the type of location to be created. In most cases, this will be either the same as the type assigned to the floor plan or more specific.\n                         \n\n                         Ex: If the floor plan is assigned the type\n                         \n                          Floor\n                         \n                         the locations assigned to the floor plan should be more specific (\n                         \n                          Floor > Location\n                         \n                         ) or as specific (\n                         \n                          Floor\n                         \n                         ) as the type assigned to the selected floor plan.\n                         \n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             Types of locations assigned to the floor plan should never be\n                             \n                              less\n                             \n                             specific than the type floor plan.\n                            \n\n\n\n\n                         Once you've selected the floor plan and the type for the new location(s), the list of available locations will be populated with the distinct options from the locations DataSet and the floor plan image will appear below the list.\n                         \n\n\n\n\n\n                         Select the desired locations in the list titled\n                         \n                          Locations on this floor\n                         \n                         on the left and then click the\n                         \n                          >\n                         \n                         or\n                         \n                          >>\n                         \n                         button to move them to the\n                         \n                          Locations assigned to this floor plan\n                         \n                         list on the right.\n                        \n\n                         If your floor plan is an SVG file, you may select different locations on the floor plan to associate with the location. To do this, select the location in the\n                         \n                          Locations assigned to this floor plan\n                         \n                         and then click the part of the SVG you'd like to associate with that location.\n                         \n\n\n\n\n\n                         Click\n                         \n                          Create Locations\n                         \n                         to complete the process; this will redirect you to the\n                         \n                          Locations\n                         \n                         view where you can see each location and any tasks assigned to it.\n                        \n\n\n                        Tasks\n                       \n\n                        Now that you've added some teams and locations, you can now create tasks. Tasks are the lifeblood of the Facility Management application; they determine which areas are clean and which areas need additional attention. They also provide the basis for determining the stats on the home screen. Each task is associated with a\n                        \n                         L\n                        \n\n                         ocation\n                        \n                        and a\n                        \n                         Team\n                        \n                        . Each team member assigned to a task will see it on their schedule/home screen.\n                       \n\n                        To create a new task:\n                       \n\n\n                         Click\n                         \n                          Create New\n                         \n                         on the home screen, or\n                        \n\n                         Open the application menu and click\n                         \n                          Create Task\n                         \n                         .\n                        \n\n\n                        This will open the\n                        \n                         New Task\n                        \n                        web form:\n                       \n\n\n\n\n                        Task details\n                       \n\n                        Every task must be assigned a\n                        \n                         Title\n                        \n                        ,\n                        \n                         L\n                        \n\n                         ocation\n                        \n                        ,\n                        \n                         T\n                        \n\n                         eam\n                        \n                        , and a level of\n                        \n                         Estimated Work\n                        \n                        (estimated number of minutes to complete the task.)\n                       \n\n\n\n\n                        Task schedule\n                       \n\n                        Every task must also be assigned a schedule. The default schedule is for each task to be completed once a day on weekdays.\n                       \n\n                        Schedules can be assigned the following types:\n                       \n\n\n\n                          One Time\n                         \n                         - Task will only be scheduled once.\n                        \n\n\n                          Daily\n                         \n                         - Completed once per scheduled day.\n                        \n\n\n                          Weekly\n                         \n                         - Completed once per scheduled week on the scheduled day.\n                        \n\n\n                          Custom Interval\n                         \n                         - Completed on a custom daily or hourly time interval.\n                        \n\n\n                        One Time\n                       \n\n                        To schedule a one time task:\n                       \n\n\n                         Select the\n                         \n                          One Time\n                         \n                         schedule type.\n                        \n\n                         In the date-time input titled\n                         \n                          Complete Task By\n                         \n                         , select the date and time to use as the tasks due date.\n                        \n\n\n\n\n\n                        Daily\n                       \n\n                        To schedule a daily task:\n                       \n\n\n                         Select the\n                         \n                          Daily\n                         \n                         schedule type.\n                        \n\n                         Select the days on which the task should be completed.\n                        \n\n                         Select the start and end times for the task; if the start and end times are the same, the task can be completed at any time on the scheduled days.\n                        \n\n\n\n\n\n                        Weekly\n                       \n\n                        To schedule a weekly Task:\n                       \n\n\n                         Select the\n                         \n                          Weekly\n                         \n                         schedule type.\n                        \n\n                         Select the day of the week on which the task should be completed.\n                        \n\n                         Select the start and end times for the task; if the start and end times are the same, the task can be completed at any time on the scheduled day.\n                        \n\n\n\n\n\n                        Custom Interval\n                       \n\n                        To schedule a task on a custom interval:\n                       \n\n\n                         Select the\n                         \n                          Custom Interval\n                         \n                         schedule type.\n                        \n\n                         Select the days on which the task should be completed.\n                        \n\n                         Select the start and end times for the task; if the start and end times are the same, the task can be completed at any time on the scheduled day.\n                        \n\n                         Select the interval for the task, available interval types are\n                         \n                          Days\n                         \n                         and\n                         \n                          Hours\n                         \n                         .\n                         \n\n                         Ex 1:\n                         \n\n                         Complete every\n                         \n                          10 Days\n                         \n\n                         Ex 2: Complete every\n                         \n                          36 Hours\n                         \n\n\n\n\n\n\n                        Notifications\n                       \n\n                        Notifications can be created and scheduled to notify workers of different events, such as a daily reminder for workers to wash their hands or pick up new personal protective equipment.\n                       \n\n                        To create a new notification open the application menu and click\n                        \n                         Create Notification\n                        \n                        . This will open the\n                        \n                         New Notification\n                        \n                        web form:\n                       \n\n\n\n\n                        Every notification must be assigned a\n                        \n                         Subject\n                        \n                        ,\n                        \n                         Frequency\n                        \n                        ,\n                        \n                         Category\n                        \n                        , and\n                        \n                         Scope\n                        \n                        . Optionally, you may add\n                        \n                         Content\n                        \n                        to the body of the notification.\n                       \n\n\n\n                          Subject\n                         \n                         - Similar to the subject line of an email or the headline of a news article, the\n                         \n                          Subject\n                         \n                         is a summary of the notification.\n                        \n\n\n                          Frequency\n                         \n                         - The\n                         \n                          Frequency\n                         \n                         of a notification is similar to the schedule of a Task, it defines when and how often a notification is sent.\n                        \n\n\n                          Category\n                         \n                         - Defines the type of notification to be sent. The available categories are:\n                         \n                          Info\n                         \n                         ,\n                         \n                          Alert\n                         \n                         ,\n                         \n                          Weather\n                         \n                         ,\n                         \n                          Danger\n                         \n                         , and\n                         \n                          Biohazard\n                         \n                         .\n                        \n\n\n                          Scope\n                         \n                         - Defines who should see the notification, this can be\n                         \n                          C\n                         \n\n                          ompany Wide\n                         \n                         or a list of specific teams.\n                        \n\n\n                        Frequency Types\n                       \n\n                        Notifications may be assigned one of the following frequency types:\n                       \n\n\n\n                          Daily\n                         \n                         - The notification is sent a user-specified number of times per day.\n                         \n\n                           If the\n                           \n                            Daily Rate\n                           \n                           is set to\n                           \n                            1\n                           \n                           , the notification will be sent at the time specified in the\n                           \n                            Send At\n                           \n                           time selector.\n                          \n\n                           If the\n                           \n                            Daily Rate\n                           \n                           is higher than\n                           \n                            1\n                           \n                           , the notifications will be sent between the times selected in the\n                           \n                            Start Time\n                           \n                           and\n                           \n                            En\n                           \n\n                            d Time\n                           \n                           time selectors.\n                          \n\n\n\n\n                          Weekly\n                         \n                         - The notification is sent once at the beginning of each week.\n                        \n\n\n                          Monthly\n                         \n                         - The notification is sent once at the beginning of each month.\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Notification definitions created by the app are consumed by a DataFlow which runs on a daily basis to create new notifications for each user. If you create a notification on Wednesday at 9:00 AM, the notification will\n                            \n                             not\n                            \n                            be sent until the following day or until the DataFlow is triggered manually.\n                           \n\n\n\n\n\n                        Scope\n                       \n\n                        The Scope determines who the notification is sent to. The\n                        \n                         Scope\n                        \n                        can be\n                        \n                         Company Wide\n                        \n                        or a list of a\n                        \n                         Teams\n                        \n                        .\n                       \n\n                        When a notification's Scope is\n                        \n                         Company Wide\n                        \n                        no recipients are assigned. Anyone who uses the\n                        \n                         Facilities Management\n                        \n                        application will see the notification.\n                       \n\n\n\n\n                        When a notification's Scope is based on a list of Recipient teams, all current members of those teams will see the notification. Only teams that have been added (via\n                        \n                         Create Team\n                        \n                        ) to the application are available as options in the\n                        \n                         Recipients\n                        \n                        combo box.\n                       \n\n\n\n\n                        Display mode\n                       \n\n                        Display mode is, at its core, a\n                        \n                         location\n                        \n                        status snapshot. To activate display mode, open the application menu and click\n                        \n                         Enter Display Mode\n                        \n                        . You will be prompted to select a location and then enter your facility administrator password.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Your facility administrator password is created and managed within the app, it is\n                            \n                             not\n                            \n                            your Domo password. The only purpose of this password is to ensure the display mode is not inadvertently unlocked and changed.\n                           \n\n\n\n\n\n                        To exit display mode, click the close button on the top right-hand corner of the screen and enter your facility administrator password.\n                       \n\n                        We will cover additional information about display mode in the\n                        \n                         Facility workers\n                        \n                        section of this documentation.\n                       \n\n                        Current schedule\n                       \n\n                        The home screen (labeled as\n                        \n                         Current Schedule\n                        \n                        in the application menu) provides you with a concise overview of your facilities. On first use, the schedule will be mostly empty, as it uses the Tasks, Teams, and Locations you create to populate its various stats and indicators.\n                       \n\n                        Defense Efforts\n                       \n\n                        The\n                        \n                         Daily COVID-19 Defense Efforts\n                        \n                        portion of the schedule provides you with a brief summary of your facility, its open Tasks, and level of effort. As an administrator, you have access to view all Teams, Tasks, and Locations. Subsequently, all data in this section will include all Teams, Tasks, and Locations.\n                       \n\n\n\n\n\n\n                          Today's Prevention\n                         \n                         - The percentage of Tasks that have been completed.\n                        \n\n\n                          Estimated Time Commitment\n                         \n                         - The overall amount of time needed to complete all open Tasks.\n                        \n\n\n                          Tasks\n                         \n                         - The total number of Tasks created and assigned in the application.\n                        \n\n\n                          Teams\n                         \n                         - The total number of Teams added to the application.\n                        \n\n\n                        Improvement Opportunities\n                       \n\n                        The\n                        \n                         Improvement Opportunities\n                        \n                        section of your schedule provides sub-views that provide a more detailed summary of each of your Teams, Tasks, and Locations.\n                       \n\n                        Locations\n                       \n\n                        Under the\n                        \n                         Locations\n                        \n                        tab of improvement opportunities, you'll see a list of all your locations. Each item in the list is labeled with the name of all geographic levels associated with the location. On the left-hand side of the list is the row number, mainly for reference. On the right-hand side of the list is the status of the location (i.e. the percentage of completed Tasks assigned to that location.)\n                       \n\n\n\n\n                        Tasks\n                       \n\n                        Under the\n                        \n                         Tasks\n                        \n                        tab of Improvement Opportunities is a list of Locations and all Tasks assigned to that Location. The header of each list item displays some basic information about that location such as: the Location Name, the Level of Effort to complete all open Tasks in that location, and the percentage of completed Tasks in that location. If a Location has not been assigned any Tasks, the percentage will always display\n                        \n                         100%\n                        \n                        .\n                       \n\n                        You can expand each list item to see all Tasks assigned to that Location. Each Task also shows the next due-date and its completion status. If the Task is not complete, you may click\n                        \n                         Mark as Complete\n                        \n                        to complete the Task and update the schedule view.\n                       \n\n\n\n\n                        Teams\n                       \n\n                        The\n                        \n                         Teams\n                        \n                        tab of improvement opportunities shows a list of all Teams added to the application and the number of Tasks to which that Team is assigned. Clicking on a Team in the list will redirect you to the details view for that Team. You can also access the Team details by opening the application menu, clicking\n                        \n                         Manage Teams\n                        \n                        , then clicking\n                        \n                         View Team\n                        \n                        for the Team you'd like to view.\n                       \n\n\n\n\n                        The Team details view lists all members of the Team and the number of Tasks assigned to all users in that Team. If a user is assigned to more than one Team, their workload may vary from other Team members.\n                       \n\n\n\n\n                        Facility workers\n                       \n\n                        Current schedule\n                       \n\n                        Your\n                        \n                         Current Schedule\n                        \n                        gives you a summary of your daily progress and a breakdown of all Tasks to which you and your Teams are assigned. You can see your Teams' current progress under\n                        \n                         Daily COVID-19 Defense Efforts\n                        \n                        as a percentage of Tasks completed titled\n                        \n                         Today's Prevention\n                        \n                        . The estimated amount of time needed to complete all open Tasks is labeled\n                        \n                         Estimated Time Commitment\n                        \n                        .\n                       \n\n                        On the bottom portion of the screen you will see all Locations and Tasks to which you and your Teams have been assigned, as well as the estimated time commitment for each location's open Tasks and the current progress of that Location. To view individual Tasks at that Location, click the expand arrow on the right-hand side of the location entry.\n                       \n\n                        Here you will see the name of each Task, the next due date for that Task, and its completion status. If the Task has\n                        \n                         not\n                        \n                        been completed, you can click\n                        \n                         Mark as Complete\n                        \n                        to complete the Task and update the schedule view.\n                       \n\n\n\n\n                        View locations\n                       \n\n                        To view a specific floor plan and/or Location, open the application menu by clicking the\n                        \n                        button in the top left corner and then click\n                        \n                         View Locations\n                        \n                        . Here, you will see the image representation for each floor plan and each Location assigned to the floor plan. If the selected floor plan was uploaded as an SVG file, you may see portions of the image highlighted in green. Highlighted portions of the SVG image are associated with individual Locations.\n                       \n\n                        Below the floor plan image are three KPIs:\n                        \n                         On Schedule\n                        \n                        ,\n                        \n                         Dirty\n                        \n                        , and\n                        \n                         Clean\n                        \n\n\n\n\n                          On Schedule\n                         \n                         - The number of Locations on the selected floor plan that do not have any overdue tasks.\n                        \n\n\n                          Dirty\n                         \n                         - The number of Locations on the selected floor plan that have overdue tasks.\n                        \n\n\n                          Clean\n                         \n                         - The number of Locations on the selected floor plan which don't have any open tasks.\n                        \n\n\n\n\n\n                        To view a different floor plan, change the selection in the\n                        \n                         Floor Plans\n                        \n                        combo box.\n                       \n\n\n\n\n                        Similar to the schedule view, you will be provided a list of Locations and all Tasks assigned to that Location. You may complete Tasks by expanding the list entry for a Location and clicking\n                        \n                         Mark as Complete\n                        \n                        .\n                       \n\n\n\n\n                        Display mode\n                       \n\n\n                         Display Mode\n                        \n                        will be activated by your administrator at a physical location. It offers some information about each Location and a summary of the Location's status.\n                       \n\n\n                         Display Mode\n                        \n                        shows the following information for each Location:\n                       \n\n\n                         The Location's name.\n                        \n\n                         The Location's assigned ID that can be used in the\n                         \n                          Scan Location\n                         \n                         view if a camera is not available.\n                        \n\n                         The current status of the Location.\n                        \n\n                         The date/time of the last service and, if completed, the name of the worker who completed the service.\n                        \n\n                         The date/time of the next service.\n                        \n\n                         A number of report problems.\n                        \n\n                         A QR code to quickly access the Location.\n                        \n\n\n\n\n\n                        Scan location\n                       \n\n                        The\n                        \n                         Scan Location\n                        \n                        view offers a quick way to navigate to a specific Location. If you're accessing the application on a device that has a camera, the application will request access to your device's camera. If your device does not have a camera, or you decline the request to access it, you can still use the\n                        \n                         Scan Location\n                        \n                        view. Instead of a QR scanner, you will be provided with a Location selector.\n                       \n\n\n\n\n                        Notifications\n                       \n\n                        Your Facility Administrators can schedule notifications to send out additional information or reminders. Notifications are displayed at the top of the screen and will require attention before continued use of the application is allowed.", "Preview Article": "Click here to preview", "URL Name": "360056655374", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004134", "Archived Date": "", "Language": "English", "Primary Version": "Facilities Management", "Article Total View Count": "4,702", "": "", "Article Created Date": "10/24/2022, 9:24 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Facilities Management\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}