{"file_path": "../../raw_kb_v2\\article\\360043428933\\index.html", "content": {"title": "\n\n\n Available Maps\n\n\n", "article_body": "\n\n\n In Domo, maps are used to represent numerical data across two or more regions. Maps are accompanied by legends so you can determine the range for each state or country. Various color themes are available for maps; you can change the existing color theme. For more information, see\n\n\n Chart Properties\n\n\n .\n\n*Video - Map Charts**\n\nThe following table lists the types of Maps available in Domo. You can click a thumbnail image to see a larger image.\n\n\n|\n Map Type\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Country map\n\n\n |\n Represents data for states, provinces, subdivisions, and prefectures in any of a number of different countries. Regions in a country may be represented using two-letter abbreviations, full names, or both, depending on the country.\n\n\n For more information, see\n\nCountry Map\n\n.\n  |\n\n|\n|\n Continental or regional map\n  |\n Represents data for countries within a specific continent or region. Countries in a continent or region may be represented using two-letter ISO 3166-1-alpha-2 codes or full names.\n\n\n For more information, see\n\nContinental/Regional Map\n\n.\n  |\n\n|\n|\n World map\n\n|\n Represents data for world nations. Nations in your DataSet are represented using ISO 3166-1-alpha-2 codes. For a current list of countries and their corresponding codes, see\n\ncountry codes\n\n.\n\n\n For more information, see\n\nWorld Map\n\n.\n  |\n\n|\n|\n Latitude-longitude map\n\n|\n Displays data for any region in the world using latitude and longitude coordinates. The region that displays for a DataSet is \"zoomed\" depending on the given coordinates. For example, if all of the cities in your DataSet were in Germany, the resulting map would show Germany; likewise, if some cities in the DataSet were in Germany and others were in France, the map would be \"zoomed out\" to show western Europe. Filters you apply to a latitude/longitude map also work this way. For example, if you were in the\n **Details**\n view for a map of the United States and you used Analyzer to show only cities in Washington and California, your map would be updated to show the westmost region of the United States. For more information about applying filters, see\n\nAdding Filters to Your Chart\n\n.\n\n\n For more information about latitude/longitude maps, see\n\nLatitude-Longitude Map\n\n.\n  |\n\n|\n|\n Latitude-longitude route map\n\n|\n A latitude-longitude map in which coordinate points are connected using lines. Two value columns are required; one of these is applied to the start point of a given route line and the other is applied to the end point. In the map, differences in the values of start and end points are represented by the thickness of the lines. In the example at right, all of the start points are set to 0 and the end points are set to the value of the product being shipped. In this way the viewer can see where their most valuable customers are located by looking at the thickness of the lines.\n\nIn other respects, a latitude-longitude route map is the same as a latitude-longitude map. The provided coordinates and applied filters determine the \"zoom\" level of the map. You can also have multiple distinct routes by uploading an optional series column. For example, in the screenshot there are three distinct routes, one colored orange, one colored green, and one colored blue.\n\n\n For more information about latitude-longitude route maps, see\n\nLatitude-Longitude Route Map\n\n.\n  |\n\n|\n|\n U.S. county map\n\n|\n A U.S. county map shows data for U.S. counties at the country level. This type of map requires only two data columns—one with values and the other with county FIPS codes.\n\n\n For more information about U.S. county maps, see\n\nU.S. County Map\n\n.\n  |\n\n|\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428933\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004732\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAvailable Maps\n\n", "article_total_view_count": "\n\n\n 5,146\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:27 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "available_maps", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}