{"file_path": "../../raw_kb_v2\\article\\7797499784343\\index.html", "content": {"Title": "URL Parameters for Embedded Content", "Article Body": "Intro\n                       \n\n                        Domo Everywhere supports three types of URL parameters in embedded content:\n                       \n\n\n                         Transparent Backgrounds\n                        \n\n                         Pfilters\n                        \n\n                         AppData\n                        \n\n\n                        Transparent Backgrounds\n                       \n\n                        Users can customize their dashboard background color or image to match their organization's branding. With this URL parameter, the transparent background can make embedded content seem even more native to the host page.\n                       \n\n\n                         Video: Adding Background Images in Domo Stories\n                        \n\n\n\n\n\n\n\n\n                        In the example below, the embedded dashboard's background and the host page is black and the URL parameter is set to \"true\".\n                       \n\n                        http://\n                        \n                         <domain>\n                        \n                        .\n                        \n                         domo.com/embed/pages/aOWnr\n                        \n\n                         ?transparentBackground=true\n                        \n\n\n\n\n\n\n\n                        In the example below, the same embedded dashboard's background transparency is set to \"false\".\n                       \n\n                        http://\n                        \n                         <domain>\n                        \n                        .\n                        \n                         domo.com/embed/pages/abcdef\n                        \n\n                         ?transparentBackground=false)\n                        \n\n\n\n\n\n\n\n\n\n                        Pfilters\n                       \n\n\n                         Pfilters are used to push filters from an external control into embedded content. With pfilters, n\n                        \n                        on-sensitive data can be passed into apps.\n                       \n\n                        Pfilters can be created and persisted automatically when embedded content links to other embedded content while maintaining previously clicked items. This auto-creation of pfilters is activated by checking the\n                        \n                         Persist filters\n                        \n                        box.\n                       \n\n\n\n\n                        Example:\n                       \n\n\nexample.domo.com/embed/pages/abcde?pfilters=[{\"column\":\"Role\",\"operand\":\"IN\",\"values\":[\"Director\",\"Manager\"],},{\"column\":\"Team\",\"operand\":\"IN\",\"values\":[\"Sales\",\"Marketing\"],}]\n\n\n\n                        More examples of URL parameter filters can be found in\n                        \n                         Using Pfilters to Apply Filters from URL Query Parameters to Embedded Dashboards.\n                        \n\n\n\n\n                        AppData\n                       \n\n                        The appData parameter supports passing in general types of inputs to the app. App developers specify the parameter, parse the value, and inject it into the most relevant part of the app.\n                        \n\n\n\n\n\n                        For example, the value of the parameter could then auto-populate a drop-down menu in an app that selects the location. This way, the host page can avoid the delay of waiting for manual inputs. They can now deep-link to a version of the app that already has specific values filled in.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Spaces should encoded as \"+\".\n                          \n\n\n\n\n\n\n\n                         <domain>\n                        \n                        .\n                        \n                         domo.com/embed/pages/abcde\n                        \n\n                         ?appData=This+is+an+example\n                        \n\n\n\n\n                        The query parameters on the embed URL will then be automatically passed down into the apps contained by the embedded cards or dashboards.\n                       \n\n\n\n                        Example:\n                        \n                         xyz.domoapps.prod4.domo.com", "Preview Article": "Click here to preview", "URL Name": "7797499784343", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004233", "Archived Date": "", "Language": "English", "Primary Version": "URL Parameters for Embedded Content", "Article Total View Count": "2,511", "": "", "Article Created Date": "10/24/2022, 9:34 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              URL Parameters for Embedded Content\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}