{"file_path": "../../raw_kb_v2\\article\\360042929814\\index.html", "content": {"title": "\n\n\n LinkedIn Enterprise Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nLinkedIn is a business and employment-oriented service used for professional networking. To learn more about the LinkedIn API, visit their page (\n\nhttps://developer.linkedin.com/\n\n).\n\n\n You connect to your LinkedIn Enterprise account in the Data Center. This topic discusses the fields and menus that are specific to the LinkedIn Enterprise connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n**Important:**\n LinkedIn has announced that they are disabling version 1 of their API on May 1, 2019. This is the API used by the LinkedIn and LinkedIn Enterprise connectors. LinkedIn has released a new version of the API, which has been implemented in Domo as the connector LinkedIn V2. Due to the two versions being considerably different, there is no way to automatically migrate existing LinkedIn DataSets to the new LinkedIn V2 connector. You will need to create new DataSets using the LinkedIn V2 connector. If there are metrics or features that are not available in the new connector, please contact Domo Support as soon as possible so those features can be added to the new connector.\n\n\n These changes do not apply to DataSets using the LinkedIn Ads connector as it is already on the new API version.\n\n\n Prerequisites\n---------------\n\nTo connect to LinkedIn Enterprise, you will need the following:\n\n The Client ID and Client Secret from your LinkedIn app. The steps for obtaining these credentials are provided below.\n* The username and password for the LinkedIn account you want to connect through. The account owner\n *must*\n be an administrator of your company's LinkedIn page.\n\nTo obtain the client ID and client secret, you must first create an app via LinkedIn's Developer Portal. You can then retrieve the Client ID and Client Secret.\n\n\n**To create an app in the Developer Portal,**\n\n. Using your LinkedIn account, log into the Developer Portal at\n\nhttps://developer.linkedin.com/.\n2. Click on\n **My Apps**\n then select\n **Create Application**\n .\n3. Give the app a descriptive name such as \"Linkedin Connection.\"\n4. Enter your own website URL.\n5. Fill in the remaining required fields.\n6. Click\n **Submit**\n .\n\n\n Now that the app is created, it must be configured.\n7. Click\n **Authentication**\n in the left side menu.\n8. Under the OAuth 2.0 section, add the following Authorized Redirect URLs:\n\n* https://oauth.dev.domo.com/api/data/...prise/exchange\n\t* https://oauth.domo.com/api/data/v1/o...prise/exchange\n9. Click\n **Update**\n .\n10. Copy the Client ID and Client Secret at the top of the page.\n\nConnecting to Your LinkedIn Enterprise Account\n------------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the LinkedIn Enterprise Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nIn the\n **Credentials**\n pane, you are first asked to enter the client ID and client secret for your LinkedIn Enterprise account. After you click\n **Connect**\n , you are prompted to open the LinkedIn OAuth screen where you can enter your LinkedIn Enterprise credentials. Once you have entered valid LinkedIn Enterprise credentials, you can use the same account any time you go to create a new LinkedIn Enterprise DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are currently logged into your personal LinkedIn account, you will need to sign out of LinkedIn before authorizing the Domo LinkedIn Connector for your company's LinkedIn account. If you do not sign out of your personal LinkedIn account, you will see an authorization window appear and disappear without prompting you to authenticate the LinkedIn account you wish to use.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the LinkedIn Enterprise report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Company Comparison\n  |\n Returns data for one or more given companies. You can use this data to compare employee count, followers, etc.\n  |\n|\n Company Follower Statistics - Breakdown\n  |\n Returns statistics about a given company's total followers, which can be broken down by various metrics such as industry, seniority, company size, month, etc.\n  |\n|\n Company Follow Statistics - Historical\n  |\n Returns a daily breakdown of company follower statistics for a specific date or date range.\n  |\n|\n Company Follow Statistics - Overview\n  |\n Returns an overview of followers for a given company.\n  |\n|\n Company Update Statistics\n  |\n Returns share statistics (clicks, shares, and likes) for a given company, broken down by month.\n  |\n|\n Company Update Statistics - Historical\n  |\n Returns share statistics (clicks, shares, and likes) for a given company for a specific date or date range.\n  |\n|\n Company Update Posts\n  |\n Returns information about the latest update posts for a given company.\n  |\n|\n Company Update Post Comments\n  |\n Returns all comments for the latest update posts for a given company.\n  |\n\n|\n|\n Follow Stats Breakdown\n  |\n Select whether you want your report to be broken down by company size, country, function, industry, monthly count, region, or seniority.\n  |\n|\n Company ID\n  |\n Select the ID of the company you want to retrieve information for.\n  |\n|\n Company IDs\n  |\n Enter a comma-separated list of the IDs for all companies you want to compare for the \"Company Comparison\" report.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Update Key (Optional)\n  |\n Enter the update key for your report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How often can the data be updated?\n\nDataSets should be set to update once a day.\n\n####\n Are there any API limits I should be aware of?\n\nLinkedIn limits how many calls can be made per day by each user and by Domo as a whole. The exact number of calls is different for each report in the connector. It is recommended that you not run your DataSets more often than you need to. Generally speaking, once per day will get you the data you need and will not take available calls away from other users.\n\n####\n Do I need a certain kind of account to use this connector?\n\nYes. The owner of the LinkedIn account must be an administrator on your company's page.\n\n####\n Can I get details about company pages as well as personal pages through this connector?\n\nThis connector can only return details about company pages. The authenticated user must be an administrator for the company page he/she is trying to query.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929814\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003472\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nLinkedIn Enterprise Connector\n\n", "article_total_view_count": "\n\n\n 4,659\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "linkedin_enterprise_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}