{"file_path": "../../raw_kb_v2\\article\\360042925914\\index.html", "content": {"Title": "Moving Tasks Through a Project Workflow", "Article Body": "In the details page for a project, you can quickly and easily move tasks between workflow task lists. For example, you might put in the \"To Do\" list tasks that you have just conceived or that are still in the planning stages. Then, when work begins on those tasks, you would move them into the \"Working On\" list to indicate that work is underway on those tasks. Finally, when work has been finished on the tasks, you would move them into the \"Completed\" list.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                          Note:\n                         \n                         Tasks in the \"To Do\" and \"Working On\" lists (and any new lists you create based on the \"To-Do\" and \"In Progress\" types) count towards the \"Open Tasks\" number for a project. Tasks in the \"Completed\" list (and any new lists you create based on the \"Completed\" type) count towards the \"Closed Tasks\" number for a project. For more information about creating new lists, see\n                         \n                          Adding a Task List to a Project\n                         \n                         .\n                        \n\n\n\n                         To move a task from one task list to another,\n                        \n\n\n\n\n                          Click and drag the task to the desired list.\n                          \n\n\n\n\n\n                        You can also change the position of tasks within a list. You do this the same way—by clicking a task and dragging it to the position you want within the list.", "Preview Article": "Click here to preview", "URL Name": "360042925914", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004364", "Archived Date": "", "Language": "English", "Primary Version": "Moving Tasks Through a Project Workflow", "Article Total View Count": "4,763", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Moving Tasks Through a Project Workflow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Projects And Tasks\n              \n", "url": "/s/topic/0TO5w000000Zao5GAC"}]}