{"file_path": "../../raw_kb_v2\\article\\360055244114\\index.html", "content": {"Title": "July 2020 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Card enhancements\n                       \n\n                        Polish your charts for great-looking Stories.\n                       \n\n                        Table Card\n                       \n\n                        Padding\n                       \n\n                        Give your tables a new clean look by adding custom padding to your tables. Now you control the look of your tables more than ever before. For more information, see\n                        \n                         Table Chart\n                        \n                        .\n                        \n\n\n\n\n\n\n\n                        Paging\n                       \n\n                        Handle larger tables than ever before with dynamic paging of rows of data in your Mega Table Cards.\n                       \n\n                        Copy\n                       \n\n                        Copy has been added to your Mega Tables for easy movement of data by using copy and paste.\n                       \n\n                        Multi-Value Gauge\n                       \n\n                        Now you have more customizable options to enhance the look of the text on your chart. Choose between new Bold and Italics options. For more information, see\n                        \n                         Multi-Value Gauge\n                        \n                        .\n                        \n\n\n\n\n\n\n\n\n\n\n                        Map Card\n                       \n\n                        New options to make your maps pop including: border options, min and max value scales, and allow three bigger sizes on bubbles in your Lat/Long maps to really make a compelling data story. Emphasize the bigger numbers in a bold new way. For more information, see\n                        \n                         Latitude-Longitude Map\n                        \n                        .\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Card data point limit increase\n                       \n\n                        Now you have the power to render very large amounts of data in your charts. You can now use the\n                        \n                         Limit Rows\n                        \n                        command inside of the Analyzer to set values larger than would otherwise be possible. To keep the responsiveness fast on your Dashboards, the chart engine limits the number of rows it downloads to the browser. Now you can override these limits by explicitly setting these values. For more information, see\n                        \n                         Card Building FAQs\n                        \n                        .\n                        \n\n\n\n\n                        Control messages\n                       \n\n                        Control the messages your users see in charts when the \"No data in filtered range\" message is called for. Set your own personalized message instead.\n                        \n\n\n\n\n\n\n\n                        Updated Radial Gauges\n                       \n\n                        New Radial Gauge with options to set the look you want including:\n                       \n\n\n                         Gauge width\n                        \n\n                         Ticks (major and minor)\n                        \n\n                         Degrees of display\n                        \n\n                         Needle look\n                        \n\n                         Colors\n                         \n\n                         For more information, see\n                         \n                          Radial Gauge\n                         \n                         .\n                         \n\n\n\n\n\n                        Dashboard Save As options\n                       \n\n                        New\n                        \n                         Duplicate all Cards\n                        \n                        option when you choose\n                        \n                         Save As\n                        \n                        on a Dashboard. Saves time when creating new versions of a Dashboard as it allows you to easily reference original Cards without creating copies. Uncheck the box to use the original Cards. For more information, see\n                        \n                         Duplicating Dashboards (\"Save As\")\n                        \n                        .\n                        \n\n\n\n\n                        Group Management\n                       \n\n                        Improved Group Management to give better oversight, simpler management, and integrate with enterprise systems (such as Active Directory). For more information, see\n                        \n                         Group Management\n                        \n                        .\n                        \n\n\n\n\n                        Beast Mode Manager\n                       \n\n                        With Beast Mode Manager, you can now see all of your Beast Modes in one place. You can also perform bulk actions, see what Beast Modes are not being used, and lock Beast Modes from being edited. For more information, see\n                        \n                         Beast Mode Manager\n                        \n                        .\n                        \n\n\n\n\n                        Getting help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n                        in the top navigation bar.\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://domo.com/university/\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n                         More\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360055244114", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004420", "Archived Date": "", "Language": "English", "Primary Version": "July 2020 Release Notes", "Article Total View Count": "11,616", "": "", "Article Created Date": "10/24/2022, 10:08 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              July 2020 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}