{"file_path": "../../raw_kb_v2\\article\\360042929054\\index.html", "content": {"Title": "RemedyForce Connector", "Article Body": "Intro\n                       \n\n                        BMC RemedyForce, built on Salesforce App Cloud, enables you to deliver high-speed service management that empowers users and accelerates the business, with minimal capital investment. To learn more about the RemedyForce API, visit their page (\n                        \n                         https://www.salesforce.com/developer/docs/api/\n                        \n                        ).\n                       \n\n                        You connect to your RemedyForce account in the Data Center. This topic discusses the fields and menus that are specific to the RemedyForce connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your RemedyForce account and create a DataSet, you must have a RemedyForce username and password. Your password is a combination of your SalesForce login password and security token.\n                       \n\n                        Connecting to Your RemedyForce Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the RemedyForce Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your RemedyForce account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            RemedyForce Environment\n                           \n\n\n\n                            Select the RemedyForce environment you want to pull data from.\n                           \n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter your RemedyForce username.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter your RemedyForce password.\n                           \n\n\n\n\n\n\n                         Once you have entered valid RemedyForce credentials, you can use the same account any time you go to create a new RemedyForce DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the RemedyForce report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Describe All Tabs\n                               \n\n\n\n                                Returns information about the tabs available to the authenticated user.\n                               \n\n\n\n\n\n                                Describe App Menu\n                               \n\n\n\n                                Returns metadata about items in the Salesforce1 navigation menu or dropdown app menu.\n                               \n\n\n\n\n\n                                Describe Approval Layout\n                               \n\n\n\n                                Returns information about the approval layout for a given object type.\n                               \n\n\n\n\n\n                                Describe Available Quick Actions\n                               \n\n\n\n                                Returns the list of actions whose parent (API version 28.0) or context (API version 29.0 and greater) entity name is supplied as well as standard and global actions.\n                               \n\n\n\n\n\n                                Describe Compact Layouts\n                               \n\n\n\n                                Returns information about the compact layout for a given object type.\n                               \n\n\n\n\n\n                                Describe Data Category Groups\n                               \n\n\n\n                                Returns the available category groups for the objects specified in the request.\n                               \n\n\n\n\n\n                                Describe Flexi Pages\n                               \n\n\n\n                                Returns metadata details about a set of Lightning Pages.\n                               \n\n\n\n\n\n                                Describe Global\n                               \n\n\n\n                                Returns list of available objects for your organization.\n                               \n\n\n\n\n\n                                Describe Global Theme\n                               \n\n\n\n                                Returns a list of available objects and theme information about those objects for your organization.\n                               \n\n\n\n\n\n                                Describe Knowledge Settings\n                               \n\n\n\n                                Returns the available Knowledge language settings.\n                               \n\n\n\n\n\n                                Describe Layout\n                               \n\n\n\n                                Returns information about the layout (presentation of data to users) for a given object type.\n                               \n\n\n\n\n\n                                Describe Primary Compact Layouts\n                               \n\n\n\n                                Returns information about the primary compact layout for the given object types.\n                               \n\n\n\n\n\n                                Describe Quick Actions\n                               \n\n\n\n                                Returns details for specified actions.\n                               \n\n\n\n\n\n                                Describe Search Layouts\n                               \n\n\n\n                                Returns search layout information for one or more objects.\n                               \n\n\n\n\n\n                                Describe Search Scope Order\n                               \n\n\n\n                                Returns an ordered list of objects in the default global search scope of a logged-in user.\n                               \n\n\n\n\n\n                                Describe S Objects\n                               \n\n\n\n                                Returns metadata for a given object or array of objects.\n                               \n\n\n\n\n\n                                Describe Softphone Layout\n                               \n\n\n\n                                Returns information about the layout of a SoftPhone.\n                               \n\n\n\n\n\n                                Describe Tabs\n                               \n\n\n\n                                Returns information about the standard and custom apps to which the logged-in user has access.\n                               \n\n\n\n\n\n                                Describe Theme\n                               \n\n\n\n                                Returns the current theme information for a given array of objects.\n                               \n\n\n\n\n\n                                Get User Info\n                               \n\n\n\n                                Returns personal information about the currently logged-in user.\n                               \n\n\n\n\n\n                                Query\n                               \n\n\n\n                                Returns data from an object.\n                               \n\n\n\n\n\n                                Search\n                               \n\n\n\n                                Returns records based on a search string.\n                               \n\n\n\n\n\n\n\n\n\n                            Search/Query Text\n                           \n\n\n\n                            Enter a search string to return records around that string.\n                           \n\n\n\n\n\n                            Quick Action Name\n                           \n\n\n\n                            Enter the Quick Action name you want to retrieve data for.\n                           \n\n\n\n\n\n                            Flexi Page Name\n                           \n\n\n\n                            Enter the name of the Flexi page you want to retrieve data for.\n                           \n\n\n\n\n\n                            App Menu Type\n                           \n\n\n\n                            Select the desired app menu type, either\n                            \n                             AppSwitcher\n                            \n                            or\n                            \n                             Salesforce1\n                            \n                            .\n                           \n\n\n\n\n\n                            S Object Type\n                           \n\n\n\n                            Select the S objece type you want to retrieve data for.\n                           \n\n\n\n\n\n                            S Object Fields\n                           \n\n\n\n                            Select the S object fields you want to retrieve data for.\n                           \n\n\n\n\n\n                            S Object Query (Optional)\n                           \n\n\n\n                            Automatically generated query from the selected discovery inputs.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042929054", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003557", "Archived Date": "", "Language": "English", "Primary Version": "RemedyForce Connector", "Article Total View Count": "2,367", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              RemedyForce Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}