{"file_path": "../../raw_kb_v2\\article\\4406041297943\\index.html", "content": {"Title": "Domo Goals Command Center", "Article Body": "Intro\n                       \n\n                        An extension of the Domo Goals experience, the Command Center takes advantage of the relationship between the data produced by the Goals tool and data and features in the core platform. The Command Center is comprised of a custom-configured templated set of Domo Dashboards for executives, front-line managers, employees, and program administrators to drive the program and provides data and resources such as:\n                       \n\n\n                         Participation by users.\n                        \n\n                         Completion and scores of Goals.\n                        \n\n                         Impact of selected Goals on key areas of the business.\n                        \n\n                         Summary Alert messages and Goals program help & Knowledge Base tools.\n                         \n\n\n\n\n\n\n\n                        Participation Dashboard\n                       \n\n                        This is a templatized Domo Dashboard that measures and presents summary data metrics to leaders and program administrators who own the Goals or OKR program to help them understand who is engaged. It combines the collected data from Domo Goals and employee data in Domo to supply information such as:\n                       \n\n\n                         Total percentage of the organization with active Goals in the system.\n                        \n\n                         Counts of Active Goals in the system.\n                        \n\n                         Stack-ranking participation breakdown by team.\n                        \n\n                         Counts of Goals broken down by department.\n                        \n\n                         Pacing of Goals created quarter over quarter.\n                        \n\n                         Access to lists of employees in the program who are missing Goals.\n                        \n\n                         Option to set Alerts to audit progress in participation initiatives.\n                        \n\n\n                        The Dashboard is customizable and configurable for your unique set of business questions.\n                        \n\n\n\n\n\n\n                        Completion and Scoring Dashboard\n                       \n\n                        This is a templatized Domo Dashboard that measures and presents summary data metrics to leaders and program administrators who own the Goals or OKR program to help them understand how Goals are progressing, and achievement levels at the end of a tracking period. It combines the collected data from Domo Goals and employee data in Domo to supply information such as:\n                       \n\n                        End of quarter:\n                       \n\n\n                         Calculated achievement scores for all Goals in the system.\n                        \n\n                         Summary metrics of the overall number of goals achieved, and average achievement scores:\n                         \n\n                           By Whole.\n                          \n\n                           By Department.\n                          \n\n\n\n\n                        In-quarter running view:\n                       \n\n\n                         Count of completed active Goals in the system, as a number and as a percent\n                         \n                         of total.\n                        \n\n                         Goal components’ (Key Results[KR]) progress, aggregated at a whole\n                         \n                         organization level.\n                        \n\n                         Stack-ranking Goal completion breakdown by team.\n                        \n\n                         Pacing of Goal completion quarter over quarter.\n                        \n\n                         Pacing of KRs’ aggregate bucketing into tiers of completion (not started through\n                         \n                         Completed.)\n                        \n\n                         Summaries of Goals with components (KRs) that are suffering from stagnant\n                         \n                         progress.\n                        \n\n                         Option to set Alerts to audit progress in completion initiatives.\n                        \n\n\n                        The Dashboard is customizable and configurable to your unique set of business questions. Additional versions of this Dashboard can be developed for sub-teams or individuals.\n                        \n\n\n\n\n                        Impact Dashboard\n                       \n\n                        This is a templatized Domo Dashboard that measures and presents summary data metrics to leaders and business functional owners to help them understand how Goals are impacting the KPIs of their respective part of the business. This is essentially a business Dashboard organized to align with the current Goals (OKRs) of the respective team. It combines the collected data from Domo Goals and key performance data in Domo to supply information such as:\n                       \n\n\n                         Listing of current Objectives with achievement level. (Enabled with Alerts as desired.)\n                        \n\n                         Breakdown of the Goal components (KRs) supporting each Objective with their\n                         \n                         respective achievement levels.\n                        \n\n                         Posting of hero metric Card(s) tied to the KRs’ progress.\n                        \n\n\n                        The Dashboard is customizable, and at present, requires manual configuration each\n                        \n                        quarter for each stakeholder’s particular Goals. Alerts can also be enabled for\n                        \n                        Objective achievement, KR progress, or on the metrics of the specific Visualization Cards.\n                        \n                        Additional versions of this Dashboard can be developed for sub-teams or individuals.", "Preview Article": "Click here to preview", "URL Name": "4406041297943", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004348", "Archived Date": "", "Language": "English", "Primary Version": "Domo Goals Command Center", "Article Total View Count": "4,719", "": "", "Article Created Date": "10/24/2022, 9:44 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Domo Goals Command Center\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Goals Center\n              \n", "url": "/s/topic/0TO5w000000ZanmGAC"}]}