{"file_path": "../../raw_kb_v2\\article\\360043428053\\index.html", "content": {"title": "\n\n\n Stacked Bar with Line Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nA Stacked Bar with Line chart is a combination of a\n\nGrouped Bar with Line Chart\n\n—the only difference is that in a standard Grouped Bar with Line chart, each series gets its own bar, and bars are grouped side by side in their respective categories, whereas in a Stacked Bar with Line chart, series in a category are stacked on top of each other. Like a Grouped Bar with Line chart, a Stacked Bar with Line chart includes two y-axes, one on each side of the chart. One of these is used to measure the values along the line(s), and the other is used to measure the values of the bars.\n\n\n The Stacked Bar with Line chart has a subtype chart—the Stacked Bar with Symbols chart. This chart type is the same as a Stacked Bar with Line chart except that it allows you to replace series with symbols. For more information, see\n\nChart Properties.\n\nPowering Stacked Bar with Line charts\n---------------------------------------\n\nStacked Bar with Line charts require three columns or rows of data from your DataSet—one for series, one for categories, and one for values. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your Stacked Bar with Line chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how data from a typical column-based spreadsheet is converted into a Stacked Bar with Line chart:\n\nCustomizing Stacked Bar with Line charts\n------------------------------------------\n\nYou can customize the appearance of a Stacked Bar with Line chart by editing its\n **Chart Properties**\n and by changing the sorting, scale syncing, and number formatting.\n\n##\n Chart Properties\n\nUnique\n **Chart Properties**\n of Stacked Bar with Line charts include the following:\n\n\n For information about all\n **Chart Properties**\n , see\n\nChart Properties\n\n.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n General > Starting Symbol\n  |\n Lets you select the symbol used to represent the first line in all symbol-bar combination charts. (The default symbol is a triangle.) If more than one symbol series appears, the chart rotates through symbols in this order: Triangle, Circle, Plus, Square, Diamond. For example, if your chart had four symbol series and you selected\n **Plus**\n for the starting symbol, the first series would be represented using plus signs, the second with squares, the third with diamonds, and the fourth with triangles.\n\n\n In the example at right, circles, pluses, and squares are used.\n  |  |\n|\n General > Series on Top Scale\n  |\n Refers to the number of lines and bars in horizontal line-bar combination charts By default, the first series that appears in your legend for these chart types becomes a line, and all remaining series become bars. However, you can convert series from bars to lines by entering the desired number of lines here. For example, if your chart had three series, the first series appearing in your legend would appear as a line, and the remaining two series would appear as bars. You could turn the second series into a line by entering\n `2`\n in the\n **Series on Top Scale**\n field.\n  |\n —\n  |\n|\n General > Series on Left Scale\n  |\n Determines how many series in your chart appear as lines (or symbol series in a Stacked Bar with Symbols chart). By default, the first series that appears in your legend for these chart types becomes a line, and all remaining series become bars. However, you can convert series from bars to lines by entering the desired number of lines in\n **Chart Properties**\n . For example, if your chart had three series, the first series appearing in your legend would appear as a line, and the remaining two series would appear as bars. You could turn the second series into a line by entering\n `2`\n in the\n **Series on Left Scale**\n field.\n  |\n —\n  |\n|\n General > Line Style\n  |\n Lets you change the line style in your chart. By default, lines in line-bar combination charts appear angular. If you want, you can change the line style to be curved.\n\n\n The example shows a chart in which the line style has been set to\n **Curved**\n .\n  |\n\n|\n|\n General > Sync Value Scales\n  |\n Determines whether value scales in dual-scale charts are synced. For more information, see\n\nSyncing Value Scales in a Dual-Scale Chart\n\n.\n\n\n The example shows a chart with synced value scales.\n  |\n\n|\n|\n General > Hide Second Scale\n  |\n Hides the second value scale in dual-scale charts in which you have synced the scales using the\n **Sync Value Scales**\n option. For more information, see\n\nSyncing Value Scales in a Dual-Scale Chart\n\n.\n  |\n —\n  |\n|\n General > Number of Running Total Lines\n  |\n Lets you specify the number of lines in line-bar combination charts that are running total lines. Lines that become running total lines are determined by your chart series order as it appears in your legend. For example, if you indicated that you wanted two running total lines, the lines corresponding to the first two line series in your legend would become running total lines.\n\n\n In the example, the blue and light green lines are running total lines; the dark green line is not.\n  |\n\n|\n|\n General > Number of Running Total Bars\n  |\n Lets you specify the number of bars in line-bar combination charts that are running total bars. Bars that become running total bars are determined by your chart series order as it appears in your legend. For example, if you indicated that you wanted two running total bars, the bars corresponding to the first two bar series in your legend would become running total bars.\n\n\n In the example, the light and dark green bars are running total bars; the other bars are not.\n  |\n\n|\n|\n General > Sync Zero Lines\n  |\n Syncs the zero lines in dual-scale charts with negative values so the \"0\" values match.\n\n\n The first example at right shows a dual-scale chart with scales that do not match. The right-side chart is being used to measure sales, which are always going to be positive; hence the scale starts at 0. However, the left-side scale is being used to measure profit, which may dip below 0. In this case the scale starts at -2000. Because the scales do not match, the chart is difficult to interpret.\n\n\n The second example shows the same chart with the zero lines synced. Even though the other values do not match, the viewer can easily use the zero line as a reference point to interpret the line and bars simultaneously.\n  |\n\n\n |\n|\n Data Label Settings >  Show Data Labels On\n  |\n Determines whether data labels appear for lines, bars, or both.\n  |\n —\n  |\n\n\n###\n Sorting\n\nYou can manipulate which series becomes lines and bars in a Stacked Bar with Line chart by changing the series order in your legend. By default, the sort method is set to\n **No Sorting**\n , which arranges your series in alphabetical order. For most charts with both lines and bars, this is\n *not*\n the optimal sort method. For the best results, do the following:\n\n Ensure that the series that should correspond to the line appears first in your DataSet\n* Choose an item-based sorting method, either ascending or descending\n\nBecause item-based sorting sorts the items in the DataSet alphabetically by category, with the series items in each category appearing in the same order that they appear in the spreadsheet, the first series in your DataSet becomes the line. For more information about sorting, see\n\nSorting the Data in Your Chart\n\n.\n\n##\n Syncing value scales\n\nBy default, the two value scales in a Stacked Bar with Line chart are matched to the data they measure, not to each other. For example, the values for your line might range from 0 to 100, and the values for your bars might range from 2 to 12. You can sync the scales by checking\n **Sync Value Scales**\n in\n **Chart Properties**\n . For more information, see\n\nSyncing Value Scales in a Dual-Scale Chart\n\n.\n\n##\n Changing scale formatting\n\nIt is possible to have separate number formatting for both vertical axes in a Stacked Bar with Line chart. For example, you could have percent symbols affixed to the values in one axis and currency symbols affixed to the values in the other. You can do this in the\n **Format**\n menus or the\n **Chart Properties**\n . Domo recommends that you use\n **Chart Properties**\n to make formatting changes, not the\n **Format**\n menus, because the options in the\n **Format**\n menus are overridden by formatting changes in\n **Chart Properties**\n . For more information about formatting numbers, see\n\nFormatting Values in Your Chart\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428053\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004748\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nStacked Bar with Line Chart\n\n", "article_total_view_count": "\n\n\n 12,745\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:29 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "stacked_bar_with_line_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}