{"file_path": "../../raw_kb_v2\\article\\360042922874\\index.html", "content": {"Title": "Getting Help", "Article Body": "Intro\n                       \n\n                        You can get help using Domo from the resources listed in this page.\n                       \n\n                        You can access any of these resources from within Domo by clicking\n                        \n                        in the top navigation bar. This opens a page with links to the Community Forum, Knowledge Base, Developer Portal, Video Library, and training apps.\n                       \n\n\n\n                          Video - Help Center Overview\n                         \n\n\n\n\n\n\n\n                        Domo University\n                       \n\n                        Domo University is the next step in helping you quickly and easily become a Domo expert, offering you an ecosystem of role-based or feature-based learning options to help you get the most out of your investment. From insightful video content available 24/7, webinars, certification to structured classroom environment or onsite, Domo University is here when—and where—you need it.\n                       \n\n                        If you are interested in or have questions about training options on Domo, please contact Domo University at\n                        \n                         university@domo.com\n                        \n                        or visit\n                        \n                         http://www.domo.com/university/training\n                        \n                        .\n                       \n\n                        To see Domo's full library of instructional videos, visit\n                        \n                         https://www.domo.com/help-center/videos\n                        \n                        .\n                       \n\n\n\n                          Video - Domo University Overview\n                         \n\n\n\n\n\n\n\n\n\n                        Domo's Community Forum\n                       \n\n                        Data lovers, unite. The Community Forum is a fun place to connect, ask questions, find answers and share best practices with fellow Domo customers.\n                       \n\n                        You can sign in to the Community Forum by doing the following:\n                       \n\n\n\n                          In Domo, click\n                          \n                          in the top navigation bar.\n                         \n\n\n\n                          Click\n                          \n                           Community Forum\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Sign In\n                          \n                          , then specify your Domo account username and password.\n                         \n\n\n\n                        Domo Knowledge Base\n                       \n\n                        Domo's extensive documentation covers nearly every aspect of the product in full detail.\n                       \n\n                        Domo Developer Portal\n                       \n\n                        Domo's Developer Portal contains documentation for all the tools available in the portal. To access the portal, visit\n                        \n                         https://developer.domo.com\n                        \n                        .\n                       \n\n                        Technical Support\n                       \n\n                        If you cannot find what you're looking for, and you have a valid support package, please use the Customer Support Portal at\n                        \n                         support.domo.com\n                        \n                        to create and manage your customer support tickets. See\n                        \n                         Understanding the Customer Support Portal\n                        \n                        for more information.\n                       \n\n\n                        For more support information, see\n                        \n                         http://www.domo.com/support\n                        \n                        and\n                        \n                         Troubleshooting\n                        \n                        .\n                       \n\n\n\n                          Follow these instructions to create a help ticket in the Support Portal:\n                         \n\n\n\n                            In Domo, click\n                            \n                            in the top navigation bar.\n                           \n\n\n\n                            Click the\n                            \n                             Contact Support\n                            \n                            link in the top right corner of the Help Center.\n                            \n\n\n\n\n\n\n                            In the Support Portal, click\n                            \n                             New\n                            \n                            .\n                           \n\n\n\n                            Enter the information for your issue in the required fields.\n                           \n\n\n\n                            Click\n                            \n                             Save\n                            \n                            .\n                            \n\n                            For information about creating lists in the Support Portal, see\n                            \n                             Creating a New List in the Customer Portal\n                            \n                            .\n                           \n\n\n\n\n\n                          Reach out to your Domo Customer Success Manager or Technical Consultant.\n                         \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Individuals evaluating commercial products are entitled to evaluation support.\n                          \n\n\n\n\n                        If you are experiencing slowness or rendering issues in Domo, go through the following steps first before you contact Support:\n                       \n\n\n\n                          Clear the cache and cookies in your browser.\n                         \n\n\n\n                          Check your network connection to ensure it is functioning normally.\n                         \n\n\n\n                          See if others in your organization are experiencing the same issue.\n                         \n\n\n\n                          See if the problem persists when you use other browsers.\n                         \n\n\n\n                          If your cache has been cleared and the network is functioning normally, contact Support so our team can investigate the issue.\n                         \n\n\n\n                          Once you contact support, they will want you to show them an example of a card/page that is experiencing slowness or rending problems. And please be ready to report roughly what timeframe they last tried to render that card/page.\n                         \n\n\n\n                        For information about the service agreement, see\n                        \n                         http://www.domo.com/company/service-terms\n                        \n                        .\n                       \n\n\n                         Video - Support Portal Overview\n                        \n\n\n\n\n\n\n\n\n                        Contact information\n                       \n\n\n\n\n\n                            Address\n                           \n\n\n\n                            Domo, Inc.\n                           \n\n                            772 East Utah Valley Dr.\n                           \n\n                            American Fork, UT 84003\n                           \n\n\n\n\n\n                            Website\n                           \n\n\n\n\n                             http://www.domo.com", "Preview Article": "Click here to preview", "URL Name": "360042922874", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004376", "Archived Date": "", "Language": "English", "Primary Version": "Getting Help", "Article Total View Count": "5,410", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Getting Help\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Support Resources\n              \n", "url": "/s/topic/0TO5w000000ZaoIGAS"}]}