{"file_path": "../../raw_kb_v2\\article\\360042933334\\index.html", "content": {"Title": "Asset Viewer", "Article Body": "Intro\n                       \n\n                        The Asset Viewer app allows you to view and display your ad campaign images in one convenient location, note that this app works in conjunction with the Asset Manager app. Along with just the image, you can include a description and multiple tags to be associated with each image. You can customize how your images are displayed using the toolbar across the top, the views include: Single Item View, Grid View, and List View. Overall app views can be configured using the Configure gear menu and in here you are able to choose a default view, select a light or dark theme, and make descriptions and tags visible/non-visible.\n                       \n\n                        Parts of the Asset Viewer App\n                       \n\n                        Views\n                       \n\n                        There are three different options for viewing your images in the app:\n                       \n\n                        Single Item View\n                       \n\n                        The Single Item View option only displays one image at a time and cycles through images using a slideshow feature.\n                       \n\n                        Grid View\n                       \n\n                        The Grid View displays images in a grid block line-by-line display.\n                       \n\n                        List View\n                       \n\n                        The List View option displays images in a vertical list style.\n                       \n\n                        Configuration\n                       \n\n                        The Configuration button let's you configure a default view from one of the three options, let's you select a dark or light theme, and let's you make certain descriptor elements such as descriptions or tags visible/non-visible.\n                       \n\n                        How Do I Get This?\n                       \n\n\n                         To begin using the Asset Viewer App, have an Admin contact your Customer Success Manager.\n                        \n\n\n                        FAQ\n                       \n\n                        Why is this important?\n                       \n\n\n                         Document repository in Domo with an associated dataset with document metadata\n                        \n\n\n                        How to use/demo it?\n                       \n\n\n                         Create a meta data schema for each document and start uploading them into the repo", "Preview Article": "Click here to preview", "URL Name": "360042933334", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005003", "Archived Date": "", "Language": "English", "Primary Version": "Asset Viewer", "Article Total View Count": "2,388", "": "", "Article Created Date": "11/2/2022, 8:16 PM", "First Published Date": "11/2/2022, 8:37 PM"}, "title": "\n              Asset Viewer\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}