{"file_path": "../../raw_kb_v2\\article\\360043428573\\index.html", "content": {"title": "\n\n\n Understanding Cards\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn Domo, your business data is represented by\n *Cards*\n . Cards are found in screens or\n *Pages*\n , where they appear as boxes containing the most important information for the Card; you can access additional information and options for a Card by clicking it to open its Details view.\n\n\n In Domo, there are various types of Cards, including\n\n Visualization cards\n* Doc Cards\n* Notebook Cards\n* Poll Cards\n* Sumo Cards\n* Custom Apps\n\nFor more information about Pages, see\n\nUnderstanding Pages\n\n.\n\n\n For information about personalizing the layout of Cards in Pages, see\n\nManaging Cards and Pages\n\n.\n\n*Video - What is a Domo Card?**\n\nParts of a Card\n-----------------\n\nAll Cards in Domo share common components. The following screenshot of a Visualization Card calls out a number of these components. Note that this screenshot shows a Card from a standard Page. Cards from Domo Stories Pages do not show all of these components.\n\nYou can learn more about the components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Card name\n  |\n The name of the Card. The process for naming a Card depends on the Card type. For example, for a Visualization Card, you specify the name of the Card in Analyzer. For a document Card, the original filename is used unless you indicate a custom name. For a notebook Card, you specify a name when you create the Card.\n\n\n For more information about changing the name of a Visualization Card, see\n\nEditing the Name or Description of a Visualization Card\n\n.\n  |\n|\n Card content\n  |\n The actual data represented in this Card.\n  |\n|\n Card options\n\n|\n Displays a menu of options for this Card. This icon appears when you mouse over the Card; click to show the available options. For more information, see\n\nCard Options menu\n\n.\n  |\n|\n Owner (standard Pages only)\n  |\n The picture that represents the owner of the Card in Domo, set this picture by\n\nAssigning or Changing a Card Owner\n\n.\n  |\n|\n Issues icon (standard Pages only)\n  |\n An icon that indicates the number of issues reported for this Card. Click the icon to open the\n **Issues Reported**\n tab in the Details view for the Card. For more information, see\n\nReporting Issues with Cards\n\n.\n  |\n|\n Views icon (standard Pages only)\n  |\n An icon that indicates the number of times the Details view for this Card has ever been viewed. This view count includes any time the Card has been rendered on a Page or in a scheduled report. Click the icon to open the Details view for the Card.\n  |\n|\n Comments icon (standard Pages only)\n  |\n An icon that indicates the number of unread comments for this Card. Click the icon to show the comments in Buzz in the Details view for the Card.\n  |\n|\n Connector icon (standard Pages only)\n  |\n An icon indicating the type of connector used to power a Visualization Card. For example, in the preceding screenshot the Card is powered by MySQL. A\n\nicon indicates that this Card is not a Visualization Card.\n  |\n|\n Company certification badge (not shown above)\n\n|\n An icon indicating that this Card is company-certified. This is the highest level of certification your company can bestow. For more information about certifying Cards, see\n\nCertifying Cards and DataSets\n\n.\n  |\n|\n Company certification pending badge (not shown above)\n\n|\n An icon indicating that this Card has been submitted for company-wide approval but has not yet been approved. For more information about certifying Cards, see\n\nCertifying Cards and DataSets\n\n.\n  |\n|\n Departmental certification badge (not shown above)\n\n|\n An icon indicating that this Card has been certified by a specific department in your company. For more information about certifying Cards, see\n\nCertifying Cards and DataSets\n\n.\n  |\n|\n Departmental certification pending badge (not shown above)\n\n|\n An icon indicating that this Card has been submitted for departmental approval but has not yet been approved. For more information about certifying Cards, see\n\nCertifying Cards and DataSets\n\n.\n  |\n|\n Details icon (Domo Stories Cards only)\n\n|\n An icon that lets you open the Details view for this Card in a Domo Stories dashboard.\n  |\n\nUnderstanding Visualization Cards\n-----------------------------------\n\nIn Domo, charts, tables, and maps are used to represent specific business metrics, such as sales by quarter, new customers by state, etc. The following example utilizes a basic line chart to show sales data for the first half of January:\n\nIn a Visualization Card, you can see the chart along with its name, the\n *date grain*\n or unit of time used to represent data (if the chart uses time data), and current value. In the following Card, the metric being measured is the profit per customer segment in 2012; the date grain is Quarter; and the current value is 1000:\n\nIn this Card, the current value of \"1k\" is used as the\n *Summary Number*\n . This is the single value that best represents the data in this chart. A Summary Number does not need to be the current value of the chart. It can be the maximum represented value, the average of all values, and so on. For more information, see\n\nConfiguring Your Chart Summary Number\n\n.\n\n\n This Card also includes another feature unique to Visualization Cards: the Alerts icon\n\n, which shows the number of triggered Alerts for this Card. For more information, see\n\nConfiguring Notifications and Alerts\n\n.\n\n\n You can click a Visualization Card to open its Details view, which provides additional options not found in the Card Page. For more information, see\n\nCard Details View Layout\n\n.\n\n\n If a Visualization Card has descriptive text, you can see that text by hovering over the name of the Card. For information about adding descriptive text to a Visualization Card, see\n\nEditing the Name or Description of a Visualization Card\n\n.\n\n\n If PDP (Personalized Data Permissions) has been enabled for the Card, a\n\nlabel appears at the bottom, next to the connector icon. For more information about PDP, see\n\nPersonalized Data Permissions (PDP)\n\n.\n\n\n For a PDF showing all of the parts of a Visualization Card, go here:\n\nAnalyzer Card Basics\n\nUnderstanding Doc Cards\n-------------------------\n\nA\n *Doc Card*\n is a type of Card containing a document, image, or video that has been uploaded to Domo.\n\n\n You can download any file in a Doc Card to your own machine. You can also use Doc Cards to collaborate and share uploaded files with others. You can see a small version of the document in the Card Page or a full-sized version in the Details view for the Card.\n\n\n The following screenshot shows an example Doc Card:\n\nYou can add Doc Cards containing the following types of files:\n\n PDF\n* DOCX\n* DOC\n* XLSX\n* XLS\n* PPTX\n* PPT\n* TXT\n* PNG\n* JPG\n* BMP\n* MP4\n\nFor other permitted file types not in this list, a download button appears instead of an embedded view.\n\n\n The maximum file size for uploaded files is 100 MB.\n\n\n When you upload a new version of a Doc Card, that version replaces the current version. All old versions of the file are stored as thumbnails in a panel in the Details view. You can see any old version of a document by clicking its thumbnail. You can also delete any version.\n\n\n You can configure an option that allows you to receive Notifications when a Doc Card you have added as a Favorite gets a new version. You do this in the Notifications Center. For more information, see\n\nReceiving and Viewing Notifications\n\n.\n\n\n For information about uploading a Doc Card to Domo, see\n\nDownloading a Document from Domo\n\n.\n\n\n You can click a Doc Card to open its Details view, which provides a full-sized preview of the file along with additional options not found in the Card Page. For more information, see\n\nDocument Card Details view\n\n.\n\n\n**Note:**\n\nIn the interest of preventing users from uploading malicious files into Domo accounts, Domo allows a specific set of file types to be uploaded. If you attempt to upload a file not within this list, an error message appears. For more information, including the full list of supported file types, see\n\nPermitted File Types for Attachments\n\n.\n\nUnderstanding Notebook Cards\n------------------------------\n\nNotebook Cards are Cards containing text you enter. You can type or paste text in a Notebook Card. You can format text using bold, italics, and numbered and bulleted lists by selecting options in the toolbar.\n\n\n The following screenshot shows an example notebook Card:\n\n\n**Note:**\n When you paste text, certain formatting may be preserved, including bold, italics, lists, tables, font size, and headings. The formatting that is preserved varies, depending on the source. Typically, formatting associated with basic HTML tags are preserved, although styles may differ. Pasted images are stripped out.\n\nText in a Notebook Card may be edited by any user with sufficient access rights after the Card is created. For more information about access rights, see\n\nManaging Roles\n\n.\n\n*Note:**\n Notebook Cards do\n *not*\n support collaborative editing by multiple users simultaneously. To collaborate, you must take turns editing the Notebook Card.\n\nFor information about adding or editing a Notebook Card, see\n\nAdding a Notebook Card\n\n.\n\n\n You can click a Notebook Card to open its Details view, which provides additional options not found in the Card Page. For more information, see\n\nNotebook Card Details view\n\n.\n\n\n Understanding Poll Cards\n--------------------------\n\nA \"poll\" in Domo consists of a question and two or more answer choices. When a user responds to a poll by selecting answer choices and then clicking a button to vote, the results of the poll up to that point replace the question and answer choices in the Card. From then on, any time another user responds to the survey, the results update accordingly. You can edit the poll information in the\n\nDetails view\n\nfor the Poll Card.\n\n\n The content you see in a Poll Card depends on whether or not you have taken the poll. If you have not taken the poll, the poll question appears in the Card, as shown here:\n\nIf you have taken the poll, you see the results of the voting up to this point, as shown here:\n\nIn the preceding screenshot, there is not enough room to show all of the results, so only the top results appear. There is also a link that takes you to the Details view, where you can see all of the results.\n\n\n For information about creating polls, see\n\nAdding a Poll Card to Domo\n\n.\n\n\n Understanding Sumo Cards\n--------------------------\n\nSumo Cards display tabular data as either standard column-based tables or more powerful pivot tables like those available in Microsoft Excel. These tables are called Sumo tables. When you create a Sumo table, a Card for that table is added to Domo.\n\n\n The type of table you see in a Sumo Card in the Card view depends on which table view was selected when the Sumo Card was last saved. In the following example, the user saved a Sumo Card when the column view was selected:\n\nIn the next example, the user saved the same Sumo Card when the pivot view was selected.\n\nThe amount of information that appears in a Sumo Card depends on the size you have selected for the Card. For example, if you select the medium size for a pivot Card, a condensed version of the pivot table appears that shows the column and row names and the Summary Number; if you select the full size for the same Card, the entire pivot table appears. In the full-size view, if there is still more information than will fit in the table, vertical and/or horizontal scroll bars are provided. For more information about sizing Cards, see\n\nChanging the Size of Cards in a Page\n\n.\n\n\n You can see a full-sized Sumo Card and open it for editing in the\n\nDetails view\n\n.\n\n\n Domo offers many other types of Tables as a chart type within Analyzer. For more information about adding Visualization tables, see\n\nTable Charts\n\n.\n\n\n If PDP (Personalized Data Permissions) has been enabled for the Card, a\n\nlabel appears at the bottom, next to the connector icon. For more information about PDP, see\n\nPersonalized Data Permissions (PDP)\n\n.\n\n\n For information about building Sumo Cards, see\n\nSumo Editor Layout\n\n.\n\n\n Understanding Custom Apps\n---------------------------\n\nA Custom App is a Card that uses multiple charts and images to present data measurements.\n\nYou can create Custom Apps using\n *App Dev Studio*\n , which is best suited for developers with web-based programming experience. To visit Domo's appstore and browse available custom apps, see\n\nhttps://www.domo.com/apps\n\n. For documentation about building Custom Apps using App Dev Studio, see our\n\nDeveloper Portal\n\n.\n\n\n Custom Apps can also be created by Client Services. For creation requests, reach out to your Domo Customer Success Manager or Technical Consultant.\n\n\n**Video - Appstore Overview**\n\n​\n\nYou can click a Custom App Card to display the Details view, which provides additional options not found in the Card Page. For more information, see\n\nCard Details View Layout\n\n.\n\nUnderstanding Image Cards\n----------------------------\n\nImage Cards are now DEPRECATED. You can upload images to Domo using\n\nDoc Cards\n\n.\n\nCard Options menu\n--------------------\n\nIn a Page, mouse over a Card, then click\n\nto display menu items for that Card. Options appear in the menu, depending on the Card type.\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Edit in Analyzer\n  |\n Opens the Analyzer for this Card directly.\n  |\n|\n Share\n  |\n Allows you to share access rights for this Card with users. For more information about sharing, see\n\nControlling Access to Cards and Pages\n\n.\n  |\n|\n Edit Drill Path\n  |\n Allows you to edit the drill path for this KPI Card. For more information, see\n\nEditing an existing drill path\n\n.\n  |\n|\n Domo Everywhere\n  |\n Allows you to share this Card outside of Domo, either publicly or privately. For more information, see\n\nSharing Cards Outside of Domo\n\n.\n  |\n|\n Schedule as Report\n  |\n Lets you create a Scheduled Report for the Cards in this Page. For more information, see\n\nScheduling Reports\n\n.\n  |\n|\n Edit Scheduled Reports\n  |\n Opens the manager interface for Scheduled Reports. For more information, see\n\nManaging your Scheduled Reports\n\n.\n  |\n|\n Send Now\n  |\n Allows you to send this Card via email to a Domo user. For more information, see\n\nSending a Scheduled Report immediately\n\n.\n  |\n|\n Send / Export\n  |\n Opens the\n **Export**\n dialog, which provides options for sending and exporting the data for the Card.\n **Send / Export**\n is available for KPI and Sumo Cards. For a KPI Card, you can email or print the Card, export the Card to Microsoft PowerPoint, or export the data as a\n `.csv`\n or Microsoft Excel spreadsheet file. For a Sumo Card, you can only export the data as a\n `.csv`\n or Microsoft Excel spreadsheet file.\n  |\n|\n Add To Favorites / Remove From Favorites\n  |\n Adds this Card to your Favorites Page for quick access. If you have enabled Daily Alerts, you receive status reports for all KPI Cards set as Favorites. If the Card is already a Favorite, this option reads\n **Remove From Favorites**\n . Choosing this option removes the Favorite status from this Card. For more information about enabling Daily Alerts, see\n\nCustomizing Notification and Alert Settings\n\n.\n  |\n|\n Notify Me on Issues/Do Not Notify Me on Issues\n  |\n Adds this Card to your \"Following\" queue, meaning you are notified when anyone reports an issue on this Card. If the Card is already in your \"Following\" queue, this option reads\n **Do Not Notify Me on Issues**\n . Choosing this option removes the Card from your \"Following\" queue.\n  |\n|\n Alert Me\n  |\n Displays the Card in the Details view and opens the\n **Alerts**\n tab in which you can create a custom Alert for the KPI Card. When an Alert is set for a KPI Card, you are notified via email and/or text whenever that KPI Card's value changes in the manner you specify (for example, you could set an Alert to appear when the value drops beneath a certain threshold). For more information about creating Alerts, see\n\nCreating a Custom Alert for a Visualization Card\n\n.\n  |\n|\n Remove\n  |\n Allows you to remove a Card from a Page.\n\n\n The\n **Remove**\n option is\n *not*\n available in Details views.\n\n*Note:**\n This option removes the Card only from this Page.\n\nFor more information about removing a Card from a Page, see\n\nRemoving Cards from a Page\n\n.\n  |\n|\n Move / Copy\n  |\n Allows you to move or copy this Card to a different Page. Cards copied in this way are still linked, so changes made to one copy are made to all other copies. For more information, see\n\nMoving or Copying Cards to Other Pages\n\n.\n  |\n|\n Save As (formerly called Duplicate)\n  |\n Allows you to create a new instance of this Card. Duplicated Cards are completely separate from the originals; changes made to one are\n *not*\n made to the other. For more information, see\n\nDuplicating Cards\n\n.\n  |\n|\n Connect / Update Data\n  |\n Opens the\n **Connect to Data**\n dialog for this KPI Card, in which you can upload a DataSet to power up the KPI Card. If you need a template spreadsheet, you can download one in this tab as well. If the KPI Card already has a DataSet connected, selecting this option allows you to refresh the data or change the DataSet. For more information about connecting and updating DataSets, see\n\nConnecting to Data with Connectors\n\n.\n  |\n|\n Report an Issue\n  |\n Allows you to write a description of an issue in this Card and send it to the Card owner and any followers via email/text. The report message is also posted to Buzz. When a Card has reported issues, a warning icon appears on the Card. You can click the warning icon to view the\n **Issues Reported**\n tab of the Details view. For more information, see\n\nReporting Issues with Cards\n\n.\n  |\n|\n Delete\n  |\n Removes a Card from Domo. You must either have an \"Admin\" security role, have a custom role with the \"Manage Cards and Pages\" privilege enabled, or be the Card owner to delete a Card. For more information, see\n\nDeleting Cards from Domo\n\n.\n  |\n|\n Size options\n  |\n Allow you to change the size of this Card. Options include small, medium, large, and full (for Domo App Cards and Sumo Cards). To change the size of all Cards on the Page, select the appropriate icon from the\n\nmenu in the top right corner of the Page. For more information, see\n\nChanging the Size of Cards in a Page\n\n.\n  |\n\nCard Collections\n------------------\n\nYou can organize Cards on a Page into distinct categories called \"Collections.\" You can name Collections, reorder Cards within a Collection, reorder Collections themselves within a Page, or remove Cards from the Collection. You can also minimize Collections so that only the names show, or delete them. For more information about Card Collections, see\n\nCreating and Managing Card Collections\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428573\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004055\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUnderstanding Cards\n\n", "article_total_view_count": "\n\n\n 8,160\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "understanding_cards", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "consuming_data_in_domo", "url": "/s/topic/0TO5w000000ZamnGAC"}, {"text": "interacting_with_cards_and_dashboards", "url": "/s/topic/0TO5w000000ZansGAC"}]}