{"file_path": "../../raw_kb_v2\\article\\360042934694\\index.html", "content": {"Title": "Connecting to Social Networks in Your Profile Page", "Article Body": "In the\n                        \n                         Profile\n                        \n                        page, you have the ability to connect to any of a number of social networks, such as Facebook, Twitter, LinkedIn, and Instagram. When you connect to a social network, a feed for that social network appears at the bottom of the\n                        \n                         Profile\n                        \n                        page. Visitors to your\n                        \n                         Profile\n                        \n                        can view your social activity and photos for each network. Feeds may also provide options such as marking posts as Favorites, \"retweeting,\" linking to Instagram photos, and so on. You can also disconnect from a social network.\n                       \n\n\n                         To connect to a social network,\n                        \n\n\n\n\n                          Open your\n                          \n                           Profile\n                          \n                          page by clicking your profile picture in the top right corner of the screen. (If you have not yet selected a profile picture, a\n                          \n                          icon appears instead.)\n                         \n\n\n\n                          Click\n                          \n                           Social Networks\n                          \n                          in the navigation bar under the profile header.\n                          \n\n\n\n\n\n\n                          Click the button for the social network you want to connect to.\n                         \n\n\n\n                          Follow the steps to authorize Domo to connect to this social network.\n                         \n\n\n\n\n                         To disconnect from a social network,\n                        \n\n\n\n\n                          Mouse over\n                          \n\n                          in the topmost panel of the social network you want to disconnect from.\n                         \n\n\n\n                          Click\n                          \n\n                            Disconnect\n                           \n\n                          .\n                         \n\n\n\n                          Click\n                          \n\n                            Disconnect\n                           \n\n                          to confirm.\n                         \n\n\n\n                        You can also send a user a reminder to connect to a particular social network. You do this by clicking the button for the desired network in the\n                        \n\n                          Social Networks\n                         \n\n                        area of the profile header.\n                       \n\n\n\n\n                        Buttons for networks that have not yet been connected appear gray, and those that have already been connected appear blue. Clicking a blue button takes you directly to the feed for that network at the bottom of the\n                        \n                         Profile\n                        \n                        page. Clicking a gray button brings up a dialogue with a customizable reminder message. When you send this message, it appears in the user's Buzz feed. For more information about Buzz, see\n                        \n                         Buzz\n                        \n                        .\n                       \n\n\n                         To send a reminder to connect a social network,\n                        \n\n\n\n\n                          Click the button for the unconnected network.\n                          \n                          A dialogue opens, with the name of the user entered in the\n                          \n\n                            To\n                           \n\n                          field by default.\n                         \n\n\n\n                          (Optional) To send this reminder to multiple people, click in the\n                          \n\n                            To\n                           \n\n                          field and select the name of the desired recipient.\n                         \n\n\n\n                          (Optional) Customize the message if desired.\n                         \n\n\n\n                          Click\n                          \n\n                            Send Message\n                           \n\n\n                           .", "Preview Article": "Click here to preview", "URL Name": "360042934694", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004393", "Archived Date": "", "Language": "English", "Primary Version": "Connecting to Social Networks in Your Profile Page", "Article Total View Count": "4,670", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Connecting to Social Networks in Your Profile Page\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}