{"file_path": "../../raw_kb_v2\\article\\360043437993\\index.html", "content": {"Title": "Sharing Content Outside of Domo with Embed", "Article Body": "Intro\n                       \n\n                        After you configure routing, creation, and mapping in the publishing organization and choose your interface settings with Brand Kit, the next step is publishing or embedding your content so others can view it. To learn more about publishing content to subscribers, see\n                        \n                         Publishing Content to a Subscriber Organization\n                        \n                        .\n                       \n\n                        Embedding content is a premium feature that is available on demand. You can embed Domo content within any website, application, or portal. Contact your Customer Success Manager (CSM) to request the feature be enabled.\n                       \n\n                        This article describes the embed methods and provides information on embedding cards and dashboards using each method.\n                        \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Programmatic DataSet Switching is now available. To learn more, see\n                           \n                            DataSet Switching\n                           \n                           in the developer documentation.\n                          \n\n\n\n\n                        Embed Methods - Public and Private\n                       \n\n                        There are two main ways to embed content: public and private.\n                       \n\n                        Public Embed\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Due to security reasons, the option to embed content\n                            \n                             PUBLICLY\n                            \n                            is not available for HIPAA-compliant Domo instances. The\n                            \n                             PRIVATE\n                            \n                            embed options are available.\n                           \n\n\n\n\n\n                        You can embed publicly on websites, blogs, or social media platforms such as Facebook and Twitter. Anyone with the URL can view the content.\n                       \n\n                        This public content is view-only, does not support Alerts, and, since it does not require any viewer to log in, does not support Personalized Data Permissions (PDP).\n                       \n\n                        You can enable and disable public embedding in\n                        \n                         Domo Everywhere\n                        \n                        >\n                        \n                         Settings\n                        \n                        >\n                        \n                         General\n                        \n                        by checking or unchecking the box for\n                        \n                         Allow public embedding of Cards and Dashboards\n                        \n                        .\n                       \n\n\n\n\n                        Private Embed\n                       \n\n                        You can embed privately in websites, portals, or applications. There are three options for privately embedding content, detailed below.\n                       \n\n\n                         User-Based\n                        \n\n                         —\n                        \n                        Supports Single Sign-On (SSO) and Personalized Data Permissions (PDP).\n                        \n                        User licenses are created in Domo, and PDP policies apply to the known users for row-level entitlement policies.\n                        \n                        This option is the easiest to configure from a technical standpoint but can be difficult to manage for large quantities of users with varying Filters and permissions. Recommended for small, consistent user groups.\n                        \n                        To implement, purchase user licenses.\n                       \n\n\n                         Server-Based\n                        \n\n                         —\n                        \n                        Uses programmatic server-side filtering. The environment that hosts the Domo embedded content is authenticated against Domo and programmatically determines what Filters to apply. The Filter requests are then sent to Domo when the embedded content is displayed.\n                       \n\n                        This option provides the greatest flexibility and works fell for large or transient user groups, but carries a higher technical debt. It requires a developer to create and maintain the programmatic Filters.\n                        \n                        To implement, purchase impressions (or card loads).\n                       \n\n                        For more information, see\n                        \n                         Embed\n                        \n                        in the Domo developer docs.\n                       \n\n\n                         Platform-Based\n                        \n\n                         —\n                        \n                        Supports SSO and PDP. Completely editable experience.\n                        \n                        This option is easiest to build and deploy full data experiences to your customers using the Domo platform.\n                        \n                        To implement, purchase a platform package that includes a Domo environment for every customer you want to deliver content to.\n                       \n\n                        Notes\n                       \n\n                        For both public and private user-based embedding, copy the automatically generated HTML string from Domo and paste it into the necessary location on the website, blog, etc. as an iFrame or via a JavaScript API. This feature enables you to share business data in a consumable, interactive, and accessible way.\n                       \n\n                        For all privately embedded content:\n                       \n\n\n\n                          Users with a Social role cannot embed, create an iFrame, or view privately embedded content.\n                          \n                          Participant users cannot embed, but can view privately embedded content.\n                         \n\n\n                         All card types are supported except Sumo pivot tables.\n                        \n\n                         Notebook and Doc Cards cannot be embedded on their own, but can be embedded as part of a dashboard.\n                        \n\n\n                        For private user-based and platform-based embedded cards or dashboards (this does not pertain to server-based):\n                       \n\n\n\n                          You must enable SSO (Single Sign-On) in Domo as well as in the website, portal, or application.\n                         \n\n\n\n                            If the\n                            \n                             Only Invited People Can Access Domo\n                            \n                            option is enabled in\n                            \n                             Admin Settings > SSO\n                            \n                            , any non-Domo user attempting to access the card are denied.\n                            \n                            If this option is disabled, a non-Domo user is auto-provisioned based on the access rights set for default users. The default setting is \"Privileged.\"\n                            \n                            For more information about access rights, see\n                            \n                             Controlling Access in Domo\n                            \n                            .\n                           \n\n\n\n\n\n                        For publicly embedded content:\n                       \n\n\n                         Titles, drill down, Summary Number, and the chart picker are all available when embedding cards publicly; however, Filters are only available for columns used in the card. For security reasons, the end-of-card table view is not available with this feature.\n                        \n\n                         If you do not want your employees to embed cards publicly, you can disable the functionality by going to\n                         \n                          Admin Settings > Company Settings > Company Overview\n                         \n                         . U\n                         \n                          ncheck the box for\n                          \n                           Publicly embed content\n                          \n                          .\n                         \n\n\n\n                        You can get an administrative view of embedded content using the\n                        \n                         Activity Log\n                        \n                        .\n                       \n\n                        If you need further assistance to choose the right embed method, contact your Account Executive (AE) or Customer Success Manager (CSM) to discuss the best option for your use case and organization.\n                       \n\n                        Enabling Domo Embed\n                       \n\n                        To enable Domo Embed, a user with an Admin default security role or a custom role with the Embed Cards grant must go to\n                        \n                         Admin Settings > Company Settings > Company Overview\n                        \n                        , and check the box for\n                        \n                         Publicly embed content\n                        \n                        .\n                       \n\n\n\n\n\n\n\n                            Important:\n                           \n                           This is a 30-day free trial. At the end of the first 30 days of use, your Domo account representative will reach out to you to discuss pricing.\n                          \n\n\n\n\n                        Authorized Domains\n                       \n\n                        To help keep your data secure, and only displayed in the places you want it, you can use Embed Authorized Domains to place domains on an allowlist. Domains on the list can embed content and receive events via the JS API. To learn more about this, see the\n                        \n                         Domo developer docs\n                        \n                        . If content is placed in a domain that is unauthorized, it does not load.\n                       \n\n\n\n\n\n\n\n                            Important:\n                           \n                           If you do not add any domains to the allowlist, cards and dashboards can be embedded in any domain, but the JS API and loading all of Domo are blocked.\n                          \n\n\n\n\n                        1. To add authorized domains, go to\n                        \n                         Domo Everywhere\n                        \n                        >\n                        \n                         Settings\n                        \n                        .\n                       \n\n                        2. In the\n                        \n                         General\n                        \n                        tab, locate\n                        \n                         Embed authorized domains\n                        \n                        and enter a\n                        \n                         Domain name.\n                        \n\n\n                        3. Select\n                        \n                         Add\n                        \n                        .\n                       \n\n                        The list of authorized domains displays below the\n                        \n                         Domain name\n                        \n                        field.\n                       \n\n\n\n\n\n                         Video - Domo Everywhere: Embed Overview\n                        \n\n\n\n\n\n\n                        Embedding Cards\n                       \n\n                        When embedding cards individually, note that you can embed multiple cards on a dashboard, but you will need to generate code for each card independently.\n                       \n\n                        For individually-embedded cards, you can choose whether or not to include card features regularly available in the\n                        \n                         Details view\n                        \n                        , including all of the following:\n                       \n\n\n\n                          Card title\n                         \n\n\n\n\n                           Ability to drill down into the Card\n                          \n\n\n\n\n                          Allow Export\n                         \n\n\n\n\n                           Ability to access the data table\n                          \n                          (private Cards only)\n                         \n\n\n\n\n                           Summary Number\n                          \n\n\n\n\n\n                           Ability to apply and change filters\n                          \n                          (private Cards only)\n                         \n\n\n\n\n                           Ability to change the chart type using the Chart Picker\n                          \n\n\n\n\n                        You can also set the size of embedded cards, either by choosing a preset size or entering a custom width and height.\n                       \n\n                        Embedding a Card\n                       \n\n                        Access the embed option for a card by selecting\n                        \n\n                         Card options\n                        \n                        >\n                        \n                         Domo Everywhere\n                        \n                        .\n                        \n                        The embed card modal displays.\n                       \n\n\n\n\n\n                        The following image points out the components of the Domo embed modal for a card.\n                       \n\n\n\n\n                        You can use the following table to learn more about the parts of the modal.\n                       \n\n\n\n\n                           Component\n                          \n\n                           Description\n                          \n\n\n\n\n\n\n                            Display options\n                           \n\n\n\n                            Let you toggle certain card features on or off in the embedded card. The following toggles are available:\n                           \n\n\n\n\n                               Show title —\n                              \n                              Toggles the card title.\n                             \n\n\n\n\n                               Allow drill —\n                              \n                              Toggles\n                              \n                               drill capability\n                              \n                              .\n                             \n\n\n\n                              Allow export —\n                             \n                             Toggles the ability to export the card.\n                            \n\n\n\n                               Allow table view —\n                              \n                              Toggles the ability to open the\n                              \n                               data table\n                              \n                              for the card. When this option is enabled, a grid icon\n                              \n                              appears at the top of the card. Viewers of the embedded card can open the data table by clicking this icon. Available for privately embedded cards only.\n                             \n\n\n\n\n                               Show summary number —\n                              \n                              Toggles the\n                              \n                               Summary Number\n                              \n                              for the card.\n                             \n\n\n\n\n                               Allow filter changes —\n                              \n                              Toggles the ability to set or change\n                              \n                               filters\n                              \n                              for the card. When this option is enabled, a funnel icon\n                              \n                              appears at the top of the card. Viewers of the embedded card can toggle the filter options by clicking this icon. Currently available for privately embedded cards only.\n                             \n\n\n\n\n                               Allow chart picker —\n                              \n                              Toggles the ability to change the\n                              \n                               chart type\n                              \n                              . When this option is enabled, a pie graph icon\n                              \n                              appears at the top of the card. Viewers of the embedded card can open the chart picker by clicking this icon.\n                             \n\n\n\n\n\n\n\n                            Sizing options\n                           \n\n\n\n                            Allows you to set the size of the embedded Domo card.\n                            \n\n                            Three default sizes are available:\n                            \n                             Square\n                            \n                            (600 x 600 pixels),\n                            \n                             Portrait\n                            \n                            (600 x 900) pixels, and\n                            \n                             Landscape\n                            \n                            (900 x 600 pixels).\n                            \n                            There is also a\n                            \n                             Custom\n                            \n                            option, which allows you to set your own custom width and height.\n                           \n\n\n\n\n\n                            Preview\n                           \n\n\n\n                            Displays a preview of the card with the size and option settings you have applied.\n                           \n\n                            You can interact with this preview just as you can with the embedded version of the card. For example, you can change the chart type, drill into the card (if drill is enabled), toggle series items by clicking them in the legend, and so on.\n                           \n\n\n\n\n                           Embed options\n                          \n\n\n                            Let you specify whether this card is to be embedded privately (default) or publicly.\n                           \n\n                            If you choose to make a card public, anyone on the web will be able to view it and the displayed data. This also gives Domo permission to publish the card as part of a public card newsfeed.\n                           \n\n                            When you choose the\n                            \n                             Public\n                            \n                            option, a URL is generated (under\n                            \n                             Share link\n                            \n                            ), which you can then copy and paste into the desired website, blog, social media platform, etc. You may also directly open any of five social media platforms (Facebook, Twitter, Google+, LinkedIn, or Pinterest) so you can embed the card immediately.\n                           \n\n\n\n\n\n                            HTML string\n                           \n\n\n\n                            Displays the automatically generated HTML string that you copy and paste into the website, portal, or application. You can copy the HTML by clicking the\n                            \n                            button to the right of the HTML string.\n                           \n\n\n\n\n\n\n\n                          Embedding a Card Publicly\n                         \n\n\n\n                        1. Navigate to either the dashboard where the card displays or the Details view for the card.\n                       \n\n                        2. Select\n                        \n\n                         Card options\n                        \n                        >\n                        \n                         Domo Everywhere\n                        \n                        .\n                        \n                        The embed card modal displays.\n                       \n\n                        3. Set the card size:\n                        \n                        Select a preset size for the embedded Card in the\n                        \n                         Default Size\n                        \n                        menu OR\n                        \n                        Select\n                        \n                         Custom\n                        \n                        and enter the desired dimensions in the\n                        \n                         Width\n                        \n                        and\n                        \n                         Height\n                        \n                        fields in pixels.\n                       \n\n                        4. Check the boxes for all the\n                        \n                         Display options\n                        \n                        you want to include in the embedded card.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n\n                            Allow table view\n                           \n                           and\n                           \n                            Allow filter changes\n                           \n                           are not currently available for publicly embedded cards.\n                          \n\n\n\n\n                        5. Select\n                        \n                         Publicly Available\n                        \n                        from the\n                        \n                         Embed Options\n                        \n                        list.\n                       \n\n                        6. Select\n                        \n                         Make Public\n                        \n                        .\n                       \n\n                        7. Select\n                        \n\n                         Copy\n                        \n                        to copy the automatically generated URL.\n                       \n\n                        8. (Conditional) To embed the card in any of the following five social media platforms—Facebook, Twitter, Google+, LinkedIn, or Pinterest—select the icon for the desired platform, log in if necessary, and paste the URL as required by the platform. Otherwise, open your website or blog and paste the URL as necessary.\n                       \n\n\n\n                          Embedding a Card Privately\n                         \n\n\n\n                        1. Navigate to either the dashboard where the card displays or the Details view for the card.\n                       \n\n                        2. Select\n                        \n\n                         Card options\n                        \n                        >\n                        \n                         Domo Everywhere\n                        \n                        .\n                        \n                        The embed card modal displays.\n                       \n\n                        3. Set the card size:\n                        \n                        Select a preset size for the embedded Card in the\n                        \n                         Default Size\n                        \n                        menu OR\n                        \n                        Select\n                        \n                         Custom\n                        \n                        and enter the desired dimensions in the\n                        \n                         Width\n                        \n                        and\n                        \n                         Height\n                        \n                        fields in pixels.\n                       \n\n                        4. Check the boxes for all the\n                        \n                         Display options\n                        \n                        you want to include in the embedded card.\n                       \n\n                        5. Select\n                        \n                         Private\n                        \n                        from the\n                        \n                         Embed options\n                        \n                        list.\n                       \n\n                        6. Select\n                        \n\n                         Copy\n                        \n                        to copy the HTML to embed.\n                       \n\n                        7. Paste the HTML into the website, portal, or application where you want the card to display. The specific instructions for doing this will vary depending on the website, portal, or application.\n                       \n\n\n\n\n\n\n\n                            Important:\n                           \n                           The cards and dashboards must be shared with the users accessing the embedded content in order for them to be able to view it.\n                          \n\n\n\n\n\n\n                          Using the JavaScript API for Filtering Embedded Cards and Dashboards\n                         \n\n\n\n                        Please visit\n                        \n                         Embedded Analytics\n                        \n                        in the developer docs for code examples in using the JavaScript API for filtering embedded content.\n                       \n\n\n\n                          Tracking Publicly Embedded Cards\n                         \n\n\n\n                        You can keep track of all publicly embedded Cards in your Domo instance in\n                        \n                         Admin Settings > Domo Everywhere\n                        \n                        . You can see information such as embed creator, current embed link status (public or disabled), number of public views, and so on. You must have an Admin security role or a custom role with the Embed Cards grant to see this tab.\n                       \n\n\n\n                          Whole-Page Filtering\n                         \n\n\n\n                        With individually embedded cards, there is more flexibility for format and layout than on a Domo dashboard. The Whole-Page Filtering feature allows you to use the power of the Filters from Domo dashboards for embedded cards in your\n                        \n                         authorized domains\n                        \n                        . Create Filters for your use cases and apply the Filter parameters to every embedded card on your page.\n                       \n\n                        In the image below, the\n                        \n                         Country\n                        \n                        Filter is applied to each individual embedded card to see the data on confirmed Covid-19 cases, currently infected, deaths, and cumulative trend for Greenland and Greece.\n                       \n\n\n\n\n\n\n                          Video - Embed a Domo Card\n                         \n\n\n\n\n\n\n\n                        Embedding Dashboards\n                       \n\n                        For Domo dashboards, you can choose whether or not to include the following options:\n                       \n\n\n\n                          Dashboard title\n                         \n\n\n\n                          Show Filter bar\n                         \n\n\n\n\n                           filtering\n                          \n\n\n\n\n                          Export of the raw data of each Card to CSV\n                         \n\n\n\n\n                           Persist filters\n                          \n                          , which automatically append pfilter parameters to the end of any custom interaction links\n                         \n\n\n\n                          Opening of links in a new tab\n                         \n\n\n\n                        Embedding a Dashboard\n                       \n\n                        If you are a Domo Everywhere Embed customer, you can embed any Domo dashboard.\n                       \n\n                        From the dashboard you want to embed, select\n                        \n                         Share\n                        \n                        >\n                        \n                         Embed Dashboard\n                        \n                        .\n                        \n                        The embed dashboard modal displays.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           With dashboard embed, you can only embed using an iFrame, not a JavaScript API as you can with card embed.\n                          \n\n\n\n\n                        The following image points out the components of the Domo embed modal for a dashboard.\n                       \n\n\n\n\n\n                        You can use the following table to learn more about the parts of the modal.\n                       \n\n\n\n\n                           Component\n                          \n\n                           Description\n                          \n\n\n\n\n\n\n                            Display options\n                           \n\n\n\n                            Let you toggle certain features on or off in the cards in the embedded dashboard. The following toggles are available:\n                           \n\n\n\n\n                               Show title —\n                              \n                              Toggles the dashboard title. The title can be hidden if you have already labeled the content in the host page that contains the iFrame.\n                             \n\n\n\n\n                               Allow interactions and filtering —\n                              \n                              Allows you to enable interactions and filtering on embedded dashboard cards. You should turn off this option if you want to lock down your embedded content (usually only for public embed).\n                              \n\n                              Interactions include such actions as opening the card Details view in a new browser tab, opening a specified web page, and enabling drilling into the card. For more information about configuring interactions in dashboards, see\n                              \n                               Creating Domo Dashboards\n                              \n                              ) or transforming the data to exclude the columns.\n                             \n\n\n\n                              Show filter bar —\n                             \n                             Toggles the Filter bar on the dashboard.\n                            \n\n\n\n                               Allow export —\n                              \n                              Allows users to export the raw data for each card in CSV format. (The\n                              \n                               Export\n                              \n                              button appears when users mouse over cards in the embedded dashboard).\n                             \n\n\n\n\n                               Allow maximization —\n                              \n                              Opens a pop-up window of the card Details view for a card. This allows you to see more detail and interact with the card such as quick Filters and allows for additional export options.\n                             \n\n\n\n\n                               Persist Filters —\n                              \n                              Enables persist Filters, which automatically append pfilter parameters to the ends of any custom interaction links so that the following content maintains context around Filters on this dashboard. Persist Filters are discussed in detail here:\n                              \n                               Using Pfilters to Apply Filters from URL Query Parameters to Embedded Dashboards\n                              \n                              .\n                             \n\n\n\n\n                               Open links in new tab —\n                              \n                              When users click on links in cards, they are opened in a new browser window; otherwise the new content opens within the iFrame. (The\n                              \n                               Allow interactions and filtering\n                              \n                              option must be checked for links to be clickable.)\n                             \n\n\n\n\n\n\n\n                            Sizing options\n                           \n\n\n\n                            Allow you to set the width and height of the embedded Domo dashboard.\n                           \n\n\n\n\n                           Embed options\n                          \n\n\n                            Let you specify whether this dashboard is to be embedded, and, if so, privately or publicly (the default option is\n                            \n                             Off\n                            \n                            ). If you choose to make a dashboard public, anyone on the web will be able to view its content.\n                           \n\n                            When you choose the\n                            \n                             Public\n                            \n                            option, a URL is generated (under\n                            \n                             Share link\n                            \n                            ), which you can then copy and paste into the desired website, blog, social media platform, etc. The public embed option is not authenticated so Filters cannot be personalized.\n                           \n\n                            When you choose the\n                            \n                             Private\n                            \n                            option, users will need to authenticate to see the embedded content. Because the private embed option uses authentication, Filters can be personalized via PDP or programmatic filters.\n                           \n\n\n\n\n                           Share link\n                          \n\n                           Allows you to view the embedded dashboard directly.\n                          \n\n\n\n                           Embed code\n                          \n\n                           Displays the automatically generated HTML string that you copy and paste into the website, portal, or application. You can copy the HTML by clicking the\n                           \n                           button to the right of the HTML string.\n                          \n\n\n\n                           Embed ID\n                          \n\n                           Used in the HTML embed code in programmatic filtering, which is discussed here:\n                           \n                            Using Programmatic Filters with Domo Embed\n                           \n                           .\n                          \n\n\n\n                           Export DataSet mapping\n                          \n\n                           Lets you download a CSV file that lists all of the original DataSet IDs used in the cards in the Domo dashboard and maps them to obfuscated datasource IDs that can be used outside the Domo platform.\n                          \n\n\n\n\n\n\n                          Embedding a Dashboard Publicly\n                         \n\n\n\n                        1. Navigate to the dashboard in Domo.\n                       \n\n                        2. Go to\n                        \n\n                         Share\n                        \n                        >\n                        \n                         Embed Dashboard\n                        \n                        .\n                       \n\n                        3. Check the boxes for all the\n                        \n                         Display options\n                        \n                        you want to include in the embedded dashboard.\n                       \n\n                        4. Enter the desired dimensions in the\n                        \n                         Width\n                        \n                        and\n                        \n                         Height\n                        \n                        fields in pixels.\n                       \n\n                        5. Select\n                        \n                         Public\n                        \n                        from the\n                        \n                         Embed options\n                        \n                        list.\n                       \n\n                        6. Select\n                        \n\n                         Copy\n                        \n                        to copy the automatically generated URL.\n                       \n\n                        7. Paste the embed code into the website, portal, or application where you want the Domo dashboard to display. The specific instructions for doing this will vary depending on the website, portal, or application.\n                       \n\n\n\n                          Embedding a Dashboard Privately\n                         \n\n\n\n                        1. Navigate to the dashboard in Domo.\n                       \n\n                        2. Go to\n                        \n\n                         Share\n                        \n                        >\n                        \n                         Embed Dashboard\n                        \n                        .\n                       \n\n                        3. Check the boxes for all the\n                        \n                         Display options\n                        \n                        you want to include in the embedded dashboard.\n                       \n\n                        4. Enter the desired dimensions in the\n                        \n                         Width\n                        \n                        and\n                        \n                         Height\n                        \n                        fields in pixels.\n                       \n\n                        5. Select\n                        \n                         Private\n                        \n                        from the\n                        \n                         Embed options\n                        \n                        list.\n                       \n\n                        6. Select\n                        \n\n                         Copy\n                        \n                        to copy\n                        \n                         Embed code.\n                        \n\n\n                        7. Paste the embed code into the website, portal, or application where you want the dashboard to display. The specific instructions for doing this will vary depending on the website, portal, or application.\n                       \n\n\n\n\n\n                          Important:\n                         \n                         The cards and dashboards must be shared with the users accessing the embedded content in order for them to be able to view it.\n                        \n\n\n\n\n                          Video - How to Publicly Embed Domo Content\n                         \n\n\n\n\n\n\n\n                        Configuring Private Embed with PDP\n                       \n\n                        Private embed leverages Domo’s SSO to authenticate users on the Domo platform. Embedded content is then served to the end user via either the Javascript API or iFrames. You can pair private embed with PDP to serve appropriate content to end users, including external end users. If you use embed to serve content to external end users, one of two methods is preferred:\n                       \n\n\n                         Embed cards from a white-labeled subscriber instance. This way, if a savvy end user was to access the Domo application, they would see only a white-labeled instance (e.g. no Buzz functionality).\n                         \n                         To learn more, see\n                         \n                          Publishing Content to a Subscriber Organization.\n                         \n\n\n                         Use Programmatic embed. When using Programmatic embed, end users are NOT actually authenticated users of Domo. Thus, end users are not able to access the Domo application. This means the portal or application code handles authentication and ensures end users see the appropriate data.\n                         \n                         For more information, see\n                         \n                          Using Programmatic Filters with Domo Embed.\n                         \n\n\n\n                        Implementing Private Embed\n                       \n\n                        1. Set up Single Sign-On (SSO).\n                        \n                        For more information, see\n                        \n                         Understanding and Configuring Domo Single Sign-On Using SAML\n                        \n                        .\n                       \n\n                        2. Enable Private embed.\n                       \n\n                        3. Set up PDP.\n                        \n                        For more information, see\n                        \n                         Creating and Deleting PDP Policies\n                        \n                        .\n                       \n\n                        4. Configure cards and dashboards for embedding.\n                        \n                        To see all cards and dashboards in your Domo environment that are configured for embedding, go to\n                        \n                         Admin Settings\n                        \n                        >\n                        \n                         Domo Everywhere\n                        \n                        >\n                        \n                         Embed\n                        \n                        .\n                       \n\n                        5. Embed cards and dashboards using iFrame or Javascript code in the portal or application.\n                       \n\n\n\n\n\n\n\n                            Important:\n                           \n                           The cards and pages must be shared with the users accessing the embedded content in order for them to be able to view it.\n                          \n\n\n\n\n                        Need Support?\n                       \n\n                        If you need support with your embedded content, contact us here:\n                        \n                         support@domo.com\n                        \n\n\n\n\n                          Include the following information in your request:\n                         \n\n\n\n                          Domo environment(s) where the behavior is occurring\n                         \n\n\n\n                          Description of behavior\n                         \n\n\n\n                          Screenshot of behavior (if applicable)\n                         \n\n\n\n                          Steps to recreate behavior (if known/applicable)", "Preview Article": "Click here to preview", "URL Name": "360043437993", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005021", "Archived Date": "", "Language": "English", "Primary Version": "Sharing Content Outside of Domo with Embed", "Article Total View Count": "8,485", "": "", "Article Created Date": "11/2/2022, 8:16 PM", "First Published Date": "11/2/2022, 8:37 PM"}, "title": "\n              Sharing Content Outside of Domo with Embed\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}