{"file_path": "../../raw_kb_v2\\article\\360042934954\\index.html", "content": {"title": "\n\n\n Social User FAQs and Video\n\n\n", "article_body": "\n\nIntro\n-------\n\nThis topic answers a number of commonly asked questions regarding the Social role in Domo. It also provides access to a training video for better understanding the Social role.\n\n\n FAQs\n------\n\n\n####\n Do Social users require a license?\n\nNo, Social users are free and do not take up a license.\n\n###\n What can Social users do and not do in Domo?\n\nThey can use Buzz, Projects and Tasks, and Profiles, and they can view Cards that have been shared with them via Buzz. They cannot do anything else, including create new Cards, drill into Cards, access the Data Center, etc.\n\n###\n What does a Social user's view look like?\n\nDue to social users not having access to most of the Domo instance, they are unable to see the main menu\n\n. On mobile, they can see Pages but not go into interactive mode on charts. On the web version, they cannot see Pages at all. To see exactly what a social user's view is, see the Social User Overview video below.\n\n###\n How does a person become a Social user?\n\nThey must either...\n\n Be invited into the instance by another user, or\n* Be downgraded from a regular user.\n\n\n####\n Who can invite a Social user to Domo?\n\nBy default, anyone, including other Social users. However, Admin users have the ability to disable the invite message for non-Admins. They can do this by going into\n **More >**\n**Admin > Feature settings > Buzz**\n and unchecking the box that reads \"Allow all users to invite Social users.\"\n\n###\n How do Social users work with SSO?\n\nYou can either set them as the default for your Role configuration or have your administrator configure users one by one.\n\n###\n When a user is downgraded to a Social user, what happens to their owned items (Cards, DataSets, etc.)?\n\nThe owned components must be reassigned in order to be managed.\n\n###\n How do Admin users and other paid users in an instance see or interact with Social users in the instance?\n\nBy communicating through Buzz.\n\n###\n Can paid users share components of an instance (Cards, Pages, etc.) with Social users directly and outside of Buzz?\n\nNo.\n\n###\n Can scheduled reports be sent to Social users?\n\nYes.\n\n###\n Will Social users register in the Activity Logs in Admin Settings?\n\nYes.\n\n*Video - Social User Overview**\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042934954\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004067\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSocial User FAQs and Video\n\n", "article_total_view_count": "\n\n\n 5,258\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "social_user_faqs_and_video", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "controlling_access_in_domo", "url": "/s/topic/0TO5w000000ZanMGAS"}, {"text": "roles", "url": "/s/topic/0TO5w000000ZapEGAS"}]}