{"file_path": "../../raw_kb_v2\\article\\4403173731863\\index.html", "content": {"Title": "March 2021 Release Notes", "Article Body": "New features and enhancements\n                         \n\n\n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Build your own Writeback Connector\n                       \n\n                        Using the Connector IDE, build a Writeback Connector that will send data from Domo to your external systems. Writeback Connectors give you the power to share data between your business systems that currently don't talk to each other. And now, if Domo’s library does not yet include what you need, you have the expanded ability to build your own. For more information, visit\n                        \n                         https://developer.domo.com/docs/writeback-connectors/build\n                        \n                        .\n                       \n\n                        Data Science Home Page\n                       \n\n                        The Data Science Home Page shows all of the powerful data science tools in one place, gives you quick access to the data science tools, outlines the products and services, and where tools fit into the data science maturity journey. For more information, see\n                        \n                         Data Science Home Page\n                        \n                        .\n                       \n\n\n\n\n                        Python and R SDK enhancements\n                       \n\n                        The R and Python SDK's have been updated to use the same function naming for both languages and to have the same functions available in each. For more information, visit\n                        \n                         https://developer.domo.com/docs/domo-sdks/sdks\n                        \n                        .\n                       \n\n                        Scheduled Reports security options\n                       \n\n                        With the new Scheduled Reports security options, Admins now have the ability to enable the\n                        \n                         Limit to Domo users\n                        \n                        option. When this setting is configured, Domo blocks scheduled reports to any external email address, only email addresses tied to an existing account will receive reports. For more information, see\n                        \n                         Scheduling Reports\n                        \n                        .\n                       \n\n                        Auto-Width Dashboards\n                       \n\n                        With the Auto-Width Dashboard setting, Dashboard content will expand to fill all the available window space. This will allow for more rows/columns to be visible from the Dashboard view. This is enabled on a per-Dashboard basis to allow you to customize your Stories. For more information, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n\n\n                        New custom import chart types\n                       \n\n                        With the new custom import chart types, you can now create custom charts from more than just SVG files.\n                       \n\n                        The following formats are now supported:\n                       \n\n\n\n                          KML (keyhole markup language) -\n                         \n                         is a file format used to display geographic data in an Earth browser such as Google Earth.\n                        \n\n\n                          GeoJSON -\n                         \n                         is an open standard format designed for representing simple geographical features, along with their non-spatial attributes.\n                        \n\n\n                          TopoJSON -\n                         \n                         is an extension of GeoJSON that encodes geospatial topology and that typically provides smaller file sizes.\n                        \n\n\n                          Shape -\n                         \n                         is an\n                         \n\n                         ESRI standard file format. Includes geospatial vector data (import Google Earth and export as KML.)\n                        \n\n\n                        For more information, see\n                        \n                         Custom Charts\n                        \n                        .\n                       \n\n                        Divergent colors\n                       \n\n                        Divergent colors make it easy to quickly create and display range distributions by combining multiple color themes. Divergent colors allow you to pick any starting color and any ending color. In addition, you can pick the number of ranges to use. Divergent colors also provide you control of your midpoint. You can select the midpoint value and color or to not include the midpoint. For example, you can use diverging colors to make it easier to see hot to cold trends in your data by using a red theme combined with a green theme to show a more complete range of values. Divergent colors add this flexibility to Map and Heat Map Cards. For more information, see\n                        \n                         Heat Map\n                        \n                        .\n                       \n\n\n\n\n                        Week view in Calendar Cards\n                       \n\n                        The week view in Calendar Cards add a new option to show as a “Week” view. This allows navigation by week and lets you customize the start of the week shown. For more information, see\n                        \n                         Calendar\n                        \n                        .\n                       \n\n\n\n\n                        Dependency Gantt chart\n                       \n\n                        The Dependency Gantt chart handles changes in dates for you and gives many new display options to communicate project timelines, such as:\n                       \n\n\n                         Calculate end dates from dependency and duration data.\n                        \n\n                         Show dependency data relationships.\n                        \n\n                         Display milestones.\n                        \n\n                         Show projects and sub-projects in a hierarchy.\n                        \n\n                         Allow resource tracking and representation in the chart.\n                        \n\n                         Smart date calculations – automatically account for weekends or display them.\n                        \n\n\n                        For more information, see\n                        \n                         Dependency Gantt Chart\n                        \n                        .\n                       \n\n\n\n\n                        Progress bar color ranges\n                       \n\n                        The Progress bar chart now has up to four color ranges that can be used to augment your chart. You can specify a minimum and maximum value for each range and select the corresponding color you would like to display. For more information, see\n                        \n                         Progress Bar Gauge\n                        \n                        .\n                       \n\n\n\n\n                        Create a \"top n\" Trellis chart\n                       \n\n                        The Trellis Chart Property now allows you to see just the top/bottom “n” in a category. For example, Top 5 Customers by Region. The Trellis Chart Property is found in most chart types. For more information, see\n                        \n                         Properties Available for Most Charts\n                        \n                        .\n                       \n\n\n\n\n                        Analyzer UI improvements\n                       \n\n                        We’ve made it easier to work in Analyzer with the following improvements:\n                       \n\n\n                         Limit Rows in Analyzer is now grouped with Filter and Sort.\n                        \n\n                         Filter and Sort are combined into one section.\n                        \n\n                         Summary number dropdown and format changes now auto-saves, so you no longer need to click Apply.\n                        \n\n\n                        For more information, see\n                        \n                         Analyzer Layout\n                        \n                        .\n                       \n\n\n\n\n                        Saved Search\n                       \n\n                        With the Saved Search feature, you can save and easily come back to your common searches—no matter how complex they are. For more information, see\n                        \n                         Searching in Domo\n                        \n                        .\n                       \n\n\n\n\n                        Regional formatting for multinational corporations\n                       \n\n                        Regional formatting allows Admins to set date and number formats globally on the Domo platform based on your region. Users can also now select their region as well as their language. Formatting conventions based on your region will now be used to display numerical, financial, and date/time values based on your region. For more information, see\n                        \n                         Setting Your Time Zone and Regional Formatting\n                        \n                        .\n                       \n\n\n\n\n                        Support for screen readers in Stories\n                       \n\n                        Screen readers in Stories give expanded access for screen readers and keyboards to better enable customers to expose Domo content to users with accessibility requirements. Domo’s improved accessibility functionality allows customers to make their Cards screen reader-friendly, as well as find Stories, traverse layouts, and read Card details. For more information, see\n                        \n                         Support for Screen Readers in Stories\n                        \n                        .\n                       \n\n\n\n\n                        Buzz Status\n                       \n\n                        The Buzz Status feature allows you to set your status on web or mobile to\n                        \n                         Available\n                        \n                        ,\n                        \n                         Busy\n                        \n                        ,\n                        \n                         Away\n                        \n                        , or\n                        \n                         Out of the office\n                        \n                        . When someone sends you a 1:1 message or @mentions you in a conversation and your status is set to something other than Available, they will see a warning message that states you are unavailable. You can also add custom messaging to your status message when you are unavailable. An icon on your avatar indicates your current status. For more information, see\n                        \n                         Buzz Layout\n                        \n                        .\n                       \n\n\n\n\n                        Premium features\n                       \n\n                        These features are available on demand and paid. To request these features be enabled, reach out to your Domo Customer Success Manager, Technical Consultant, or Account Executive. If you do not have contact information for your CSM, TC, or AE, contact Technical Support. For information on how to contact Support, please see\n                        \n                         Getting Help\n                        \n                        . Depending on the feature, you may be required to complete training before you can use the feature.\n                       \n\n                        Adrenaline DataFlow\n                       \n\n                        An Adrenaline DataFlow is an Adrenaline powered, in-house built, high-scale, high-performance data-transformation tool for massive DataSets in Domo. It allows you to leverage investments and performance improvements made to the Adrenaline engine. Adrenaline DataFlows are a SQL script-based transformation interface (similar to MySQL & RedShift DataFlows.) For more information, see\n                        \n                         Creating an Adrenaline DataFlow\n                        \n                        .\n                       \n\n                        AutoML (Machine Learning)\n                       \n\n                        Domo AutoML enables you to train dozens of ML models with just a few clicks, and deploy the best performing models to production. Go from data to models to outcomes faster.\n                       \n\n                        Domo makes it easy to:\n                       \n\n\n                         Automatically train and tune dozens of ML models.\n                        \n\n                         Launch hundreds of training jobs on any DataSet in Domo to find the model that achieves the best performance for your task.\n                        \n\n                         Easily deploy the model on your DataSet with the new AutoML tile in Magic ETL.\n                        \n\n                         All that is required to be successful with AutoML is a well-defined problem and a clean DataSet—Domo will take care of the rest.\n                        \n\n\n                        For more information, see\n                        \n                         AutoML (Machine Learning)\n                        \n                        .\n                       \n\n                        Integration Studio\n                       \n\n                        Integration Studio allows you to link disparate business systems together that otherwise would not be able to share data. Transform data, or add Data Science and AI before sharing to a different business system using the Writeback Tile in Magic ETL. For more information, see\n                        \n                         Integration Studio\n                        \n                        .\n                       \n\n                        Campaigns App SMS\n                       \n\n                        The Campaigns App SMS add-on provides you with the ability to programmatically send SMS messages from Domo. This gives you the ability to contact non-Domo users through multiple avenues automatically for items such as: customer appointment reminders, staff & contractor shift rostering notices, unpaid invoice reminders, shipping updates, product “back in stock” alerts, etc.\n                       \n\n                        Use the Campaigns App SMS add-on to:\n                       \n\n\n                         Read cell phone numbers from a Domo DataSet to populate your list of recipients.\n                        \n\n                         Prepare your SMS message body content manually or populate it programmatically from Domo DataSet values.\n                        \n\n                         Manually send SMS message blast, schedule its run time, or trigger it using DataSet Alerts.\n                        \n\n\n                        For more information, see\n                        \n                         Domo Campaigns App\n                        \n                        .\n                       \n\n\n\n\n                        Beta features\n                       \n\n                        If you are interested in joining the Beta for these features, please contact your Customer Success Manager (CSM).\n                       \n\n                        Filter Views (Beta)\n                       \n\n                        Filter Views allow you to customize a single Dashboard to meet the needs of all audiences.\n                       \n\n                        With Filter Views you can:\n                       \n\n\n                         Save personalized Views that only you see.\n                        \n\n                         Curate and share important Views to create alignment on a specific perspective.\n                        \n\n                         Provide any number of personalized data stories for any person in any role.\n                        \n\n                         Designate which saved Filter View is the “default” for a Dashboard.\n                        \n\n\n                        For more information, see\n                        \n                         Applying Page Level-Filters and Filter Views\n                        \n                        .\n                       \n\n\n\n\n                        Page Filter settings (Beta)\n                       \n\n                        With Page Filter settings, you can now customize how your users interact with Cards on your Dashboard. You can toggle off\n                        \n                         Allow adding of new filters\n                        \n                        to have users only use Card interactions to filter. You can also turn off Date Filters if your Dashboard is built to look at a specific time frame. For more information, see\n                        \n                         Applying Page Level-Filters and Filter Views\n                        \n                        .\n                       \n\n                        Getting help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n                        in the top navigation bar.\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://domo.com/university/\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n                         More\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "4403173731863", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004418", "Archived Date": "", "Language": "English", "Primary Version": "March 2021 Release Notes", "Article Total View Count": "11,598", "": "", "Article Created Date": "10/24/2022, 9:48 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              March 2021 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}