{"file_path": "../../raw_kb_v2\\article\\360042930914\\index.html", "content": {"Title": "OpenWeatherMap Connector", "Article Body": "Intro\n                       \n\n                        OpenWeatherMap is an online service that provides weather data, including current weather data, forecasts, and historical data to the developers of web services and mobile applications. To learn more about the OpenWeatherMap API, visit their page (\n                        \n                         https://openweathermap.org/api\n                        \n                        ).\n                       \n\n                        You connect to your OpenWeatherMap account in the Data Center. This topic discusses the fields and menus that are specific to the OpenWeatherMap connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Common use cases are for...\n                           \n\n\n                             Retailers that need to see how weather impacts sales, and\n                            \n\n                             Logistics companies that need to understand forecasts and historical weather.\n                            \n\n\n                            Basically this connector is great for any organization that relies on weather trends for attendance, product delivery, or outdoor work.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Temperature and precipitation forecasts\n                             \n\n\n\n                              Historical weather patterns\n                             \n\n\n\n                              Likelihood of weather events occurring\n                             \n\n\n\n                              Possibility of extreme events.\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              Facilities\n                             \n\n\n\n                              Event planning\n                             \n\n\n\n                              Operations manager\n                             \n\n\n\n                              Program manager\n                             \n\n\n\n                              Sales teams\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            Less than 1 hour\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            3\n                           \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your OpenWeatherMap account and create a DataSet, you must have an OpenWeatherMap API key. You can obtain an API key by doing the following:\n                       \n\n\n\n                          Log into your OpenWeatherMap account.\n                         \n\n\n\n                          Click the\n                          \n                           API Keys\n                          \n                          tab.\n                         \n\n\n\n                          Copy and paste the default API key into Domo OR use the\n                          \n                           Create Key\n                          \n                          option to generate a new key.\n                         \n\n\n\n                        Connecting to Your OpenWeatherMap Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the OpenWeatherMap Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your OpenWeatherMap account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your OpenWeatherMap API key. For information about obtaining a key, see \"Prerequisites,\" above.\n                          \n\n\n\n\n\n                         Once you have entered valid OpenWeatherMap credentials, you can use the same account any time you go to create a new OpenWeatherMap DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the OpenWeatherMap report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Current Weather Data\n                              \n\n                               Returns current weather data for one location, based on city ID, city name, geographic coordinates (latitude and longitude), or ZIP code.\n                              \n\n\n\n                               Current Weather Data for Multiple Cities\n                              \n\n                               Returns current weather data for several city IDs.\n                              \n\n\n\n                               Five-Day Three-Hour Forecast\n                              \n\n                               Returns a weather forecast for the next five days, at three hour intervals, for one location identified by city ID, city name, or geographic coordinates (latitude and longitude).\n                              \n\n\n\n                               Historical Data\n                              \n\n                               Returns historical weather data for one location identified by city ID, city name, or geographic coordinates (latitude and longitude). Requires a separate paid plan; for more information see\n                               \n                                OpenWeatherMap Subscription Pricing\n                               \n                               .\n                              \n\n\n\n                               Sixteen Day Daily Forecast\n                              \n\n                               Returns a 16-day weather forecast with daily average parameters for one location identified by city ID, city name, or geographic coordinates (latitude and longitude).\n                              \n\n\n\n                               Current Weather by Weather Station\n                              \n\n                               Returns current weather from one or several weather stations.\n                              \n\n\n\n\n\n\n\n                           Choose Location By\n                          \n\n                           Select whether you want the location for your report to be based on city ID, city name, latitude and longitude, or zip code. For the most accurate results, choose\n                           \n                            City ID\n                           \n                           .\n                          \n\n\n\n                           City ID\n                          \n\n                           Enter the City ID. A list of City IDs can be downloaded from\n                           \n                            OpenWeatherMap\n                           \n                           .\n                          \n\n\n\n                           City Name\n                          \n\n                           Enter the name of the city you want to retrieve data for.\n                          \n\n\n\n                           Latitude\n                          \n\n                           Enter the latitude of the region you want to retrieve data for. This can be a positive or negative number with up to 6 decimal places. Degree-minutes-seconds form is not accepted.\n                          \n\n\n\n                           Longitude\n                          \n\n                           Enter the longitude of the region you want to retrieve data for. This can be a positive or negative number with up to 6 decimal places. Degree-minutes-seconds form is not accepted.\n                          \n\n\n\n                           Zip Code\n                          \n\n                           Enter the ZIP code of the area you want to retrieve data for.\n                          \n\n\n\n                           Units\n                          \n\n                           Select whether to return temperature data in Kelvin, Celsius, or Fahrenheit units.\n                          \n\n\n\n                           Search Accuracy\n                          \n\n\n                            Select whether to return the one closest match (\n                            \n                             Accuracy\n                            \n                            ) or all similar values (\n                            \n                             Like\n                            \n                            ).\n                           \n\n                            For example, if this was set to\n                            \n                             Accurate\n                            \n                            and you searched for a city named \"Cedar,\" your report would return data for \"Cedar Rapids\" (since this is the city determined by the server to be the best match). But if this parameter was set to\n                            \n                             Like\n                            \n                            , you would get results for \"Cedar City,\" \"Cedar Hills,\" as well as cities named \"Cedar.\"\n                           \n\n\n\n\n                           Multiple City IDs\n                          \n\n\n                            Enter a comma-separated list of City IDs. For example:\n                            \n                             524901,703448,2643743\n                            \n\n\n                            A list of City IDs can be downloaded from\n                            \n                             OpenWeatherMap\n                            \n                            .\n                           \n\n\n\n\n                           Start Date\n                          \n\n                           Select the start date for the range of data you want to pull.\n                          \n\n\n\n                           End Date\n                          \n\n                           Select the end date for the range of data you want to pull.\n                          \n\n\n\n                           Choose Station By\n                          \n\n                           Select whether to pull station data for a station ID, a geographic point (based on latitude and longitude), or a rectangular zone.\n                          \n\n\n\n                           Station ID\n                          \n\n                           Enter the ID of the station you want to retrieve data for. You can find station IDs by searching for weather stations using geographic coordinates and noting the IDs in the returned data.\n                          \n\n\n\n                           Count\n                          \n\n                           Enter the expected number of weather stations.\n                          \n\n\n\n                           Bounding Box\n                          \n\n\n                            Enter the coordinates for the rectangular zone you want to retrieve data for. The format for this is:\n                            \n                             [longitude of top left point],[latitude of top left point],[longitude of bottom right point],[latitude of bottom right point],[map zoom level]\n                            \n                            .\n                           \n\n                            For example:\n                            \n                             8.87,49.07,65.21,61.26,6\n                            \n\n\n\n\n\n                           Cluster\n                          \n\n                           Select whether to use server clustering of points.\n                          \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n\n                          Double-check the spelling on the city name.\n                         \n\n\n\n                          If using city IDs, make sure the IDs are correct.\n                         \n\n\n\n                          Ensure the free API key is valid.\n                         \n\n\n\n                          If data limits or speed becomes an issue, consider upgrading to a paid plan.", "Preview Article": "Click here to preview", "URL Name": "360042930914", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003368", "Archived Date": "", "Language": "English", "Primary Version": "OpenWeatherMap Connector", "Article Total View Count": "4,699", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              OpenWeatherMap Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}