{"file_path": "../../raw_kb_v2\\article\\360042930314\\index.html", "content": {"Title": "Asana Connector", "Article Body": "Intro\n                       \n\n                        Asana is a cloud-based project management platform that helps users track projects, tasks, stories and other project-related workflows. To learn more about the Asana API, visit their page (\n                        \n                         https://asana.com/developers/documen...arted/overview\n                        \n                        ).\n                       \n\n                        You connect to your Asana account in the Data Center. This topic discusses the fields and menus that are specific to the Asana connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Asana account and create a DataSet, you must have the email address you use to log into Asana, as well as your Asana password. Alternatively, you can use Google credentials to connect.\n                       \n\n                        Connecting to Your Asana Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Asana Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Asana connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Asana accounts in Domo) to open the Asana OAuth screen where you can enter your Asana or Google credentials. Once you have entered valid credentials, you can use the same account any time you go to create a new Asana DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Asana when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Asana.\n                          \n\n\n\n\n                        You will also need an API Key for your Asana account. Any user can get their own API key by visiting the Account Settings dialog and clicking on the Apps tab. The API key is located at the bottom of this dialog box.\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select. If you select the \"Tasks\" report, a \"Subreport\" menu appears from which you may select a secondary report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Asana report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Attachments\n                              \n\n                               Retrieves all attachments for a specified workspace.\n                              \n\n\n\n                               Projects\n                              \n\n                               Retrieves all projects in a specified workspace.\n                              \n\n\n\n                               Stories\n                              \n\n                               Retrieves all stories in a specified workspace.\n                              \n\n\n\n                               Tags\n                              \n\n                               Retrieves all tags made on tasks in a specified workspace.\n                              \n\n\n\n                               Tasks\n                              \n\n                               Retrieves all tasks for a specified workspace. With this report, you may also select a subreport.\n                              \n\n\n\n                               Teams\n                              \n\n                               Retrieves all teams for a specified workspace.\n                              \n\n\n\n                               Users\n                              \n\n                               Retrieves all users for a specified workspace.\n                              \n\n\n\n                               Workspaces\n                              \n\n                               Retrieves all workspaces for the authenticated user.\n                              \n\n\n\n\n\n\n\n                           Subreport\n                          \n\n\n                            Select the desired subreport for the \"Tasks\" report. The following subreports are available:\n                           \n\n\n\n\n                               None\n                              \n\n                               Only task data is returned.\n                              \n\n\n\n                               Followers\n                              \n\n                               Retrieves a list of tasks enhanced with followers data.\n                              \n\n\n\n                               Hearts\n                              \n\n                               Retrieves a list of tasks enhanced with hearts data.\n                              \n\n\n\n                               Memberships\n                              \n\n                               Retrieves a list of tasks enhanced with memberships data.\n                              \n\n\n\n                               Projects\n                              \n\n                               Retrieves a list of tasks enhanced with project data.\n                              \n\n\n\n\n\n\n\n                           Workspace\n                          \n\n                           Select the workspace you want to retrieve data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        How often can the data be updated?\n                       \n\n                        DataSets can be updated as often as once an hour.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        Asana does not document any limits in their API.", "Preview Article": "Click here to preview", "URL Name": "360042930314", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003431", "Archived Date": "", "Language": "English", "Primary Version": "Asana Connector", "Article Total View Count": "2,475", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Asana Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}