{"file_path": "../../raw_kb_v2\\article\\360043428853\\index.html", "content": {"title": "\n\n\n Viewing the Lineage of a DataSet in Analyzer\n\n\n", "article_body": "\n\nIn the Analyzer view for a Visualization Card, you can see the lineage of the DataSet that powers the Card. By \"lineage,\" we mean the DataSets that have been combined and/or transformed using DataFlows or DataFusion to generate this DataSet. The following screenshot shows an example of a DataSet with an extensive lineage:\n\nIn this example, two DataSets, \"Demographic Detail\" and \"Sales Data,\" were combined using a DataFlow or DataFusion to yield the \"Adjusted Revenue Data\" DataSet. That DataSet  was then combined with \"Agency Inputs\" and \"Ad Campaigns\" to generate another new DataSet—\"Revenue - Combined All.\" Finally, that DataSet was transformed in some way to create \"Sales Data - Final\"—the DataSet powering this Card.\n\n\n You can click the name of any DataSet in a lineage to expand the information panel for the DataSet. This shows you the owner, the connector, last update time, and columns. If you click the name of a DataSet again, the DataSet details view appears. For more information about this view, see\n\nData Center Layout\n\n.\n\n\n This ability to view the lineage of a DataSet and find out more about ancestor DataSets is useful in showing you that your data is up-to-date and running on time. If there are any issues from one step in the lineage to another, the line for that step appears red or orange instead of blue. Orange indicates that this DataSet has broken but has not run since breaking (possibly indicating a recent problem). Red indicates that a DataSet has attempted to run at least once since breaking. This color coding lets you know where problems are occurring so you can go in and fix your connections.\n\n*Video - Using Data Lineage**\n\n*To view the lineage for a DataSet in Analyzer,**\n\n. Open the Analyzer for the Card you want to see the lineage for.\n\n\n You can do this by selecting\n **Edit in Analyzer**\n in either the page view or Details view for the Card.\n2. (Optional) If the Analyzer toolbar is not expanded near the top of the window, click\n\nto expand it.\n3. Click the\n **Lineage**\n button in the toolbar.\n\nThe Lineage view for the Card then opens in its own window.\n\n\n For more information about methods of combining and transforming DataSets to create new DataSets, see\n\nMagic Transforms\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428853\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004629\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nViewing the Lineage of a DataSet in Analyzer\n\n", "article_total_view_count": "\n\n\n 4,996\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "viewing_the_lineage_of_a_dataset_in_analyzer", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "analyzer", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}