{"file_path": "../../raw_kb_v2\\article\\1500000406641\\index.html", "content": {"title": "\n\n\n Inline Editing Implementation Guide\n\n\n", "article_body": "\n\nIntro\n-------\n\nThis guide helps you implement the Inline Editing app with your own data. For more information on the Inline Editing app, please visit the\n\nInline Editing User Guide\n\n.\n\n\n Inline Editing is a premium app you can use to individually or collectively modify the content of any DataSet from a card within Domo.\n\n\n This guide details how to implement the Inline Editing app in the following topics:\n\n Preparing your data\n* Converting to an upsert DataSet\n* Deploying the app\n\nPreparing Your Data\n-----------------------\n\nThe Inline Editing app is built to handle two types of data models: standard and upsert DataSets. For this version of the app, connector-based DataSets that are updated through outside sources are not recommended, as any changes you save are overwritten by data coming through the connector.\n\n\n Standard DataSets have some inherent limitations in terms of how they can be updated, and because of this, if your app is using a standard DataSet you are limited to DataSets that have 100,000 or fewer rows and 500 or fewer columns.\n\n\n Upsert DataSets can be any size, but they take a little extra effort to set up. Follow the instructions below to convert a DataSet to an upsert DataSet.\n\n##\n\n\n Converting to an Upsert DataSet\n\n(Optional) To convert a DataSet to an upsert DataSet, follow the steps below.\n\n. In Domo, navigate to your DataSet.\n2. Go to the\n **Settings**\n tab, then select the\n **Update Mode**\n setting to expand it.\n3. Select the\n **Update method**\n and choose\n **Append**\n from the list.\n4. Select\n **Save**\n to keep your changes.\n5. Now create your upsert keys.\n\n\n Upsert keys are a group of columns in your data that when put together create a unique key for each row— you must set these keys manually.\n\nThe next steps describe how to set your keys.\n6. Download the Java CLI tool using the following link:\n\nhttps://app-domo-com-prod.s3.amazonaws.com/labs/java-sdk/latest/domoUtil.jar\n7. Navigate to and run the JAR file from either your terminal or command line tool.\n\n\n**Note:**\n To run the JAR file in the Mac Terminal, make sure you have java installed and then navigate to the correct directory and use the following command:\n\n'java -jar domoUtil.jar'`\n8. When the program is running in your command line, you'll first need to connect to your Domo instance and use the command:\n\nconnect -s <domain> -t <access_token>`\n\n\n <domain> is the name of your Domo instance (\n *mycompany*\n .\n\ndomo.com\n\n), and <access\\_token> is a generated access token from your Domo instance. Access tokens can be generated by admins in your Domo instance by navigating to\n **Admin**\n >\n **Security**\n >\n **Access Tokens**\n and selecting\n **Generate Access Token**\n .\n9. After you have connected to your instance, use the following command:\n\n\n`define-upsert -i <dataset_id> -c <columns>`\n\n\n <dataset\\_id> is the dataset id of the DataSet that you want to set as an upsert DataSet and <columns> is a comma-separated list of columns names that you want to use as upsert keys (\"\n *Column 1\"*\n , \"\n *Column 2\"*\n , and so on). Remember to use double quotes around any columns that have spaces in the column name.\n10. To check to see if this process worked, use the following command:\n\n\n`get-schema -i <dataset_id>`\n\n\n and check to see if 'upsertKey' is set to true for the columns that you passed through in the last command.\n11. Close the CLI tool. Your DataSet is now an upsert DataSet.\n\nDeploying the App\n---------------------\n\nIf you have access to the app asset, deploy the app from your\n **Asset Library**\n and connect your DataSet to it.\n\n\n If you don't have access to the app asset, your app admin can connect the app to your DataSet.\n\n\n App admins must be added to a Domo Group. To learn how to set this up, see the\n\nInline Editing User Guide\n\n. If the group does not exist, the app still functions, but users cannot make any changes to it.\n\n\n After your data is connected and app admins have been configured, the app is ready to use. See the\n\nInline Editing User Guide\n\nto learn more.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500000406641\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004131\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nInline Editing Implementation Guide\n\n", "article_total_view_count": "\n\n\n 5,000\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:24 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "inline_editing_implementation_guide", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}