{"file_path": "../../raw_kb_v2\\article\\360042924994\\index.html", "content": {"title": "\n\n\n Running Total Grouped Bar Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nA Running Total Grouped Bar chart is similar to a vertical Grouped Bar chart, except that each successive bar in a series displays the cumulative total (or \"running total\") of all bars in that series up to that point. Although you can use any kind of categorical data in a Running Total chart, typically, you use date or date-time data. Other chart types in Domo that utilize this same \"running total\" concept include\n\nRunning Total Line charts\n\n, which use lines instead of bars.\n\n\n Powering Running Total Grouped Bar Charts\n-------------------------------------------\n\nA Running Total Grouped Bar chart requires three data columns or rows from your DataSet—one for categories, one for the series within each category; and one for values. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your Running Total Grouped Bar chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how the data from a typical column-based spreadsheet is converted into a Running Total Grouped Bar chart:\n\nCustomizing Running Total Grouped Bar Charts\n----------------------------------------------\n\nYou can customize the appearance of a Running Total Grouped Bar chart in a number of ways. Many customizations are possible by setting\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of Running Total Grouped Bar charts include the following.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Running Total > Number of Running Total Series\n  |\n Lets you choose the number of aggregated series in most Running Total charts. Series that remain aggregated are determined by your chart series order as it appears in your legend. For example, if you had a Running Total Grouped Bar chart and you indicated that you wanted two running total series, the bars corresponding to the first two bar series in your legend would remain aggregated, and all other bars would show their literal values.\n\n\n In the example, only one series has been selected as a running total series. This is the blue series at the bottom of each stack. All other series are shown with their literal values.\n  |  |\n|\n Value Scale > Title Position\n  |\n Determines whether value scale labels in Vertical Bar charts appear to the left of the chart or above it.\n\n\n**Note:**\n This property is deprecated as of our October 2016 release.\n\n\n |\n —\n  |\n\n\n###\n Changing the size of bars in a Running Total Grouped Bar chart\n\nFor any Bar chart, you can set the percentage of space taken up by bars in that chart or specify a fixed bar width. For more information, see\n\nSpecifying the Size of Bars in Bar Charts\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924994\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004675\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nRunning Total Grouped Bar Chart\n\n", "article_total_view_count": "\n\n\n 4,840\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:20 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "running_total_grouped_bar_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}