{"file_path": "../../raw_kb_v2\\article\\000005182\\index.html", "content": {"Title": "Deploy, Request, and Remove Apps", "Article Body": "Intro\n                       \n\n                        This article contains instructions for deploying, requesting access to, and removing an app from your Domo instance.\n                       \n\n                        Use these links to navigate to the needed task:\n                       \n\n\n\n                          Deploy an app\n                         \n\n\n\n                          Request access to an app\n                         \n\n\n\n                          R\n                         \n\n                          emove an installed app\n                         \n\n\n\n\n\n                        Deploy an App\n                       \n\n                        In the Appstore, you can deploy an app to your organization's Domo instance. If any installations of the app are already deployed to your Domo instance, you have the option to request access to an existing version or to deploy a new version.\n                       \n\n                        When you deploy an app, Domo first installs the app card(s) with sample data. Cards with sample data display with a label reading\n                        \n                         Sample\n                        \n                        to indicate they are not yet live.\n                       \n\n\n\n\n                        After you deploy an app, look over the app card(s) to make sure this app is what you need. When you are ready, you can power up the cards in the app with live data by connecting to a third-party connector account (Dashboard apps) or DataSet with matching columns (all other apps). You can also assign another user to power up the app.\n                       \n\n                        Follow these steps to deploy an app to Domo:\n                       \n\n\n                         In the navigation header, select\n                         \n                          Appstore\n                         \n                         .\n                        \n\n                         In the Appstore, search for and find the app you want to add. To learn more about searching in the Appstore, see\n                         \n                          Appstore Overview\n                         \n                         .\n                        \n\n                         Select the app to display its Details view.\n                        \n\n                         In the Details view, review the requirements and notes for the app.\n                        \n\n\n                          Select\n                          \n                           Get\n                          \n                          . Some apps may have different labels, for this option. A dialog displays, informing you that your app is being created. You can select\n                          \n                           Notify Me\n                          \n                          to continue working and receive a notification when the app is ready. You can also wait and be taken directly to the app when it is ready.\n                         \n\n\n\n\n\n\n\n\n\n                              Conditional:\n                             \n                             If any versions of this app are already installed in your instance, you have the option to request access to an existing version or to add a new version. For information about requesting access to an existing version, see the\n                             \n                              Request Access to an App\n                             \n                             task. Otherwise, select\n                             \n                              Add New\n                             \n                             and proceed to the next step.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Anyone with a Participant default security role or anyone with a custom role that does not include the Use Appstore grant do not see the option to get the app. Instead, they see an option to\n                             \n                              Request Demo\n                             \n                             . Selecting this option displays a dialog in which you can reach out to your MajorDomo and request that the app be installed. For more information about default security roles, see\n                             \n                              Managing Custom Roles\n                             \n                             .\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n                          In the navigation header, go to\n                          \n                           Dashboards\n                          \n                          . You can view the new app dashboard at the bottom of your\n                          \n                           Dashboards\n                          \n                          panel.\n                         \n\n\n\n\n                          When you select the app dashboard, you view all of the cards automatically created with sample date. A blue bar displays at the top of the cards with sample data.\n                         \n\n\n\n                          At the top of the app dashboard, select\n                          \n                           Connect Data\n                          \n                          to display the\n                          \n                           Connect your company data\n                          \n                          banner. The banner displays\n                          \n                           Connect\n                          \n                          buttons for all DataSets powering the app, along with the total number of DataSets and cards associated with this app. In this example, the app is powered by three DataSets and contains four cards.\n                         \n\n\n\n\n\n\n                          (Optional) Select\n                          \n                           Assign\n                          \n                          to assign the setup for this app to another person. A dialog displays with an assignment message that you can send as-is or customize. Search for and select your organization's data specialist, customize the message if you want to, and then select\n                          \n                           Send\n                          \n                          . The person you assign setup to receives an email notification about the assignment.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             You can only assign people with an Editor role or above to set up the app.\n                            \n\n\n\n\n\n\n                          (Optional) To connect the DataSets yourself, select\n                          \n                           Connect\n                          \n                          for any one of the DataSets in the banner. The result of this action depends on the type of app you are deploying.\n                         \n\n\n\n\n                          Follow the appropriate steps for the type of app: a\n                          \n                           Dashboard app\n                          \n                          or a\n                          \n                           Cardbuilder or custom app\n                          \n                          .\n                         \n\n\n\n\n\n                        Configure a Dashboard App\n                       \n\n                        Follow the steps in the configuration wizard.\n                       \n\n\n\n\n\n                        Configure a Cardbuilder or Custom App\n                       \n\n                        When you select\n                        \n                         Connect\n                        \n                        in the banner for a Cardbuilder or custom app, the\n                        \n                         Find matches for your columns to connect\n                        \n                        screen displays.\n                       \n\n\n\n\n\n                         In pane 1, select the DataSet you want to connect in the menu. The different columns in the DataSet display in that pane.\n                        \n\n                         Drag the columns from pane 1 into the matching columns in pane 2. When a match is made, a green checkmark displays by the column. If there is no match, you cannot drag the DataSet into pane 2.\n                         \n\n\n\n\n                         After you match all of the columns in pane 2, select\n                         \n                          Connect\n                         \n                         . The cards in the DataSet now populate with live data from your DataSet.\n                        \n\n                       You can update the columns and/or DataSet populating the app at any time by going to the dashboard, viewing the banner, and selecting\n                       \n                        Change\n                       \n                       .\n                       \n\n\n\n                         Video — Advanced Deploy for all Apps\n                        \n\n\n\n\n\n\n\n                         Video — Appstore Column Mapping\n                        \n\n\n\n\n\n\n\n\n                        Request Access to an App\n                       \n\n                        By default, when you install an app, only you, Admin-level users, and users with a custom security role that includes the Manage Appstore grant. If someone else wants access to an app that you installed, you can share access to the dashboard the same way you\n                        \n                         share access to any dashboard\n                        \n                        . If you want access to an app that someone else installed, you can request access to the app dashboard from the Appstore.\n                       \n\n                        For more information, see\n                        \n                         Controlling Access to Cards and Dashboards\n                        \n                        .\n                       \n\n                        Follow these steps to request access to an app dashboard:\n                       \n\n\n                         In the navigation header, select\n                         \n                          Appstore\n                          \n                           .\n                          \n\n\n\n                         Locate the app you want access to. You can view a list of apps in your instance by selecting\n                         \n\n                          Installed Apps\n                         \n                         in the sidebar and going to the\n                         \n                          Your Installed Apps\n                         \n                         and\n                         \n                          Installed By Others\n                         \n                         tabs.\n                        \n\n                         When you locate the app, select it to see the Details view.\n                        \n\n                         Select\n                         \n                          Request Access\n                         \n                         . A dialog displays with a request message that you can send as-is or customize.\n                        \n\n                         (Optional) Customize the request message.\n                        \n\n                         Select\n                         \n                          Send Request\n                         \n                         .\n                        \n\n                       Your request is sent to the app owner via Buzz.\n                       \n\n\n                        Remove an Installed App\n                       \n\n                        You can remove an app you have deployed to your Domo instance from the Appstore. This action removes instances of the app\n                        \n                         only\n                        \n                        from your own view of the instance. If other instances of the app have been installed in your organization's Domo instance by other people, these are not removed. When you remove an installed app, the version of the app in the Appstore is not affected.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           To remove an app, you must be the person who deployed the app or have an Admin default security role or a custom role with the Manage Appstore grant enabled. For more information about default security roles, see\n                           \n                            Managing Custom Roles\n                           \n                           .\n                          \n\n\n\n\n                        Follow these steps to remove an installed app:\n                       \n\n\n                         In the navigation header, select\n                         \n                          Appstore\n                         \n                         .\n                        \n\n                         In the sidebar, select\n                         \n\n                          Installed Apps\n                         \n                         .\n                         \n                         The\n                         \n                          Installed Apps\n                         \n                         page displays.\n                        \n\n                         In the\n                         \n                          Your Installed Apps\n                         \n                         section, locate and select the app you want to remove.\n                         \n                         The app Details view displays.\n                        \n\n                         Select\n                         \n                          Uninstall\n                         \n                         .\n                         \n                         A dialog displays warning that this action cannot be undone.\n                         \n\n\n\n\n\n\n\n                         Select\n                         \n                          Uninstall\n                         \n                         to remove the app or\n                         \n                          Cancel\n                         \n                         to go back.", "Preview Article": "Click here to preview", "URL Name": "000005182", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005182", "Archived Date": "", "Language": "English", "Primary Version": "Deploy, Request, and Remove Apps", "Article Total View Count": "273", "": "", "Article Created Date": "4/18/2023, 3:28 PM", "First Published Date": "4/18/2023, 3:29 PM"}, "title": "\n              Deploy, Request, and Remove Apps\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Explore the Appstore\n              \n", "url": "/s/topic/0TO5w000000ZaoMGAS"}]}