{"file_path": "../../raw_kb_v2\\article\\000005164\\index.html", "content": {"Title": "Attributes", "Article Body": "Intro\n                       \n\n                        You can use attributes to drive dynamic groups and dynamic personalized data permissions (PDP). This can significantly reduce the overhead of managing group and data access. Depending on your needs, attributes can be managed by your identity provider, your Domo admins, or your users.\n                       \n\n                        Why attributes?\n                       \n\n                        These are examples of two of the most common problems that attributes can solve:\n                       \n\n                        Department-Based Access\n                        \n\n\n\n                        The Sales and Marketing departments should have access to customer performance dashboards. However, team members in these departments change frequently, and managing group membership manually is a challenge.\n                       \n\n\n                         Solution\n                        \n\n\n\n\n                        Use dynamic groups to automatically populate group membership based on the department attribute in a user profile.\n                       \n\n                        Org Structure-Based Access\n                       \n\n                        BI department team members should have access to instance monitoring dashboards. The department attribute is not properly maintained in our identity provider, but\n                        \n\n                        only BI team members contribute to the BI team cost center. This assignment is tracked in the user's profile as a list of \"Contributing Cost Centers\".\n                       \n\n\n                         Solution\n                        \n\n\n                        Use dynamic groups to populate group membership based on whether this attribute contains the BI team cost center.\n                       \n\n\n                        This article provides more information about attributes in the following topics:\n                       \n\n\n\n                          Add attribute\n                         \n\n\n\n                          Manage attributes\n                         \n\n\n\n                          Manage attribute values\n                         \n\n\n\n                          Usage\n                         \n\n\n\n                          Security\n                         \n\n\n\n                          FAQ\n                         \n\n\n\n\n\n\n                        Add Attribute\n                       \n\n                        Follow these steps to add an attribute:\n                       \n\n\n                         In the Domo navigation header, select\n                         \n                          More\n                         \n                         >\n                         \n                          Admin\n                         \n                         .\n                         \n                         The Admin Settings display.\n                        \n\n                         In the\n                         \n                          Governance\n                         \n                         menu, select\n                         \n                          Attributes\n                         \n                         .\n                         \n                         The\n                         \n                          Attributes\n                         \n                         section displays.\n                        \n\n                         Select\n                         \n                          +\n                         \n\n                          New Attribute\n                         \n                         .\n                         \n                         The\n                         \n                          Create new attribute\n                         \n                         modal displays.\n                         \n\n\n\n\n                         In the modal, fill in the following fields:\n                         \n\n\n\n                             Name —\n                             \n\n\n                            A descriptive name shown within Domo. This does not need to be unique, although we recommend unique names to avoid confusion.\n                           \n\n\n\n\n                             (Optional) Description —\n                            \n                            Details to help users understand what this attribute represents.\n                           \n\n\n\n\n                             Key —\n                            \n                            A unique, case-sensitive name for the attribute. If the attribute is sourced from your IdP, this must exactly match the name used in your IdP configuration. After it is set, this value cannot be changed.\n                           \n\n\n\n\n                             Visibility —\n                            \n                            Selecting\n                            \n                             Limited visibility\n                            \n                            indicates that this attribute's value is not directly visible to non-admin users. However, this attribute can potentially be used to identify users. For example, if the attribute is trusted, it can be used to populate group membership, which in turn can\n                            \n\n                            identify users with a given value.\n                           \n\n\n\n\n                             Value Source —\n                            \n                            Indicates allowable sources of values for this attribute:\n                           \n\n\n\n\n                               IdP —\n                              \n                              If enabled, values are sourced from your IdP each time a user signs in\n                              \n\n                              to Domo. Note that this also requires your SSO configuration to allow attribute population via the Enable custom attribute ingestion option.\n                              \n                              See the\n                              \n                               SSO articles\n                              \n                              for more information.\n                             \n\n\n\n\n                               Grant: Edit Users —\n                              \n                              If enabled, users with the Edit Users grant can edit values for this attribute. If the\n                              \n                               IdP\n                              \n                              source is also enabled and your IdP contains values for this attribute, those values overwrite any user-entered values the next time the user signs in.\n                             \n\n\n\n\n                               Managed —\n                              \n                              If enabled, this attribute is managed and users cannot edit their own values. This permits using the attribute in security policies.\n                             \n\n\n\n\n\n\n                         Select\n                         \n                          Save\n                         \n                         .\n                        \n\n\n\n\n                        Manage Attributes\n                       \n\n                        You can edit and remove certain existing attributes. System attributes are not removable. Other attributes can be removed and edited, but only if they are not used in dynamic groups or PDP policies. This ensures the original intent of the attribute is not changed while it's in use.\n                       \n\n\n\n\n                        The\n                        \n                         Attribute management\n                        \n                        table shows properties of your defined attributes:\n                       \n\n\n\n                          System —\n                         \n                         System attributes are defined by Domo and cannot be removed. However,\n                         \n\n                         certain properties of system attributes are editable.\n                        \n\n\n                          Managed —\n                         \n                         Managed attributes are not editable by the user themselves;  the value source is Managed. These attributes can be used to drive dynamic group membership and dynamic PDP policies.\n                        \n\n\n                          Data type —\n                         \n                         For system attributes, the data type is defined by Domo. For user-defined attributes, data types are inferred from the values received/entered. Data types follow the Java definition for that type.\n                         \n                         For more details, see\n                         \n                          Java's documentation\n                         \n                         . Attributes can also be multi-valued (list/array).\n                        \n\n\n                          PDP policies —\n                         \n                         Indicates the number of dynamic PDP policies that use this attribute. Select the number to view a list of those policies.\n                        \n\n\n                          Groups —\n                         \n                         Indicates the dynamic groups that use this attribute.\n                        \n\n\n                          Actions —\n                         \n                         Non-system attributes that are not being used as part of a PDP policy or group can be edited or deleted. System attributes cannot be removed.\n                        \n\n\n\n\n                        Manage Attribute Values\n                       \n\n                        You can edit attribute values in the\n                        \n                         People\n                        \n                        section of the\n                        \n                         Governance\n                        \n                        settings. You can only edit unmanaged attributes with the\n                        \n                         Grant: Edit Users\n                        \n                        value source from this page.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If the attribute is also sourced from your IdP, any manually changed values reset to the IdP-sourced value the next time the user signs in.\n                          \n\n\n\n\n\n\n                        Usage\n                       \n\n                        Managed attributes (both system and custom) can be used to populate dynamic groups based on values in a user's profile. See our\n                        \n                         Creating and Managing User Groups\n                        \n                        article\n                        \n\n                        for more detail.\n                       \n\n                        Managed attributes (both system and custom) can also be used to create dynamic PDP policies. See\n                        \n                         Creating and Deleting PDP Policies\n                        \n                        for more information.\n                       \n\n\n\n                        Security\n                       \n\n                        Users with the Manage all company settings grant can manage attributes.\n                       \n\n\n\n                        FAQ\n                       \n\n\n                         Can I use custom attributes in dynamic groups and dynamic PDP?\n                        \n\n\n                        Custom (non-system) attributes can be used in both dynamic groups and dynamic PDP policies as long as they're managed. See the details above for how to configure an attribute as\n                        \n                         managed\n                        \n                        .\n                       \n\n                        Can I export my attribute configuration?\n                       \n\n                        Not at this time.\n                       \n\n                        I'm renaming an attribute key in my IdP. How do I change the key in Domo?\n                       \n\n                        Attribute keys cannot be changed. Instead, create a new attribute.\n                       \n\n                        Why can't I edit an attribute?\n                       \n\n                        Attributes are only editable when they are not being used to drive group membership and PDP rules. See\n                        \n                         Manage Attributes\n                        \n                        above for more information.\n                       \n\n                        How do I edit attribute values in bulk?\n                       \n\n                        Bulk user import does not currently support editing custom attribute values, but we are exploring options to allow that.", "Preview Article": "Click here to preview", "URL Name": "000005164", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005164", "Archived Date": "", "Language": "English", "Primary Version": "Attributes", "Article Total View Count": "903", "": "", "Article Created Date": "3/25/2023, 12:17 AM", "First Published Date": "3/28/2023, 12:09 AM"}, "title": "\n              Attributes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Governance Tools\n              \n", "url": "/s/topic/0TO5w000000ZannGAC"}]}