{"file_path": "../../raw_kb_v2\\article\\360042925434\\index.html", "content": {"Title": "Bucketing Data Using Beast Mode", "Article Body": "Bucketing FAQs\n                       \n\n                        What is bucketing and what is it used for?\n                       \n\n                        Cards inherently group data, but you’re limited to face value data provided by the data source. You can create buckets using Beast Mode and create an additional column in your data that you can leverage in cards as filters, sorts, series and values where your data falls short. Bucketing is also used to group things for advanced comparative analysis.\n                       \n\n                        What fields can be used when creating buckets?\n                       \n\n                        Buckets can be based off of any field available in the data source powering the card, and multiple fields can be leveraged if needed in order to create your bucket/group column.\n                       \n\n                        Can buckets be used in summary numbers?\n                       \n\n                        Yes, as long as there is some sort of aggregation on them (for example, Min, Max, Count, Sum, Avg).\n                       \n\n                        Is there a limit on how many I can create in a card?\n                       \n\n                        No. Each one is treated as an additional column in your data, and you can create as many as you need.\n                       \n\n                        Video - Grouping Data into Buckets\n                       \n\n\n\n\n\n\n\n                        Bucketing Samples\n                       \n\n                        Use Case #1\n                       \n\n                        I have data on all my departments but want to roll them up so I have only 2 bars showing Finance vs. everything else. The strategy for accomplishing this task is to group everything that isn’t finance into an “Other” bucket and then graph the results. Here is an example of how a chart like this could look:\n                       \n\n\n\n\n                        The Beast Mode calculation to use to create this bucket in the above example would look like this:\n                        \n\n\n\n                         CASE WHEN `Account_Industry` = 'Finance' THEN 'Finance' ELSE 'Other' END\n                        \n\n\n                        Use Case #2\n                       \n\n                        All my sales departments have the same target, but I want to be able to clearly see which departments have met the target. The strategy is to split the existing series out into two separate series, which can then be graphed together but colored separately. Here is an example of how a chart like this could look:\n                       \n\n\n\n\n                        The Beast Mode calculations to use to create these buckets in the above example would look like this:\n                       \n\n                        (Above Goal)\n                       \n\n\n                         CASE  WHEN avg(`Amount`) >= 30000 THEN avg(`Amount`) END\n                        \n\n\n                        (Below Goal)\n                       \n\n\n                         CASE WHEN avg(`Amount`) < 30000 THEN avg(`Amount`) END\n                        \n\n\n                        The last step in this example is accomplished by going into the Chart Properties and changing the colors to Green and Red so these match the new series.", "Preview Article": "Click here to preview", "URL Name": "360042925434", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004083", "Archived Date": "", "Language": "English", "Primary Version": "Bucketing Data Using Beast Mode", "Article Total View Count": "5,877", "": "", "Article Created Date": "10/24/2022, 9:20 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Bucketing Data Using Beast Mode\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Beast Mode\n              \n", "url": "/s/topic/0TO5w000000ZanAGAS"}]}