{"file_path": "../../raw_kb_v2\\article\\360042931754\\index.html", "content": {"Title": "PostgreSQL SSH Connector", "Article Body": "Intro\n                       \n\n                        PostgreSQL is a widely used open-source relational database management system. You can use Domo's PostgreSQL SSH Connector to pull data from your PostgreSQL database via an SSH tunnel and compile custom reports. You indicate the data you want by inputting an SQL query. For more information about the PostgreSQL API, visit their website. (\n                        \n                         https://www.postgresql.org/docs/\n                        \n                        )\n                       \n\n                        The PostgreSQL SSH connector is a \"Database\" connector, meaning it retrieves data from databases using a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n                        \n                         Database\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to your PostgreSQL database in the\n                        \n                         Data Center\n                        \n                        . This topic discusses the fields and menus that are specific to the PostgreSQL SSH connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           Depending on your network's structure, your IT administrator may need to whitelist any IP addresses necessary for the data connector to retrieve data. Contact your IT administrator for assistance.\n                          \n\n\n\n\n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector is appropriate for pulling database information into Domo.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n                            N/A\n                           \n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              IT\n                             \n\n\n\n                              Project management\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            ~10 hours\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            9\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n\n\n                          Use read-only queries only.\n                         \n\n\n\n                          Use \"Replace\" instead of \"Append.\"\n                         \n\n\n\n                        Prerequisites\n                       \n\n                        To connect to a PostgreSQL database via an SSH tunnel and create a DataSet, you must have the following:\n                       \n\n\n\n                          The username and password you use to log into your PostgreSQL database\n                         \n\n\n\n                          The name of the PostgreSQL database\n                         \n\n\n\n                          The port number for the PostgreSQL database\n                         \n\n\n\n                          The PostgreSQL database hostname or IP address\n                         \n\n\n\n                          The UNIX server to SSH-tunnel through\n                         \n\n\n\n                          The username and password for the UNIX account\n                         \n\n\n\n                          The SSH port number\n                         \n\n\n\n                          The SSH private key (either DES or RSA)\n                         \n\n\n\n                        Before you can connect to a PostgreSQL database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n                        \n                         Whitelisting IP Addresses for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys generated by OpenSSL\n                            \n\n                           .\n                          \n\n\n\n\n                        Connecting to Your PostgreSQL Database\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the PostgreSQL SSH Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your database and SSH server. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            SSH Server Hostname\n                           \n\n\n\n                            Enter the hostname of the UNIX server to SSH-tunnel through.\n                           \n\n\n\n\n\n                            SSH Username\n                           \n\n\n\n                            Enter the SSH username for your UNIX account.\n                           \n\n\n\n\n\n                            SSH Password\n                           \n\n\n\n                            Enter the SSH password username for your UNIX account.\n                           \n\n\n\n\n\n                            SSH Port\n                           \n\n\n\n                            Enter the port number for your UNIX account.\n                           \n\n\n\n\n\n                            Database Hostname\n                           \n\n\n\n                            Enter the host name for the PostgreSQL database. For example:\n                            \n\n                              db.company.com\n                             \n\n\n\n\n\n\n\n                            SSH Private Key\n                           \n\n\n\n                            Enter the SSH private key (either DES or RSA).\n                           \n\n\n\n\n\n                            Database Name\n                           \n\n\n\n                            Enter the PostgreSQL database name.\n                           \n\n\n\n\n\n                            Database Username\n                           \n\n\n\n                            Enter your PostgreSQL username.\n                           \n\n\n\n\n\n                            Database Password\n                           \n\n\n\n                            Enter your PostgreSQL password.\n                           \n\n\n\n\n\n                            Database Port\n                           \n\n\n\n                            Enter your PostgreSQL port number.\n                           \n\n\n\n\n\n                        Once you have entered valid credentials, you can use the same account any time you go to create a new PostgreSQL SSH DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        In this pane you create an SQL query to pull data from your database.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            SQL Query\n                           \n\n\n\n                            Enter the Structured Query Language (SQL) query to use in selecting the data you want. For example:\n                           \n\n\n                             select * from Employee\n                            \n\n\n\n\n\n\n                        Troubleshooting\n                       \n\n\n\n                          Make sure the appropriate IP addresses are whitelisted (see\n                          \n                           Prerequisites\n                          \n                          for a list of IP addresses).\n                         \n\n\n\n                          Try decreasing fetch size or leave it empty.", "Preview Article": "Click here to preview", "URL Name": "360042931754", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003883", "Archived Date": "", "Language": "English", "Primary Version": "PostgreSQL SSH Connector", "Article Total View Count": "4,811", "": "", "Article Created Date": "10/24/2022, 9:16 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              PostgreSQL SSH Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               Database Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaojGAC"}]}