{"file_path": "../../raw_kb_v2\\article\\360042924234\\index.html", "content": {"title": "\n\n\n Creating County and Zip Code Drilldown in a U.S. Map\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can create U.S. maps in which users can drill down on states to see values by both county and zip code. For example, a U.S. map may show sales for western states, as follows:\n\n\n In this map, a user could click on the state of Oregon to show the sales for all of the counties in Oregon:\n\n\n He could then click on Multnomah County (the small dark red county containing the city of Portland) to show sales by zip code within that county:\n\n\n To enable state and county drilldown, you must first create a DataFlow data source that joins two data sources: the data source with the values you want to show and a data source with state, county, and zip code information. With this data source, you can create a U.S. map with state and county drilldown enabled.\n\n*Video - Creating a Map Drilldown to Zip**\n\nCreating the DataSet\n----------------------\n\nThe first step in building a map with drilldown is creating a DataSet with your values matched to the appropriate states, counties, and zip codes. You can do this by using DataFlows to join the following input DataSets:\n\n The master DataSet that contains the values you want to display. The DataSet must contain a column with zip codes.\n* A reference DataSet containing columns with states, FIPS county codes, and zip codes. The names of the columns in this DataSet must be different from those in the master DataSet, or the DataFlow will not run successfully.\n\n\n To create this DataSet you will need to combine your data with Domo's \"Zips2Fips\" DataSet, which is available via the Domo Dimensions connector.\n\nAfter you acquire the Domo \"Zips2Fips\" DataSet, you can create a DataFlow DataSet that joins the master and \"Zips2Fips\" DataSets by matching the zip code columns.\n\n\n**To join the master and \"Zip2Fips\" DataSets,**\n\n. In Domo, click\n ****Data****\n in the toolbar at the top of the screen.\n2. Click\n **SQL**\n in the\n **Magic Transform**\n area at the top of the screen.\n\n\n The\n **Create DataFlow**\n page opens.\n3. Enter a name for the DataFlow in the\n **Name**\n field.\n4. (Optional) Enter a description for the DataFlow in the\n **Description**\n field.\n5. Under \"Input DataSets,\" click\n **Select a DataSet**\n .\n6. Locate and select the master DataSet (the DataSet that contains your values).\n7. Click\n **Select a DataSet**\n .\n8. Locate and select the \"Zip2Fips\" DataSet.\n9. Click\n **Add Output DataSet**\n .\n\n\n An\n **Output DataSet**\n dialog appears.\n10. Enter a name for the output DataSet in the\n **Output DataSet Name**\n field.\n11. In the\n **Output SQL**\n field, enter the following SQL, replacing\n *master*\n with the name of your master DataSet and\n *zipcode\\_column\\_name*\n with the name of the zip code column in your master DataSet. Also, if you named the reference DataSet anything besides \"zip2fips\" in the previous set of steps, you will need to change all instances of \"zip2fips\" to that name.\n\n\n`select\n *master*\n .*, zip2fips.`STATE` as 'State', zip2fips.`FIPS`, zip2fips.`CNTY_NAME` as 'County', zip2fips.`ZIP` as 'ZipCode'from\n *master*`\n\n\n`join zip2fips`\n\n\n`on zip2fips.`ZIP` =\n *master*\n .`\n *zipcode\\_column\\_name*\n ``\n12. Click\n **Done**\n .\n13. Click\n **Save and Run**\n .\n\n\n Domo now attempts to create an output DataSet that joins the master and \"Zips2Fips\" DataSets. If the attempt is successful, the new DataSet is added to your\n **DataSets**\n listing. If any problems are found (such as duplicate column names), a message appears indicating that the run was not successful.\n\nCreating map drilldown\n------------------------\n\nWith your new DataSet, you can build a U.S. map with state- and county-level drill path.\n\n*Note:**\n You cannot drill directly from the U.S. map into a zip code map; you\n *must*\n include the state level as an intermediary step. For example, you would not be able to click on Oregon and bring up a map with zip codes; you would first need to open a view showing the counties.\n\n*To create a map with drill path,**\n\n. In the page where you want the new card to appear, click\n\nthen select\n **Create New Card**\n .\n2. Click\n **Existing Data**\n .\n3. Locate and select the DataSet you created in the previous set of steps.\n4. Click\n **Select DataSet**\n .\n\n\n The\n **Visualize your Data**\n screen appears,\n5. Select\n **United States**\n as your chart type.\n6. In the value menu, select the column that contains the values you want to display.\n7. In the category menu, select\n **State**\n .\n8. Click\n **Save & Finish**\n .\n\n\n The card is saved to the card page.\n9. Click the new card to open its\n **Details**\n view.\n10. In the\n **Options**\n menu, select\n **Edit Drill Path**\n .\n11. Click\n **Add a view**\n .\n12. In the category menu, select\n **FIPS**\n .\n13. Click\n **Save this View**\n .\n14. Click\n **Add a view**\n .\n15. In the category menu, select\n **ZipCode**\n .\n16. Click\n **Save this View**\n .\n\nThe drilldown map is complete. You can test it by returning to the\n **Details**\n view and clicking on a state. If the drill path was implemented correctly, a state-level view appears with counties showing. You can then click a county to show the zip code areas within that county.\n\n*Note:**\n If you have just state level information and use the US map card to filter to a specific state, the entire US map will appear, but only the state you have filtered on will be highlighted.\n\nTo view a map of the state you have filtered to, you need the FIPS view saved as the top level US County card.  The map recalibrates the view to show only the state you have FIPS values for. Then, as in the Oregon example above, you would just see the specific state but filtered down to the county level.\n\n\n**Note:**\n F\n\nor a US map to use State/County/Zip Code drilldown, it is important that the state column in the DataSet for the top-level card use a two letter state abbreviation category. The state column MUST be named \"State\" or \"STATE.\"\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924234\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004633\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCreating County and Zip Code Drilldown in a U.S. Map\n\n", "article_total_view_count": "\n\n\n 2,622\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "creating_county_and_zip_code_drilldown_in_a_us_map", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "analyzer", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}