{"file_path": "../../raw_kb_v2\\article\\360042934994\\index.html", "content": {"title": "\n\n\n September 2018 Release Notes\n\n\n", "article_body": "\n\n\n New Features and Enhancements\n--------------------------------\n\nFeatures and enhancements in this release include the following:\n\n##\n DataSet Sharing\n\nSharing a DataSet is now as simple as sharing anything else in Domo. With DataSet sharing, you can even share your DataSet with groups, making it easy to handle your changing and growing organization. Whether people come or go, the right people can always have the right access to the right DataSets. And when you share a DataSet, you can even choose what level of access you want to grant. You can choose from the following access levels:\n\n **Co-Owner**\n . Has the same privileges as the DataSet owner.\n* **Can Edit**\n . Can edit and share DataSets but cannot delete them.\n* **Can Share**\n . Can share DataSets but not edit or delete them.\n\nYou share a DataSet by choosing the new\n **Share**\n option in the details view for the DataSet then specifying options in the dialog.\n\n\n For more information about sharing DataSets, including a table showing all of the privileges available to each access level, see\n\nSharing a DataSet\n\n.\n\n##\n Domo in Spanish\n\nIn addition to English, French, German, Japanese, and Simplified Chinese, Domo has added full support for Spanish. With Domo now available in six languages, new and existing users can easily work within Domo in the language that they feel the most comfortable. With this feature, managers and team leaders can improve their teams' overall operational efficiency and get even more value out of using Domo. The Domo platform is prepared to scale to any number of languages to support Domo's steady international expansion.\n\nTo turn on Spanish, go into your User Locale Settings by mousing over your profile photo and clicking the globe icon in the top right corner. Then in the Settings screen, choose\n **Español**\n in the menu under \"Language.\"\n\nFor more information about language selection, see\n\nConfiguring Languages in Domo\n\n.\n\n##\n Sunburst Graph\n\nWe have added again to our repertoire of chart types! We are excited to introduce the Sunburst graph. This chart type is ideal for showing hierarchical relationships for DataSet columns. Each hierarchical level is represented as a ring. The innermost ring represents the top level of the hierarchy, and each progressive ring outward from the center represents a level down from the top level, with smaller segments representing a portion of their parent in the hierarchy. The relative size of any segment represents the value of that segment. You can include up to 5 rings in any Sunburst graph.\n\nFor information about building a Sunburst graph, see\n\nSunburst Graph\n\n.\n\n##\n Apple TV App\n\nDomo can be consumed and viewed across all platforms: mobile, desktop web, and now on TV. The Domo Apple TV app is the ideal offering for Domo users who have large gathering areas, meeting rooms or operations centers, allowing them to have a constant realtime view into their business. The Domo Apple TV app displays any card on a page with the option to have a running slideshow or just a single card view.\n\n\n You can download the Domo Apple TV app for free in the Apple TV App Store (4th generation or later). Once you have downloaded the app, launch it and scan the QR code with your device, then log into Domo.\n\n##\n New DomoStats Apps\n\nDomo is excited to announce two new DomoStats Apps this release:\n\n###\n DomoStats DataSets and DataFlows App\n\nWith the new DataSets and DataFlows DataSet and App, ensure that your data is always fresh and that your Domo only has the most relevant and up-to-date information. You can watch your DataSet and DataFlow success rates, be notified when DataSets fail to run, and see which DataSets are orphaned, duplicated, or broken so you can clean out your Domo instance. Never feel in the dark about your data again. Available for download for Domo Admins.\n\n\n For more information, see\n\nDomoStats - DataSets and DataFlows\n\n.\n\n###\n DomoStats People App\n\nWith the new People App for DomoStats, get your user stats and activities all in one place. You can watch adoption levels and take action quickly to help people get onboard by watching login trends and seeing who still needs to log in. With the User Roles card, you can keep your instance secure and make sure everyone is working at the level that is best for them. To get an even broader view of your Domo data, you can also use DataFlows to combine this DataSet with other DomoStats DataSets. See all the information you need about your users, all in one place. Available for download for Domo Admins.\n\nFor more information, see\n\nDomoStats - People\n\n.\n\n##\n Personalized Mobile Home Tile Creation\n\nA new tool in the Admin Settings lets you customize the Mobile home tile experience for executives and other users, allowing them to immediately see the content most important to running their business. To use this feature, you simply go into the Admin Settings, locate the\n **People**\n page for the user whose home tile layout you want to customize, and click\n **Manage home screen**\n .\n\nThis provides access to a customizable tile listing, which you can change just by clicking the name of a tile and dragging it to the desired position in the list. You can even add an existing page, card, feature, or project as a new tile. Once you hit\n **Save**\n , the changes are applied to the user's Mobile home screen.\n\nFor more information, see\n\nAdmin Settings Layout -- People Tab\n\n.\n\n##\n Australia Postal and LGA Maps\n\nIn addition to the standard province-level maps for Australia, Domo now gives you the ability to create Australian postal maps and LGA (Local Government Authority) maps by applying columns with postal codes or LGA codes, respectively. These updates should be a great help to our users in Australia and other parts of the world who want more control over how their Australia data appears.\n\n\n**Australia Postal Map**\n\n*Australia LGA Map**\n\nFor more information about these new map types, see\n\nCountry Map - Australia\n\n.\n\n##\n Ability to Send a Card Using iMessage\n\nThe Domo iMessage extension brings the power of Domo and real time insights into iMessage conversations. With the Domo iMessage extension, anyone with the Domo app can share and see live previews of any Domo card within iMessage. Additionally, users will be able to quickly reference cards they have recently viewed or search for any card of their choosing to add to the iMessage conversation.\n\nTo begin adding the power of Domo to your iMessage conversations, just tap on the extensions button next to the camera when iMessage is open and select the Domo icon.\n\n##\n Projects & Tasks Improvements and SDK\n\nDomo provides an enhanced experience to Projects & Tasks with the latest update. You can now give each task a description and an owner. Additionally, the new Projects & Tasks SDK gives your developers the ability to incorporate this feature into your company’s existing workflow processes. Use the provided documentation to create custom apps or interactions between Projects & Tasks and your current workflow solutions. The addition of descriptions, owners, and an SDK results in clear and concise workflow planning and execution, tailored to meet your company’s specific needs.\n\nTo learn more about the updates to the Projects & Tasks interface, see\n\nCreating and Assigning Project Tasks\n\n.\n\n##\n New Chart Properties\n\nThe following new Chart Properties are now available in Analyzer:\n\n###\n New Properties for Line Graphs\n\n\n* **Outlier Filtering**\n . Available for most Line graphs. Outlier Filters allow you to filter out any lines with points above, below, or in between the value or values you set. If any point on a line does not pass the filter, that entire line is filtered out. For more information, see\n\nFiltering Outliers in a Line Graph\n\n.\n* **General > Hide Empty Values**\n . When you check this box, any gaps in your Line graph will be filled in, showing a complete line or lines.\n* **General > Hide Area Fill**\n . When you check this box, the fill that appears by default in single-line Line charts is hidden.\n\nFor more information about Line graph properties, see\n\nProperties for Line Charts\n\n.\n\n###\n New Properties for Bar Graphs\n\n\n* **General > Maximum Bars**\n . This property lets you specify the maximum number of bars that appear in your Bar chart. The values of all remaining bars are aggregated into a single bar called \"Other\" (unless you decide to hide this bar using the\n **Hide 'Other' Bar**\n property).\n* **General > Hide 'Other' Bar**\n . This property lets you hide or show the \"Other\" bar that appears by default when you set the\n **Maximum Bars**\n property.\n\nFor more information about Bar graph properties, see\n\nProperties for Bar Charts\n\n.\n\n###\n New Properties for Line-Bar Graphs\n\n\n* **General > Starting Symbol**\n . This property allows you to select the symbol used to represent the first series in Stacked Bar with Symbol and Grouped Bar with Symbol graphs. (The default symbol is a triangle.) If more than one symbol series appears, the chart rotates through symbols in this order: Triangle, Circle, Plus, Square, Diamond.\n* **General > Series on Top Scale**\n . This property determines how many series in horizontal line-bar combination graphs appear as lines. By default, the first series that appears in your legend for these chart types becomes a line, and all remaining series become bars. However, you can convert series from bars to lines by entering the desired number of lines here.\n\nFor more information about Line-Bar graph properties, see\n\nProperties for Bar Charts\n\n.\n\n##\n Mobile Preview Image for Domo Apps, Sumo Cards, and Formatted Notebook Cards\n\nWe have added an improvement to mobile rendering of Domo Apps, Sumo cards and formatted Notebook cards. Beginning now, anytime you view any of these card types on your mobile Domo app, you will see the preview image of the actual content.\n\n##\n Support Portal Update\n\nAn update to our Support portal will ensure that all of our customers receive “update” emails automatically anytime their case is updated by Support—providing improved transparency and customer experience.\n\n\n Connector API Change Announcements\n------------------------------------\n\nOther items our users should know about are as follows.\n\n##\n Amazon MWS API Change\n\n*What is the situation?**\n\n\n To take full advantage of the Amazon MWS API, we have decided to deprecate the old Amazon MWS connector and proceed with a new Amazon MWS connector.\n\n\n**What do I need to do?**\n\n\n Create your DataSets in the latest version of the Amazon MWS connector. Simply visit the AppStore and power up the new DataSets using the new connector. Amazon MWS API has strict API throttling, and the connector does everything possible to globally pace requests. However, we recommend spreading out DataSet runs throughout the entire day and night. This is especially true for the \"Orders\" suite of reports.\n\n\n Once you have created your DataSets in the new connector, you should stop importing new data in the old connector by turning off imports in the \"Schedule\" section of the old connector. Once the DataSet is completely migrated, ensure that all cards and ETL logic is powered from the new DataSet. Finally, you can delete the old DataSet.\n\n\n**When do I need to have this done?**\n\n\n To ensure continuous service, please ensure that all your DataSets are set up in the new connector by October 11th, 2018. On October 12th, we will be marking the version 0 connector and anything associated with it as legacy and it will stop importing new data.\n\n\n**What if I have additional questions?**\n\n\n As always, we welcome and appreciate your feedback. Please reach out to the Domo support team if you have any questions. Thank you for being a Domo customer.\n\n\n Getting Help\n--------------\n\nYou can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n\n***> Help Center****\n .\n\n\n If you have questions about Domo,\n\n search for a topic in the Help Center\n* train in Domo University at\n\nhttp://university.domo.com\n* search for training apps in the Appstore\n* get answers in the Domo Community at\n\nhttps://dojo.domo.com\n* contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n\n/support\n\n.\n* reach out to your Domo Customer Success Manager or Technical Consultant\n\nIf you have feedback, please send it from within Domo (\n\n***> Feedback****\n ). Or send an email to\n\nproduct.feedback@domo.com\n\n.\n\n\n For more information about getting help, see\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042934994\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004428\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSeptember 2018 Release Notes\n\n", "article_total_view_count": "\n\n\n 4,703\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:09 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "september_2018_release_notes", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "release_notes", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "archived_feature_release_notes", "url": "/s/topic/0TO5w000000Zan7GAC"}]}