{"file_path": "../../raw_kb_v2\\article\\360056727214\\index.html", "content": {"Title": "Non-queryable DataSets", "Article Body": "Intro\n                       \n\n                        Not all DataSets are created equal. For example, some DataSets may be used strictly as DataFlow inputs or have not been accessed for a while and therefore are not being actively queried (i.e. used and viewed regularly in Cards or Dashboards). These DataSets will continue to run as scheduled, perform normally as expected, and are optimized for their current use, but must be brought into an actively queried state to use in visualizations.\n                       \n\n                        DataSets that cannot be actively queried\n                       \n\n                        When a DataSet is not optimized for querying, the following message will appear in the DataSet Details.\n                        \n\n\n\n\n\n\n\n\n                        You will also be notified of a DataSet's status when you click\n                        \n                         Open With\n                        \n                        menu in the DataSet Details view. You must bring the DataSet back to an actively queried state to begin building new content with it.\n                        \n\n\n\n\n\n\n\n\n                        Bringing DataSets to an actively queried state\n                       \n\n                        To optimize a DataSet for querying to be used in Cards, Dashboards, and more, click the\n                        \n                         Start\n                        \n                        button in the Details View Overview tab. You may begin using that DataSet as soon as it is done preparing.\n                        \n\n\n\n\n\n\n\n\n                        From the Data Center\n                       \n\n\n\n                          Navigate to the\n                          \n                           Data Center\n                          \n                          and search for the DataSet you want to actively query.\n                         \n\n\n\n                          Click on the DataSet to view the Overview tab in the DataSet Details.\n                         \n\n\n\n                          Click\n                          \n                           Start\n                          \n                          .\n                         \n\n\n\n                        In Analyzer\n                       \n\n\n\n                          In Analyzer, you will be presented with the following message if a DataSet is not actively queried.\n                          \n\n\n\n\n\n\n                          Click\n                          \n                           Get Details\n                          \n                          to be taken directly to the DataSet Details view.\n                         \n\n\n\n                          Click\n                          \n                           Start\n                          \n                          .\n                         \n\n\n\n                        From Card Details\n                       \n\n\n\n                          In the Card Details view, you will be presented with the following message if a DataSet is not actively queried.\n                          \n\n\n\n\n\n\n\n\n                          Click\n                          \n                           Get Details\n                          \n                          to be taken directly to the DataSet Details view.\n                         \n\n\n\n                          Click\n                          \n                           Start\n                          \n                          .\n                         \n\n\n\n                        In DataFusions\n                       \n\n\n\n                          In DataFusions, you will be presented with the following message if a DataSet you are attempting to use as an input is not actively queried.\n                          \n\n\n\n\n\n\n\n\n                          Navigate to the Data Center. Find and select the DataSet to access the DataSet Details view.\n                         \n\n\n\n                          Click\n                          \n                           Start\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360056727214", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003153", "Archived Date": "", "Language": "English", "Primary Version": "Non-queryable DataSets", "Article Total View Count": "4,780", "": "", "Article Created Date": "10/24/2022, 9:10 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Non-queryable DataSets\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}