{"file_path": "../../raw_kb_v2\\article\\360043428473\\index.html", "content": {"title": "\n\n\n Area Overlay Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn area overlay charts (referred to simply as \"area\" charts in Domo), all series begin from the same axis and are overlaid on top of each other. In their default state these charts are typically not very useful because data for some series is usually hidden. However, you can distinguish an individual series by mousing over that series in the legend or in the chart itself. Because each series begins from the same baseline, this type of area chart is useful for quickly discerning the value for individual series.\n\n\n An area overlay chart is similar to a\n\nstacked area chart\n\n; however, in a stacked area chart, all segments are shown at once, either side by side or on top of each other, whereas in an area overlay chart, segments overlap.\n\n\n Subtypes\n----------\n\nStacked area charts have a number of subtypes, including all of the following:\n\n Vertical curved area\n* Vertical step area\n* Horizontal area\n* Horizontal curved area\n* Horizontal step area\n\nFor explanations and screenshots for these subtypes, see\n\nAvailable Chart Types\n\n.\n\n\n Powering area overlay charts\n------------------------------\n\nArea overlay charts require three columns or rows of data from your DataSet—one for categories (generally dates), one for series in those categories, and one for values. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your area overlay chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how the data from a typical column-based spreadsheet is converted into a vertical area overlay chart:\n\nThe following graphic shows you how the data from a typical column-based spreadsheet is converted into a horizontal area overlay chart:\n\nCustomizing area overlay charts\n---------------------------------\n\nYou can customize the appearance of an area overlay chart by editing its\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of area overlay charts include the following. You can click a thumbnail image to see a larger image.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n General > Style\n  |\n Determines the style for an area chart, either \"Flat,\" \"Folded,\" \"Curved\" or \"Step.\" The default style of the chart depends on the specific subtype you have selected. If you select \"Folded,\" the chart takes on a 3-D appearance, as shown in the example at right.\n  |  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428473\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004741\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nArea Overlay Chart\n\n", "article_total_view_count": "\n\n\n 4,753\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:28 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "area_overlay_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}