{"file_path": "../../raw_kb_v2\\article\\360042928794\\index.html", "content": {"Title": "Google Search Console Connector", "Article Body": "Intro\n                       \n\n                        Google Seach Console (formerly Google Webmaster Tools) is a no-charge web service by Google that allows webmasters to check indexing status and optimize visibility of their websites. To learn more about the Google Search Console API, visit their page (\n                        \n                         https://developers.google.com/webmas...-api-original/\n                        \n                        ).\n                       \n\n                        You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Console Tools connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector retrieves common SEO metrics.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Crawler errors\n                             \n\n\n\n                              Clicks\n                             \n\n\n\n                              Impressions\n                             \n\n\n\n                              CTR\n                             \n\n\n\n                              Position by Site\n                             \n\n\n\n                              Country\n                             \n\n\n\n                              Query\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            SEO specialists\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            ~10\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            3\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n\n\n                          Google Search Console is limited to a 90-day rolling timeframe with a 2-day delay. Best practice when establishing the connector calls for pulling in the full 90 days of data by setting the connector. To do this, follow these steps:\n                         \n\n\n\n                            Set the\n                            \n                             Duration\n                            \n                            to\n                            \n                             Date Range\n                            \n                            , the\n                            \n                             Start Date\n                            \n                            to\n                            \n                             Relative\n                            \n                            ,\n                            \n                             Days Back to Start From\n                            \n                            to\n                            \n                             90\n                            \n                            , and\n                            \n                             Days Back to End At\n                            \n                            to\n                            \n                             Yesterday-2\n                            \n                            .\n                           \n\n\n\n                            Run the connector once.\n                           \n\n\n\n                            Set\n                            \n                             Start Date\n                            \n                            and\n                            \n                             End Date\n                            \n                            to\n                            \n                             Relative\n                            \n                            ,\n                            \n                             Days Back To Start From\n                            \n                            to\n                            \n                             Yesterday-2\n                            \n                            ,  and\n                            \n                             Days Back to End At\n                            \n                            to\n                            \n                             Yesterday-2\n                            \n                            .\n                           \n\n\n\n                            Update the schedule to run every day with an update setting of\n                            \n                             Append\n                            \n                            .\n                           \n\n\n\n                            Save the DataSet without running.\n                            \n\n                            The connector will run on the schedule and append new data daily.\n                           \n\n\n\n\n\n                          Be aware that data from Google Search Console's API tends to be delayed, sometimes for several days.\n                         \n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your Google account and create a DataSet, you must have Google credentials.\n                       \n\n                        Note that although you will be able to create an account using any Google credentials, you will not be able to connect to data using this connector unless you have actually used the features of Google Search Console.\n                       \n\n                        Connecting to Your Google Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Google Search Console Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Google Search Console connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Google Search Console accounts in Domo) to open the Google Search Console OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Search Console DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Google Search Console report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Sitemap Details\n                              \n\n                               Retrieves data about a specific sitemap.\n                              \n\n\n\n                               Search Analytics Query\n                              \n\n                               Queries and returns your search traffic data with dimensions that you define.\n                              \n\n\n\n\n\n\n\n                           Get Consolidated Data\n                          \n\n                           Select this check box to get consolidated data for the given date range in a single row. Leave this box unchecked to get a separate row of data for each date within the date range.\n                          \n\n\n\n                           Choose Search Dimensions\n                          \n\n                           Select the dimensions you'd like to receive information for.\n                          \n\n\n\n                           Choose Search Type\n                          \n\n\n                            Select the search type that you would like to receive information about.\n                           \n\n\n\n\n                           Include Fresh Data\n                          \n\n\n                            Select this checkbox if you want to retrieve all data including fresh data, otherwise only finalized data will be included.\n                           \n\n\n\n\n                           Choose Your Site\n                          \n\n                           Select the site you want to retrieve data for.\n                          \n\n\n\n                           Choose the Site Map (Errors, Warnings)\n                          \n\n                           Select the site map you want to retrieve data for. URLs are listed together with the numbers of errors and warnings. For example:\n                           \n\n                             www.domo.com\n                            \n                            (1,0)\n                           \n                           would mean that Domo's website contained 1 error and 0 warnings.\n                          \n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n\n                          It is not uncommon for there to be variance between the front end UI of Google Search Console and the API. If there are major variances, ensure that you do not have duplicate records. In this event, do a full Replace on the DataSet and reset the daily Append schedule.\n                         \n\n\n\n                          The more search dimensions you add, the less likely the data's total will match the total found in Google Search Console's front end. This is because Google Search Console's API breaks data up into smaller parts when it sends it to Domo. If you want to verify Domo's data, follow this link to see whether Domo's data matches what the Google Search Console returns:\n                          \n                           https://developers.google.com/apis-e...nalytics.query\n                          \n                          . If you want to compare Google Search's Front End Totals to Domo, select NONE of the search dimensions in the connector.", "Preview Article": "Click here to preview", "URL Name": "360042928794", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003589", "Archived Date": "", "Language": "English", "Primary Version": "Google Search Console Connector", "Article Total View Count": "4,779", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Google Search Console Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}