{"file_path": "../../raw_kb_v2\\article\\360043434713\\index.html", "content": {"Title": "VoiceStorm Connector", "Article Body": "Intro\n                       \n\n                        VoiceStorm is  a product that manages and measures employees' efforts to promote a company on social networks. Use Domo's VoiceStorm connector to retrieve lists of liked comments, leaderboards, posts, users, and more. To learn more about the VoiceStorm API, visit their page (\n                        \n                         https://dev.voicestorm.com/\n                        \n                        ).\n                       \n\n                        You connect to your VoiceStorm account in the Data Center. This topic discusses the fields and menus that are specific to the VoiceStorm connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your VoiceStorm account and create a DataSet, you must have the following:\n                       \n\n\n\n                          A VoiceStorm API token\n                         \n\n\n\n                          A VoiceStorm token secret\n                         \n\n\n\n                          Your VoiceStorm company domain\n                         \n\n\n\n                        To obtain an API token and token secret, ask your VoiceStorm customer service account manager for API keys (which are necessary for you to access the REST API platform). The API keys include the API token and token secret.\n                       \n\n                        You can find your VoiceStorm company domain by looking at the portion of your VoiceStorm URL immediately following\n                        \n                         https://\n                        \n                        . For example, if the URL was\n                        \n\n                          https://mycompany.voicestorm.com/v1\n                         \n\n                        , the domain would be\n                        \n                         mycompany\n                        \n                        .\n                       \n\n                        Connecting to Your VoiceStorm Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the VoiceStorm Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your VoiceStorm account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Access Token\n                          \n\n                           Enter your VoiceStorm access token.\n                          \n\n\n\n                           Token Secret\n                          \n\n                           Enter your VoiceStorm token secret.\n                          \n\n\n\n                           Domain\n                          \n\n                           Enter your VoiceStorm company domain.\n                          \n\n\n\n\n                        For information about obtaining these credentials, see \"Prerequisites,\" above.\n                       \n\n\n                         Once you have entered valid VoiceStorm credentials and created an account, you can use the same account any time you go to create a new VoiceStorm DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the VoiceStorm report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Comment Like List\n                               \n\n\n\n                                Retrieves a list of users who have liked the selected comment.\n                               \n\n\n\n\n\n                                Discussion\n                               \n\n\n\n                                Retrieves discussion information for a selected post, such as comments, likes on comments, and likes on posts.\n                               \n\n\n\n\n\n                                LeaderBoard\n                               \n\n\n\n                                Retrieves a list of leaderboards defined in the system.\n                               \n\n\n\n\n\n                                LeaderBoard Ranking\n                               \n\n\n\n                                Retrieves the rankings for all leaderboards in the system.\n                               \n\n\n\n\n\n                                Posts\n                               \n\n\n\n                                Retrieves the most recent posts by date (within two weeks) regardless of approval state.\n                               \n\n\n\n\n\n                                Posts by Tag\n                               \n\n\n\n                                Retrieves a list of posts containing a specified tag.\n                               \n\n\n\n\n\n                                Post Tags\n                               \n\n\n\n                                Retrieves the post tags defined in the system.\n                               \n\n\n\n\n\n                                Users\n                               \n\n\n\n                                Retrieves user information for specified email IDs.\n                               \n\n\n\n\n\n                                User Activities\n                               \n\n\n\n                                Retrieves user information for the specified email ID.\n                               \n\n\n\n\n\n                                User Tags\n                               \n\n\n\n                                Retrieves the user tags defined in the system.\n                               \n\n\n\n\n\n\n\n\n                           Post\n                          \n\n                           Select the post you want to retrieve information for.\n                          \n\n\n\n                           Comment\n                          \n\n                           Select the comment you want to retrieve information for.\n                          \n\n\n\n                           Leaderboard\n                          \n\n                           Select the leaderboard you want to see rankings for.\n                          \n\n\n\n                           Tag\n                          \n\n                           Enter the tag you want to retrieve information for.\n                          \n\n\n\n                           Email\n                          \n\n                           Enter the email ID of the user you want to retrieve information for.\n                          \n\n\n\n                           Email(s)\n                          \n\n                           Enter the email IDs of the users you want to retrieve information for, separated by commas.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043434713", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003441", "Archived Date": "", "Language": "English", "Primary Version": "VoiceStorm Connector", "Article Total View Count": "2,369", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              VoiceStorm Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}