{"file_path": "../../raw_kb_v2\\article\\360043433953\\index.html", "content": {"title": "\n\n\n Microsoft Exchange Metrics Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMicrosoft Exchange Server acts as a centralized hub for Microsoft Exchange mailboxes. To learn more about Microsoft Exchange Server, visit their page (\n\nhttps://docs.microsoft.com/en-us/exc...xchserver-2019\n\n).\n\n\n You connect to your Microsoft Exchange Server account in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft Exchange Metrics connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n\n Prerequisites\n---------------\n\nTo connect to your Microsoft Exchange Server account and create a Microsoft Exchange Metrics DataSet, you must have your Microsoft Exchange Server username and password.\n\n\n Connecting to Your Microsoft Exchange Server Account\n------------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Microsoft Exchange Metrics Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Microsoft Exchange Server account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter your Microsoft Exchange Server username. If you are using on-premise data, the username should be entered as\n\ndomain/username\n\nor\n\n\n username@domain.com\n\n\n .\n  |\n|\n Password\n  |\n Enter your Microsoft Exchange Server password.\n  |\n\n\n Once you have entered valid Microsoft Exchange credentials, you can use the same account any time you go to create a new Microsoft Exchange Metrics DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a number of menus and fields for specifying the data you want to bring into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Instance Type\n  |\n Select whether you want to connect to online or on-premise data.\n  |\n|\n Server Name\n  |\n Enter the name of the server containing your on-premise data.\n  |\n|\n Report\n  |\n Select whether you want to retrieve data based on a PowerShell script or command.\n  |\n|\n Script\n  |\n Select the desired PowerShell report script you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n MailTraffic\n  |\n Returns the mail traffic per day per user( incoming and outgoing mails) for the last 30 days.\n  |\n|\n LargeMailboxes\n  |\n Returns the 10 largest mailboxes.\n  |\n|\n AverageSize\n  |\n Returns the average size of your mailboxes.\n  |\n|\n LastDayOutbound\n  |\n Returns a list of yesterday's emails sent outside your organization.\n  |\n|\n LastDayInbound\n  |\n Returns a list of yesterday's emails sent inside your organization.\n  |\n\n|\n|\n Command\n  |\n Select the PowerShell command you want to run in order to retrieve data. For information about all commands, visit\n\nhttps://docs.microsoft.com/en-us/pow...ew=exchange-ps\n\n.\n  |\n|\n Parameters (Optional)\n  |\n Enter any parameters for your selected command here, separating multiple parameters with semicolons. Use the format\n\nkey1=value2;key2=value2;...keyn=valuen.\n\n|\n|\n Device ID\n  |\n Enter the ID of the device you want to retrieve information for.\n  |\n|\n Mailbox ID\n  |\n Enter a keyword or keywords to indicate the mailbox you want to retrieve information for. You may use any of the following:\n * Alias\n* Display name\n* Distinguished name (DN)\n* Domain/account\n* Immutable ID\n* Legacy exchange DN\n* Object GUID\n* SMTP address\n* User principal name (UPN)\n |\n|\n Distribution Group\n  |\n Enter a keyword or keywords to indicate the distribution group you want to retrieve information for. You may use any of the following:\n * Alias\n* Canonical DN\n* Display name\n* Distinguished name (DN)\n* Domain/account\n* Immutable ID\n* Legacy exchange DN\n* Object GUID\n* SMTP address\n* User principal name (UPN)\n |\n|\n Folder\n  |\n Enter the mailbox and folder path/folder name for the calendar folder you want to retrieve information for.\n  |\n|\n Restore Request ID\n  |\n Enter the ID of the restore request. This consists of the alias of the mailbox to be restored and the name specified when the request was created.\n  |\n|\n Role Entry\n  |\n Enter the role entry you want to retrieve data for. For example:\n\nExampleRole\\Set-Mailbox\n\n|\n|\n Tracking Report ID\n  |\n Enter the ID of the message tracking report you want to retrieve.\n  |\n|\n Email ID\n  |\n Enter the email ID of the user you want to retrieve information for.\n  |\n|\n GUID\n  |\n Enter the GUID or public folder name representing a folder you want to retrieve information for.\n  |\n|\n Message ID\n  |\n Enter a unique quarantine message identifier.\n  |\n|\n Role Group\n  |\n Enter the role group for which member information should be retrieved. For example:\n\nRecipient Administrators\n\n|\n|\n Sync Request ID\n  |\n Enter the ID of the sync request you want to view information for.\n  |\n|\n Phone Call ID\n  |\n Enter the ID of the phone call you want to retrieve information for.\n  |\n|\n Unified Audit ID\n  |\n Enter the ID of the unified audit you want to retrieve information for.\n  |\n|\n Domain Name\n  |\n Enter the domain name you want to retrieve information for.\n  |\n|\n Category\n  |\n Select a \"MailTrafficSummaryReport\" category.\n  |\n|\n Message Trace ID\n  |\n Enter the message trace ID you want to retrieve information for.\n  |\n|\n Device Type\n  |\n Select whether you want to retrieve data for an EAS or Intune device.\n  |\n|\n Schedule ID\n  |\n Enter the ID of the schedule you want to retrieve information for.\n  |\n|\n Recipient\n  |\n Enter the email ID of the recipient you want to retrieve information for.\n  |\n|\n Organization\n  |\n Enter the organization you want to retrieve information for.\n  |\n|\n Version\n  |\n Enter the version number you want to retrieve information for.\n  |\n|\n Mailbox\n  |\n Enter the email ID of the user you want to retrieve information for.\n  |\n|\n Group By\n  |\n Select whether you want your report data to be grouped by day, month, or total.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433953\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003521\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft Exchange Metrics Connector\n\n", "article_total_view_count": "\n\n\n 4,662\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "microsoft_exchange_metrics_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}