{"file_path": "../../raw_kb_v2\\article\\360042924934\\index.html", "content": {"Title": "Radial Gauge", "Article Body": "Intro\n                       \n\n                        Gauges are simple charts that indicate progress towards meeting a target. A Radial gauge is similar in appearance to a speedometer in a car, with a \"needle\" that moves to indicate the proximity of the current value to the goal. Radial gauges can include up to six ranges. Other gauge types in Domo include\n                        \n                         Single Value gauges\n                        \n                        ,\n                        \n                         Filled gauges\n                        \n                        ,\n                        \n                         Progress Bar gauges\n                        \n                        ,\n                        \n                         Face gauges\n                        \n                        , and\n                        \n                         Comparative Fill gauges\n                        \n                        .\n                       \n\n\n\n                          Video - Building a Radial Gauge Chart\n                         \n\n\n\n\n\n\n\n\n\n                        Powering Radial gauges\n                       \n\n                        A Radial gauge requires only two columns or rows of data from your DataSet—one contains categories, and the other contains the values. This creates a \"bare-bones\" Radial gauge without ranges. You can specify up to six different ranges in a Radial gauge in\n                        \n                         Chart Properties\n                        \n                        . For more information, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        The maximum value of a Radial gauge is automatically determined based on the current value. For example, if your current value was 80, the maximum value would be set to 100. If the current value was 155, the maximum value would be set to 200. However, you can set custom minimum and maximum values by specifying ranges. The minimum value of your first range is the minimum value of the gauge, and the maximum value of your last range is the maximum value of the gauge.\n                       \n\n                        By default, all of the values in your values column are summed to produce the final value for the chart, even when you select\n                        \n                         No Aggregation\n                        \n                        in the value aggregation menu. This is because the\n                        \n                         General > Value\n                        \n                        chart property for this chart type is set to\n                        \n                         Sum\n                        \n                        by default. This property performs a second aggregation on the chart value\n                        \n                         in addition\n                        \n                        to the one selected in the value aggregation menu.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           Because having two aggregations in a chart is usually undesirable, select\n                           \n                            No Aggregation\n                           \n                           in the value aggregation menu, then select your desired aggregation in the\n                           \n                            General > Value\n                           \n                           menu in\n                           \n                            Chart Properties\n                           \n                           .\n                          \n\n\n\n\n                        In the Analyzer, you choose the columns containing the data for your Radial gauge. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from the category and value columns in a typical column-based spreadsheet is converted into a Radial gauge:\n                       \n\n\n\n\n                        Customizing Radial gauges\n                       \n\n                        You can customize the appearance of a Radial gauge by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Setting Properties for Gauges\n                        \n                        .\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            General > Value\n                           \n\n\n\n                            Determines how the values in your values column are to be aggregated. Options include the usual aggregations such as\n                            \n                             Sum\n                            \n                            ,\n                            \n                             Average\n                            \n                            , etc., as well as\n                            \n                             First Row\n                            \n                            and\n                            \n                             Last Row\n                            \n                            , which take the value in the first or last row as the gauge value. The default option is\n                            \n                             Sum\n                            \n                            . The aggregation you select here is added to the aggregation you select in the value aggregation menu (so, for example, if you selected\n                            \n                             Average\n                            \n                            in the value aggregation menu and\n                            \n                             Sum\n                            \n                            in\n                            \n                             Chart Properties\n                            \n                            , your gauge value would be the summed averages for each category).\n                           \n\n                            Because having two aggregations in a chart is usually undesirable, select\n                            \n                             No Aggregation\n                            \n                            in the value aggregation menu, then select your desired aggregation in the\n                            \n                             General > Value\n                            \n                            menu in\n                            \n                             Chart Properties\n                            \n                            .\n                           \n\n\n\n\n\n                            General > Style\n                           \n\n\n\n                            Lets you set the style for the gauge. The default is\n                            \n                             Legacy\n                            \n                            .\n                           \n\n\n\n\n                           General > Value Indicator\n                          \n\n                           Lets you specify the type of indicator used to show the position of the value.\n                          \n\n\n\n                           General > Value Indicator Color\n                          \n\n                           Lets you select a color for the value indicator.\n                          \n\n\n\n                           General > Ring Width Percent\n                          \n\n                           Lets you specify the width of the ring used to display the range values. Valid values are between 5 and 50.\n                          \n\n\n\n                           General > Major Tick Width Percent\n                          \n\n                           Lets you set the percentage width for the major ticks. Valid values are between 5 and 50.\n                          \n\n\n\n                           General > Tick Color\n                          \n\n                           Lets you select a color for the ticks on the gauge.\n                          \n\n\n\n                           General > Tick Alignment\n                          \n\n                           Lets you set the alignment for the ticks within the ring of the gauge.\n                          \n\n\n\n                           General > Major Segments\n                          \n\n                           Lets you specify the number of segments the gauge will be divided into. Setting this to 0 will turn off major ticks.\n                          \n\n\n\n                           General > Minor Segments\n                          \n\n                           Lets you specify the number of segments the gauge will be divided into, between major ticks. Setting this to 0 will turn off minor ticks.\n                          \n\n\n\n                           General > Major Tick Width\n                          \n\n                           Lets you set the width for the major ticks.\n                          \n\n\n\n                           General > Minor Tick Width\n                          \n\n                           Lets you set the width for the minor ticks.\n                          \n\n\n\n                           General > No Data Handling\n                          \n\n                           Lets you set how the chart will display if it receives no data. The default is to display a message.\n                          \n\n\n\n                           General > No Data Message\n                          \n\n                           Lets you set the message to be displayed if there is no data. This may occur if the data has been filtered out on the Dashboard.\n                          \n\n\n\n\n                            Range 1-6 > Minimum Value\n                           \n\n\n\n                            Lets you specify the minimum value for the selected range.\n                           \n\n\n\n\n\n                            Range 1-6 > Maximum Value\n                           \n\n\n\n                            Lets you specify the maximum value for the selected range.\n                           \n\n\n\n\n\n                            Range 1-6 > Color\n                           \n\n\n\n                            Lets you select a color for the selected range.", "Preview Article": "Click here to preview", "URL Name": "360042924934", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004678", "Archived Date": "", "Language": "English", "Primary Version": "Radial Gauge", "Article Total View Count": "4,947", "": "", "Article Created Date": "10/24/2022, 10:20 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Radial Gauge\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}