{"file_path": "../../raw_kb_v2\\article\\360042929574\\index.html", "content": {"title": "\n\n\n Intercom Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nIntercom is a platform used to integrate customer messaging apps for sales, marketing and support connected on one platform. To learn more about the Intercom API, visit their page (\n\nhttps://developers.intercom.com/inte...ence/reference\n\n).\n\n\n You connect to your Intercom account in the Data Center. This topic discusses the fields and menus that are specific to the Intercom connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\na DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Intercom account and create a DataSet, you must have an Intercom access token. For information about obtaining an access token, see\n\nhttps://developers.intercom.com/docs...-access-tokens\n\n. Note that some reports require your access token to have \"extended scope.\"\n\n\n Connecting to Your Intercom Account\n-------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Intercom Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Intercom account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Token\n  |\n Enter your Intercom access token. For more information, see \"Prerequisites,\" above.\n  |\n\n\n Once you have entered valid Intercom credentials, you can use the same account any time you go to create a new Intercom DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Intercom report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Admins\n  |\n Returns a list of admins for this connector.\n  |\n|\n Attached Companies\n  |\n Returns a list of companies that are associated with a contact.\n  |\n|\n Attached Contacts\n  |\n Returns a list of all the contacts that are associated with a company.\n  |\n|\n Attached Tags\n  |\n Returns a list of all the tags that are associated with a contact.\n  |\n|\n Companies\n  |\n Returns a list of companies.\n  |\n|\n Contacts\n  |\n Returns a list of all the contacts.\n  |\n|\n Contact by Contact Id\n  |\n Returns the details of a specific contact.\n  |\n|\n Conversations\n  |\n Returns a list of all the conversations.\n  |\n|\n Conversations by Conversation Id\n  |\n Returns the details of a single conversation.\n  |\n|\n Counts\n  |\n Returns the count of your application.\n  |\n|\n Notes\n  |\n Returns a list of notes that are associated with a contact.\n  |\n|\n Notes by Notes Id\n  |\n Returns the details of a single note.\n  |\n|\n Segments\n  |\n Returns a list of all the segments.\n  |\n|\n Tags\n  |\n Returns a list of all the tags.\n  |\n|\n Teams\n  |\n Returns a list of all the available teams.\n  |\n\n|\n|\n Event Type\n  |\n Select whether to pull user or lead events.\n  |\n|\n Conversation Admin Type\n  |\n Select the type of conversation admin to pull data for.\n\n\n|  |  |\n| --- | --- |\n|\n All\n  |\n Retrieves all conversations for both assigned and unassigned users.\n  |\n|\n Specific\n  |\n Retrieves all conversations for a given admin. Note that when querying conversations for a given user, Intercom carries out message matching for the user and your existing auto messages. This will happen at most once every 15 minutes.\n  |\n|\n Unassigned\n  |\n Retrieves unassigned conversations.\n  |\n\n|\n|\n Company\n  |\n Select the company you want to retrieve data for.\n  |\n|\n Segments\n  |\n Select the segments you want to retrieve data for.\n  |\n|\n Tags\n  |\n Select the tags you want to retrieve data for.\n  |\n|\n Users\n  |\n Select the users you want to retrieve data for.\n  |\n|\n Leads\n  |\n Select the leads you want to retrieve data for.\n  |\n|\n Email ID\n  |\n Enter the lead you want to retrieve data for.\n  |\n|\n Admin\n  |\n Select the admin you want to retrieve data for.\n  |\n|\n Option to Expand\n  |\n Select the column you want to expand.\n  |\n|\n Skip Failed Conversations\n  |\n When you check this box, if Intercom fails to return details for a conversation, it will be excluded from the DataSet, and Domo will continue processing instead of failing the run. This may result in missing data.\n  |\n|\n Conversation Status\n  |\n Select the conversation status you want to filter your report by.\n  |\n|\n Order\n  |\n Select whether you want to sort your data by created or last updated date.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How often can the data be updated?\n\nDataSets can be updated as often as once an hour, though this should be decreased if rate limits are encountered.\n\n####\n Are there any API rate limits I should be aware of?\n\nIntercom allows 83 calls per 10 seconds or roughly 500 per minute.\n\n####\n What kind of credentials do I need to power this connector?\n\nIntercom requires an access token to authenticate. Be aware that some reports require that your access token include \"extended access\" to work. If you receive an authentication error and your key is valid, check with your Intercom administrator to get \"extended access\" added to your API key.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929574\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003504\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nIntercom Connector\n\n", "article_total_view_count": "\n\n\n 4,723\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "intercom_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}