{"file_path": "../../raw_kb_v2\\article\\360043428433\\index.html", "content": {"title": "\n\n\n Creating Domo Stories\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo Stories allow you to tell targeted stories by creating custom Pages that translate smoothly across devices and retain the same Card orientation and size. Because each layout has been optimized individually for web, mobile, tablet, print, and Scheduled Reports, Domo Stories tell a consistent story no matter where the story ends up being consumed. With hundreds of layout templates built individually for dozens of use cases, you can create Domo Stories that bridge the gap between understanding the data and taking action.\n\n\n######\n Domo Stories differ from\n\nstandard Pages\n\nin the following ways:\n\n\n* In standard Pages, individual users can move and resize Cards. With Domo Stories, however, only Page owners and \"Admin\" users can make changes to Card order and size. This provides a single source of truth by ensuring that all users see the same thing in a Page.\n* Cards in standard Pages may appear differently across different devices or platforms (i.e. different desktop window sizes, email reports, print, etc.). Cards in a Domo Stories Page, however, appear the same no matter what device or platform you are using.\n* In standard Pages, all Cards are the same size and dimensions by default. If you want to change the size or dimensions of a Card, you must do it manually. In a Domo Stories Page, you can choose from hundreds of different templates, each of which contains slots appropriate for different Card sizes and dimensions. You can also resize templates from the Page level, which changes the dimensions of the Cards in the templates.\n* Domo Stories cannot be collapsed as Collections in standard Pages can.\n* You can export Domo Stories Pages to PDFs. You cannot do this with standard Pages. For more information, see\n\nExporting Domo Stories Pages to PDF\n\n.\n\nYou can use Card-to-Card Filters in Domo Stories and in standard Pages. These Filters allow you to filter all Cards on a Page by setting a Filter on a single Card. Interaction Filters are automatically enabled in Domo Stories but must be turned on manually in standard Pages. For more information, see\n\nUsing Filter Cards to Filter Card Content\n\n.\n\n\n Cards in a Domo Stories Page have all of the same options as Cards in a standard Page EXCEPT the sizing options. If you want to resize a Card in a Domo Stories Page, you drop it into a different-sized slot or resize the template from the Page view while editing the Page. There are no height restrictions for Cards in Domo Stories; they can be as tall as you want.\n\n\n In Domo Stories, you can change the background color of Pages as well as Cards. This is not possible in standard Pages.\n\n\n You cannot have Domo Stories and Card Collections in the same Page. If you have any Collections in your Page when you turn on Domo Stories, all of the Collections are converted into Domo Stories Pages. Likewise, if you convert a Domo Stories Page back into a standard Page, all of the Domo Stories are turned back into Collections. If you convert a Page with Collections into a Domo Stories Page and there are any Cards not in a Collection, these Cards are added to an \"Appendix\" section at the bottom of the Page.\n\n\n Converting a standard Page to a Domo Stories Page\n---------------------------------------------------\n\nTo convert a standard Page (with or without Collections) to a Domo Stories Page, you must be the Page owner or have an \"Admin\" default security role. For more information about security roles, see\n\nDefault Security Role Reference\n\n.\n\n\n**To convert a standard Page to a Domo Stories Page,**\n\n. Select\n **Design Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Click\n **Design Dashboard**\n .\n\n\n If the Page contains Collections, all of the Collections become Domo Stories Pages, and any extra Cards not in Collections are added into the \"Appendix\" section at the bottom of the Page. If the Page does not contain Collections, all of the Cards are added to a single default Domo Stories Page with an \"Example Header\" heading.\n3. (Conditional) If you are already satisfied with the Domo Stories layout on the Page, click\n **Save**\n then\n **Close**\n . Otherwise, first edit the Domo Stories Page layout following the instructions under Editing Pages, below.\n\n*Note:**\n When you convert a standard Page to a\n\nDomo Stories\n\nPage, the\n **Edit Dashboard**\n and\n **Convert to Standard Page**\n options are grayed out while the Pages and Cards load.\n\n\n Converting a Domo Stories Page back to a standard Page\n--------------------------------------------------------\n\nTo convert a Domo Stories Page (with or without Collections) back to a standard Page, you must be the Page owner or have an \"Admin\" default security role. For more information about security roles, see\n\nDefault Security Role Reference\n\n.\n\n\n**To convert a Domo Stories Page back to a standard Page,**\n\n. Select\n **Convert to Standard Page**\n in the\n\nmenu in the top right corner of the Page. (If the Domo Stories edit mode is open, you must first close it for this menu to appear.)\n2. Click\n **Convert Page**\n to confirm.\n\nIf the Page contains Domo Stories, all of the Domo Stories are converted into Collections.\n\n\n Adding Domo Stories and layout components\n-------------------------------------------\n\nThe Domo Stories edit mode contains various options for editing your Domo Stories. In this mode you can do all of the following:\n\n Add new Card layouts based on a variety of Domo Stories templates.\n* Drag and drop Visualization Cards into the slots in the layouts you have added.\n* Resize templates and the Cards within them by dragging their borders\n* Swap Cards in a layout by dragging one Card on top of another.\n* Add headers to your Domo Stories.\n* Drag and drop layouts and headers wherever you want them in the Page.\n* Delete layouts or headers as desired.\n* Add borders between Domo Stories.\n* Add images and notebook Card content inline, without having to first open the\n\nnotebook Card editor\n\n.\n* Change the background color of your Page and/or individual Cards.\n* Specify which Card elements appear (for example, you could hide the summary number for a Card).\n\n\n###\n Adding a Domo Stories Page\n\nYou can add a new Domo Stories Page to your Domo instance by selecting\n **New Story**\n in the\n **Add to Domo**\n menu.\n\n\n**To add a Domo Stories Page to your instance,**\n\n. Click\n\nin the top right corner of the screen.\n2. Select\n **New Story**\n .\n3. Enter a title for the new Stories Page.\n\nA new Domo Stories template Page is added, and the edit mode is opened by default. You can now begin adding and customizing Domo Stories layouts as described in the following sections.\n\n##\n Adding a Domo Stories layout\n\nYou can add a Domo Stories layout by clicking the\n\nicon that appears on the right side of the Page view when the Domo Stories edit mode is open, then dragging it to the desired location on the Page. You can then select the desired Domo Stories layout template. The template you select will then be added to this location in the Page.\n\n\n**To add a Domo Stories layout,**\n\n. On the Page where you want to add a Domo Stories layout, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Click and drag the\n\nicon from the toolbar on the right side of the Page to the location on the Page where you want the new layout.\n\n\n When you drag the layout icon over a border, it highlights to indicate you can put the layout there. In the example below, the user is dragging the icon over the line directly beneath the \"Group 1\" layout.\n\nOnce you drop the\n\nicon onto a border, the\n **Choose a layout**\n dialog opens.\n3. Use the filter options to locate the desired template.\n\n* The\n\t **Categories**\n\t menu lets you filter by template category. Categories are as follows:\n\n\n\t|\n\t Template\n\t  |\n\t Description\n\t  |\n\t| --- | --- |\n\t|\n\t All\n\t  |\n\t The top templates are shown for all categories. You can show all of the templates for a category by clicking\n\t **View All**\n\t for that category.\n\t  |\n\t|\n\t With banner\n\t  |\n\t All of these templates include a long, narrow slot at the top where you can insert a Card to use as a banner.\n\n |\n\t|\n\t Hero\n\t  |\n\t All of these templates include at least one very large slot for Cards that should immediately draw viewers' attention (\"hero Cards\").\n\n |\n\t|\n\t Quick summary\n\t  |\n\t All of these templates consist of small slots for Cards that are intended to be glanced at.\n\n |\n\t|\n\t General purpose\n\t  |\n\t All of these templates consist of a mix of small and large Cards.\n\n |\n\t* The\n\t **Number of Cards**\n\t menu lets you filter by the number of Card slots in the template.\n4. Once you locate the desired template, click on it.\n\n\n The template for the layout is now added to the designated location in the Page.\n\n*Tip:**\n You can return to the\n **Choose a layout**\n dialog to change your template by mousing over the layout and clicking the pencil icon\n\nthat appears on the left. Note that when switching a template, the new template does\n *not*\n need to contain the same amount of slots as the current template. If the new template has fewer slots available than the current template, the extra Cards are moved to the \"Appendix\" section at the bottom of the Page. If the new template has more slots available than the current template, the new slots appear as empty in the template.\n5. Do any of the following to add Cards to the layout:\n\n* Drag Cards from elsewhere in the Page into the appropriate slots in the template.\n\n\n\t You can drag Cards from other Domo Stories in the Page, from the \"Appendix\" area, etc. When you drag a Card (represented by a\n\n icon) over a border line in a layout, it highlights to indicate the Card will end up there when you drop it.\n\n Note that when you move a Card into a different-sized slot, the Card automatically resizes itself to fit the slot.\n\n\n\t If you drag a Card onto another Card, the two Cards switch places. So if you dragged \"Finance: AR Aging\" from \"Group 2\" onto \"\"Finance: COGS\" in \"Group 1,\" \"Finance: AR Aging\" would take over the spot in Group 1, and \"Finance: COGS\" would appear in the spot formerly containing the other Card in Group 2.\n\t* Add an existing Visualization Card from your Domo instance into an empty slot by doing the following:\n\n\t1. In the slot where you want to add the Card, click\n\t\t **Add Content**\n\t\t .\n\t\t2. Select\n\t\t **Add existing Card**\n\t\t .\n\t\t3. Locate the Card you want to add by entering its name in the\n\t\t **Search Cards**\n\t\t field and clicking on it.\n\t* Add an existing Visualization Card from your Domo instance to a layout\n\t *without*\n\t an empty slot by doing the following:\n\n\t1. Click and drag the\n\n\t icon from the toolbar on the right side of the Page to the spot where you want the Card to appear.\n\n\n\t\t When you drag the Card icon over a Page, borders between layout slots highlight to indicate the spots where you can insert the Card. In the example below, the user is dragging the icon over the line between the \"Finance: COGS\" and \"Outstanding Debt\" Cards.\n\n\t When you drop the icon onto a line, a slot appears for the Card with an\n\t\t **Add Content**\n\t\t button.\n\t\t2. Click\n\t\t **Add Content**\n\t\t .\n\t\t3. Select\n\t\t **Add existing Card**\n\t\t .\n\t\t4. Locate the Card you want to add by entering its name in the\n\t\t **Search Cards**\n\t\t field and clicking on it.\n\t* Add an image Card (essentially a\n\n Document Card\n\n containing an image) inline to a layout by doing the following:\n\n\t1. Click and drag the\n\n\t icon from the toolbar on the right side of the Page to the spot where you want the image Card to appear.\n\n\n\t\t When you drag the image icon over a Page, borders between layout slots highlight to indicate the spots where you can insert the Card.\n\t\t2. Click\n\t\t **Choose Image**\n\t\t .\n\t\t3. Select the image you want to upload from your computer or network.\n\t* Add a notebook Card inline to a layout by doing the following:\n\n\t1. Click and drag the\n\n\t icon from the toolbar on the right side of the Page to the spot where you want the image Card to appear. Alternatively, if your layout already contains a blank slot, you can select\n\t\t **Add Content > Insert text**\n\t\t to open the editor.\n\t\t2. Enter the desired notebook Card content.\n\n\n\t\t The interface options are the same as those in the full notebook Card editor. For more information, see\n\n\t Adding a Notebook Card\n\n\t .\n\t\t3. Click anywhere outside of the Card to save it.\n\n\n###\n\n\n Adding headers\n\nYou can insert additional header text in your Domo Stories Pages to divide up content and draw attention to the most important Cards. Headers can be placed before or after layouts as well as other headers.\n\n\n**To add a header,**\n\n. On the Page where you want to add header text, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Click and drag the\n\nicon from the toolbar on the right side of the Page to the location on the Page where you want the new header.\n\n\n When you drag the header icon over a Page, borders highlight to indicate the spots where you can insert the Card.\n3. Replace the word \"Title\" with the desired header name.\n4. (Optional) Use the\n\n\n icon to the left of the header to drag it where you want in the Page.\n\n\n###\n\nAdding borders\n\n\n You can add horizontal borders to your\n\nDomo Stories to better break up the content for your viewers. You can insert borders before or after layouts, headers, or other borders.\n\n\n**To add a border,**\n\n. On the Page where you want to add a border, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Click and drag the\n\nicon from the toolbar on the right side of the Page to the location on the Page where you want the new border.\n\n\n When you drag the border icon over a Page, borders highlight to indicate the spots where you can insert the Card.\n3. (Optional) Use the\n\n\n icon to the left of the border to drag it where you want in the Page.\n\nEditing Domo Stories layouts\n------------------------------\n\nA variety of options is available for editing Domo Stories, such as swapping Cards, replacing Cards with other Cards from your Domo instance, moving Cards to the Appendix, deleting entire layouts or individual Cards from a layout, etc.\n\n\n With all Domo Stories editing options, make sure to click\n **Save**\n after you make changes so you don't lose your work.\n\n##\n Swapping Cards\n\nTo swap Cards, just drag one onto the other.\n\n\n**To swap two Cards,**\n\n. On the Page where you want to swap Cards, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Drag one Card on top of the other.\n\n\n When you drag a Card (indicated by a\n\nicon) over another Card, a heavy line appears around the second Card to indicate the first Card will appear in that slot when you drop it.\n\nNote that when two Cards swap places, they both automatically resize themselves to fit the new slots.\n\n\n###\n Replacing Cards\n\nYou can replace a Card in a Domo Story with any existing Card you have access to in your Domo instance. Cards you replace are sent to the \"Appendix\" section at the bottom of the Page.\n\n\n**To replace a Card,**\n\n. On the Page where you want to replace a Card, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card you want to replace.\n3. In the\n **Edit Content**\n menu that appears, click\n **Choose different Card**\n .\n4. Locate the Card you want to add by entering its name in the\n **Search Cards**\n field and clicking on it.\n\nThe new Card fills the old Card's slot, and the old Card is sent to the \"Appendix\" section at the bottom of the Page.\n\n##\n Moving Cards to the appendix\n\nIf you want to move a Card to the Appendix without replacing it with another Card (as explained in the previous steps), you can do so easily.\n\n\n**To move a Card to the Appendix,**\n\n. On the Page where you want to move a Card, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card you want to move.\n3. In the\n **Edit Content**\n menu that appears, select\n **Move to appendix**\n .\n\nThe Card is moved to the Appendix, and the template slot is now empty.\n\n##\n Deleting individual Cards\n\nYou can remove a Card from a Domo Story, in which case it is no longer found anywhere in that Page. Note that these instructions show how to do this in the Story Editing mode, but you can also do this when the Editing mode is closed by selecting\n **Remove**\n in the Card menu (just as you can for any normal Card).\n\n\n**To delete a Card,**\n\n. On the Page where you want to delete a Card, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card you want to delete.\n3. In the\n **Edit Content**\n menu that appears, select\n **Remove from Dashboard**\n .\n\n\n###\n Deleting a Domo Story\n\nYou can delete a Domo Story from a Page. When you do this, all of the Cards in the Domo Story are moved to the \"Appendix\" section at the bottom of the Page.\n\n\n**To delete a Domo Story**\n**,**\n\n. On the Page where you want to delete a Domo Story, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Locate the Domo Story you want to delete.\n3. Click the\n\nicon to the left of the Domo Story.\n4. Click\n **Remove Layout**\n to confirm.\n\nThe Domo Story is removed, and all Cards are sent to the \"Appendix.\"\n\n##\n Editing or deleting a header\n\nTo edit a header, you simply click in the header box and replace the name with the name you want. To delete a header, you click the\n\nicon for that header.\n\n\n**To edit a header,**\n\n. On the Page where you want to edit or delete a header, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Locate the header you want to edit or delete.\n3. Do one of the following:\n\n* To enter a new header, click on the existing header and replace it with the desired header text.\n\t* To delete the header, click the\n\n icon for the header.\n\n\n###\n Deleting a border\n\nTo delete a border, you just click the\n\nicon for that border.\n\n\n**To delete a border,**\n\n. On the Page where you want to delete a border, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Locate the border you want to delete.\n3. Click the\n\nicon for the border.\n\n\n###\n Changing the background color for a Domo Story\n\nYou can change the background color for all Cards in a given Domo Story. This changes is applied to all Cards except for any in which you have already set an individual background color (discussed more in the next section).\n\n\n**To change the background color for a Domo Story,**\n\n. On the Page where you want to change a Story background color, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Locate and hover over the Domo Story you want to change the background color for.\n3. Click the palette icon\n\n.\n4. Click one of the provided colors from the palette.\n5. (Optional) To remove a fill from a Card, click\n **No Fill**\n in the color palette.\n\n*Tip:**\n When setting the background color of a Card, be sure it doesn't interfere with the colors already set in your chart. Remember that your primary goal is to communicate information to your viewers, not impress them with your flashy color choices!\n\n\n Customizing individual Cards\n------------------------------\n\nIn Domo Stories, there are a number of ways to customize Cards that are not available in standard Pages. These include changing Card background colors, showing or hiding Card elements such as titles and summary numbers, and configuring the actions that take place when users click on Cards.\n\n##\n Changing the background color for a Card\n\nYou can select a different background color for a Card in a Domo Story by selecting\n **Edit Content > Change background**\n . This change takes precedence over any background colors you have set for an entire Story (discussed in the previous section). So, for example, let's assume you have a Domo Story called \"Street Metrics.\" Within that Story is a Card called \"Net Income.\" You set the background color for that Card to red to draw attention to it. If you then change the overall color scheme of the \"Street Metrics\" Story to blue, all of the Cards in the Story take on blue backgrounds\n *except*\n for the Card you already set to red.\n\n\n**To change the background color for a Card,**\n\n. On the Page containing the Card you want to change the background color for, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Locate the Card in the Page.\n3. Select\n **Edit Content > Change background**\n .\n4. Click one of the provided colors from the palette.\n5. (Optional) To remove a fill from a Card, click\n **No Fill**\n in the color palette.\n\n*Tip:**\n When setting the background color of a Card, be sure it doesn't interfere with the colors already set in your chart. Remember that your primary goal is to communicate information to your viewers, not impress them with your flashy color choices!\n\n##\n Showing or hiding Card elements\n\nFor any given Card, you can hide Card elements such as titles, timeframes (i.e. date grains, such as \"By day\"), Summary Numbers, and even charts themselves. For example, you could hide the chart for a Card entirely and show just the Summary Number for the card. You do this by selecting\n **Edit Content > Display settings**\n then checking or unchecking the elements you want to show or hide.\n\n*Video - Domo Stories: Summary Metric View**\n\n*To show or hide elements for a Card,**\n\n. On the Page containing the Card you want to show or hide elements for, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Locate the Card in the Page.\n3. Select\n **Edit Content > Display settings**\n .\n4. Check or uncheck the elements you want to show or hide.\n\nSetting Card interactions\n---------------------------\n\nFor Cards in Domo Stories, you can define the actions that take place when a user clicks on a Card. These actions include the following:\n\n Opening the\n\nCard details view\n\nin a new browser tab\n* Enabling\n\ninteractions Filters\n\nfor all Cards powered by the same DataSet as this Card, either for all such Cards on the Page or for selected Cards\n* Opening other content in Domo, either in the same browser tab or in a different tab\n* Opening a specified web Page\n* Enabling \"Drill in place\" for the Card, which allows users to drill down into the card without having to first open the Details view\n* Disabling interactions entirely (essentially making the Card a \"flattened\" version of the Card)\n\n\n**Video - Domo Stories: Drill in Place**\n\nCard interactions are\n *only*\n available for Cards in Domo Stories. They do not work in standard Pages.\n\n*To configure a Card's Details view to open in another browser tab,**\n\n. On the Page with the Card you want to open in another browser tab when clicked, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card and click\n **Edit Content**\n .\n3. Select\n **Change Interaction**\n .\n4. In Section 2, check the\n **Open Card details in a new tab**\n box.\n5. Click\n **Save**\n .\n\n*To configure interaction Filters for a Card,**\n\n. On the Page with the Card you want to configure interaction Filters for, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card and click\n **Edit Content**\n .\n3. Select\n **Change Interaction**\n .\n4. (Optional) If you want to the Details view for the Card to open in a new tab when a user clicks on the Card, check the\n **Open Card details in a new tab**\n box in Section 2.\n5. (Conditional) Check the\n **Enable interaction Filters**\n box if it is not checked already.\n6. Do one of the following:\n\n* If you want interaction Filters to be applied to\n\t *all*\n\t Cards on the Page powered by the same DataSet as this Card, select the\n\t **Apply to all Cards on Dashboard**\n\t radio button.\n\t* If you want interaction Filters to be applied to\n\t *selected*\n\t Cards on the Page powered by the same DataSet as this Card, select the\n\t **Apply to selected Cards**\n\t radio button, click\n\t **Change**\n\t , select the Cards you want to apply the Filters to, click\n\t **Save**\n\t , then click\n\t **Save**\n\t again.\n\n*To enable Drill in Place for the Card,**\n\n. On the Page with the Card you want to enable Drill in Place on, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card and click\n **Edit Content**\n .\n3. Select\n **Change Interaction**\n .\n4. Select the\n **Drill in place**\n radio button.\n5. Click\n **Save**\n .\n\nFor more information about creating drilldown on a card, see\n\nAdding Drill Path to Your Chart\n\n.\n\n\n**To configure specified Domo content to open when a Card is clicked,**\n\n. On the Page with the Card you want to link to Domo content, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card and click\n **Edit Content**\n .\n3. Select\n **Change Interaction**\n .\n4. In Section 1, select the\n **Link to anything in Domo**\n radio button.\n5. In Section 2, click the\n **Select Content**\n button.\n6. Locate the content you want to open when this Card is clicked.\n7. Click\n **Save**\n .\n8. (Optional) If you want the URL to open with a custom name, enter the name in the\n **Display as**\n field.\n9. (Optional) If you want the new content to open in a new browser tab when the Card is clicked, check the\n **Open link in a new tab**\n box.\n10. Click\n **Save**\n again.\n\n*To configure an external web Page to open when a Card is clicked,**\n\n. On the Page with the Card you want to link to external content, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card and click\n **Edit Content**\n .\n3. Select\n **Change Interaction**\n .\n4. In Section 1, select the\n **Link to external web Page**\n radio button.\n5. In Section 2, in the\n **Web Page address**\n field, enter the URL of the Page you want to open when the Card is clicked.\n6. (Optional) If you want the URL to open with a custom name, enter the name in the\n **Display as**\n field.\n7. (Optional) If you want the new content to open in a new browser tab when the Card is clicked, check the\n ****Open link in a new tab****\n box.\n8. Click\n ****Save****\n again.\n\n*To disable Card interactions,**\n\n. On the Page with the Card you want to disable interactions for, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Mouse over the Card and click\n **Edit Content**\n .\n3. Select\n **Change Interaction**\n .\n4. In Section 1, click the radio button reading\n **Disable Card interactions**\n .\n5. Click\n **Save**\n .\n\nSetting a Page background color or image\n------------------------------------------\n\nIf you want, you can set either a background color or image on a Domo Stories Page. You cannot set both a background color and image on the same Page.\n\n##\n Setting a Page background color\n\nYou can choose colors from a palette or specify a custom color by inputting a hexadecimal value.\n\n\n**Note:**\n\nWhen you add a background color, the Card content shrinks slightly to allow for padding between the Card edges and content.\n\n\n**Video - Domo Stories Background Colors**\n\n*To change the Page background color,**\n\n. On the Page you want to change the background color of, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. In the\n **Options**\n menu at the top of the screen, select\n **Change background**\n .\n3. (Conditional) If\n **Image Fill**\n is selected in the menu at the top of the dialog, choose\n **Color Fill**\n .\n4. Choose the color you want from the palette OR specify a custom color by entering a hexadecimal value into the field at the bottom of the dialog.\n\n\n###\n Setting a Page background image\n\nYou can specify a background image to appear in your Domo Stories Pages. You can also choose a background color to be used while your image is loading. You also have the option to set the text color for headers and cards without a background color. Background images are recommended to have a size with a 2:1 ratio (for example, 1000 x 500).\n\n\n**Video - Adding Background Images to Domo Stories**\n\n*To set the background image for a Page,**\n\n. On the Page you want to change the background color of, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. In the\n **Options**\n menu at the top of the screen, select\n **Change background**\n .\n3. (Conditional) If\n **Color Fill**\n is selected in the menu at the top of the dialog, choose\n **Image Fill**\n .\n4. Click\n **Choose Image**\n .\n5. Locate and select your image on your machine.\n6. (Optional) To change the default background color (which is only used before the image has loaded on the Page), click\n **Change**\n then choose the new color from the palette (or enter a hexadecimal code in the field at the bottom of the palette).\n7. (Optional) To change the default text color used on the Page, select the new color in the menu under \"Default text color.\"\n\n\n Currently only black and white are available as text colors.\n\nIf you want to change your background image, click\n **Choose New Image**\n at the bottom of the dialog then locate and select the new image on your machine.\n\n\n Turning on fullscreen mode\n----------------------------\n\nIn Domo Stories Pages, a fullscreen mode is available. When this mode is active, all Cards in the Page are visible, while all other interface elements such as navigation components, menus, etc. are hidden.\n\n\n**To turn on fullscreen mode,**\n\n. Select\n **Full Screen**\n in the\n\nmenu in the top right corner of the Page.\n2. To exit fullscreen mode, press Escape.\n\nTurning on mobile preview\n---------------------------\n\nIn Domo Stories Pages, you can turn on a preview showing how your Stories will appear when viewed on smartphones. This preview will be the same across all major smartphone brands, notwithstanding a few UI elements specific to certain brands. There is no preview for tablets because the tablet layout is nearly the same as the standard web layout.\n\n\n**Video - Using the Mobile Preview in Domo Stories**\n\n*To turn on the mobile preview,**\n\n. On the Page you want to change the view of, select\n **Edit Dashboard**\n in the\n\nmenu in the top right corner of the Page.\n2. Click the\n **Desktop**\n menu in the top right area of the screen.\n3. Select\n **Mobile**\n .\n\nTo switch back to\n **Desktop**\n , select\n **Desktop**\n in the same menu.\n\n\n Turning on auto width\n-----------------------\n\nWith the Auto-Width Dashboard setting, Dashboard content will expand to fill all the available window space. This will allow for more rows/columns to be visible from the Dashboard view. This is enabled on a per-Dashboard basis to allow you to customize your Stories.\n\n\n**To turn on auto width,**\n\n. On the Page you want to enable auto width, select Edit Dashboard in the details\\_gear\\_icon.png menu in the top right corner of the Page.\n2. Click the Options menu in the top right area of the screen.\n3. Select Auto width.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428433\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005022\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCreating Domo Stories\n\n", "article_total_view_count": "\n\n\n 6,235\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/2/2022, 8:55 PM\n\n\n", "first_published_date": "\n\n\n 11/2/2022, 9:04 PM\n\n\n"}, "title": "creating_domo_stories", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "card_and_dashboard_management", "url": "/s/topic/0TO5w000000ZanDGAS"}]}