{"file_path": "../../raw_kb_v2\\article\\360042931774\\index.html", "content": {"title": "\n\n\n SAP Adaptive Server Enterprise SSH Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSAP ASE (Adaptive Server Enterprise), formerly known as Sybase SQL Server, is a relational model database server product for businesses. Use Domo's SAP Adaptive Server Enterprise SSH connector to retrieve data from an SAP database via an SSH tunnel by inputting an SQL query. To learn more about SAP Adaptive Server Enterprise, visit their page (\n\nhttps://www.sap.com/products/sybase-ase.html\n\n).\n\n\n You connect to a SAP Adaptive Server Enterprise database in the Data Center. This topic discusses the fields and menus that are specific to the SAP Adaptive Server Enterprise SSH connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to an SAP Adaptive Server Enterprise database and create a DataSet, you must have the following:\n\n The username and password you use to log into your SAP Adaptive Server Enterprise account\n* The host name for the database\n* The port number for the database\n* The database name\n* The SSH hostname\n* The username and password for the SSH user\n* The SSH port number\n* The SSH private key\n\nBefore you can connect to an SAP database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses for Connectors\n\n.\n\n\n**Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys (in PEM format) generated by OpenSSL.**\n\n\n Connecting to an SAP Adaptive Server Enterprise Database\n----------------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the SAP Adaptive Server Enterprise SSH Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your SAP Adaptive Server Enterprise account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n SSH Host\n  |\n Enter the SSH hostname.\n  |\n|\n SSH User\n  |\n Enter the username for your SSH user.\n  |\n|\n SSH Password\n  |\n Enter the password for your SSH user.\n  |\n|\n SSH Port\n  |\n Enter the SSH port number.\n  |\n|\n SSH Private Key\n  |\n Enter the SSH private key.\n  |\n|\n Username\n  |\n Enter your SAP Adaptive Server Enterprise account username.\n  |\n|\n Password\n  |\n Enter your SAP Adaptive Server Enterprise account password.\n  |\n|\n Host\n  |\n Enter the host name for the SAP database. For example:\n\n\n db.company.com\n\n\n |\n|\n Port\n  |\n Enter the port number for the database.\n  |\n|\n Database\n  |\n Enter the name of the database.\n  |\n\n\n Once you have entered valid SAP Adaptive Server Enterprise credentials, you can use the same account any time you go to create a new SAP Adaptive Server Enterprise SSH DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nIn this pane you create an SQL query to pull data from your database. The\n **Query**\n parameter is required. The other three parameters are here to help you construct this query if you choose.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Query\n  |\n Enter the Structured Query Language (SQL) query to use in selecting the data you want. For example:\n\nselect \\* from Employee\n\nIf you want help in constructing your query,\n  |\n|\n Database Table (Optional)\n  |\n Select the table containing the data you want to pull into Domo. The selected table will be added to the automatically generated query in the\n **Query Helper**\n field.\n  |\n|\n Table Columns (Optional)\n  |\n Select the table columns with data you want to pull into Domo. The selected columns will be added to the automatically generated query in the\n **Query Helper**\n field.\n  |\n|\n Query Helper (Optional)\n  |\n Copy and paste this query into the\n **Query**\n field if you need help building a query. This query is automatically generated when you select a table and columns in the\n **Database Table**\n and\n **Table Columns**\n fields, respectively.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931774\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003886\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSAP Adaptive Server Enterprise SSH Connector\n\n", "article_total_view_count": "\n\n\n 4,691\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "sap_adaptive_server_enterprise_ssh_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}