{"file_path": "../../raw_kb_v2\\article\\6523741250455\\index.html", "content": {"Title": "Domo Everywhere: Routing, Creation, and Mapping", "Article Body": "Intro\n                       \n\n                        To get started with Domo Everywhere, you must establish a connection between the publishing organization and all of the subscribing organizations. The Domo administrator for the publishing organization creates and maintains the connections to the subscribing organizations from the Domo Everywhere central hub. The admin also configures the authentication for each user within the subscribing organizations. This is called routing.\n                       \n\n                        After routing is configured, the admin must create each subscribing organization within the publishing organization and provide the key attributes for the individual users that are authenticating so that they can be mapped to the appropriate subscribing organizations. After the key attributes are provided, Domo completes the mapping process automatically. The admin can then view the mapping details from within the publishing organization.\n                       \n\n\n\n\n                        This article describes how to configure publishing organizations and subscriber organizations in the following topics:\n                       \n\n\n\n                          Prerequisites\n                         \n\n\n\n                          Routing\n                         \n\n\n\n                            G\n                           \n\n                            rant embed access\n                           \n\n\n\n                            Download/upload routing certificate\n                           \n\n\n\n\n\n                          Subscriber Organization Setup\n                         \n\n\n\n                            Define the key attribute\n                           \n\n\n\n                            Create a subscriber organization\n                           \n\n\n\n                            Remove a subscriber organization\n                           \n\n\n\n\n\n                          Mapping\n                         \n\n\n\n                          Troubleshooting\n                         \n\n\n\n                          FAQ\n                         \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        You need to do the following before routing, creation, and mapping:\n                       \n\n\n                         Purchase the Domo Everywhere product.\n                        \n\n                         Configure the publishing organization in Domo.\n                        \n\n                         Identify your organization's authentication method in the following table and obtain any listed information.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If a third-party system hosts key attributes used to authenticate the identity of your users, choose OIDC or SAML.\n                            \n\n\n\n\n\n\n\n\n\n\n                            Authentication Method\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            JWT Secret\n                           \n\n\n\n\n                             This method requires the simplest implementation. If your system hosts key attributes used to authenticate the identity of your users, choose JWT Secret. No additional\n                            \n\n                             information is needed. Generate the secret as instructed in the UI.\n                            \n\n\n\n\n\n\n\n\n\n\n                                Important:\n                               \n                               A secret is a one-to-many relationship. After you select\n                               \n                                Generate Secret\n                               \n                               one time, copy it and put it in the places that you need it. When you navigate away from the page, that secret cannot be recovered. Generating a new secret invalidates all existing secrets.\n                              \n\n\n\n\n\n\n\n\n                            JWT Public Key\n                           \n\n\n\n\n                             If your organization uses this method, you can get the Public Key from your IT manager.\n                            \n\n\n\n\n\n\n                            OpenID Connect (OIDC)\n                           \n\n\n\n                            You need the following information:\n                            \n                            -  Client ID\n                            \n                            -  Client Secret\n                            \n                            -  Authorization url\n                            \n                            -  Token endpoint\n                            \n                            -  Exchange endpoint\n                            \n                            -  User information endpoints\n                           \n\n\n\n\n\n                            SAML (SSO)\n                           \n\n\n\n                            You need the following information:\n                            \n                            -  Entity ID\n                            \n                            -  Login endpoint url\n                            \n                            -  Logout endpoint url\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           During beta, you must upload the Routing Certificate from the publishing organization to the\n                           \n                            Routing\n                           \n                           tab of each new subscribing organization that you create. For detailed instructions on how to do this, see\n                           \n                            Uploading the Routing Certificate to the Subscribing Organization\n                           \n                           .\n                          \n\n\n\n\n\n\n                        Routing\n                       \n\n                        Complete the tasks in this section according to the authentication method you identified above.\n                       \n\n                        Choosing the Authentication Method\n                       \n\n                        1. From the navigation header, go to\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                       \n\n                        2. From the\n                        \n                         Domo Everywhere\n                        \n                        menu on the Admin page, select\n                        \n                         Embed\n                        \n                        .\n                       \n\n\n\n\n                        3. In the\n                        \n                         Embed\n                        \n                        section, go to the\n                        \n                         Routing\n                        \n                        tab.\n                       \n\n                        4. Select your authentication method from the menu.\n                       \n\n\n\n\n                        5. Fill in the information for your authentication method.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           As a reminder, if you use JWT Secret, make sure to copy and save the secret after you generate it. When you navigate away from the page, that secret cannot be recovered. If you generate a new secret, all existing secrets are invalidated.\n                          \n\n\n\n\n\n\n                        Grant Embed Access\n                       \n\n                        This security feature is optional. The\n                        \n                         Embed Url\n                        \n                        feature allows you to create a pre-approved list of domains that can display your embedded Domo content. Even with the embed code, a domain that is not on the allowlist cannot display the content.\n                       \n\n                        To use this feature, enter the URL of each site you wish to add to the allowlist in the\n                        \n                         Domain name\n                        \n                        field and select\n                        \n                         Add\n                        \n                        .\n                       \n\n                        The URLs on the allowlist display below the\n                        \n                         Domain name\n                        \n                        field.\n                       \n\n\n\n\n\n\n                        Download Routing Certificate\n                       \n\n                        This security feature is optional. If your website or portal requires certificate encryption between Domo and the website, you can download the certificate here.\n                       \n\n                        To download the certificate, select\n                        \n\n                         Download\n                        \n                        to the right of the\n                        \n                         Routing Certificate\n                        \n                        field.\n                       \n\n\n\n\n                        You can now upload the certificate to your authentication provider.\n                       \n\n                        Uploading the Routing Certificate to the Subscribing Organization\n                       \n\n                        After you download the Routing Certificate, you can upload it to a subscriber organization's Domo environment by following these steps:\n                       \n\n                        1. Load the Domo environment you want to upload the certificate to.\n                       \n\n                        2. From the navigation header, go to\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                       \n\n                        3. From the\n                        \n                         Domo Everywhere\n                        \n                        menu on the Admin page, select\n                        \n                         Embed\n                        \n                        .\n                       \n\n                        4. Go to the\n                        \n                         Routing\n                        \n                        tab.\n                       \n\n                        5. In the\n                        \n                         Authentication Method\n                        \n                        menu, select\n                        \n                         SAML (SSO)\n                        \n                        .\n                       \n\n                        6. Select\n                        \n                         Edit\n                        \n                        .\n                        \n                        The\n                        \n                         Edit SAML (SSO)\n                        \n                        dialog displays.\n                       \n\n\n\n\n\n\n\n                        7. In the\n                        \n                         Certificate\n                        \n                        field, enter the Routing Certificate.\n                       \n\n                        8. Select\n                        \n                         Save\n                        \n                        .\n                       \n\n\n\n                        Paste the Embed URL\n                       \n\n                        After you have chosen the authentication method and configured all security features, you can view the embed url.\n                       \n\n                        1. Copy the address in the\n                        \n                         Embed Url for identity broker\n                        \n                        field by selecting\n                        \n\n                         Copy\n                        \n                        .\n                       \n\n                        2. Paste the address into your host site or software to redirect users to their mapped account.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If the format of your url does not display as https://\n                           \n                            domain\n                           \n                           .\n                           \n                            identity.domo.com\n                           \n                           , contact your Customer Success Manager (CSM).\n                          \n\n\n\n\n\n\n                        Subscriber Organization Setup\n                       \n\n                        After you have successfully set up routing, the next step is adding subscriber organizations that will receive your published content. A Domo admin\n                        \n\n                        can create, update, and delete any number of subscribing organizations based on needs and workflows.\n                       \n\n                        Before you can create a subscriber organization for the first time, you need to define your key attribute. The key attribute is the value that Domo uses to map a user to an organization. To help you determine your key attribute, consider, for your organization, what is the field in a user's profile that comes from your identity provider (IDP)? Common examples are \"customer ID\" and \"partner ID.\" We recommend renaming the\n                        \n                         Key attribute\n                        \n                        field to your preferred value.\n                       \n\n                        After you define your key attribute once, you can then skip this section and begin at\n                        \n                         Creating a Subscriber Organization.\n                        \n\n\n\n\n                        Define the Key Attribute\n                       \n\n                        1. In\n                        \n                         Domo Everywhere\n                        \n                        , go to the\n                        \n                         Embed\n                        \n                        section.\n                       \n\n                        2. In\n                        \n                         Embed\n                        \n                        , go to the\n                        \n                         Mapping\n                        \n                        tab.\n                        \n                        At the top of the Mapping tab, the\n                        \n                         Key attribute\n                        \n                        field displays\n                       \n\n                        3. Select\n                        \n                         Edit\n                        \n                        to edit the field and name your key attribute.\n                        \n                        The\n                        \n                         Edit key attribute\n                        \n                        modal displays.\n                       \n\n\n\n\n                        You can name your key attribute whatever your organization uses for the value that identifies your customers. In this example, we are using customerID.\n                       \n\n\n\n\n\n\n                        4. After you enter your key attribute name, select\n                        \n                         Save.\n                        \n\n\n                        Your key attribute now displays throughout Domo Everywhere where the key attribute appears.\n                       \n\n\n\n\n\n                        Create a Subscriber Organization\n                       \n\n                        If your\n                        \n                         key attribute\n                        \n                        is defined, follow these steps to create a subscriber organization.\n                       \n\n                        1. From the navigation header, go to\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                       \n\n                        2. In the\n                        \n                         Domo Everywhere\n                        \n                        menu, select\n                        \n                         Organizations\n                        \n                        .\n                        \n                        The\n                        \n                         Organizations\n                        \n                        section of Domo Everywhere displays.\n                       \n\n\n\n\n\n\n                        3. Select\n                        \n                         + New Organization\n                        \n                        .\n                        \n                        The\n                        \n                         New Organization Creation\n                        \n                        modal displays.\n                       \n\n\n\n\n                        4. In the modal, enter the\n                        \n                         Organization Name\n                        \n                        .\n                        \n                         We recommend giving the organization a name that corresponds with a service account that the organization uses consistently to validate all end customer accounts\n                         \n                          .\n                         \n\n\n\n\n                         5. Enter the\n                         \n                          Service account email\n                         \n                         .\n                        \n\n\n                        6. Enter the value for your key attribute, which displays in the modal the way that you configured it in the\n                        \n                         Mapping\n                        \n                        tab. In this example, the key attribute is configured as the customerID.\n                       \n\n\n\n\n                        5. (Optional) Check the box if you want to share with the default group.\n                       \n\n                        6. Select\n                        \n                         Save\n                        \n                        .\n                       \n\n                        Saving may take a few seconds because the system is confirming that no duplicate customer names have been sent.\n                       \n\n\n\n                        Remove a Subscriber Organization\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           The subscriber organization must unsubscribe from all publications before you can remove it.\n                          \n\n\n\n\n\n                         From the navigation header, go to\n                         \n                          More\n                         \n                         >\n                         \n                          Admin\n                         \n                         .\n                         \n                         The Admin Settings display.\n                        \n\n                         In the\n                         \n                          Domo Everywhere\n                         \n                         menu, select\n                         \n                          Publications\n                         \n                         .\n                         \n                         The\n                         \n                          Publications\n                         \n                         page displays.\n                         \n\n\n\n\n\n\n\n                         Open the\n                         \n                          Subscribers\n                         \n                         tab.\n                         \n                         Each subscriber organization displays as a row.\n                         \n\n\n\n\n                         Select\n                         \n\n                          More\n                         \n                         for the subscriber you want to remove.\n                         \n                         The edit and delete options display.\n                         \n\n\n\n\n\n\n\n                         Select\n                         \n\n                          Delete Subscriber\n                         \n                         .\n                         \n                          A dialog displays where you must acknowledge that you understand that the subscriber is being removed from Domo permanently and that everybody that has access to that subscriber's Domo environment will no longer be able to log in.\n                         \n\n\n\n\n\n                         Select\n                         \n                          Delete\n                         \n                         to remove the subscriber or\n                         \n                          Cancel\n                         \n                         to cancel the operation.\n                        \n\n\n\n\n                        Mapping\n                       \n\n                        After creating an organization, it's time to set its\n                        \n\n                        key attribute for mapping. Users are mapped according to the\n                        \n                         Attribute Value\n                        \n                        that displays on the left side of the mapping table. As each user signs into the host portal, Domo redirects the iframe to the\n                        \n                         Child instance URL\n                        \n                        listed on the right side of the mapping table.\n                       \n\n\n\n\n                        Follow these steps to map a subscriber organization:\n                       \n\n                        1. From the navigation header, go to\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                       \n\n                        2. In the\n                        \n                         Domo Everywhere\n                        \n                        menu, select\n                        \n                         Embed\n                        \n                        .\n                       \n\n                        3. Go to the\n                        \n                         Mapping\n                        \n                        tab.\n                       \n\n                        4. Select\n                        \n                         + Add Mapping\n                        \n                        .\n                       \n\n\n\n\n                        The\n                        \n                         Add mapping\n                        \n                        dialog displays.\n                       \n\n\n\n\n                        5. In the dialog, fill in the\n                        \n                         Attribute Value\n                        \n                        and the\n                        \n                         Child instance URL\n                        \n                        for the user.\n                       \n\n                        6. Select\n                        \n                         Save\n                        \n                        .\n                        \n                        The dialog closes.\n                       \n\n                        Users are now mapped to the correct subscribing organization.\n                       \n\n\n\n                        Troubleshooting\n                       \n\n\n                         {\"status\":400,\"statusReason\":\"Bad Request\",\"message\":\"No value in attribute...\"}\n                         \n\n\n\n                        This usually occurs if you have changed the\n                        \n                         Key Attribute name from the default and your host page has not adjusted to watch for the new name. The default always looks for \"keyAttribute.\"\n                         \n\n                         We recommend you change it to the field in your data and user profiles. Common examples include \"Customer ID\" and \"Partner ID.\"\n                        \n\n\n\n\n\n\n\n\n                         Changing the Key Attribute Name\n                        \n\n\n\n                         1. Inside Domo Everywhere, go to the\n                         \n                          Embed\n                         \n                         section.\n                        \n\n\n\n                         2. Go to the\n                         \n                          Mapping\n                         \n                         tab.\n                        \n\n\n\n                         3. In the\n                         \n                          Key attribute\n                         \n                         field, enter the value you would like to use instead.\n                        \n\n\n\n\n\n\n\n\n                         {\"status\":500,\"statusReason\":\"Internal Server Error\" ...}\n                        \n\n\n                        This usually occurs if you or the automated process have not successfully uploaded the cert.pem to the SSO settings in the subscriber organization's Domo environment. Routing Certificates are usually uploaded automatically by the published configuration.\n                       \n\n\n\n\n\n                        If that process was not successful or you are integrating a preexisting instance that was not created through Domo Everywhere admin, you can also manually download the SSO certificate from the publishing organization and upload it to the subscriber organization.\n                       \n\n                        For detailed instructions on how to do this, see\n                        \n                         Downloading the Routing Certificate\n                        \n                        , above.\n                       \n\n\n\n\n                         \"Browser cannot open page in embedded iframe\"\n                        \n\n\n                        This usually happens if the\n                        \n                         no-iframe-embedding\n                        \n                        feature switch is active. Deactivation of the switch is normally done\n                        \n                         automatically as a part of the configuration published from the parent to the child along with the rest of the brand kit and subscriber feature switches.\n                        \n\n                        If you click the \"open site in new window\" and the cert mentioned above has been uploaded, the child should load when accessed directly or when you click the \"Open Site in New Window\" button above.\n                        \n                        If that published configuration was unsuccessful or the child is a preexisting instance, \"no-iframe-embedding\" can be activated by contacting your Domo representative. This will ensure the child environment also loads in embedded iframes.\n                       \n\n\n\n                        Frequently Asked Questions\n                       \n\n\n                         My customer has a certain template they apply to their users. How can I make sure that template is used?\n                        \n\n                        For this version, we require all subscribing organization's to use the same \"embedded end customer account\" feature switch template. That template hides the Domo platform header and footer, removes Domo branding, and activates auto-subscription capabilities. However, if you have additional unique needs, you can coordinate additional template changes by contacting your CSM/AE.\n                        \n                        Your custom template is then automatically used in the creation of subscriber organizations for that publisher.\n                       \n\n\n                         I need to create multiple subscribers. Is there a bulk creation option?\n                        \n\n                        Not yet. That is queued for release soon after this beta begins.\n                       \n\n\n                         Can I automate the bulk creation of instances programmatically via API?\n                        \n\n                        Not yet. That is part of the general release of customer creation that includes bulk creation.", "Preview Article": "Click here to preview", "URL Name": "6523741250455", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004982", "Archived Date": "", "Language": "English", "Primary Version": "Domo Everywhere: Routing, Creation, and Mapping", "Article Total View Count": "5,822", "": "", "Article Created Date": "11/1/2022, 11:18 PM", "First Published Date": "11/1/2022, 11:23 PM"}, "title": "\n              Domo Everywhere: Routing, Creation, and Mapping\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}