{"file_path": "../../raw_kb_v2\\article\\360042936174\\index.html", "content": {"Title": "July 2016 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Personalized Data Permissions (PDP)\n                       \n\n                        Personalized Data Permissions (PDP) allow you to create a customized experience for each Domo user through the definition of Entitlement Policies. Using Entitlement Policies, you can filter data in a DataSet for specified users and/or groups. PDP policies are applied almost anywhere in Domo that data from this DataSet is used, including the following:\n                       \n\n\n\n                          Cards. If a card is powered by a DataSet with PDP policies applied, affected users and groups see only data in the card that applies to them.\n                         \n\n\n\n                          Alerts. An alert's PDP policies filter the alert data and control which users can subscribe.\n                         \n\n\n\n                          DataFusions. When you add input DataSets with PDP policies applied to a DataFusion, only the data allowed by the policy is incorporated into the DataFusion.\n                         \n\n\n\n                        You cannot add input DataSets to a DataFlow if you are restricted by PDP policies; however, you can add policies to the output DataSets generated by the DataFlow. When executing a DataFlow with PDP policies applied, you\n                        \n                         must\n                        \n                        have an \"Admin\" security role or be the DataFlow owner; otherwise the DataFlow will break.\n                       \n\n                        If no Entitlement Policies have been created for a DataSet, anyone the DataSet has been shared with will have full access to the data. If a policy is created, only those users in the policy can see data.\n                       \n\n\n\n                          PDP Tab in Data Center\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                          PDP Policy Selection in Alert Dialog\n                         \n\n\n\n\n\n\n\n\n\n\n                        For more information, see\n                        \n                         Personalized Data Permissions (PDP)\n                        \n                        .\n                       \n\n                        Design Studio updates\n                       \n\n                        The following enhancements have been made to the Design Studio:\n                       \n\n\n\n                          Notifications for users with older versions. Creative Cloud syncs version updates to users, so if users have turned off the Creative Cloud desktop sync application or if they need IT permission to upgrade, their version of Design Studio may be out of date. To accommodate this problem, a notification system has been built to identify users with older versions and instruct them on how to upgrade.\n                         \n\n\n\n                          New font selection interface. The former interface required users to type the font name into a text field. This has now been changed to a drop-down menu that populates with supported web fonts.\n                         \n\n\n\n\n\n\n\n\n\n                          Cool new widgets, including...\n                         \n\n\n\n                            A Canadian FSA Map widget that shows data by province and FSA areas.\n                            \n\n\n\n\n\n\n                            Image and text link widgets that allow you to link to URLs on Domo's whitelist.\n                            \n\n\n\n\n\n\n                            Table Widget V2. The new table widget allows you to add sorts; define width by pixels or points; have alternating row colors; and set background transparency, cell borders, and border size.\n                            \n\n\n\n\n\n\n\n\n                        New Beast Mode functions\n                       \n\n                        The following functions are now available for use in building Beast Mode calculations:\n                       \n\n\n\n                          String Functions\n                         \n\n\n\n\n\n\n\n                            Function\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n\n                             INSTR\n                            \n\n\n\n\n                            Returns the position of the first instance of a specified string in a given column, starting from the first letter in the name.\n                           \n\n                            In the example at right, the calculation would return the position of the first instance of the letter \"e\" in each string in the column.\n                           \n\n\n\n\n                             INSTR(`Group`,'e')\n                            \n\n\n\n\n\n\n\n                             LEFT\n                            \n\n\n\n\n                            Returns the specified number of characters in each string in the the given column, starting from the left.\n                           \n\n\n\n\n                             LEFT(`Group`,3)\n                            \n\n\n\n\n\n\n\n                             LENGTH\n                            \n\n\n\n\n                            Returns the number of characters in each string in the given column.\n                           \n\n\n\n\n                             LENGTH(`Group`)\n                            \n\n\n\n\n\n\n\n                             REPLACE\n                            \n\n\n\n\n                            Replaces all of the specified strings in a given column with another specified string.\n                           \n\n\n\n\n                             REPLACE(`Department`,'Human Resnources','Human Resources')\n                            \n\n\n\n\n\n\n\n                             RIGHT\n                            \n\n\n\n\n                            Returns the specified number of characters in the given column, starting from the right.\n                           \n\n\n\n\n                             RIGHT(`Group`,3)\n                            \n\n\n\n\n\n\n\n\n                          Date/Time Functions\n                         \n\n\n\n\n\n\n\n\n                             UNIX_TIMESTAMP\n                            \n\n\n\n\n                            Returns UNIX time stamps for all values in a date/time column.\n                           \n\n\n\n\n                             UNIX_TIMESTAMP(`DateCol`)\n                            \n\n\n\n\n\n\n\n                             WEEKOFYEAR\n                            \n\n\n\n\n                            Returns the week number for all dates in a date/time column.\n                           \n\n\n\n\n                             WEEKOFYEAR(`DateCol`)\n                            \n\n\n\n\n\n\n                        For more information about Beast Mode calculations, see\n                        \n                         Beast Mode Functions Reference Guide\n                        \n                        .\n                       \n\n                        Previews of previous/next cards\n                       \n\n                        In the Details view for a card, when you mouse over the previous or next button, a thumbnail image of the previous or next card in the page appears.\n                       \n\n\n\n\n                        For more information about the Details view, see\n                        \n                         Card Details View Layout\n                        \n                        .\n                       \n\n                        Card Builder resizable column containers\n                       \n\n                        In the Card Builder, you can now expand the pane on the left that displays the category and value columns. This will allow you to read longer column names that would have been cut off previously.\n                       \n\n\n\n\n\n\n                        Filtering on unused data columns\n                       \n\n                        An issue was corrected in which you were not able to filter on data columns not being used in your visualization.\n                       \n\n                        End of Support for IE9\n                       \n\n                        Beginning with our July release, Domo will no longer be supporting Internet Explorer 9.\n                       \n\n                        End of Support for Workbench 2\n                       \n\n                        Beginning in September, Domo will be ending support for Workbench 2.\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by using @DomoSupport in Buzz, by email at\n                          \n                           support@domo.com\n                          \n                          or by phone at 801-805-9505 (Monday through Friday, 7 am to 6 pm MST)\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042936174", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004450", "Archived Date": "", "Language": "English", "Primary Version": "July 2016 Release Notes", "Article Total View Count": "2,403", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              July 2016 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}