{"file_path": "../../raw_kb_v2\\article\\360043438993\\index.html", "content": {"Title": "Setting Up Publication Groups", "Article Body": "Intro\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                           This feature is available\n                           \n                            on demand.\n                           \n                           To request that this feature be enabled,\n                           \n                            Contact Support\n                           \n                           . Depending on the feature, you may be required to complete training before you can use the feature.\n                          \n\n\n\n\n                        Using Publication Groups, you can set up specific users to access only pertinent data in a protected, filtered view of Domo. Based on group membership and filters, these users can view only the slice of data pertinent to them (aka\n                        \n                         row-based view filtering\n                        \n                        ,\n                        \n                         horizontal\n                        \n                        or\n                        \n                         row-level\n                        \n                        security). Publication Groups SSO is also available, for more information see\n                        \n                         Publication Groups and You: The Not Quite Definitive Primer\n                        \n                        .\n                       \n\n                        You can create, edit, and delete Publication Groups in your Domo instance if you have an \"Admin\" default security role or a custom role with \"Manage Publication Groups\" enabled. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Any policies created through Publication Groups will supersede any PDP policies. For more information about PDP, see\n                            \n                             Creating and Deleting PDP Policies\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           With\n                           \n                            row-based view filtering\n                           \n                           , you can filter a DataSet based on the row value of a column heading in the data. By filtering row values per user on the same column, you allow a user to view only certain data.\n                          \n\n\n\n\n\n                         Video - Publication Groups\n                        \n\n\n\n\n\n\n                        Understanding the Publication Groups view\n                       \n\n                        Elements of the Publication Groups view\n                       \n\n                        In the Publication Groups view you can...\n                       \n\n\n\n                          Add Pages\n                          \n\n                          Page owners may create Pages containing Cards to share with Publication Group members.\n                         \n\n\n\n                          Add Cards\n                          \n\n                          Card owners add Cards to Pages to share with Publication Group members.\n                         \n\n\n\n                          Set up access groups\n                          \n\n                          Groups and members in Publication Groups are different than regular groups and members in Domo. Publication Groups are special security groups controlled within the Publication Groups view. Members of a Publication Group see only the Pages and Cards authorized for the group. (If users are also members of regular groups, then they see Pages and Cards authorized for those groups.)\n                         \n\n\n\n                          Set up filters on columns\n                          \n\n                          Filtering works by using a column in the data as a data column filter and using its row values as row value filters to apply to Publication Groups.\n                         \n\n\n\n                            Data column filters\n                            \n\n                            Administrators assign filters for DataSets powering the Cards in the Publication Groups Pages. The data column filters make use of the column headings in the data (for example, the \"Region\" column heading).\n                           \n\n\n\n                            Row value filter values\n                            \n\n                            Administrators assign row value filters to Publication Groups to control what row level data access group members have. The row value filter is a value in the specified data column filter. For example, if the data column filter is \"Region,\" values might be \"West,\" \"Northeast,\" and \"Southeast.\"\n                           \n\n\n\n\n\n                          Inclusive or exclusive access\n                          \n\n                          Currently, you can configure the Publication Groups view to provide inclusive and/or exclusive access for internal enterprise users, or exclusive access for external users (those without Domo accounts).\n                          \n\n\n\n\n\n\n                              Access Type\n                             \n\n\n\n                              Domo Account Type\n                             \n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n                              Inclusive\n                             \n\n\n\n                              Internal\n                             \n\n\n\n                              You can authorize users in Domo to access Publication Groups Pages and Cards, in addition to seeing other Pages and Cards. To configure this method, administrators add users with \"Privileged,\" \"Editor,\" or \"Participant\" security roles to Publication Groups, in addition to regular groups.\n                             \n\n\n\n\n\n                              Exclusive\n                             \n\n\n\n                              Internal or External\n                             \n\n\n\n                              You can authorize users in Domo to access only the Publication Groups Pages and Cards. To configure this method, administrators add users with \"Privileged,\" \"Editor,\" or \"Participant\" security roles to only Publication Groups, removing them from any regular groups. You can also authorize external users to access only Publication Groups Pages and Cards.\n                             \n\n\n\n\n\n\n\n\n\n                        By default, when users are initially added to a Publication Group, they cannot see any data. Administrators must explicitly grant access to data to Publication Group users by specifying the row value filters per group.\n                       \n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           As you add an additional data column filter to a Publication Group, Domo attempts to apply any existing row value filters to the data column filter when the additional DataSet has the same column names as an existing DataSet. If the DataSet values are the same as values of an existing DataSet, Domo applies any existing row value filters to the additional data column filter. You can specify additional row value filters or any differing values.\n                          \n\n\n\n\n                        In Domo, users create Pages and Cards that they want to share in the Publication Groups view.\n                       \n\n                        How the Publication Groups view works for a user\n                       \n\n                        A user with membership in a Publication Group first logs in to Domo.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n\n                           If the user has an external account, he or she can access the Publication Group by navigating to\n                           \n                            domain-ss.domo.com\n                           \n                           where domain-ss is their company domain, then connecting using the implemented Single Sign-On. For more information, see\n                           \n                            Implementing Single Sign-On\n                           \n                           .\n                          \n\n\n\n\n                        The user can then access the Publication Groups view (by going to the Page specified as the title in the\n                        \n                         Publication Group\n                        \n                        settings), then navigate to any available Pages or Subpages, based on membership in Publication Groups.\n                       \n\n                        On a Page, the user sees filtered data in the Cards, based on DataSet and row value filters. You can also grant access to Cards not connected to a DataSet, such as Notebook cards, Doc cards, and so on.\n                       \n\n                        Publication Group members with a \"Privileged\" or \"Editor\" security role can comment on Cards using Buzz.\n                       \n\n                        Depending on their membership in regular groups, users cannot share Pages and Cards in the Publication Groups view with others.\n                       \n\n                        Setting up the Publication Groups view\n                       \n\n                        You can set up multiple Publication Groups views to allow specific users to access only pertinent data in a protected, filtered view of Domo. The Publication Groups UI guides you through the process of creating a Publication Group using a three-step walkthrough.\n                       \n\n\n                         To set up the Publication Groups view,\n                        \n\n\n\n\n                          Determine the column names and row values in the DataSets of the Cards in the Publication Groups view to use in filtering the data by user.\n                         \n\n\n\n                          Click\n                          \n                           More\n                          \n\n                           > Admin\n                          \n                          .\n                          \n                          The Admin Settings appears.\n                         \n\n\n                         Click\n                         \n                          Content\n                         \n                         .\n                        \n\n\n                          Click\n                          \n                           Publication Groups\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           New Publication Group\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Name\n                          \n                          field, enter the name you want to use for the top Page of the Publication Groups view.\n                         \n\n\n\n                          Click\n                          \n                           Step 1\n                          \n                          to open the first step in the walkthrough.\n                         \n\n\n\n                          Click\n                          \n                           Add Page\n                          \n                          , select a Page you want to add to the Publication Groups view, then click\n                          \n                           Add Page\n                          \n                          .\n                         \n\n\n\n                            (Conditional) If you want the Page to be the Page Publication Groups users go to when they sign in, click\n                            \n                             Landing Page\n                            \n                            .\n                           \n\n\n\n                            (Optional) If you want additional Pages to appear in the Publication Groups view, select and add those Pages.\n                           \n\n\n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to open the second step in the walkthrough.\n                          \n                          All DataSets used in the Page(s) you selected in step 7 are listed here.\n                         \n\n\n\n                          (Optional) If you want to add DataSets to this list, click\n                          \n                           Add DataSet\n                          \n                          , select the DataSet you want to add filters to, then click\n                          \n                           Add DataSet\n                          \n                          . Repeat to add additional DataSets.\n                         \n\n\n                         For each DataSet in the list, select a filter option in the dropdown.\n                         \n                         Filter options are as follows:\n                         \n\n\n\n\n                             Option\n                            \n\n                             Description\n                            \n\n\n\n\n\n                             No Access\n                            \n\n                             Members of this Publication Group will not have access to any of the rows in this DataSet.\n                            \n\n\n\n                             All Rows\n                            \n\n                             Members of this Publication Group will have access to all of the rows in this DataSet.\n                            \n\n\n\n                             Filter Access\n                            \n\n                             Members of this Publication Group will have access to specifically defined data in this DataSet.\n                            \n\n\n\n\n\n                          For all DataSets in which you select\n                          \n                           Filter Access\n                          \n                          , you must specify the columns to be filtered by clicking\n                          \n                           Add Filter\n                          \n                          and selecting the desired column. If you want, you can include a custom name for the column. You can also add multiple filters to the same DataSet by clicking\n                          \n                           Add Column\n                          \n                          and repeating these steps.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to open the third step in the walkthrough.\n                          \n                          In this step, you can grant access to any Cards in the Page not powerered by a DataSet, such as Notebook Cards, Doc Cards, etc.\n                         \n\n\n\n                          Toggle on the\n                          \n                           Enable access\n                          \n                          switch if you want to grant access to Cards in the Page not linked to DataSets.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to open the fourth step in the walkthrough.\n                         \n\n\n\n                          In the\n                          \n                           People\n                          \n                          dialog, do the following:\n                         \n\n\n\n                            Search for and select users and groups to add to this Publication Group.\n                           \n\n\n\n                            (Conditional) If using SSO, specify the SSO email or group.\n                           \n\n\n\n                            Click\n                            \n                             Add\n                            \n                            .\n                           \n\n\n\n\n\n                          For each person, group, or email you've added, do the following:\n                         \n\n\n\n                            Click the pencil icon to expand the\n                            \n                             Filters and values\n                            \n                            column.\n                           \n\n\n\n                            For each DataSet in blue, click the DataSet and check the boxes for all rows that should be accessible by members of this Publication Group, then click\n                            \n                             Apply\n                            \n                            .\n                           \n\n\n\n\n\n                          Click\n                          \n                           Done\n                          \n                          .\n                         \n\n\n\n                          (Optional) Repeat the above steps to add more people, groups, or emails.\n                         \n\n\n\n                          Click\n                          \n                           Create New\n                          \n                          .\n                         \n\n\n\n\n                         To edit a Publication user group,\n                        \n\n\n\n\n                          Click\n                          \n                           More\n                          \n\n                           > Admin\n                          \n                          .\n                          \n                          The Admin Settings appears.\n                         \n\n\n                         Click\n                         \n                          Content\n                         \n                         .\n                        \n\n\n                          Click\n                          \n                           Publication Groups\n                          \n                          .\n                         \n\n\n\n                          Search for and select the Publication Group you want to edit.\n                         \n\n\n\n                          Make the changes you want, then click\n                          \n                           Save Changes\n                          \n                          .\n                         \n\n\n\n\n                         To delete a Publication user group,\n                        \n\n\n\n\n                          Click\n                          \n                           More\n                          \n\n                           > Admin\n                          \n                          .\n                          \n                          The Admin Settings appears.\n                         \n\n\n                         Click\n                         \n                          Content\n                         \n                         .\n                        \n\n\n                          Click\n                          \n                           Publication Groups\n                          \n                          .\n                         \n\n\n\n                          Search for and select the Publication Group you want to delete.\n                         \n\n\n\n                          Click\n                          \n                           Delete Publication Group\n                          \n                          , then click\n                          \n                           Delete\n                          \n                          .\n                         \n\n\n\n                        Example scenario\n                       \n\n                        In the\n                        \n                         Publications Group\n                        \n                        view in the Admin Settings, a user sets up a Publication Group so that members of the \"West Coast\" and \"East Coast\" groups can see only the \"Finance\" and \"Marketing\" Pages, and the Cards in those Pages are filtered to show only data that is pertinent to each group. Jhonka, a sales executive with a \"Privileged\" security role with access to other groups, can see the data for all the regions.\n                       \n\n                        The following table shows how three charts in the \"Marketing\" Page display different data depending on the whether the \"Region\" column filters are set to \"East Coast\" or \"West Coast.\"\n                       \n\n\n\n\n\n                            Region\n                           \n\n\n\n                            Filtered Card view\n                           \n\n\n\n\n\n\n\n                            West\n                           \n\n\n\n\n\n\n\n\n\n\n                            East\n                           \n\n\n\n\n\n\n\n\n\n\n                        The next table shows the Details Page\n                        \n                         Data\n                        \n                        view for the \"OR: Referring Domains\" chart for both the \"East Coast\" and \"West Coast\" groups. The appropriate data appears in both Publication Groups, based on the row value filters.\n                        \n\n\n\n\n\n\n                            Region\n                           \n\n\n\n                            Filtered data view\n                           \n\n\n\n\n\n\n\n                            West\n                           \n\n\n\n\n\n\n\n\n\n\n                            East\n                           \n\n\n\n\n\n\n\n\n\n\n                        The filtered data applies to other features such as Analyzer, alerts, drilling, previewing, and exporting. For example, when using Analyzer, only the values pertinent to the user appear. The following table shows how the available Analyzer filters appear differently depending on the user group.\n                       \n\n\n\n\n                           Region\n                          \n\n                           Filtered Analyzer Values\n                          \n\n\n\n\n\n\n                            West\n                           \n\n\n\n\n\n\n\n\n                            East\n                           \n\n\n\n\n\n\n\n\n                        Updating Pages in Publication Groups\n                       \n\n                        If new Cards are added and are using a DataSet that is already being used in the Publication Group, then any new Cards will show automatically. If a new Card is added and is using a new DataSet that isn't already being used in the Publication Group, then you will need to go into Step 2 of the configuration to designate the level of access and any filters for the DataSet. Once this is done the Card will show in the Publication Group.", "Preview Article": "Click here to preview", "URL Name": "360043438993", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004260", "Archived Date": "", "Language": "English", "Primary Version": "Setting Up Publication Groups", "Article Total View Count": "12,238", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Setting Up Publication Groups\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Publication Groups\n              \n", "url": "/s/topic/0TO5w000000Zao6GAC"}]}