{"file_path": "../../raw_kb_v2\\article\\360042929194\\index.html", "content": {"Title": "Box Analytics Advanced Connector", "Article Body": "Intro\n                       \n\n\n\n\n                         Box is an online file sharing and personal content cloud management service for businesses. You can use Domo's Box Analytics Advanced connector to pull data about files and folders, users, enterprise events, and single user events from Box.\n                         \n                          Box Analytics Advanced connector allows more filtering options for 'File and Folder' and 'Enterprise Events' reports.\n                         \n                         To learn more about the Box API, go to\n                        \n\n                         https://docs.box.com/v2.0/reference#events\n                        \n\n                         .\n                        \n\n\n                        The Box Analytics Advanced connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        This connector is nearly the same as the standard\n                        \n                         Box Analytics Connector\n                        \n                        . The difference is that the advanced version allows more filtering options for the \"File and Folder\" and \"Enterprise Events\" reports.\n                       \n\n\n                         This topic discusses the fields and menus that are specific to the Box Analytics Advanced connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n                        Best Practices\n                       \n\n                        The data that comes from this connector is a stream of events occurring in your company Box account. While helpful, the data may take a while to analyze and understand before becoming useful.\n                       \n\n\n                         Prerequisites\n                        \n\n\n\n                         To connect to your Box account and create a Box Analytics Advanced DataSet, you must have the following:\n                        \n\n\n\n\n\n                           The email address you use to log into your Box account.\n                          \n\n\n\n\n\n                           The password you use to log into your Box account.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                           While anyone with a Box account can use this connector, if you are not an Admin you will only be able to see one report about your own usage, which may not be helpful.\n                          \n\n\n\n\n\n                         Connecting to Your Box Account\n                        \n\n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Box Analytics Advanced connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         The Domo Box Analytics Advanced connector uses OAuth to connect to Box. Click\n                         \n                          Connect\n                         \n                         (or select\n                         \n                          Add Account\n                         \n                         if you have existing Box Analytics Advanced accounts in Domo) to open the Box OAuth screen where you can enter the email address and password associated with your Box account. After you have entered valid Box credentials, you can use the same account in Domo any time you create a Box Analytics Advanced DataSet.\n                        \n\n\n\n                         You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n                         Details Pane\n                        \n\n\n                        In this pane, you can select from any of four Box Analytics report types to import into Domo. Different configuration options may then appear depending on the selected report type.\n                       \n\n\n\n\n\n\n                             Menu\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n\n                             Select the Box Analytics report. The following reports are available:\n                            \n\n\n\n\n\n\n\n                                 File and Folder Report\n                                \n\n\n\n\n\n                                 Returns details of files and folders in the account.\n                                \n\n\n\n\n\n\n\n                                 User Report\n                                \n\n\n\n\n\n                                 Returns details about account users. For an individual user, this includes only the user's own user information and content. For an enterprise administrator, this includes both the individual user's information along with that of any other users in the administrator’s enterprise account.\n                                \n\n\n\n\n\n\n\n                                 Enterprise Event Report\n                                \n\n\n\n\n\n                                 Returns the full history of an enterprise account.\n                                \n\n\n\n\n\n\n\n                                 Single User Event Report\n                                \n\n\n\n\n\n                                 Returns a list of all the events relevant to an individual user's Box account.\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n                            Events to Filter On\n                           \n\n\n\n                            Select all of the event types you want to import data for.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a range of dates. You can also choose\n                            \n                             Other\n                            \n                            , which lets you select whether to retrieve all data or just new data since the last successful run.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Retrieve All Data Or Just New Data Since Last Successful Run\n                           \n\n\n\n                            Select how much data you want to retrieve.\n                           \n\n\n                             All data\n                            \n                            returns all available data.\n                           \n\n\n                             Since the last successful run\n                            \n                            returns data since the last successful run. If there has never been a successful run, the\n                            \n                             All data\n                            \n                            option will run once.\n                           \n\n\n\n\n\n                            Use Short Column Names\n                           \n\n\n\n                            Select the option for column name length. If you select\n                            \n                             No\n                            \n                            , the long and default column names will be displayed in the report. If you select\n                            \n                             Yes\n                            \n                            , the short column names will be displayed.\n                           \n\n\n\n\n\n                            Folder ID\n                           \n\n\n\n                            Enter the ID of the Box folder that you would like to pull information for (e.g.\n                            \n                             342963669\n                            \n                            ). If you leave this blank, information will be pulled for all files and folders.\n                           \n\n\n\n\n\n                            Fields to Include\n                           \n\n\n\n                            Select all field parameters you want to be included in your report.\n                           \n\n\n\n\n\n                            Get Image Thumbnail\n                           \n\n\n\n                            Select\n                            \n                             Yes\n                            \n                            if you want to retrieve the image's thumbnail. The column \"ID\" is required.\n                           \n\n\n\n\n\n                            Include Subfolders\n                           \n\n\n\n                            Select\n                            \n                             Yes\n                            \n                            if you want to retrieve results for files in subfolders.\n                           \n\n\n\n\n\n                            Squash Arrays (Optional)\n                           \n\n\n\n                            Check this box if you want to squash arrays. This increases the size of columns in your report.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n                        Verify that you are an Admin in your company's Box instance. Otherwise you will not be able to pull much data using this connector.\n                       \n\n                        FAQ\n                       \n\n                        How do I know that my Box account credentials are secure?\n                       \n\n                        The login process uses the OAuth process, so your Box credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        Datasets should be set to update once every 15 minutes.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        Box allows roughly 10 queries per second for each user. Note that a single dataset run may require multiple queries.\n                       \n\n                        Why am I not able to pull maximum data?\n                       \n\n                        Make sure that you are an Admin in your company's Box instance. Otherwise you may not be able to pull much data using this connector.\n                       \n\n                        What is the difference between the Box Analytics connector and the Box Advanced Analytics connector?\n                       \n\n                        Box Analytics Advanced connector allows more filtering options for 'File and Folder' and 'Enterprise Events' reports.", "Preview Article": "Click here to preview", "URL Name": "360042929194", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003541", "Archived Date": "", "Language": "English", "Primary Version": "Box Analytics Advanced Connector", "Article Total View Count": "4,692", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Box Analytics Advanced Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}