{"file_path": "../../raw_kb_v2\\article\\4421037429271\\index.html", "content": {"title": "\n\n\n IntelliShift Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nIntelliShift provides the modern fleet and safety management solution that deploys in half the time. Experience the most impactful way to safeguard employees and combine AI-powered cams with the richest vehicle data from fully integrated hardware that deploys in seconds. Retrieve the information about your fleet operators in seconds. Combine your data with Domo to get better and faster visibility across your operations and learn how an integrated architecture gets you to more value.  To learn more about the IntelliShift\n\n\n API, visit their page (\n\nhttps://intellishift.com/solutions/operations-intelligence/api/\n\n).\n\n\n The IntelliShift\n\n\n Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your IntelliShift\n\n\n account in the Data Center. This topic discusses the fields and menus that are specific to the IntelliShift\n\n\n Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your IntelliShift\n\n\n account and create a DataSet, you must have the email address and password associated with IntelliShift account.\n\n\n Connecting to Your IntelliShift\n\n\n Account\n---------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the IntelliShift Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your IntelliShift account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Email\n  |\n Enter the email address associated with your IntelliShift account.\n  |\n|\n Password\n  |\n Enter the password associated with your IntelliShift account.\n  |\n\nOnce you have entered valid IntelliShift\n\n\n credentials, you can use the same account any time you go to create a new IntelliShift\n\n\n DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the IntelliShift\n\n\n report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Operator\n  |\n Returns a paged collection of operators\n  |\n\n|\n|\n Sort Direction\n  |\n Select whether you want the report sorted by ascending or descending direction.\n  |\n|\n Sort By\n  |\n Enter the name of the column to sort on.\n\nExample: id, operatorName, firstName, lastName, pin, etc.\n  |\n|\n Filter\n  |\n\nEnter a search term to filter the results by. This field only takes a single string and will search all columns for a match.\n\n\n Example: ABC.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What endpoint is the base URL for this connector?\n\nThe base URL for IntelliShift is\n\nhttps://connect.intellishift.com/\n\n.\n\n###\n Which endpoint(s) does each report call in this Connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n Operator\n  |\n /api/operators\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the email address and password associated with IntelliShift account.\n\n\n Can I use the same account to create multiple datasets?\n\n\n Yes\n\n\n How often can the data be updated?\n\n\n As often as needed.\n\n\n Are there any API limits that I need to be aware of?\n\n\n No\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4421037429271\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003193\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nIntelliShift Connector\n\n", "article_total_view_count": "\n\n\n 4,633\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "intellishift_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}