{"file_path": "../../raw_kb_v2\\article\\360043429193\\index.html", "content": {"title": "\n\n\n Histogram\n\n\n", "article_body": "\n\nIntro\n-------\n\nA histogram is a chart type that represents the frequency at which certain ranges of values appear in a DataSet. Histograms are most often used for statistical analysis.\n\n\n Understanding histograms\n--------------------------\n\nIn a histogram, two axes appear, one on the left side of the graph and one at the bottom. One of the axes is divided into ranges of values called \"bins.\" The other axis measures the number of items in the DataSet that fall into each bin. For each bin, a bar is drawn that represents the number of items in the bin. In a vertical histogram, the axis with the bins appears on the bottom and the axis that measures the items appears on the left. In a horizontal histogram, these axes are switched.\n\n\n The following example shows how a histogram works. This histogram represents the frequency at which specific height ranges appear in a group of students. The bottom axis shows the complete range of heights in the DataSet, with bins for individual ranges. The left axis measures the number of items–in this case, students–that fall into each bin.\n\nPowering histograms\n---------------------\n\nHistograms require only two data columns or rows from your DataSet. One of the columns contains category names, and the other contains the associated values. Note that the category names themselves do not appear in the chart, but are counted and represented numerically. Also, values do not appear as is, but are converted into ranges in your chart. An optimal number of ranges (and hence, bins) is determined automatically, but you can change the default number of bins in\n **Chart Properties,**\n as seen in the section below on Customizing histograms.\n\n\n**Note:**\n Histograms\n\nhave a limit of 25,000 rows of data.\n\nFor information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your histogram. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer.\n\n\n###\n Examples\n\nThe following graphic shows you how data from a typical column-based spreadsheet is converted into a vertical histogram:\n\nThe following graphic shows you how data from a typical column-based spreadsheet is converted into a horizontal histogram:\n\nCustomizing histograms\n------------------------\n\nYou can customize the appearance of a histogram by editing its\n **Chart Properties**\n . Properties for all chart types are listed and described in\n\nChart Properties.\n\nUnique properties of histograms include the following. You can click a thumbnail image to see a larger image.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Bar Settings > Symbol Color\n  |\n Allows you to set the color for bins. The default is blue.\n  |\n —\n  |\n|\n Bar Settings > Histogram Bins\n  |\n Lets you change the number of bins that appear in the histogram. An optimal number of bins is determined automatically by Domo, but you can choose any number between 3 and 20. Changing the number of bins may create \"gaps\" for ranges with no data. The example at right shows one such gap in the 4.9-5.0 data range. This indicates that there were no items in the DataSet with a value between 4.9 and 5.0.\n  |\n\n|\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429193\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004706\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nHistogram\n\n", "article_total_view_count": "\n\n\n 5,301\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:25 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "histogram", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}