{"file_path": "../../raw_kb_v2\\article\\1500000286041\\index.html", "content": {"Title": "Best Practices for AutoML", "Article Body": "Machine Learning process for success\n                       \n\n                        What are the most common approaches in machine learning and how can I leverage them for business growth and success? The following are the most common principles used when applying machine learning to business problems.\n                       \n\n\n                         Data Collection\n                         \n\n                           The quantity & quality of your data dictates how accurate our model is.\n                          \n\n                           The outcome of this step is generally a representation of data that we will use for training.\n                          \n\n                           Using pre-collected data, by way of datasets from your business, or samples from Kaggle, UCI, etc.\n                          \n\n\n\n                         Data Preparation\n                         \n\n                           Curate data and prepare it for training.\n                          \n\n                           Clean that which may require it (remove duplicates, correct errors, deal with missing values, normalization, data type conversions, etc.)\n                          \n\n                           Randomize data, which erases the effects of the particular order in which we collected and/or otherwise prepared our data.\n                          \n\n                           Visualize data to help detect relevant relationships between variables or class imbalances (bias alert!), or perform other exploratory analysis.\n                          \n\n                           Split into training and evaluation sets.\n                          \n\n\n\n                         Choose a Model\n                         \n\n                           Different algorithms are for different tasks; choose the right one.\n                          \n\n\n\n                         Train the Model\n                         \n\n                           The goal of training is to answer a question or make a prediction correctly as often as possible.\n                          \n\n                           Linear regression example: algorithm would need to learn values for m (or W) and b (x is input, y is output.)\n                          \n\n                           Each iteration of the process is a training step.\n                          \n\n\n\n                         Evaluate the Model\n                         \n\n                           Uses some metric or combination of metrics to \"measure\" objective performance of the model.\n                          \n\n                           Test the model against previously unseen data.\n                          \n\n                           This unseen data is meant to be somewhat representative of model performance in the real world, but still helps tune the model (as opposed to test data, which does not.)\n                          \n\n                           Good train/eval split? 80/20, 70/30, or similar, depending on the domain, data availability, dataset particulars, etc.\n                          \n\n\n\n                         Parameter Tuning\n                         \n\n                           This step refers to hyperparameter tuning, which is an \"art form\" as opposed to a science.\n                          \n\n                           Tune model parameters for improved performance.\n                          \n\n                           Simple model hyperparameters may include: number of training steps, learning rate, initialization values, distribution, etc.\n                          \n\n\n\n                         Make Predictions\n                         \n\n                           Using further (test set) data which have, until this point, been withheld from the model (and for which class labels are known), are used to test the model; a better approximation of how the model will perform in the real world.\n                          \n\n\n\n\n                        Best practices in Machine Learning for business\n                       \n\n\n                         A Machine Learning solution maps input→output.\n                         \n\n                           Always ask and explore how well your data explains (predicts) your output.\n                          \n\n                           If performance is better than the current process?\n                           \n\n                             Consider implementing.\n                            \n\n                             Perform cost-benefit analysis of model improvement vs cost of development to the business. (if low → keep going.)\n                            \n\n\n\n                           Not better than your current process?\n                           \n\n                             Improve your training data.\n                            \n\n                             Optimize your ML method.\n                            \n\n                             Learn more about how your data represents your domain.", "Preview Article": "Click here to preview", "URL Name": "1500000286041", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004884", "Archived Date": "", "Language": "English", "Primary Version": "Best Practices for AutoML", "Article Total View Count": "4,746", "": "", "Article Created Date": "10/24/2022, 10:34 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Best Practices for AutoML\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               AutoML (Machine Learning)\n              \n", "url": "/s/topic/0TO5w000000Zan8GAC"}]}