{"file_path": "../../raw_kb_v2\\article\\5761015577879\\index.html", "content": {"title": "\n\n\n data.world Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\ndata.world is the modern catalog for data and analysis. It activates the hidden data workforce within your enterprise, multiplies your data value, and creates a faster data-driven culture. The modern, intuitive user experience brings together employees of all roles, backgrounds, and skills to collaborate while keeping the data connected to everything people need to find, understand, and use. As a result, your data, analysis, and expertise become more discoverable, trustworthy, and reusable.\n\n\n With the data.world Writeback connector export your data from a Domo dataset to your specified file securely and enhance your data performance.. To learn more about the data.world API, visit their page\n\nhttps://apidocs.data.world/\n\n\n .\n\nYou configure your Domo-data.world connection in the Data Center. This topic discusses the fields and menus that are specific to the data.world Writeback Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nPrerequisites\n---------------\n\nTo configure this Connector, you must have your data.world account API token.\n\nYou can find your API token under\n\n*User Setting >> Advanced Tab**\n\n.\n\nConfiguring the Connection\n----------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the data.world Writeback Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your data.world account where you want your data to be copied to. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n API Token\n  |\n Enter the API Token. You can find your API token under\n\n*User Setting >> Advanced Tab**\n\n.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to set up a new data.world Writeback DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Input DataSet ID\n  |\n\nEnter your Domo dataset ID(GUID) located in the dataset URL. Example:\n\nhttps://customer.domo.com/datasources/\n\n\n**aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee**\n\n/details/settings\n\n|\n|\n Select data.world DataSet Method\n  |\n Specify whether you want to select your data.world dataset or enter the dataset ID manually.\n  |\n|\n data.world DataSet\n  |\n Select the location to copy your data.world dataset from.\n  |\n|\n data.world DataSet\n  |\n Enter the data.world dataset id.\n  |\n|\n Select File Name Method\n  |\n Specify whether you want to select your output file or enter the filename manually.\n  |\n|\n File Name\n  |\n Enter the output file name without the file extension. If the provided file name collides with an existing file, the connector will overwrite that file.\n  |\n|\n Files\n  |\n Select the file name you want to write to. Files will have the `.csv` extension.\n  |\n|\n Append Date or Number to Filename\n  |\n\n\n Operation\n  |\n Description\n  |\n| --- | --- |\n|\n None\n  |\n Doesn't append anything to the file name. This means that the file will always be overwritten on every run instead of creating new files.\n  |\n|\n Append date\n  |\n Appends date of current run to the file name (e.g., FileName\\_MM-DD-YYYY.csv). This means that if there are multiple runs on the same day, the previous run will be overwritten. Runs on new days will create new files.\n  |\n|\n Append number\n  |\n Appends run number (starting from 1) to file name (e.g., FileName\\_1.csv). This means that a new file will be created on every run.\n  |\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the API token associated with your data.world account.\n\n###\n Where can I find my API token?\n\nYou can find your API token under User Setting >> Advanced Tab.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n How do I find the Input Dataset ID?\n\nYour Domo input dataset id is in the URL of the dataset you are exporting data from. For example:\n\nhttps://customer.domo.com/datasources/aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee/details/settings\n\n\n####\n What is the File Name?\n\nThe File Name is the name of the output file where you would like to save your data. Provide the output file name without the file extension. If the provided file name collides with an existing file, the Connector will overwrite that file.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 5761015577879\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003990\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\ndata.world Writeback Connector\n\n", "article_total_view_count": "\n\n\n 4,710\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "dataworld_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}