{"file_path": "../../raw_kb_v2\\article\\4405291644311\\index.html", "content": {"title": "\n\n\n Amazon S3 Unload Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAmazon S3 is an online file storage web service offered by Amazon Web Services that you can use to store and retrieve any amount of data, at any time, from anywhere on the web. With the Amazon S3 Unload Writeback connector, you can export your data from a Domo DataSet to an Amazon S3 Bucket. To learn more about the Amazon S3 API, visit their page (\n\nhttp://docs.aws.amazon.com/AmazonS3/...I/Welcome.html\n\n).\n\n\n You export data to S3 in the Data Center. This topic discusses the fields and menus that are specific to the Amazon S3 Unload Writeback connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nPrerequisites\n---------------\n\nTo configure this connector, you will need the following:\n\n A Domo Client ID and Client Secret.\n* Your AWS access key. You can find this in the\n ****Security Credentials****\n section of the AWS Console. Alternatively, if you are using IAM, you can find it under\n ****Users****\n .\n* Your AWS secret key, which was provided when you created your access key. You can generate a new secret key in the AWS Console.\n* The name of the AWS S3 Bucket you want to push data to.\n\nTo obtain your Domo Client ID and Client Secret, do the following:\n\n. Log into the\n\nDomo developer account\n\n.\n2. In the top right corner under\n **My Account**\n click\n **New Client**\n .\n3. Enter the application name and description.\n4. Provide the application scope by selecting the checkboxes for\n **Data**\n and\n **User**\n .\n5. Click\n **Create**\n .\n6. Once you have created a client, you can manage the client by clicking on\n **Manage Client**\n .\n\nYour\n **Client Secret**\n will appear in the\n **Manage Client**\n section.\n\n*Important**\n : You will need the WRITE (s3:PutObject) permission on Amazon S3.\n\nConfiguring the Connection\n----------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Amazon S3 Unload Writeback Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Domo developer account as well as your S3 bucket. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Domo Client ID\n  |\n Enter your Domo client ID.\n  |\n|\n Domo Client Secret\n  |\n Enter your Domo client secret.\n  |\n|\n Access Key\n  |\n Enter your AWS access key. You can find this in the\n **Security Credentials**\n section of the AWS Console. Alternatively, if you are using\n **IAM**\n , you can find it under\n **Users**\n .\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key that was provided when you created your access key. You can generate a new secret key in the AWS Console.\n  |\n|\n Bucket\n  |\n Enter the name of the bucket you want to push Domo data to.\n  |\n|\n Region\n  |\n Select the Amazon S3 region where your bucket is located.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to set up a new Domo-S3 connection. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n\nInput DataSet ID\n\n|\n\nEnter your Domo dataset ID (GUID) located in the dataset URL. You can find the ID by opening the details view for the DataSet in the Data Center and looking at the portion of the URL following\n\ndatasources/\n\n.\n\n\n Example:\n\nhttps://customer.domo.com/datasources/\n\n*aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee**\n /details/settings\n\n|\n|\n\nPath\n\n|\n\nEnter the path where you would like the file to be saved in your Amazon S3 bucket.\n\n|\n|\n\nPrimary Key\n\n|\n\nEnter the primary key of the datafusion dataset.\n\n|\n|\n\nSpecific Day\n\n|\n\nEnter an integer that specifies the day you want to get the data for. 0 pulls today's data, 1 pulls yesterday's data, and 7 pulls the data from 7 days ago each time the connector runs. Only a single day of data is returned for each connector run.\n\n|\n|\n Select the Data Type for Date Column(s) to be parsed\n  |\n\n  |  |\n| --- | --- |\n| **Date Time**  | **Description**  |\n|\n Parse as is (Do not convert)\n  |\n Metrics columns say- 'started' & 'finished' will be shown as is received in the response.\n  |\n|\n Parse and convert into Date Time\n  |\n Metrics columns say- 'started' & 'finished' will be parsed into Date Time.\n  |\n\n*Note**\n : This is just for the dataset metrics to be displayed; there will be no impact on the data to be unloaded.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4405291644311\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003988\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon S3 Unload Writeback Connector\n\n", "article_total_view_count": "\n\n\n 2,455\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "amazon_s3_unload_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}