{"file_path": "../../raw_kb_v2\\article\\360045120554\\index.html", "content": {"title": "\n\n\n Publish Content to a Subscriber Organization\n\n\n", "article_body": "\n\nIntro\n-------\n\nAfter you configure routing, creation, and mapping in the publishing organization and choose your interface settings with Brand Kit, the next step is to publish or embed your content so others can view it. This article describes how to set up a subscriber organization and publish content to it. To learn more about embedding, see\n\nSharing Cards and Dashboards Outside of Domo Using Domo Embed\n\n.\n\n\n A subscriber organization can subscribe to publications individually, as invited, or auto-subscribe to receive all publications that come from a trusted publishing organization. For more information,\n\n\n see the headings for\n\nSubscribe to a Publication\n\nor\n\nAuto-Subscribe to all Publications from an Organization\n\n.\n\n\n Admins in the publishing environment filter to the appropriate data for each subscriber organization before publishing content. Manage your publications and subscribers from the\n **Publications**\n section of\n **Domo Everywhere**\n .\n\n\n This article discusses publishing content in the following topics:\n\n Publications\n* Sort publications\n* Publication tasks\n* Create a publication\n* Add a permission\n* Refresh a publication\n* Delete a publication\n* Remove pages from a publish job\n* Subscribe to a publication\n* Lock the dashboard\n* Unsubscribe from a publication\n* PDP policies for published content\n* Notes\n* Publish the same DataSet via two publish jobs\n\nPublications\n----------------\n\nYou can access the list of publications from your Domo environment in the\n **Publications**\n page of\n **Domo Everywhere**\n .\n\n\n To get there, follow these steps:\n\n. In the Domo navigation header, select\n **More**\n >\n **Admin**\n .\n\n\n The Admin Settings display.\n2. In the\n **Domo Everywhere**\n menu of the Admin Settings, select\n **Publications**\n .\n\n*Publications**\n has two tabs:\n **Publications**\n and\n **Subscribers**\n .\n\n\n In the\n **Publications**\n tab, you can view the list of publications from your Domo environment.\n\n\n###\n\n\n Sort Publications\n\nYou can sort the publications with the sort menu, which is\n\n\n located in the upper-right corner of the screen, above the publications list.\n\nThe options for sorting the publications are as follows:\n\n **By name —**\n Sorts the publications alphabetically by name. You can sort from A to Z or from Z to A.\n* **By last run —**\n Sorts the publications by the date of the last run. You can sort from newest to oldest or from oldest to newest.\n* **By status —**\n Sorts the publications by status. All publications with error statuses display at the top of the list.\n\n\n Publication Tasks\n---------------------\n\nBefore setting up a publication, you need to\n\n\n create your subscriber organization(s). To learn how to set up subscriber organizations, see\n\nDomo Everywhere: Routing, Creation, and Mapping\n\n.\n\n\n This section provides instructions for various tasks related to publishing.\n\n##\n\n\n Create a Publication\n\n\n1. From the navigation header, go to\n **More**\n >\n **Admin**\n .\n2. In the\n **Domo Everywhere**\n menu, select\n **Publications**\n .\n\n\n The\n **Publications**\n section displays.\n3. Select\n **New Publication**\n .\n\n\n The\n **Publication Creation**\n modal displays.\n4. Enter a name and optional description for the publication.\n\n\n**Tip:**\n You can use the description to document which content you are publishing and to whom.\n5. Select\n **Next**\n .\n\n\n The\n **Subscribers**\n section of the modal displays.\n6. (Optional) If the subscriber organization you want to publish to is not already listed, follow these steps:\n\t* Select\n\t **+ Add Subscribers**\n\t . The\n\t **Subscriber organization**\n\t and\n\t **Organization ID**\n\t fields display.\n\t* Enter the URL for the subscriber domain in the\n\t **Subscriber Organization**\n\t field in this format:\n\t *domain*\n\t .domo.com.\n\t* Enter the Organization ID. This value is the same as the key attribute used when creating the subscriber organization. To learn more about the key attribute, see\n\n Domo Everywhere: Routing, Creation, and Mapping\n\n .\n\t* Select\n\t **+ Add.**\n\n\n\t The subscriber organization displays in the list of subscribers.\n\t* Check the box for each subscriber organization you want to publish to.\n7. Select\n **Next**\n .\n\n\n The\n **Dashboards**\n section of the modal displays.\n8. Select the dashboards that you want to publish.\n\n*Important**\n\n* Any dashboards to be published must be shared with the user configuring the publication.\n\t* When you add a dashboard to a publication, any sub-dashboards are also automatically added.\n9. Select\n **Next**\n .\n\n\n The\n **DataSets**\n section of the modal displays.\n10. Review the DataSets that power the dashboard. You can search for and add any additional DataSets.\n11. Select\n **Next**\n .\n\n\n The\n **Data Permissions**\n section of the modal displays.\n12. Set up personalized data permissions (PDP).\n\n\n For more information, see\n\nPDP Policies for Published Content\n\n, below.\n\n\n**Important:**\n You must choose one policy for each DataSet\n\n,\n\nwhether that is All Rows or a subset of rows, by using Filters.\n\n\n\t* If you want to publish\n\n all rows in a given DataSet to the subscriber, check the\n\t **Include in publication**\n\t box. Review the publication details on the final screen of the modal and select\n\t **Save.**\n\t* If you are sharing a filtered version of the data, select\n\t **Add Permission.**\n\t The\n\t **New Permission**\n\t modal displays. Follow the instructions below to\n\n Add a New Permission\n\n .\n13. Select\n **Next**\n and review the details for the publication. Select\n **Save**\n .\n\n\n**Important:**\n Saving makes the publication available for subscription in subscriber environments. Subscribers must accept the invitation inside their Domo environment before the published content is visible to them.\n\n\n Back to top\n\n\n###\n\nAdd a Permission\n\n\n1. Enter a name in the\n **Name your policy**\n field.\n2. From the list in the\n **Dataset**\n field, select the DataSet to apply the permission to.\n3. Select\n **+ Add New Filter**\n . The new filter fields display.\n4. Select a\n **Column name**\n from the list.\n5. Choose the filter\n **Type.**\n If you are using Dynamic PDP, select\n **Dynamic PDP by Org ID**\n . To learn more, see\n\nPDP Policies for Published Content\n\n, below.\n6. Select values.\n7. Select\n **Save**\n to return to the\n\n*Publication Creation**\n\nmodal.\n\n\n Back to top\n\n\n###\n\n\n Refresh a Publication\n\n\n1. From the Domo navigation header, go to\n **More**\n >\n **Admin**\n .\n2. In the\n **Domo Everywhere**\n menu, select\n **Publications**\n .\n3. In the\n **Publications**\n tab of the\n **Publications**\n section, locate the publication you want to refresh.\n4. Hover over the publication until\n\n*Publication Options**\n displays and select it.\n5. Select\n **Refresh**\n .\n\n\n The\n **Refresh**\n modal displays.\n6. In the\n **Refresh**\n modal, check the boxes to perform a targeted refresh for the selected subscribers. You can sort the publications to see for which subscriber(s) the publication has an error message. Learn about the sorting options under the\n\nSort Publications\n\nheading above.\n7. Select\n **Refresh**\n to refresh the publication for the subscribers you selected and close the modal.\n\n\n**Note:**\n If you make changes to a dashboard or a card on a dashboard, you need to refresh the publication in order for the updates to display in the subscriber organization.\n\n\n**Important:**\n Do not modify the source dashboards while the job is being refreshed. This causes the layout of the dashboard to change and corrupts the layout of cards in the subscriber organization.\n\n\n Back to top\n\n\n###\n\n\n Delete a Publication\n\n\n1. From the navigation header, go to\n **More**\n >\n **Admin**\n .\n2. In the\n **Domo Everywhere**\n menu, select\n **Publications**\n .\n3. In the\n **Publications**\n tab of the\n **Publications**\n section, locate the publication you want to refresh.\n4. Hover over the publication until\n\n*Publication Options**\n displays and select it.\n5. Select\n **Delete**\n .\n6. The\n **Delete Publication**\n dialog displays with a warning of how much content you are removing. You must acknowledge the removal of that content before you can proceed.\n7. Select\n **Confirm**\n to delete the publication.\n\n*Note:**\n This immediately starts the process of removing the dashboards, cards, and DataSets that have been subscribed to by all subscriber organizations.\n\nBack to top\n\n\n###\n\n\n Remove Dashboard from a Publish Job\n\n\n**Warning:**\n When editing an existing publication, if you remove a dashboard from the publication, the underlying DataSets powering the dashboard are also automatically removed. If the subscriber organization is using any of those DataSets to power any custom-built cards within their Domo environment, those cards are also automatically deleted from the subscriber organization when the page and its related DataSets are removed.\n\nTo remove a page from a publication while preserving the DataSets that power the page, make sure that all of the DataSets you want to keep are reselected in the\n **DataSet**\n section of the\n **Publication Creation**\n modal before you save the publication.\n\nBack to top\n\n\n###\n\n\n Subscribe to a Publication\n\nSubscriber organizations can subscribe to a publication that has been created and saved in the publishing organization. With auto-subscription, a subscriber organization can choose to trust and accept all subscriptions from a specific publishing organization, rather than accepting every subscription individually.\n\n###\n Subscribe to an Individual Publication\n\nThe first set of steps below details how to subscribe to an individual publication.\n\n\n See the\n\nAuto-Subscribe\n\nheading for instructions for how to auto-subscribe.\n\n. Begin in the subscriber organization's Domo environment.\n2. From the navigation header, go to\n **More**\n >\n **Admin**\n .\n3. In the\n **Domo Everywhere**\n menu, select\n **Subscriptions**\n .\n\n\n The\n **Subscriptions**\n section displays.\n4. Go to the\n **Invitations**\n tab.\n5. Review the invitations and select\n **Subscribe**\n for the appropriate invitations. A dialog displays to confirm that you are accepting the invitation(s).\n6. Select\n **Accept**\n to confirm the subscription. The data from the publishing organization populates in the subscriber organization.\n\nThe process is complete when the invitation disappears from the\n **Invitations**\n tab and displays in the\n **Subscriptions**\n tab.\n\n*Important:**\n The DataSets are available as soon as you accept the invitation, but you must refresh your browser to view the visualizations.\n\n\n Back to top\n\n\n####\n\n\n Auto-Subscribe to All Publications From an Organization\n\nFollow these steps to auto-subscribe to publications from a specific organization:\n\n. In the\n **Domo Everywhere**\n menu in the Admin Settings, select\n **Subscriptions**\n . The\n **Subscriptions**\n page has three tabs:\n **Subscriptions**\n ,\n **Invitations**\n , and\n **Settings**\n .\n2. Go to the\n **Settings**\n tab.\n3. In the\n **Settings**\n tab, select\n **+ Add Auto-Subscription**\n .\n\n\n The\n **Add auto-subscription**\n modal displays.\n4. In the\n **Domain name**\n field, enter the Domo domain name for the publishing organization. The format is\n *companyname*\n .domo\n\n.\n\ncom.\n5. In the\n **Subscription**\n**owner**\n field, enter a name for the owner of the subscription. We recommend that the owner be a service account.\n6. (Optional) In the\n **Share subscription**\n field, search for and add users or groups to this auto-subscription. While this step is optional, this field is where you can configure\n\nDefault Sharing\n\n.\n7. Select\n **Add**\n to add the auto-subscription or\n **Cancel**\n to close the modal without saving.\n\n\n The auto-subscription now displays in the\n **Settings**\n tab of the\n **Subscriptions**\n page, as well as in the list of subscriptions in the\n **Subscriptions**\n tab.\n\n\n**Note:**\n You can edit or remove the auto-subscription from the\n **Settings**\n tab. You cannot remove the auto-subscription from the subscriptions list in the\n **Subscriptions**\n tab.\n\n\n Back to top\n\n\n####\n\n\n Default Sharing\n\nDefault Sharing allows subscriber organizations to automatically share all publications from a specified publishing organization to any number of users or groups.\n\n. In the\n **Add auto-subscription**\n modal, accessed while\n\nadding an auto-subscription\n\n, enter the Domo domain for the publishing organization that you want to automatically share publications from.\n2. In the\n **Share subscription**\n field, enter any users or groups that you want to automatically push publications to.\n\n\n Learn more about configuring users and groups in our\n\nAdmin Settings: Governance\n\narticle.\n\n*Video - Subscribe to a Publication**\n\nBack to top\n\n\n###\n\nLock the Dashboard\n\nWe recommend that subscriber organizations lock published dashboards. This is because if the publisher makes an update to the visualizations on their side, those changes override any changes made by subscriber organizations.\n\n\n You can lock the dashboard by selecting\n **Lock**\n at the top of the dashboard.\n\nIf you want to make edits to the visualizations in the publication, it's best to make a copy of the dashboard by going to\n\n*Dashboard options**\n >\n\n*Save as**\n . Make edits to the duplicate version.\n\n\n Back to top\n\n\n###\n\n\n Unsubscribe from a Publication\n\n\n1. From the navigation header, go to\n **More**\n >\n **Admin**\n .\n2. In the\n **Domo Everywhere**\n menu, select\n **Subscriptions**\n .\n3. In the\n **Subscriptions**\n tab of the\n **Subscriptions**\n section, locate the publication you want to unsubscribe from.\n4. Hover over the publication until\n\n*Subscriptions Options**\n displays and select it.\n5. Select\n **Delete**\n . A dialog displays, confirming that you want to delete the subscription.\n6. Select\n **Confirm**\n or\n **Cancel**\n .\n\n\n**Note:**\n Completing these steps immediately starts the process of removing the dashboards, cards, and DataSets that have been subscribed to as part of the publication.\n\n\n Back to top\n\nPDP Policies for Published Content\n--------------------------------------\n\nThis section contains information about Personalized Data Permissions (PDP) for publishing.\n\n If you share the same DataSet in two publications to the same subscriber organization, the PDP policies of the more recently saved publication are used for data permissions.\n* If you want to share the same DataSet to the same subscriber organization twice with different permissions, you must duplicate the DataSet in the publishing organization's Domo environment.\n\n\n###\n Dynamic PDP\n\nWhen you set up a publication using the Dynamic PDP by Org ID permission type, only the part of the DataSet that you want that subscriber organization to see is published to their Domo environment. This keeps your data even more secure and is simple to edit if you need to change the data a subscriber organization receives at a later time.\n\n\n The Dynamic PDP takes effect the next time the publication is refreshed.\n\nBack to top\n\nNotes\n---------\n\n\n* Domo Everywhere supports publishing Domo Bricks. For more information, see our\n\nDomo Bricks\n\narticle.\n* Dataset Views can be published across organizations. Remember to follow the best practices for PDP policies as described\n\n\n in\n\nPublishing DataSet Views\n\n.\n* Alerts are not copied when publishing across organizations. Subscriber organizations can create Card Alerts on their side that are triggered by numerical thresholds (as shown below on the right). DataSet Alerts for appending new rows or changing values are not compatible with the virtual DataSets from a publication (as shown below on the left).\n* Beast Mode calculations are only copied to the subscriber organization if they are being used in the cards that are published.\n* Federated data can be published, with the caveat that the published data, if the original source is federated, cannot be run in a DataFlow.\n\n\n Back to top\n\n\n###\n\n\n Publish the Same DataSet via Two Publish Jobs\n\nEach publication pushes all of the DataSets that exist within it to the subscriber organization, even if any of the DataSets already exists in the subscriber organization's Domo environment due to another publication already publishing that DataSet to the same subscriber organization.\n\n\n Within the subscriber organization, each copy of the DataSet has the same name, but different values for `Dataset\\_Id`. Each copy of the DataSet is tied to the specific publication it was published with.\n\n\n We recommend only publishing a given DataSet to a subscriber organization at one time in one publication.\n\nBack to top\n\nNeed Support?\n---------------\n\nIf you still need support with your publication, contact us here:\n\nsupport@domo.com\n\n\n Include the following information in your request:\n\n\n • Domo environment(s) where the behavior is occurring\n\n\n • Publication Name\n\n\n • Description of behavior\n\n\n • Screenshot of behavior (if applicable)\n\n\n • Steps to recreate behavior (if known/applicable)\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360045120554\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004983\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nPublish Content to a Subscriber Organization\n\n", "article_total_view_count": "\n\n\n 6,062\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/1/2022, 11:18 PM\n\n\n", "first_published_date": "\n\n\n 11/1/2022, 11:23 PM\n\n\n"}, "title": "publish_content_to_a_subscriber_organization", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "distributing_domo_content", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "domo_everywhere", "url": "/s/topic/0TO5w000000ZanbGAC"}]}