{"file_path": "../../raw_kb_v2\\article\\4409199658263\\index.html", "content": {"Title": "PII Vault Protection and Compliance", "Article Body": "Intro\n                       \n\n                        Domo has partnered with Anonomatic to safely store, anonymize, mask, mine, redact and share sensitive Personally Identifiable Information (PII) data with 100% data accuracy and full international data privacy compliance. This allows you to upload your data that contains PII data with the information redacted so that it is never stored in Domo. For more information on PII, see\n                        \n                         What Constitutes PII?\n                        \n\n\n\n\n\n                        Privacy compliance is accomplished through a process called Poly-Anonymization™. Poly-Anonymization involves taking any personal identifying pieces of information (name, gender, address, social security number, etc.) and swapping it out for an anonymous value (Poly-ID). This value is unique, inconsistent, unpredictable, and not hashed. After data anonymization has been completed, organizations can share the resulting data either internally or externally without the usual risk that would be associated with such activity. For more information on this process and on Anonomatic, visit their site\n                        \n                         https://anonomatic.com\n                        \n                        .\n                       \n\n\n                         Video - PII Vault Plugin For Domo Workbench - Introduction and Overview\n                        \n\n\n\n\n\n\n\n\n                        Try it out\n                       \n\n                        In order to test the PII Vault Protection and Compliance feature with Domo, you need to do the following:\n                       \n\n\n                         Create an Anonomatic Trial account.\n                        \n\n                         Download the Workbench plugin.\n                        \n\n\n                        This free trial will let you upload 2,000 unique personal profiles and will last for 30 days.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This feature is available\n                             \n                              on demand and paid\n                             \n                             .\n                            \n\n\n\n\n                            To request this feature be enabled,\n                           \n\n\n\n                              Reach out to your Domo Customer Success Manager, Technical Consultant, or Account Executive.\n                             \n\n\n\n                              If you do not have contact information for your CSM, TC, or AE, contact Technical Support. For information on how to contact Support, please see:\n                              \n                               Getting Help\n                              \n\n\n\n\n                            Depending on the feature, you may be required to complete training before you can use the feature.\n                           \n\n\n\n\n\n                        Create an Anonomatic Trial account\n                       \n\n                        In order to use the PII Vault Protection and Compliance feature with Domo, you will first need to create an account with Anonomatic.\n                       \n\n\n                         Video - How to Create a new PII Vault Trial Account\n                        \n\n\n\n\n\n\n\n                         To create an Anonomatic account,\n                        \n\n\n\n                         Navigate to\n                         \n                          https://api.anonomatic.com/ui\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Create New Account\n                         \n                         .\n                         \n\n\n\n\n\n\n                         Fill out the registration information.\n                        \n\n                         (Conditional) Under the\n                         \n                          Subscription Type\n                         \n                         dropdown select one of the following:\n                         \n                         To create a trial account, select\n                         \n                          Trial Vault\n                         \n                         .\n                         \n                         To create a regular account select\n                         \n                          Standard Vault\n                         \n                         . (If you choose this option, you will need to reach out to your Domo Account Executive for an\n                         \n                          Activation Key\n                         \n                         .)\n                         \n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you select a Trial Vault it is fully functional and allows you to test all of the features. However, do NOT use any production data in this environment as the data can be wiped at any time.\n                            \n\n\n\n\n\n\n\n                         Select the checkbox for\n                         \n                          I accept the terms and conditions\n                         \n                         .\n                         \n\n\n\n\n\n\n                         Click\n                         \n                          Subscribe\n                         \n                         .\n                        \n\n                         On the success page, click\n                         \n                          Login\n                         \n                         .\n                         \n\n\n\n\n\n\n                         A verification email will be sent to the email address you provided. You will need to click the link to verify your account before you can log in for the first time.\n                         \n\n\n\n\n\n\n                         Enter your credentials.\n                        \n\n                         Click\n                         \n                          Login\n                         \n                         .\n                        \n\n                         Once you log in, you will receive a second email that will provide you with the\n                         \n                          API Access URL\n                         \n                         ,\n                         \n                          AccountId,\n                         \n                         and\n                         \n                          ApiKey\n                         \n                         you need in order to use the vault.\n                        \n\n\n                        Download the Workbench plugin\n                       \n\n                        In order to use the PII Vault Protection and Compliance feature with Domo, you will need to download the plugin for use inside of Domo Workbench.\n                       \n\n\n                         Video - How To Download PII Vault Plugin for Domo Workbench\n                        \n\n\n\n\n\n\n\n                         To download the Workbench plugin,\n                        \n\n\n\n                         Navigate to\n                         \n                          https://github.com/AnonomaticInc/Domo\n                         \n                         .\n                        \n\n                         (Conditional) Depending on the version of Workbench on your machine, you will select one of the following files:\n                         \n                         If you are using Workbench 5.0, you will select the file\n                         \n                          PIIVaultDomoPlugin5.0.zip\n                         \n                         .\n                         \n                         If you are using Workbench 5.1, you will select the file\n                         \n                          PIIVaultDomoPluginWB5.1.zip\n                         \n                         .\n                         \n\n\n\n\n\n\n                         Click\n                         \n                          Download\n                         \n                         .\n                         \n\n\n\n\n\n\n                         Once the file has been downloaded, open the file so that you can see the\n                         \n                          PIIVaultDomoPlugin\n                         \n                         folder.\n                        \n\n                         In a separate file window, navigate to the following folder path on your PC:\n                         \n\n                          This PC > OS (C:) > ProgramData > Domo > Workbench > Pipeline > AddIns\n                         \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This is the default file path that is created when Workbench is installed on your machine, if you selected a different file path when it was installed, you will need to navigate to where you saved it.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If the file doesn't appear in the folder, click\n                             \n                              View\n                             \n                             at the top of the explorer and then check the\n                             \n                              Hidden Items\n                             \n                             box.\n                            \n\n\n\n\n\n\n\n                         Click and drag the\n                         \n                          PIIVaultDomoPlugin\n                         \n                         folder into the\n                         \n                          AddIns\n                         \n                         folder.\n                        \n\n                         The plugin will now be available inside of your Domo Workbench.\n                        \n\n\n                        Using PII Vault Protection and Compliance\n                       \n\n                        Once you have created an account with Anonomatic and downloaded the Domo Workbench plugin, you can create a Workbench job to upload the data. You have two options for handling the PII data, it can be Redacted or Masked.\n                       \n\n                        PII Vault with Data Redaction\n                       \n\n                        Using the PII Vault Protection and Compliance plugin with the Data Redaction method replaces all PII data with null values before uploading the data into Domo. The values are given a Poly Anonymous-Id that is used to reference the particular individual anytime they have data added to the database.\n                       \n\n\n                         Video - PII Vault Plugin Setup for Data Redaction\n                        \n\n\n\n\n\n\n\n\n\n                         To use PII Vault Protection and Compliance with data redaction,\n                        \n\n\n\n                         Create a new job inside of Domo Workbench.\n                        \n\n                         Select the data you would like to upload.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you are doing a database query, be sure to use an Order By statement on the unique ID field for the individual.\n                            \n\n\n\n\n\n                         Under the\n                         \n                          Transforms\n                         \n                         section, select\n                         \n                          PIIVault Transform\n                         \n                         .\n                        \n\n                         Click the\n                         \n                          +\n                         \n                         icon.\n                        \n\n                         Under the\n                         \n                          PII Vault Parameter Value\n                         \n                         type\n                         \n                          Redact\n                         \n                         .\n                         \n                         This will replace the data with null values.\n                         \n\n\n\n\n\n\n                         Click the\n                         \n                          Configure PII Vault Connection\n                         \n                         button.\n                         \n\n\n\n\n\n\n                         Enter the\n                         \n                          PII Vault URL\n                         \n                         .\n                        \n\n                         Enter the\n                         \n                          PII Vault Account Id\n                         \n                         .\n                        \n\n                         Enter the\n                         \n                          PII Vault API Key\n                         \n                         .\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The PII Vault URL, Account Id, and API Key will be emailed to you once you set up your account with Anonomatic. To create an account, see\n                             \n                              Create an Anonomatic Trial account\n                             \n                             .\n                            \n\n\n\n\n\n                         Click\n                         \n                          OK\n                         \n                         .\n                        \n\n                         Click the\n                         \n                          Configure Schema\n                         \n                         button.\n                         \n\n\n\n\n\n\n                         Under the\n                         \n                          Column Type\n                         \n                         field for each column, select what type of PII data it contains (if applicable.)\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             There must be one column set to\n                             \n                              Unique Key to Individual\n                             \n                             that must be a consistent value that you use to identify an individual whenever data is uploaded about them.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Tip:\n                             \n                             There is an option for\n                             \n                              Non-PII Data Field\n                             \n                             however, this does not need to be selected for each non-PII column. If the selection is left blank, it defaults to the Non-PII Data Field option.\n                            \n\n\n\n\n\n\n\n                         (Optional) Set the\n                         \n                          Column Type Group\n                         \n                         field.\n                         \n                         This option is used when there are multiple addresses (mailing or email such as a personal and a work address) associated to a single individual. You would set all of the secondary address information to another group so that the plugin knows how to anonymize the data while keeping the addresses separate.\n                        \n\n                         Click the checkbox next to the columns you want to be Redacted.\n                        \n\n                         Click\n                         \n                          OK\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Apply\n                         \n                         .\n                        \n\n\n                          Save\n                         \n                         and\n                         \n                          Run\n                         \n                         the job.\n                        \n\n\n                        PII Vault with Data Masking\n                       \n\n                        Using the PII Vault Protection and Compliance plugin with the Data Masking method replaces all PII data with non-identifying fake values. This gives the appearance of real values for your data, without actually containing PII data. The values are not given a Poly Anonymous-Id as they are assigned fake data that is unique to that individual.\n                       \n\n\n                         Video - PII Vault Plugin Setup Data Masking\n                        \n\n\n\n\n\n\n\n\n\n                         To use PII Vault Protection and Compliance with data masking,\n                        \n\n\n\n                         Create a new job inside of Domo Workbench.\n                        \n\n                         Select the data you would like to upload.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you are doing a database query, be sure to use an Order By statement on the unique ID field for the individual.\n                            \n\n\n\n\n\n                         Under the\n                         \n                          Transforms\n                         \n                         section, select\n                         \n                          PIIVault Transform\n                         \n                         .\n                        \n\n                         Click the\n                         \n                          +\n                         \n                         icon.\n                        \n\n                         Under the\n                         \n                          PII Vault Parameter Value\n                         \n                         type\n                         \n                          Mask\n                         \n                         .\n                         \n                         This will replace the data with non-identifying fake values.\n                         \n\n\n\n\n\n\n                         Click the\n                         \n                          Configure PII Vault Connection\n                         \n                         button.\n                         \n\n\n\n\n\n\n                         Enter the\n                         \n                          PII Vault URL\n                         \n                         .\n                        \n\n                         Enter the\n                         \n                          PII Vault Account Id\n                         \n                         .\n                        \n\n                         Enter the\n                         \n                          PII Vault API Key\n                         \n                         .\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The PII Vault URL, Account Id, and API Key will be emailed to you once you set up your account with Anonomatic. To create an account, see\n                             \n                              Create an Anonomatic Trial account\n                             \n                             .\n                            \n\n\n\n\n\n                         Click\n                         \n                          OK\n                         \n                         .\n                        \n\n                         Click the\n                         \n                          Configure Schema\n                         \n                         button.\n                         \n\n\n\n\n\n\n                         Under the\n                         \n                          Column Type\n                         \n                         field for each column, select what type of PII data it contains (if applicable.)\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             There must be one column set to\n                             \n                              Unique Key to Individual\n                             \n                             that must be a consistent value that you use to identify an individual whenever data is uploaded about them.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Tip:\n                             \n                             There is an option for\n                             \n                              Non-PII Data Field\n                             \n                             however, this does not need to be selected for each non-PII column. If the selection is left blank, it defaults to the Non-PII Data Field option.\n                            \n\n\n\n\n\n\n\n                         (Optional) Set the\n                         \n                          Column Type Group\n                         \n                         field.\n                         \n                         This option is used when there are multiple addresses (mailing or email such as a personal and a work address) associated to a single individual. You would set all of the secondary address information to another group so that the plugin knows how to anonymize the data while keeping the addresses separate.\n                        \n\n                         Click the checkbox next to the columns you want to be Masked.\n                        \n\n                         Click\n                         \n                          OK\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Apply\n                         \n                         .\n                        \n\n\n                          Save\n                         \n                         and\n                         \n                          Run\n                         \n                         the job.\n                        \n\n\n                        Anonymous Data Matching\n                       \n\n                        The PIIVault Reader Plugin allows you to link users together from different sources. You configure what fields need to match (such as name and email) in order to prove two records are the same individual.\n                       \n\n\n                         Video - Anonymous Data Matching Conceptual Overview\n                        \n\n\n\n\n\n\n\n\n\n                         Video - Anonymous Data Matching Plugin Configuration\n                        \n\n\n\n\n\n\n\n\n\n                         To use PII Vault Protection and Compliance with anonymous data matching,\n                        \n\n\n\n                         Create a new job inside of Domo Workbench.\n                        \n\n                         Set the\n                         \n                          Source\n                         \n                         as\n                         \n                          PIIVault Provider\n                         \n                         .\n                         \n\n\n\n\n\n\n                         Click the\n                         \n                          Configure PII Vault Connection\n                         \n                         button.\n                        \n\n                         Enter the\n                         \n                          PII Vault URL\n                         \n                         .\n                        \n\n                         Enter the\n                         \n                          PII Vault Account Id\n                         \n                         .\n                        \n\n                         Enter the\n                         \n                          PII Vault API Key\n                         \n                         .\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             The PII Vault URL, Account Id, and API Key will be emailed to you once you set up your account with Anonomatic. To create an account, see\n                             \n                              Create an Anonomatic Trial account\n                             \n                             .\n                            \n\n\n\n\n\n                         Click\n                         \n                          OK\n                         \n                         .\n                        \n\n                         Click the\n                         \n                          Configure Accounts to Match\n                         \n                         button.\n                        \n\n                         Enter the\n                         \n                          Account Id\n                         \n                         for each account you would like to match.\n                        \n\n                         Enter an\n                         \n                          Account Name\n                         \n                         to list which account the match came from.\n                         \n\n\n\n\n\n\n                         Click\n                         \n                          OK\n                         \n                         .\n                        \n\n                         Select the\n                         \n                          Configure Matching Criteria\n                         \n                         button.\n                        \n\n                         Enter a\n                         \n                          Test Name\n                         \n                         .\n                        \n\n                         Select the\n                         \n                          Confidence Level\n                         \n                         .\n                        \n\n                         Enter the\n                         \n                          Test Criteria\n                         \n                         .\n                         \n\n\n\n\n\n\n                         Click\n                         \n                          Validate Tests\n                         \n                         .\n                        \n\n                         Click\n                         \n                          OK\n                         \n                         .\n                        \n\n                         Click\n                         \n                          Apply\n                         \n                         .\n                        \n\n                         Set\n                         \n                          Processing\n                         \n                         as\n                         \n                          PIIVault Reader\n                         \n                         .\n                        \n\n                         Set the\n                         \n                          Data Type\n                         \n                         as\n                         \n                          Workbench CSV\n                         \n                         .\n                        \n\n\n                          Save\n                         \n                         and\n                         \n                          Run\n                         \n                         the job.\n                        \n\n\n                        FAQ's\n                       \n\n                        As more plugins become available, they will be added to the YouTube Playlist found\n                        \n                         here\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "4409199658263", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004123", "Archived Date": "", "Language": "English", "Primary Version": "PII Vault Protection and Compliance", "Article Total View Count": "2,525", "": "", "Article Created Date": "10/24/2022, 9:23 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              PII Vault Protection and Compliance\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}