{"file_path": "../../raw_kb_v2\\article\\8230241776791\\index.html", "content": {"title": "\n\n\n CSV SFTP Traverse Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe CSV SFTP Traverse Connector is capable of parsing any valid CSV file and retrieving data from files where the file pattern name matched with the filename at the server; It is also able to connect to different data sources or any CSV resource that is hosted remotely and available over FTP protocol.\n\nA character-separated values (CSV) file stores tabular data in plain text form. Domo provides two connectors that allow you to access CSV files you have uploaded to an SFTP (Secure File Transfer Protocol) server:\n\n\n* The Domo CSV SFTP Traverse connector (formerly called the \"CSV-SFTP\" connector) allows you to access CSV files that you have uploaded to your own SFTP server.\n* The Domo CSV SFTP Push connector allows you to capture and process CSV files that have been uploaded to Domo's own SFTP. With this connector, Domo gives you credentials, then you push your data to Domo.\n\n\n This article discusses the CSV SFTP Traverse connector. For information about the CSV SFTP Push connector, visit\n\nCSV SFTP Push Connector\n\n.\n\n\n If you need to access files located on a directory, use the\n\nCSV Advanced\n\nconnector.\n\nThe CSV SFTP Traverse connector is a \"File\" connector, meaning it retrieves files and output them to Domo. In the Data Center, you can access the connector page for this and other File connectors by clicking\n\n\n**File**\n in the toolbar at the top of the window.\n\nYou connect to CSV files in the Data Center. This topic discusses the fields and menus that are specific to the CSV connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n----------------\n\n\n You must have an SFTP host name and a username and password to authenticate to the SFTP server.\n\nYou also need to whitelist the appropriate IP addresses for your region.\n\nYou can access the list of IP addresses, by region, in\n\n\n Whitelisting IP Addresses for Connectors & Federated Adapters.\n\n\n Connecting to CSV Files\n--------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n\n\n and\n\n\n**Details**\n panes for the CSV SFTP Traverse connector. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your SFTP server. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n\nSFTP Host Name\n\n|\n\nEnter the name of the SFTP host you want to connect to. This\n\n\n*must*\n\n\n begin with\n\nsftp://\n\n. For example:\n\ns\n\nftp://hostname\n\n\n .\n\n|\n|\n\nUsername\n\n|\n\nEnter the username you use to authenticate to the SFTP server.\n\n|\n|\n\nPassword\n\n|\n\nEnter the password you use to authenticate to the SFTP server.\n\n|\n|\n\nHead Start Row\n\n|\n\n\n Signifies the row where the header should start.\n\n\n |\n|\n\nData Start Row\n\n|\n\n\n signifies the row where the data should be fetched from the CSV file.\n\n\n |\n\nLooking to upload a CSV file but do not have an SFTP server? Take a look at our\n\nWorkbench solution\n\navailable for download in your Domo instance.\n\n##\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n FAQs\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the username, password and host name of the SFTP server.\n\n###\n How does this connector handle the data?\n\nThe CSV-SFTP connector pulls the data from customer's SFTP server into Domo.\n\n###\n How often can the data be updated?\n\nData will update every hour.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 8230241776791\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003831\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCSV SFTP Traverse Connector\n\n", "article_total_view_count": "\n\n\n 2,398\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "csv_sftp_traverse_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}