{"file_path": "../../raw_kb_v2\\article\\360042931814\\index.html", "content": {"title": "\n\n\n Snowflake Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSnowflake is data warehouse that makes it easy to bring together all your data and make it available to all of the users and systems that need to analyze it. You can use Domo's Snowflake connector to retrieve data from a specified warehouse, database, and database schema by inputting an SQL query. For more information about the Snowflake API, go to\n\nhttps://docs.snowflake.net/manuals\n\n.\n\n\n The Snowflake connector is a \"Database\" connector, meaning it retrieves data from a database using a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n **Database**\n in the toolbar at the top of the window.\n\n\n This topic discusses the fields and menus that are specific to the Snowflake connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to a Snowflake database and create a DataSet, you must have the following:\n\n The full name of your account (provided by Snowflake). This is the portion of your Snowflake URL immediately following\n\nhttps://\n\n.\n\n\n Note that your full account name may include additional segments that identify the region and cloud platform where your account is hosted. The following table provides account name examples by cloud platform/region. For each row, it assumes your account name is \"xy12345.\"\n* The username and password for your Snowflake account.\n\nConnecting to Your Snowflake Account\n--------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Snowflake Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Snowflake account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Account Name\n  |\n Enter the account name for your Snowflake account. For information about finding your account name, see Prerequisites.\n  |\n|\n Username\n  |\n Enter the username associated with your Snowflake account.\n  |\n|\n Password\n  |\n Enter the password associated with your Snowflake account.\n  |\n|\n Role\n  |\n E\n\nnter your role.\n\n|\n\nAfter you have entered valid Snowflake credentials, you can use the same account in Domo any time you create a Snowflake DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a number of fields and menus for entering your SQL query and specifying the location of the data you want to retrieve.\n\n\n Parameter\n  |\n Description\n  |\n| --- | --- |\n|\n Query Type\n  |\n Select the query type.\n\n\n|  |  |\n| --- | --- |\n|\n Enter Query\n  |\n It enables an option to enter the user defined query.\n  |\n|\n Query History\n  |\n It will fetch the data from the Snowflake query history for the last 70 days using the predefined query.\n  |\n|\n Table Information\n  |\n It will fetch the metadata information about the objects created in your account.\n  |\n|\n Warehouse Metering History\n  |\n It will fetch the warehouse usage and metering information for the last 70 days.\n  |\n\n|\n|\n Query\n  |\n Enter the SQL query to use to retrieve your data. You can use the\n **Query Helper**\n parameter to help you write a usable SQL query. To use the\n **Query Helper**\n , do the following:\n 1. Select your desired warehouse, database, database schema, database table, and table columns in each menu.\n2. Copy the SQL statement that appears in the\n **Query Helper**\n field.\n3. Paste the copied SQL statement into the\n **Query**\n field.\n |\n|\n Warehouses\n  |\n Select the warehouse containing the data you want to retrieve. The list populates with all of the warehouses you have access to based on your credentials.\n  |\n|\n Databases\n  |\n Select the database containing the data you want to retrieve. The list populates with all of the databases you have access to based on your credentials.\n  |\n|\n Database Schema\n  |\n Select the database schema containing the data you want to retrieve. The list populates with all of the schemas you have access to based on your credentials.\n  |\n|\n Database Tables (Optional)\n  |\n Select the database table you want to retrieve. The list populates with all of the tables you have access to based on your credentials. If you do not select a database table, the connector retrieves your entire database schema.\n  |\n|\n Table Columns (Optional)\n  |\n Select the table columns you want to retrieve. The list populates with all of the columns you have access to based on your credentials. If you do not select a table column, the connector retrieves your entire selected database table.\n  |\n|\n Query Helper (Optional)\n  |\n When you select warehouses, databases, schemas, tables, etc. from the above menus, a usable SQL query is built for you in this field. Copy and paste the SQL statement in this field into the\n **Query**\n field. For more information, see\n **Query**\n , above.\n  |\n|\n Fetch Size (Optional)\n  |\n Enter a fetch size for memory performance. If this field is left blank, the default value of 1000 will be used. If the DataSet throws an \"Out of memory\" error, try decreasing the fetch size.\n  |\n\n\n###\n\nOther Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n When should I use this connector?\n\nThis connector allows you to import your data into Domo from Snowflake using Snowflake's JDBC drivers. Use this connector with a Snowflake Account Name, local username, and password to ingest small to large datasets from Snowflake.\n\n####\n What permissions do I need on Snowflake?\n\nYou need the CREATE TABLE, COPY INTO, PUT, CREATE FILE FORMAT, REMOVE, and LIST permissions on Snowflake.\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the account name (provided by Snowflake), your Snowflake username, and private key. If you are creating an encrypted private key then you will need a passphrase used to encrypt the private key file. You can also provide your role name.\n\n####\n Can I use the same account to create multiple datasets?\n\nYes\n\n####\n How do I find the Input Dataset ID?\n\nYour Domo input dataset ID is in the URL of the dataset you are exporting data from. For example:\n\nhttps://customer.domo.com/datasources/aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee/details/settings\n\n\n#####\n Are there any API limits I should be aware of?\n\nThis depends on your server configuration.\n\n####\n How frequently will my data update?\n\nDataSets can run as often as every 15 minutes. However, depending on the runtime of the query, DataSets may need to run less frequently.\n\n####\n What should I be aware of while writing a query?\n\nMake sure that all the words, table names, and field names are correctly spelled. Refer to the Query Helper field for query help.\n\n####\n Why can't I connect to my Snowflake database? Do I need to whitelist any IP addresses?\n\nBefore you can connect to a Snowflake database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses for Connectors & Federated Adapters.\n\n\n#####\n Is this a Production-level connector?\n\nYes. This connector is designed for all-sized DataSets.\n\n####\n Why are the lists of warehouses, databases, schemas, etc. not populating correctly?\n\nYou only see content that you have access to based on the user role entered for your account in Snowflake. If you aren’t seeing something you are expecting, make sure that role has access to that warehouse, database, and table. etc.\n\n\n If you do not enter a role in Snowflake, the SYSADMIN role is used by default.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931814\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003885\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSnowflake Connector\n\n", "article_total_view_count": "\n\n\n 5,591\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "snowflake_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}