{"file_path": "../../raw_kb_v2\\article\\1500000572542\\index.html", "content": {"title": "\n\n\n Retail Express Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Retail Express is a cloud-based POS, inventory, and eCommerce software that provides inventory-based Australian and NZ retailers with a central platform. It helps to manage sales and services, inventory and logistics, marketing, and loyalty, business intelligence practices, and much more across multiple online stores. As a cloud solution, Retail Express gives you the flexibility to manage your business anytime, anywhere, via any internet-enabled devices. Reports and dashboards give users valuable insight into business performance. The Retail Express Web Store API and the IPS API are the web services that allow e-commerce web sites to communicate with Retail Express point of sale and stock control software. This enables the synchronization of products, pricing, purchase orders, customers, internal transfers, and other business-specific information to help reduce the amount of administration required to maintain an online e-commerce website and an IPS. Use Domo's Retail Express connector to retrieve the web store and inventory planning systems data.\n\nThe\n\nRetail Express\n\nConnector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your\n\nRetail Express\n\naccount in the Data Center. This topic discusses the fields and menus that are specific to the\n\nRetail Express\n\nConnector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n| **Primary Use Cases**  |\n This Connector lets you retrieve data about\n\nsales and services, inventory and logistics, marketing, and business intelligence practices.\n  |\n| **Primary Metrics**  | * Customer Data\n* Customer Details\n* Order Details\n* Purchase Order Details\n* Staff Details\n* Supplier Details\n* Outlet\n |\n| **Primary Company Roles**  | * Inventory Management\n* Sales and Services\n* Logistics\n* Marketing\n* Marketing Analytics\n |\n| **Average Implementation Time**  |\n Less than an hour.\n  |\n| **Ease of Use (on a 1-to-10 scale with 1 being easiest)**  |\n 3\n  |\n\nPrerequisites\n---------------\n\nTo connect to your Retail Express account and create a DataSet, you must have the following:\n\n Your domain name of the web service account\n* Your unique client code of retail express account\n* The username and password associated with your Retails Express account\n\nConnecting to Your Retails Express Account\n--------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the Retails Express Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Retails Express account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Domain\n  |\n\nEnter your domain name of the web service account.\n\n|\n|\n Client ID\n  |\n\nEnter your unique client code of retail express account.\n\n|\n|\n Username\n  |\n\nEnter the username associated with your Retail Express account.\n\n|\n|\n Password\n  |\n\n\n Enter the password associated with your Retail Express account.\n\n\n |\n\nOnce you have entered valid Retails Express credentials, you can use the same account any time you go to create a new Retails Express DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Retail Express report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Customer Data\n  |\n Returns a list of customers either created or modified since the last updated date.\n  |\n|\n Customer Details\n  |\n Returns all customer information that has been created or modified since the last synchronization.\n  |\n|\n Order Details\n  |\n Returns order with item-level data including product and quantities.\n  |\n|\n Product Details\n  |\n Returns a list of product details for all modified or created products since the given date.\n  |\n|\n Products SOH\n  |\n Returns ZIPPED XML format data on demand containing stock on hand data for all non-disabled products for the target warehouse.\n  |\n|\n Purchase Orders Details\n  |\n Returns a list of purchase orders.\n  |\n|\n Staff Details\n  |\n Returns ZIPPED XML format data on demand containing a list of staff details.\n  |\n|\n Supplier Details\n  |\n Returns details of all suppliers.\n  |\n|\n Outlets\n  |\n Returns ZIPPED XML format data on demand containing a list of outlets.\n  |\n\n|\n|\n Date Selection\n  |\n Select the date format for your data.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n\n\n**Days Back**\n\n\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Retrieve Data For\n  |\n Select whether you want to retrieve data for all warehouses or provide a comma-separated list of warehouse IDs.\n  |\n|\n Comma-separated list of Warehouse IDs\n  |\n Enter a comma-separated list of warehouse IDs. It can be obtained from the 'Outlets' report under\n\n\n \\\"\n\n\n WHID\n\n\n \\\"\n\n\n columns.\n  |\n|\n Only Customers With Emails\n  |\n A flag indicating whether to return only customers that have any value in Bill Email.\n  |\n|\n Only Customers For Export\n  |\n A flag indicating whether to return only customers marked as export to web or all customers.\n  |\n|\n Last Updated Date\n  |\n Select the last updated date.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n\n\n What kind of credentials do I need to power up this Connector?\n\nYou need\n\nthe domain name of your web service account, the unique client code, username, and password of Retail Express account.\n\n\n####\n Are there any API limits I should be aware of?\n\nNo\n\n###\n Can I use the same account to create multiple datasets?\n\nYes\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500000572542\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003250\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nRetail Express Connector\n\n", "article_total_view_count": "\n\n\n 2,392\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "retail_express_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}