{"file_path": "../../raw_kb_v2\\article\\360060905774\\index.html", "content": {"title": "\n\n\n Salesforce with Upsert Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Domo Salesforce connector integrates Domo with Salesforce to extract data from API-enabled editions of Salesforce (currently Enterprise and Unlimited). To establish the connection between Domo and Salesforce, an API-enabled user must first authenticate to Salesforce and then grant Domo permission to access to their data. You can then compile reports based on Salesforce data. The Salesforce Upsert connector supports the upsert mode along with append and replace modes, for scheduling datasets. To learn more about the Salesforce API, visit any of the following:\n\n https://www.salesforce.com/developer/docs/api/\n* http://resources.docs.salesforce.com...\\_reference.pdf\n* https://developer.salesforce.com/doc...data\\_model.htm\n\nThe Salesforce with Upsert connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Salesforce account in the Data Center. This topic discusses the fields and menus that are specific to the Salesforce with Upsert connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n| **Primary Use Cases**  |\n This connector is appropriate for pulling data from any API-enabled editions of Salesforce, such as leads, pipeline activity, and so on.\n  |\n| **Primary Metrics**  | * Number of Leads\n* Pipeline Amount\n* Bookings\n* Cases\n* Meetings\n* Portfolio Activity\n |\n| **Primary Company Roles**  |\n\nSalesforce has broad functionality and applies to many functions (e.g. Sales, Marketing, HR, Operations, Finance, IT, etc...) and also roles (analyst, sales rep, manager, VP, etc...). It all depends on how Salesforce was implemented, and the objects/modules created.\n\n|\n| **Average Implementation Time**  |\n Depends on the object/report/data size, but Salesforce is very quick to implement. It would take minutes to pull data through once you identify what you need. A very large data pull (millions of rows) would take about an hour.\n  |\n| **Ease of Use (on a 1-to-10 scale with 1 being easiest)**  |\n 4\n  |\n\nBest Practices\n----------------\n\n\n When using the Object Browser mode, Salesforce includes related objects (e.g. Opportunity and Account), so fields from each related object can be brought into the same DataSet. This prevents you from having to always pull in the objects independently (i.e. a separate Opportunity object and Account object) and join them in a DataFlow.\n\nPrerequisites\n---------------\n\nTo connect to your Salesforce account and create a DataSet, you must have the following:\n\n The username  and password for your Salesforce account\n* An installed Domo Connector Package from the Salesforce AppExchange (required as of August 1, 2018; see next section for installation instructions)\n\n\n###\n Installing the Domo Connector Package\n\nThe \"Domo Connector Package\" found in Salesforce AppExchange allows Salesforce users to import their data into Domo. Follow these instructions to download and install the Connector Package from the AppExchange.\n\n\n**To install Domo's Salesforce Managed Package,**\n\n. Log into Salesforce.\n2. Navigate to the Salesforce AppExchange at\n\nhttps://appexchange.salesforce.com\n\nand search for \"Domo Connector Package,\" then click on it.\n3. Customers can go directly to the package with the following link:\n\n\n https://login.salesforce.com/packaging/installPackage.apexp?p0=04t1I000001ymKN\n4. If you are installing into a sandbox organization you must replace the initial portion of the URL with\n\n\n http://test.salesforce.com\n\nAlternatively, you can go directly to\n\nhttps://appexchange.salesforce.com/a...A00000EcrsyUAB\n\n.\n5. Click\n **Get It Now**\n .\n6. Choose whether you want to install in a production environment or sandbox.\n7. Check the box reading \"I have read and agree to the terms and conditions.\"\n8. Click\n **Confirm and Install**\n .\n9. Click the\n **Install for All Users**\n tile.\n\nFor more details, see Salesforce's documentation at\n\nhttps://help.salesforce.com/articleV...ges.htm&type=5\n\n.\n\n##\n Verifying your Installation\n\nUse Domo's Salesforce Managed Package Validator to verify that your Salesforce Managed Package has been installed correctly.\n\n\n**To verify your installation,**\n\n. In the Connectors page in either the Data Center or Appstore in Domo, search for \"Salesforce Managed Package\" and double-click on on the icon.\n2. Customers can go directly to the package with the following link:\n\nhttps://login.salesforce.com/packaging/installPackage.apexp?p0=04t1I000001ymKN\n3. If you are installing into a sandbox organization you must replace the initial portion of the URL with\n\nhttp://test.salesforce.com\n4. Click\n **Get the Data**\n .\n5. Under\n **Credentials**\n , select your Salesforce account name, then click\n **Next**\n .\n6. Under\n **Details**\n , click\n **Next**\n .\n7. In the\n **Update**\n menu, select\n **Manually**\n , then click\n **Next**\n .\n8. Give your DataSet a name, then click\n **Save**\n .\n\nThe DataSet now runs. If everything has been set up correctly, the run will be successful, and a message will appear reading, \"Validation Success: You have set up your Salesforce Managed Package correctly.\"\n\nIf everything has\n *not*\n been set up correctly, the DataSet fails, and a message appears reading, \"You have not installed Salesforce's Domo Connector Package,\" with a help link to this article.\n\nConnecting to Your Salesforce Account\n---------------------------------------\n\n\n This section enumerates the options in the Credentials and Data Selection panes in the Salesforce with Upsert Connector page. The components of the other panes in this page,\n\n*Scheduling**\n\n, and\n\n*Name & Describe Your DataSet**\n\n, are universal across most connector types and are discussed in greater length in\n\n\n Adding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\n\n The Domo Salesforce with Upsert connector uses OAuth to connect, so there is no need to enter credentials within Domo. Choose an environment in the Salesforce Environment menu then click Connect to open the Salesforce login screen. Here you can enter your Salesforce username and password. Once you have entered valid Salesforce credentials, you can use the same account any time you go to create a new Salesforce Upsert DataSet. You can manage connector accounts in the\n\n*Accounts**\n\ntab in the Data Center. For more information about this tab, see\n\n\n Managing User Accounts for Connectors\n\n.\n\n##\n Data Selection Pane\n\nThis pane contains a primary\n **How Do You Want to Select Your Salesforce Data**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n How Do You Want to Select Your Salesforce Data?\n  |\n Select the method you want to use to pull data from Salesforce. Methods are as follows:\n * Browse Objects and Fields - Lets you select Salesforce objects with associated fields and relationships.\n* Query - Lets you enter SOQL queries to retrieve data.\n* Tabular Reports - Lets you retrieve your tabular reports in Salesforce.\n* Sharing Rules Settings - Lets you retrieve your sharing rules from Salesforce..\n |\n|\n Type of Records to Retrieve\n  |\n Select whether you want to retrieve only active records or include deleted records in the search as well.\n  |\n|\n Unique Field to Retrieve More Than 2000 Rows\n  |\n Select the field that contains a unique value for each row of the report. It will be used to retrieve more than 2000 rows of data.\n  |\n|\n Query Option\n  |\n Select a predefined query (\n **Sales Performance**\n or\n **User Images**\n ) or create your own query (\n **Custom**\n ).\n  |\n|\n Query\n  |\n Enter your Salesforce SOQL query here. For example:\n\nSELECT\n *Account*\n FROM Account\n\nFor more information about writing SOQL queries, see\n\nhttp://www.salesforce.com/us/developer/docs/officetoolkit/Content/sforce\\_api\\_calls\\_soql.htm\n\n.\n  |\n|\n Reset Schema\n  |\n Choose an option for resetting the columns in your data. In general, you will want to choose the second option when changing the selected fields or custom query. You will then run the DataSet, then switch to the first option to maintain the schema for subsequent runs to avoid data type issues.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\nSalesforce is generally a very stable connector so there are just a few common issues that arise with it. Most of the issues are due to insufficient permissions (on both the object and the field). Your Salesforce admin should be able to upgrade permissions on specific objects and fields.\n\n\n Another common error is the “Query Locator Error.” Salesforce only keeps 10 query locators at a time for a single user and for a maximum of 15 minutes. If too many DataSets are running at the same time, some of these will fail. The best way to avoid this issue is to spread out the times when the DataSets are running.\n\n\n FAQ\n-----\n\n###\n\nWhat version of the Salesforce API does this connector use?\n\nThis connector uses version 46.0 of the Salesforce API (\n\nhttps://{\n\ncustomer instance}.\n\nsalesforce.com/services/data\n\n/v46.0.)\n\n###\n\nWhich endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Browse Objects and Fields\n  |\n /query\n  |\n|\n Query\n  |\n /query\n  |\n|\n Tabular Reports\n  |\n /analytics/reports/{reportId}/describe\n  |\n|\n Sharing Rules and Settings\n  |\n /knowledgeManagement/settings\n  |\n\n\n####\n\nWhat kind of credentials do I need to power up this connector?\n\nYou need to select the Salesforce environment you would like to authenticate against, and the email address and password associated with your Salesforce account.\n\n###\n\nHow do I know my Salesforce account credentials are secure?\n\nThe login process uses the OAuth process so your Saleforce credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n\nI keep getting an \"INVALID\\_QUERY\\_LOCATOR\" error. How do I fix that?\n\nSalesforce allows a user to run a maximum of 10 queries at a time. Make sure your dataset runs are spread out.\n\n###\n\nI keep getting a \"QUERY\\_TIMEOUT\" error. How do I fix that?\n\nThis error appears if your SOQL query exceeds 20K character limit or contains too many formula fields. To fix this issue you need to simplify your query.\n\n###\n\nWhy do I not see my reports in the report drop-down menu?\n\nBefore reports can appear in the connector and pull in data, reports must be in table format and made public.\n\n###\n\nWhat's the difference between the Salesforce connector and the Salesforce with Upsert connector?\n\nThe Salesforce with Upsert connector allows a Merge mode that replaces all updated rows, while any new rows are appended for scheduling datasets along with the Replace and Append modes.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360060905774\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003244\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSalesforce with Upsert Connector\n\n", "article_total_view_count": "\n\n\n 4,777\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "salesforce_with_upsert_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}