{"file_path": "../../raw_kb_v2\\article\\360043428633\\index.html", "content": {"Title": "Taking Snapshots of Cards", "Article Body": "Intro\n                       \n\n                        You can take a \"Snapshot\" of a card in Domo, add annotations if desired, and share it with other users. A Snapshot is essentially a static picture of the card, providing an unchanging view of how it appeared within that moment, just like a picture taken with a camera. This capability is available for all card types (KPI, notebook, document, etc.).\n                       \n\n                        One of the most useful features of the Snapshot tool is the ability to add annotations such as text, arrows, and simple shapes. This allows you to call out aspects of the card you want to draw attention to. In the following example, the user noticed that customer satisfaction was down in the APAC region. After taking a snapshot of the card, he used annotation tools to call out the problem area and ask why such a problem was occurring.\n                       \n\n\n\n\n                        The user can then share the annotated version of the card with other users who should be aware of the problem.\n                       \n\n                        Be aware that when you take Snapshots and add annotations, the annotations are\n                        \n                         not\n                        \n                        added to the card. You are essentially creating a shareable\n                        \n                         image\n                        \n                        of the card with annotations applied. Therefore, as soon as you leave the Snapshot editor, your annotations are discarded.\n                       \n\n\n\n                          Video - Card Details - Snapshot Annotations\n                         \n\n\n\n\n\n\n\n\n\n                        Taking a Snapshot\n                       \n\n                        You take a Snapshot of a card by selecting\n                        \n                         Take a Snapshot\n                        \n                        in the\n                        \n                         Annotation\n                        \n                        menu (\n                        \n                        ) in the card Details view. For more information about the Details view, see\n                        \n                         Card Details View Layout\n                        \n                        .\n                       \n\n                        When you take a Snapshot of a card, a dialog opens in which you can annotate and share the Snapshot.\n                       \n\n                        Annotating Your Snapshot\n                       \n\n                        In the dialog that opens after you take a Snapshot of a card, you can add various annotations to the Snapshot using the options in the Annotations toolbar.\n                       \n\n                        Annotations Toolbar\n                       \n\n                        Thes options in the Annotations Toolbar are as follows:\n                       \n\n\n\n\n                           Option\n                          \n\n                           Description\n                          \n\n\n\n\n\n\n                            Undo (Ctrl + Z)\n                           \n\n\n\n\n\n                           Undoes the previous action.\n                          \n\n\n\n\n                            Draw (Ctrl + D)\n                           \n\n\n\n\n\n                           Lets you \"free draw\" on the card by clicking in the spot where you want to start drawing then dragging with the mouse. Each time you release the mouse button, a new selectable object is formed.\n                          \n\n\n\n\n                            Add Arrow (Ctrl + 1)\n                           \n\n\n\n\n\n\n                            Lets you add an arrow to the card.\n                           \n\n\n\n\n\n                            Add Circle (Ctrl + 2)\n                           \n\n\n\n\n\n                           Lets you add a circle to the card.\n                          \n\n\n\n\n                            Add Square (Ctrl + 3)\n                           \n\n\n\n\n\n                           Lets you add a square to the card.\n                          \n\n\n\n\n                            Large Textbox (Ctrl + 4)\n                           \n\n\n\n\n\n                           Lets you add a large textbox to the card.\n                          \n\n\n\n\n                            Small Textbox (Ctrl + 5)\n                           \n\n\n\n\n\n                           Lets you add a small textbox to the card.\n                          \n\n\n\n\n                            Select Color\n                           \n\n\n\n\n\n                           Lets you select a new color. If you have an object selected when you choose a color, that object takes on the new color.\n                          \n\n\n\n\n                            Delete (Delete or Backspace)\n                           \n\n\n\n\n\n                           Deletes the selected object.\n                          \n\n\n\n\n                        Manipulating Objects\n                       \n\n                        When you add any kind of object to a card (arrow, shape, textbox, or free draw object), it appears in a bounding box surrounded by a number of dots. All of these dots but one form the perimeter of the box. The last dot is connected to the box by a line, as shown in the following example:\n                       \n\n\n\n\n                        You can manipulate annotation objects by clicking and dragging on these dots, as explained in the following sections.\n                       \n\n                        Changing the size and shape of an object\n                       \n\n                        With a non-text object, clicking and dragging on the perimeter dots changes the size and shape of the object. Clicking and dragging on edge dots changes the shape; for example, if you had a square object and you dragged upward on the bottom edge dot, the square would be flattened into a rectangle. Clicking and dragging on corner dots changes the size of the object. Note that arrows do not have edge dots, only corner dots, so you cannot change their shape.\n                       \n\n                        With a textbox, clicking and dragging on the edge dots does not change the shape; it expands or contracts the space available for text, pushing it to the next line if need be. For example, if you took the text in the previous screenshot and clicked and dragged far enough on the right-side dot, the name \"Bunderson\" would drop to the next line.\n                       \n\n\n\n\n                        Rotating an object\n                       \n\n                        For any kind of object, clicking and dragging on the \"other\" dot (the one connected to the object by a line) allows you to rotate the object. You can even do this with text. In the following example, the user rotated both the arrow and the accompanying text:\n                       \n\n\n\n\n                        Moving Objects\n                       \n\n                        You can move any object by clicking it to select it (the bounding box will appear) and then moving it wherever you want it.\n                       \n\n                        Selecting Multiple Objects\n                       \n\n                        You can select multiple annotation objects by selecting the first object, holding down the Shift key, then clicking to select all remaining objects. When you select multiple objects, you can apply various actions to them at once, including the following:\n                       \n\n\n\n                          Moving them on the card\n                         \n\n\n\n                          Changing the color\n                         \n\n\n\n                          Resizing them\n                         \n\n\n\n                          Changing the shape (note that if any textboxes are included, you cannot click and drag to change the shape)\n                         \n\n\n\n                          Rotating them\n                         \n\n\n\n                        You cannot currently delete multiple objects at once.\n                       \n\n                        Clearing All Annotations\n                       \n\n                        You can clear all annotations from the card by clicking the\n                        \n                         Clear\n                        \n                        button at the bottom of the dialog.\n                       \n\n                        Sharing a Snapshot\n                       \n\n                        You can share a snapshot with others in your company via Buzz. When you click the\n                        \n                         Share\n                        \n                        button at the bottom of the dialog, a single option appears—\n                        \n                         Share to Buzz\n                        \n                        . Selecting this option opens the Universal Compose window in Buzz and automatically attaches your annotated version of the KPI card to the conversation. You can then enter your message, select the intended recipients, and send. For more information about Buzz, see\n                        \n                         Chatting in Buzz > Starting a conversation using the Universal Compose option\n                        \n                        .\n                       \n\n                        Downloading a Snapshot\n                       \n\n                        You can download an annotated snapshot to your computer by clicking the\n                        \n                         Download\n                        \n                        button at the bottom of the dialog.", "Preview Article": "Click here to preview", "URL Name": "360043428633", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004764", "Archived Date": "", "Language": "English", "Primary Version": "Taking Snapshots of Cards", "Article Total View Count": "4,896", "": "", "Article Created Date": "10/24/2022, 10:30 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Taking Snapshots of Cards\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Visualization Card Details View Actions\n              \n", "url": "/s/topic/0TO5w000000ZapOGAS"}]}