{"file_path": "../../raw_kb_v2\\article\\360042925234\\index.html", "content": {"Title": "Filtering Outliers in a Line Chart", "Article Body": "Intro\n                       \n\n                        In Analyzer, you can set \"Outlier Filters\" on a multi-line line chart. This allows you to filter out any lines with points above, below, or in between the value or values you set. If any point on a line does not pass the filter,\n                        \n                         that entire line is filtered out\n                        \n                        .\n                       \n\n                        You configure Outlier Filters in\n                        \n                         Chart Properties > Outlier Filters\n                        \n                        . There are two properties in\n                        \n                         Outlier Filters\n                        \n                        to be aware of:\n                       \n\n\n\n\n                           Show When Points Above\n                          \n                          . Filters your line chart to show only those lines with any values\n                          \n                           above\n                          \n                          the value you specify.\n                         \n\n\n\n\n                           Show When Points Below\n                          \n                          . Filters your line chart to show only those lines with any values\n                          \n                           below\n                          \n                          the value you specify.\n                         \n\n\n\n                        Note that\n                        \n                         any\n                        \n                        values above the filter set in\n                        \n                         Show When Points Above\n                        \n                        or below the filter set in\n                        \n                         Show When Points Below\n                        \n                        count toward this filter. So if you entered\n                        \n                         5000\n                        \n                        for the\n                        \n                         Show When Points Above\n                        \n                        property, and only one point exceeded 5000, the line would still appear.\n                       \n\n                        You can use\n                        \n                         Show When Points Above\n                        \n                        and\n                        \n                         Show When Points Below\n                        \n                        in tandem, to show only those lines within a given range. You do this by entering a larger value in\n                        \n                         Show When Points Below\n                        \n                        than in\n                        \n                         Show When Points Above\n                        \n                        . Again, note that if any point on a line falls outside the range you set, the line does not appear. If no lines have all points within the filter range, a \"No data in filtered range\" error appears.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                             When using Outlier Filters, keep in mind that if the date grain of your line chart changes, this could also change the values that are above or below the threshold(s) you have set, resulting in lines disappearing unexpectedly. For example, let's say you had a line chart with a weekly date grain and you set the\n                             \n                              Show When Points Above\n                             \n                             property to\n                             \n                              500\n                             \n                             . Let's also say the line in the chart has several points exceeding 500. Because there are points above the threshold, the line appears. Let's next say you go back into Analyzer and change the date grain to daily. This causes the individual values on the line to fall below the threshold of 500 (because they are no longer aggregated into weekly values). Thus, the line disappears.\n                            \n\n\n\n\n\n\n                        Example\n                       \n\n                        Dottie Birch is the Social Media Marketing manager for her company, Kablinko Toys. She owns the following card that shows all visits to the company website from various social media networks made between January and March in 2014.\n                        \n\n\n\n\n\n\n                        Because there are so many social media networks represented here, the chart is difficult to read. Dottie decides to filter the chart to show only those networks that brought in more than 1,300 visitors. She enters the number\n                        \n                         1300\n                        \n                        for the\n                        \n                         Show When Points Above\n                        \n                        property. The chart then filters out all networks without any points at or above 1,300. The only two networks that pass the filter are Facebook and Twitter:\n                       \n\n\n\n\n\n\n                        Dottie can also take the opposite approach and show all lines with points below a given threshold. She deletes the value from\n                        \n                         Show When Points Above\n                        \n                        and enters the value\n                        \n                         53\n                        \n                        for\n                        \n                         Show When Points Below\n                        \n                        . The chart now filters out all lines with no points at or below 53. Only Pinterest, YouTube, Google+, and LinkedIn have values this low, so these are the lines that remain:\n                        \n\n\n\n\n\n\n                        Finally, Dottie decides to try filtering out all lines with outlier values and leaving the others. She sets\n                        \n                         Show When Points Above\n                        \n                        to\n                        \n                         50\n                        \n                        and\n                        \n                         Show When Points Below\n                        \n                        to\n                        \n                         800\n                        \n                        . The only three social networks that pass both filters are Pinterest (with a low value of 50 and a high value of 614), YouTube (50 and 744), and Google+ (50 and 662). All of the other networks have values that are two low, too high, or both, and therefore are filtered out of the chart.\n                       \n\n\n\n\n\n                        Setting outlier filters\n                       \n\n\n                         To set outlier filters on a Line chart,\n                        \n\n\n\n\n                          Select\n                          \n                           Outlier Filtering\n                          \n                          in\n                          \n                           Chart Properties\n                          \n                          .\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            To filter to show only those lines with any points ABOVE a certain value, enter that value for\n                            \n                             Show Points Above\n                            \n                            .\n                           \n\n\n\n                            To filter to show only those lines with any points BELOW a certain value, enter that value for\n                            \n                             Show Points Below\n                            \n                            .\n                           \n\n\n\n                            To filter to show only those lines with all points within a certain range of values, enter the minimum value in\n                            \n                             Show Points Above\n                            \n                            and the maximum value in\n                            \n                             Show Points Below\n                            \n                            .", "Preview Article": "Click here to preview", "URL Name": "360042925234", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005036", "Archived Date": "", "Language": "English", "Primary Version": "Filtering Outliers in a Line Chart", "Article Total View Count": "2,593", "": "", "Article Created Date": "11/2/2022, 9:00 PM", "First Published Date": "11/2/2022, 9:04 PM"}, "title": "\n              Filtering Outliers in a Line Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Properties\n              \n", "url": "/s/topic/0TO5w000000ZaodGAC"}]}