{"file_path": "../../raw_kb_v2\\article\\360043429213\\index.html", "content": {"Title": "Latitude-Longitude Map", "Article Body": "Intro\n                       \n\n                        A latitude-longitude map displays data for any region in the w\n                        \n\n                        orld using latitude and longitude coordinates. The region that displays for a DataSet is \"zoomed\" in or out depending on the given coordinates. For example, if all of the cities in your DataSet were in Germany, the resulting map would show Germany; likewise, if some cities in the DataSet were in Germany and others were in France, the map would be \"zoomed out\" to show western Europe. Filters you apply to a latitude/longitude map also work this way. For example, if you were in the Details view for a map of the United States and you used Analyzer to show only cities in Washington and California, your map would be updated to show the westmost region of the United States. For more information about applying filters, see\n                        \n                         Adding Filters to Your Chart\n                        \n                        .\n                       \n\n                        This type of map is almost the same as the\n                        \n                         latitude-longitude route map\n                        \n                        . The difference is that points in a latitude-longitude route map are connected to form routes. These maps are more complex than standard latitude-longitude maps, requiring seven columns or rows of data.\n                       \n\n                        For information about world maps, see\n                        \n                         U.S. County Map\n                        \n                        .\n                       \n\n                        For information about troubleshooting when an area in your map does not show data but there is data, see\n                        \n                         Troubleshooting\n                        \n                        .\n                       \n\n\n                         Video - Map Charts\n                        \n\n\n\n\n\n\n                        Understanding latitude-longitude maps\n                       \n\n                        Latitude-longitude maps require four data columns or rows from your DataSet, though you can add an optional fifth column for series data if you want. One column or row contains the latitudes of the points you want to plot, one contains the longitudes, one contains the values that correspond with each latitude-longitude pairing, and one contains text for the hover label that appears for each point. Maps also include permanent data labels for specific cities. These are\n                        \n                         not\n                        \n                        determined by your DataSet—they are included automatically based on the region. For this reason, it is possible your map may include points that do not have data labels. However, all points have hover text.\n                       \n\n                        Values are represented in your map by varying point sizes, each size of which corresponds to a specific range. Ranges are determined automatically based on the distribution of values in your DataSet and are represented by a legend, which is automatically included beside the map.\n                       \n\n                        If you want, you can add an optional fifth column that contains series data, which is represented in the map by varying colors of map points. For example, if the cities in your DataSet were broken down into two different classes, \"A\" and \"B,\" the points within class \"A\" would appear orange by default, and the points within class \"B\" would appear blue. The sums for each series are shown in the map legend. If a user clicks on a point in a latitude-longitude map with series data, the drill table that appears shows all items for that series in the map. For more information about drilling into a chart, see\n                        \n                         Drilling into Data\n                        \n                        .\n                       \n\n                        For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        Latitudes and longitudes are recognizable by Domo in any of a number of different formats. For a list of accepted formats, see\n                        \n                         Formats for latitudes and longitudes\n                        \n                        .\n                       \n\n                        Powering latitude-longitude maps\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your map. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         KPI Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        Example\n                       \n\n                        The following graphic shows you how data from a typical column-based spreadsheet is converted into a latitude-longitude map:\n                       \n\n\n\n\n                        Formats for latitudes and longitudes\n                       \n\n                        Domo recognizes latitudes and longitudes written in any of the following formats:\n                       \n\n\n\n\n\n                            Format Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Examples\n                           \n\n\n\n\n\n\n\n                            Signed degrees\n                           \n\n\n\n                            Uses the format \"DDD.dddd.\" In this format, South latitudes and West longitudes are preceded by a minus sign. Latitudes range from -90 to 90, and longitudes range from -180 to 80.\n                           \n\n\n\n\n                             41.25, -120.9762\n                            \n\n\n\n\n\n\n                            Degrees minutes seconds\n                           \n\n\n\n                            Uses the format \"DDD MM SS + compass direction (N, S, E, or W).\" Latitudes range from 0 to 90 and longitudes range from 0 to 180. The last degree, minute, or second or a latitude or longitude may contain a decimal portion.\n                           \n\n\n\n\n                             41 25 01N, 120 58 57W\n                            \n\n\n\n                             41º25'01\"N, 120º58'57\"W\n                            \n\n\n\n                             S17 33 08.352, W69 01 29.74\n                            \n\n\n\n\n\n\n                            Degrees minutes\n                           \n\n\n\n                            Uses the format \"DDD MM + compass direction (N, S, E, or W).\" Latitudes range from 0 to 90 and longitudes range from 0 to 180. The last degree or minute of a latitude or longitude may contain a decimal portion.\n                           \n\n\n\n\n                             41 25N, 120 58W\n                            \n\n\n\n                             41º25'N, 120º58'W\n                            \n\n\n\n                             N41 25.117, W120 58.292\n                            \n\n\n\n\n\n\n                            Degrees only\n                           \n\n\n\n                            Uses the format \"DDD + compass direction (N, S, E, or W).\" Latitudes may range from 0 to 90 and longitudes range from 0 to 180. The last degree of a latitude or longitude may contain a decimal portion.\n                           \n\n\n\n\n                             41N, 120W\n                            \n\n\n\n                             41 N, 120 W\n                            \n\n\n\n                             41ºN, 120ºW\n                            \n\n\n\n                             N41.092, W120.8362\n                            \n\n\n\n\n\n\n                        Customizing latitude-longitude maps\n                       \n\n                        You can customize the appearance of a latitude-longitude map by editing its\n                        \n                         Chart Properties\n                        \n                        . Properties for all chart types are listed and described in\n                        \n                         Chart Properties\n                        \n                        . Unique properties of latitude-longitude maps include the following. You can click a thumbnail image to see a larger image.\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Examples\n                           \n\n\n\n\n\n\n\n                            Symbols > Symbol Color\n                           \n\n\n\n                            Allows you to set the color for map points. The default is orange. If your map contains a series column, colors are determined automatically—setting this property in this case has no effect.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Symbols > Symbol Sizes\n                           \n\n\n\n                            Determines the relative size for map points. The default is medium.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Symbols > Symbol Transparency\n                           \n\n\n\n                            Determines the transparency for map points. You can select any value from \"none\" (totally opaque) to 80% (almost transparent). The default is \"none.\" In the first example at right, the transparency has been set to \"none\"; in the second example, it has been set to 80%.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Scale > Symbol Borders\n                           \n\n\n\n                            When set, this option will show borders around the symbols on the map.\n                           \n\n\n\n\n\n\n\n\n                            Scale > Manual Minimum Value\n                           \n\n\n\n                            Allows you to set the minimum value in your scale.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Scale > Manual Maximum Value\n                           \n\n\n\n                            Allows you to set the maximum value in your scale.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Scale > Use Log Scale\n                           \n\n\n\n                            Allows you to convert your map scale to a logarithmic scale.\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Legend > Show Series Total in Legend As\n                           \n\n\n\n                            Lets you choose whether the series totals in the map legend are calculated as totals or averages or do not appear at all. The default is \"Total.\"\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Background > Color\n                           \n\n\n\n                            Lets you choose the lightness of the background. The default is\n                            \n                             Very Light\n                            \n                            . The example shows a map in which the background lightness has been set to\n                            \n                             Very Dark\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                        Aggregating rows\n                       \n\n                        You can aggregate like rows in a latitude-longitude map, and the map points reflect the aggregated values. In the following example, the user uploads a DataSet with two rows for \"Geneva.\"\n                       \n\n\n\n\n                        In the map, the individual values for \"Geneva\" are aggregated, and the corresponding map point is sized larger accordingly.\n                       \n\n\n\n\n                        Drilling from map to map\n                       \n\n                        With both U.S. state maps and latitude-longitude maps in which U.S. cities are represented, you can create \"zoomed\" drill layers by drilling down to the same map. For example, if you had a latitude-longitude map showing values per state and you added the same map as a drill layer, clicking any point in the country-level map would bring up a \"zoomed in\" state or region level that displayed all of the original data points from that state or region.\n                       \n\n                        Results from using this technique vary depending on the map type, your DataSet, and the specific columns you apply.\n                       \n\n                        For more information about adding drill layers to a chart, see\n                        \n                         Adding Drill Path to Your Chart\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043429213", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004707", "Archived Date": "", "Language": "English", "Primary Version": "Latitude-Longitude Map", "Article Total View Count": "12,457", "": "", "Article Created Date": "10/24/2022, 10:25 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Latitude-Longitude Map\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}