{"file_path": "../../raw_kb_v2\\article\\360042924474\\index.html", "content": {"Title": "Date Selector Card", "Article Body": "Intro\n                       \n\n                        Date Selector Cards display a calendar-style range of dates. When you add them to a Card Page in Domo, users visiting that Page can select a range of dates from the calendar as a filter. Alternatively, they can choose from a number of preset date filters such as \"Last year,\" \"Last 2 months,\" etc. The date filter you choose is applied to all other Cards on the Page. For example, if you selected all dates from April 1st to July 31st on the calendar, all other Cards in the Page would be filtered to show just the data for these dates. All Date Selector Cards have a 25,000 row limit.\n                       \n\n\n\n\n                        For information about other Filter Card types, see the following:\n                       \n\n\n\n\n                           Slicer, Checkbox, and Radio Button Cards\n                          \n\n\n\n\n\n                           Range Selector Card\n                          \n\n\n\n\n\n                         Video - Filter Chart Types\n                        \n\n\n\n\n\n\n                        Powering Date Selector Cards\n                       \n\n                        This type of graph requires two columns or rows of data from your DataSet. One of these contains a date column. You drop this column into the \"Date\" field in Analyzer.\n                        \n\n\n\n\n\n\n\n                        The other field is called \"Group By.\" Though this field is required to power up the Card, in general it doesn't matter what column you drop here. If you need to aggregate the data, you can use this column to do so. For example, if the date column is duplicated in your DataSet, you can make the dates unique by aggregating.\n                       \n\n                        For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        Customizing Date Selector Cards\n                       \n\n                        You can customize the appearance of a Date Selector Card by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        . Unique properties of Date Selector Cards include the following:\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Selected Color\n                           \n\n\n\n                            Lets you change the highlight color used when you select a range of calendar dates in the Card.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > Highlight Today\n                           \n\n\n\n                            When checked, a box appears around today's date in the calendar. In the example at right, the date of \"July 25\" is highlighted.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > View\n                           \n\n\n\n                            Determines the calendar view that is used. The following options are available:\n                           \n\n\n\n\n                               Auto\n                              \n                              (Default). The view is determined automatically based on your data. For example, if you had at least a year's worth of data in your date column, a yearly view would be used.\n                             \n\n\n\n\n                               Last Year Rolling\n                              \n                              . The calendar shows dates from a year ago up until the current month. This is the option shown in the example at right.\n                             \n\n\n\n\n                               Next Year Rolling\n                              \n                              . The calendar shows dates from the current month up until a year from now.\n                             \n\n\n\n\n                               Year\n                              \n                              . The current year is shown.\n                             \n\n\n\n\n                               Month\n                              \n                              . The current month is shown.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n                            General > Dates From\n                           \n\n\n\n                            Specifies whether the dates that appear in the calendar are based on the current date, are automatically determined based on your data, or are user-specified (in which case, you will enter the date parameters in the\n                            \n                             Year\n                            \n                            ,\n                            \n                             Selected Year\n                            \n                            , and\n                            \n                             Month\n                            \n                            fields.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Year\n                           \n\n\n\n                            Determines whether the year shown in the calendar is the current year, the previous year, or the next year. You can also specify a year by selecting\n                            \n                             Specified\n                            \n                            and entering the desired year in the\n                            \n                             Selected Year\n                            \n                            field. This option is only available when\n                            \n                             Dates From\n                            \n                            is set to\n                            \n                             User Specified\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Selected Year\n                           \n\n\n\n                            Lets you enter a specific year to be shown in the calendar. This option is only available when\n                            \n                             Dates From\n                            \n                            is set to\n                            \n                             User Specified\n                            \n                            and\n                            \n                             Year\n                            \n                            is set to\n                            \n                             Specified\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Month\n                           \n\n\n\n                            Lets you enter a specific month to be shown in the calendar. This option is only available when\n                            \n                             Dates From\n                            \n                            is set to\n                            \n                             User Specified\n                            \n                            and\n                            \n                             View\n                            \n                            is set to\n                            \n                             Month\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > First Day of Week\n                           \n\n\n\n                            Lets you select the first day of the week to be shown in your calendar. In the example at right, the first day of the week is Monday.\n                           \n\n\n\n\n\n\n\n\n\n                           General > First Month Displayed\n                          \n\n                           Lets you select the first month of the year to be shown in your calendar. This option is only available when\n                           \n                            Year\n                           \n                           is selected in the\n                           \n                            View\n                           \n                           menu.\n                          \n\n                           —", "Preview Article": "Click here to preview", "URL Name": "360042924474", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004722", "Archived Date": "", "Language": "English", "Primary Version": "Date Selector Card", "Article Total View Count": "6,081", "": "", "Article Created Date": "10/24/2022, 10:25 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Date Selector Card\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}