{"file_path": "../../raw_kb_v2\\article\\5714345629207\\index.html", "content": {"title": "\n\n\n Weathernews Connector\n\n\n", "article_body": "\n\nIntro\n=======\n\nWeathernews' Weather Data API provides weather data that can be used for a variety of businesses. For example, in the retail industry, the ability to analyze in detail the relationship between weather conditions around a store and the number of customers and sales enables advanced business optimization and marketing.\n\n\n You connect to your Weathernews account in the Data Center. This topic discusses the fields and menus that are specific to the Weathernews connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n===============\n\nTo connect to your Weathernews account and create a DataSet, you must have the following:\n\n The API Key for your Weathernews Account.\n\nAPI Keys can be obtained by signing up for\n\nWxTech®\n\nservice.\n\n\n Connecting to Your Weathernews Account\n========================================\n\nThis section enumerates the options in the Credentials and Details panes in the Weathernews Connector page. The components of the other panes in this page, Scheduling and Name & Describe Your DataSet, are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Credentials Pane\n------------------\n\nThis pane contains fields for entering credentials to connect to your Weathernews account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n API Key\n  |\n Enter your Weathernews API Key.\n  |\n\nFor information about obtaining these credentials, see\n\n\n**Prerequisites**\n\n\n above.\n\n\n Once you have entered valid Weathernews credentials, you can use the same account any time you go to create a new Weathernews DataSet. You can manage connector accounts in the\n\n\n**Accounts**\n\n\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n Details Pane\n--------------\n\nThis pane contains a primary\n\n\n**Reports**\n\n\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n| **1km メッシュ ピンポイント天気予報 - 短期予報(1時間ごと72時間)**  |\n Obtains the weather forecast for the specified latitude and longitude. Retrieves hourly weather forecast data for the next 72 hours, calculated on a 1 km grid based on latitude and longitude.\n  |\n| **1km メッシュ ピンポイント天気予報 - 中期予報(1日ごと10日間)**  |\n Obtains the weather forecast for the specified latitude and longitude. Retrieves 10-day daily weather forecast data calculated for each 1 km grid based on latitude and longitude.\n  |\n| **1km メッシュ 過去天気データ**  |\n Retrieves historical weather data for a 1 km mesh containing the specified latitude and longitude. For historical data, data since 2018-01-01 is supported. As for the observation frequency, the data for this period are those observed at 1-hour intervals. The latitude and longitude that can be specified are limited to within Japan. Note that data may be missing for various reasons, which may result in missed observations. This includes cases of failure such as periodic maintenance or equipment failure. Values are expressed as -999 or -9999 in areas where no data exist.Data for the previous day is updated at 3 AM JST.\n\n*Date**\n\n\n parameter is required.\n  |\n\n|\n|\n Lat\n  |\n Specify the latitude of the location from which weather forecast data or historical weather data will be retrieved. The range that can be specified is limited to within Japan.\n  |\n|\n Lon\n  |\n Specify the longitude and latitude of the location from which weather forecast data or historical weather data will be retrieved. The range that can be specified is limited to within Japan.\n  |\n|\n Date\n  |\n When retrieving the\n\n\n**1km メッシュ 過去天気データ**\n\n\n report, specify the date to be retrieved.\n\nHowever, please note that an error will occur if today's date is specified due to API specifications.*\n\nSelect in\n\n\n**Date Type**\n\n\n from the followings whether the report data is for a specific date or for a relative number of days back from today:\n\n\n|  |  |\n| --- | --- |\n|\n Single date\n  |\n Select the specific or relative single date.\n  |\n|\n Date range\n  |\n Select the specific or relative date range.\n  |\n|\n Time period\n  |\n Select the time period from\n\n\n Time period dropdown for your report.\n  |\n\n\n |\n|\n Date - Date\n  |\n Select in\n\n\n**Date Type**\n\n\n from the followings whether the report data is for a specific date or for a relative number of days back from today:\n\n\n|  |  |\n| --- | --- |\n|\n Relative\n  |\n Enter the number of days back that you would like to get data for in the\n\n\n**Days Back**\n\n\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Specific\n  |\n Select the specific date using the date selector in the\n\n\n**Date**\n\n\n field.\n  |\n\n|\n|\n Date - Start Date\n  |\n Select in\n\n\n**Date Type**\n\n\n from the followings:\n\n\n|  |  |\n| --- | --- |\n| **Relative**  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n\n\n**End Date**\n\n\n to create a range of represented days.\n\nFor example, if you entered\n\n\n`10`\n\n\n for\n\n\n**Start Date**\n\n\n and\n\n\n`5`\n\n\n for\n\n\n**End Date**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n| **Specific**  |\n Select the first date in your date range using the date selector.\n  |\n\n|\n|\n Date - End Date\n  |\n Select in\n\n\n**Date Type**\n\n\n from the followings:\n\n\n|  |  |\n| --- | --- |\n|\n Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n\n\n**Start Date**\n\n\n to create a range of represented days.\n\n\n For example, if you entered\n\n\n`10`\n\n\n for\n\n\n**Start Date**\n\n\n and\n\n\n`5`\n\n\n for\n\n\n**End Date**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n\n|\n|\n Date - Time period\n  |\n Choose the time period for which you would like to receive data.\n  |\n\nOther Panes\n-------------\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the Weathernews API does this connector use?\n\nThis connector uses version 1 of the Weathernews API.\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n 1km メッシュ ピンポイント天気予報 - 短期予報(1時間ごと72時間)\n  | `/api/v1/ss1wx`  |\n|\n 1km メッシュ ピンポイント天気予報 - 中期予報(1日ごと10日間)\n  | `/api/v1/ss1wx`  |\n|\n 1km メッシュ 過去天気データ\n  | `/api/v1/ss1wx`  |\n\n\n####\n Are there any API limits that I need to be aware of?\n\nAPI is set to be called up at most 50 times per second for each API Key. Please note that\n\n\n**1km メッシュ 過去天気データ**\n\n\n requires API calls for a number of days.\n\n###\n How frequently does my data update?\n\n\n* 1km メッシュ ピンポイント天気予報 - 短期予報(1時間ごと72時間)\n\nYour data can be retrieved every hour.\n\n 1km メッシュ ピンポイント天気予報 - 中期予報(1日ごと10日間)\n\nYour data can be retrieved every day.\n\n 1km メッシュ 過去天気データ\n\nYour data can be retrieved every day. Yesterday's data will be updated at 3:00 AM Japan time.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 5714345629207\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003819\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nWeathernews Connector\n\n", "article_total_view_count": "\n\n\n 4,780\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "weathernews_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "available_custom_connectors", "url": "/s/topic/0TO5w000000ZaoVGAS"}]}