{"file_path": "../../raw_kb_v2\\article\\360043212294\\index.html", "content": {"Title": "Scheduling a Job in Workbench 5", "Article Body": "You can schedule a DataSet job to routinely upload data from external DataSets to Domo. You can select a basic update frequency (once per day, once per week, etc.) or configure advanced scheduling options (such as setting an exact time, choosing specific days of the week or month, or setting update intervals within a specific daily timeframe). Or, if the data source is a local file, you can have Workbench run the job anytime the source file is updated.\n                       \n\n                        For more information about the schedule job settings, see\n                        \n                         Understanding the Workbench 5 User Interface.\n                        \n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           When running on a schedule, Workbench uses the local system account to access the file. If the local system does not have access to the file, an error appears saying the file could not be accessed. You can get around this by changing the settings for Domo in Windows Services so you can run the DataSet Job with your own account, which has access to the file.\n                          \n\n\n\n\n\n\n\n\n\n\n\n                             Notes:\n                            \n\n\n\n\n                              The\n                              \n                               Update when file is changed\n                              \n                              option works only when the file being watched is on the same PC as Workbench.\n                             \n\n\n                             A scheduled DataSet job sends data from the specified DataSet to Domo.\n                             \n                             You can view the DataSet information in Domo by clicking\n                             \n                              Data\n                             \n                             . For more information, see\n                             \n                              Data Center Layout\n                             \n                             .\n                             \n                             If there are any errors in the data, the DataSet is not sent to Domo. You can review logged information in the log files.\n                            \n\n\n                              A scheduled DataSet job uses the same update setting used when uploading data manually.\n                             \n\n\n\n                              You can receive an email report when a scheduled DataSet job runs. For more information, see\n                              \n                               Setting Notifications in Workbench 5\n                              \n                              .\n                             \n\n\n\n                              You can disable a scheduled DataSet job by changing the schedule to update manually.\n                             \n\n\n\n\n\n\n\n\n                         To set a BASIC update schedule for a DataSet job,\n                        \n\n\n\n\n                          In the jobs listing in the\n                          \n                           Jobs\n                          \n                          pane, double-click on the DataSet job you want to set an update schedule for.\n                          \n\n\n\n\n\n\n                          Click the\n                          \n                           Schedule\n                          \n                          subtab.\n                          \n\n\n\n\n\n\n                          Select the radio button for the desired scheduling option.\n                         \n\n\n\n                            Select\n                            \n                             Update manually\n                            \n                            if you intend to run this job manually instead of on a schedule or automatically when the data source changes.\n                           \n\n\n\n                            Select\n                            \n                             Update when file is changed\n                            \n                            if you want the job to run anytime the data source is updated (local files only).\n                           \n\n\n\n                            Select\n                            \n                             Update on a schedule\n                            \n                            if you want the job to run on a schedule.\n                           \n\n\n\n\n\n                          (Conditional) If you selected\n                          \n                           Update on a schedule\n                          \n                          in step 3, configure options as desired.\n                          \n\n                          For example, if you select an update frequency of less than a day, you have the option to specify a range of hours when updating is active. If you select\n                          \n                           Every Mont\n                          \n\n                           h\n                          \n                          as the update frequency, you are prompted to enter the time of day as well as the days of the month when updating will occur.\n                         \n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n                            \n\n\n\n\n\n\n\n                         To set an ADVANCED update schedule for a DataSet job,\n                        \n\n\n\n\n                          In the jobs listing in the\n                          \n                           Jobs\n                          \n                          pane, double-click on the DataSet job you want to set an update schedule for.\n                          \n\n\n\n\n\n\n                          Click the\n                          \n                           Schedule\n                          \n                          subtab.\n                          \n\n\n\n\n\n                         Click the\n                         \n                          Advanced Schedule\n                         \n                         subtab.\n                         \n\n\n\n\n                         Configure your desired update schedule using the available options.\n                         \n\n                           By combining options from the three columns, you can create very specific update schedules. For example, you could choose\n                           \n                            Once a day\n                           \n                           from the first column and set the daily update to occur at 8:00 p.m.; you could have this happen on Wednesday and Saturday by choosing\n                           \n                            Specific days of the week\n                           \n                           in the second column then checking the boxes for Wednesday and Saturday; and you could ensure this happens every month by choosing the\n                           \n                            Every month\n                           \n                           radio button in the third column.\n                          \n\n                           For\n                           \n                            More than once a day\n                           \n                           , you choose the interval at which updates occur (every 15 minutes, every 30 minutes, or every hour). You can also set a timeframe during which updates are made by checking the\n                           \n                            Active during hours\n                           \n                           box then entering the desired hours for the timeframe.\n                           \n\n\n\n\n\n\n                                Note:\n                               \n                               If you need your DataSet to update faster than every 15 minutes, please reach out to your account team for evaluation.\n                              \n\n\n\n\n\n\n\n\n\n                         To disable a scheduled job,\n                        \n\n\n\n\n                          In the jobs listing in the\n                          \n                           Jobs\n                          \n                          pane, double-click on the DataSet job you want to disable scheduling for.\n                         \n\n\n\n                          Click the\n                          \n                           Schedule\n                          \n                          subtab.\n                         \n\n\n\n                          In the\n                          \n                           Update\n                          \n                          menu, select\n                          \n                           Manually\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                            Tips:\n                           \n                           If a scheduled job does not run when you expect,\n                           \n\n\n                              Check the log files for errors.\n                             \n\n\n\n                              Ensure that the machine is properly connected to the network and the Internet.\n                             \n\n\n\n\n\n\n\n                        Group scheduling options\n                       \n\n                        With the group scheduling options available in Workbench 5, you can create job dependencies or select jobs to run as a group. For example, with schedule groups, if a job fails in your data pipeline, you can stop subsequent jobs from running. Or, if you need to wait for your source data systems to finish updating, you can schedule a group of jobs to run at the same time after your source data is ready.\n                       \n\n                        Note that jobs must be set to\n                        \n                         manual\n                        \n                        scheduling (see above for more info) to be available for group scheduling. Also be aware that any given job can be on a regular schedule or a group schedule but not both.\n                       \n\n\n                         To set a group schedule,\n                        \n\n\n\n                         In Workbench, click the\n                         \n                         icon in the toolbar on the left side of the screen.\n                        \n\n                         Click\n                         \n                          Group Schedules\n                         \n                         .\n                        \n\n                         Click the \"+\" button in the upper right corner of the screen.\n                         \n                         A list of jobs appears.\n                        \n\n                         Check the boxes for all jobs you want in your schedule group.\n                        \n\n                         Scroll down to the\n                         \n                          Run order\n                         \n                         area.\n                        \n\n                         Set the run order for the jobs.\n                         \n                         You can move jobs up or down in the order by selecting them then clicking\n                         \n                         or\n                         \n                         , respectively, in the upper right corner; you can delete a job from the group by selecting it then clicking the trash can icon; you can choose to run selected jobs either with or after the previous job in the list by choosing the desired option in the\n                         \n                          Run\n                         \n                         menu; and you can mark jobs as critical by checking the\n                         \n                          Critical\n                         \n                         box for a job.\n                        \n\n                         Scroll down to the\n                         \n                          Schedule\n                         \n                         area.\n                        \n\n                         Configure a basic or advanced schedule for the job, following the instructions provided in the previous section.\n                        \n\n                         Enter a name for the group schedule in the\n                         \n                          Name\n                         \n                         field.\n                        \n\n                         Click\n                         \n                          Done\n                         \n                         .", "Preview Article": "Click here to preview", "URL Name": "360043212294", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004804", "Archived Date": "", "Language": "English", "Primary Version": "Scheduling a Job in Workbench 5", "Article Total View Count": "2,656", "": "", "Article Created Date": "10/24/2022, 10:31 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Scheduling a Job in Workbench 5\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Workbench\n              \n", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "\n\n               Workbench 5\n              \n", "url": "/s/topic/0TO5w000000ZapTGAS"}]}