{"file_path": "../../raw_kb_v2\\article\\360042927234\\index.html", "content": {"title": "\n\n\n Salesforce Radian6 Advanced Connector\n\n\n", "article_body": "\n\nIntro\n\n﻿\n------------\n\nSalesforce Radian6 enables users to listen to, analyze, and be engaged in customers’ conversations about their company, products, and competitors.\n\n\n Use Domo's Salesforce Radian6 connector to extend the functionality of the Salesforce Marketing Cloud. With the Radian6 API, you can\n\n create custom reporting and make your own visualizations.\n* extract post data directly from your Topic Profiles.\n* extract the data from visualizations or widgets from the Radian6 Dashboard.\n* access appended post data like post tags and source tags.\n\nTo learn more about the Salesforce Radian6 API, visit their website (\n\nhttps://developer.salesforce.com/docs/atlas.en-us.salesforce1api.meta/salesforce1api/radian6\\_intro.htm\n\n).\n\n\n The Salesforce Radian6 connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Salesforce Radian6 account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the Radian6 connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n This is the \"advanced\" version of the connector, which includes more report types and configuration options than the standard version. For more information about the standard version, see\n\nSalesforce Radian6 Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Salesforce Radian6 account and create a DataSet, you must have the following:\n\n Your Radian6 username and password.\n* Your Radian6 API key. If you do not know your API key, contact your Salesforce Radian6 account representative.\n\nConnecting to Your Salesforce Radian6 Account\n-----------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Salesforce Radian6 Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Salesforce Radian6 account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Radian6 Environment\n  |\n Select the Radian6 environment you want to connect to.\n  |\n|\n Username\n  |\n Enter the username you use to log into your Radian6 account.\n  |\n|\n Password\n  |\n Enter the password you use to log into your Radian6 account.\n  |\n|\n API Key\n  |\n Enter your Radian6 API key. If you do not know your API key, contact your account representative.\n  |\n\nOnce you have entered valid Radian6 credentials, you can use the same account any time you go to create a new Radian6 DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a\n **Report**\n menu in which you can select a Radian6 report type. Other menus and fields may appear depending on the report you've selected.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select a Radian6 report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Conversation Cloud\n  |\n Returns Conversation Cloud information for a given number of past hours, with filters on topics, advanced filter types and extended media types.\n  |\n|\n Insight Segmentation\n  |\n Returns insight segmentation information for the given date or date range.\n  |\n|\n Number of Posts\n  |\n Returns the number of posts for all topics.\n  |\n|\n Radian6 River of News\n  |\n Returns River of News post content for a given number of past hours.\n  |\n|\n Radian6 River of News by Keyword Group\n  |\n Returns River of News post content for a given number of past hours, broken down by keyword group.\n  |\n|\n Topic Information\n  |\n Returns topic information for the given set of credentials.\n  |\n|\n Topic Trends\n  |\n Returns time series data for a selected topic.\n  |\n\n\n |\n|\n Topic ID/Topic Profile ID\n  |\n Enter the topic ID(s) you want to retrieve information for. Enter\n\nAll\n\nto retrieve information for all topics. To retrieve multiple topics for the \"River of News\" reports, enter the names separated by commas. For example:\n\n123,456,789.\n\nMultiple IDs are not supported in the \"Insight Segmentation\" report.\n  |\n|\n Topics/Topics Profile\n  |\n Select the topics you want to retrieve report data for.\n  |\n|\n Advanced Filter Types\n  |\n Select all of the advanced filter types you want to use to pull data.\n  |\n|\n Extended Media Types\n  |\n Select all of the extended media types you want to use to pull data.\n  |\n|\n Hours\n  |\n Enter the number of past hours you want to retrieve data for.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date, a date range, or a given number of hours back.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n View By\n  |\n Select the first insight that will be shown in the report.\n  |\n|\n Segment By\n  |\n Select the insight that will be used to segment the results in the report after the\n **View By**\n insight.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042927234\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003726\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSalesforce Radian6 Advanced Connector\n\n", "article_total_view_count": "\n\n\n 4,655\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "salesforce_radian6_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}