{"file_path": "../../raw_kb_v2\\article\\360043429233\\index.html", "content": {"Title": "Line Chart", "Article Body": "Intro\n                       \n\n\n\n                        A basic line chart uses a single trendline to display data, usually for a series of dates or times. Most line charts display lines horizontally—that is, you scroll left or right to follow the lines. In these horizontal charts, category data appears on the horizontal axis (x-axis) and value data appears on the vertical axis (y-axis). Domo also includes several vertical line charts, in which you scroll up or down to follow the lines. In vertical line charts, category data appears on the y-axis and value data appears on the x-axis.\n                       \n\n                        Powering line charts\n                       \n\n                        Line charts require only two columns or rows of data from your DataSet—one for categories (generally dates or times) and one for values. However, you can add series columns to a basic line chart if you want. Adding series data to a line chart may turn it into a\n                        \n                         multi-line chart\n                        \n                        or may simply show the two lines side by side, depending on the data.\n                       \n\n                        For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        There are several different sub-types of basic line charts. These are built in the same way as regular line charts but have different features.\n                       \n\n\n\n                          Horizontal symbol line\n                         \n\n\n\n                          Horizontal step line\n                         \n\n\n\n                          Horizontal curved line\n                         \n\n\n\n                          Horizontal curved symbol line\n                         \n\n\n\n                          Running total line (discussed in more detail\n                          \n                           here\n                          \n                          )\n                         \n\n\n\n                          Vertical symbol line\n                         \n\n\n\n                          Vertical curved line\n                         \n\n\n\n                          Vertical step line\n                         \n\n\n\n                          Vertical symbol line\n                         \n\n\n\n                          Vertical curved symbol line\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Symbols are auto-selected based on the series. You cannot assign a specific symbol to a given series.\n                           \n\n\n\n\n\n                        All of these line chart types become\n                        \n                         multi-line charts\n                        \n                        if series data is present.\n                       \n\n                        For information about and screenshots of these chart sub-types, see\n                        \n                         Available Chart Types\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your line chart. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Visualization Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from a typical column-based spreadsheet is converted into a basic horizontal line chart:\n                       \n\n\n\n\n                        The following graphic shows you how the data from a typical column-based spreadsheet is converted into a vertical line chart:\n                       \n\n\n\n\n                        Customizing line charts\n                       \n\n                        You can customize the appearance of a line chart by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        . Unique properties of line charts include the following. You can click a thumbnail image to see a larger image.\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Show Right Scale\n                           \n\n\n\n                            Includes a second vertical scale in most kinds of multi-line line charts, with or without date or time data. This is useful in situations where you want to display lines with vastly different value increments in the same chart. In the example at right, the left scale shows values in increments of $20,000 and the right scale shows values in increments of 2. Because two scales are present, both lines can be interpreted independently on their own scales. If there was only one scale, the $20,000 increments would be used for both lines, so one of the lines would appear flat.\n                           \n\n                            This property (and\n                            \n                             General >\n                            \n\n                             lines on Left Scale\n                            \n                            ) can only be used in line charts with more than one line. All line chart subtypes are compatible except for step line charts.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            General > Lines on Left Scale\n                           \n\n\n\n                            When\n                            \n                             Show Right Scale\n                            \n                            is checked, determines how many of the lines in the chart are measured on the left scale. All additional lines are measured on the right scale. If\n                            \n                             Show Right Scale\n                            \n                            is not checked, this property does not work.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Sync Zero Lines\n                           \n\n\n\n                            Syncs the zero lines in dual-scale charts with negative values so the \"0\" values match. For line charts, this works only when\n                            \n                             General > Show Right Scale\n                            \n                            is checked.\n                           \n\n                            The first example at right shows a dual-scale chart with scales that do not match. The right-side chart is being used to measure sales, which are always going to be positive; hence the scale starts at 0. However, the left-side scale is being used to measure profit, which may dip below 0. In this case the scale starts at -2000. Because the scales do not match, the chart is difficult to interpret.\n                           \n\n                            The second example shows the same chart with the zero lines synced. Even though the other values do not match, the viewer can easily use the zero line as a reference point to interpret the line and bars simultaneously.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Category Scale > Never Use Time Scale\n                           \n\n\n\n                            Determines which type of timeline is used in supported charts with time data.\n                           \n\n                            By default, when time data is used in supported charts, such as line and bar charts, Domo automatically makes it appear using a\n                            \n                             date grain\n                            \n                            appropriate for your data. This is shown in the first example at right, in which the timeline takes date data spanning several months and shows it by month.\n                           \n\n                            If you check this box, however, date data appears as it does in your DataSet. This is shown in the second example at right, in which the time scale uses individual dates, as in the DataSet.\n                           \n\n                            This option is\n                            \n                             not\n                            \n                            available for step line charts.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Grid lines > Remove Min/Max/Avg lines\n                           \n\n\n\n                            Removes the minimum, maximum, and average lines that normally display on mouse-over in standard bar and line charts.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Last Value Projection > Project Using\n                           \n\n\n\n                            Determines whether a final value is projected in bar and line charts and, if so, how this value is determined. You can enter a specific value for a projection or set Domo to project a value automatically by...\n                           \n\n\n\n                              taking the current value for the period and comparing it to the previous period (forecasting),\n                             \n\n\n\n                              taking the average of the previous points in the chart, or\n                             \n\n\n\n                              using a linear regression.\n                             \n\n\n\n                            The example at right shows a line chart in which a final value has been projected using a linear regression. For more information, see\n                            \n                             Projecting the Last Value in Your Chart\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Last Value Projection > Projection Value\n                           \n\n\n\n                            Lets you specify the final projected value in a bar or line chart. This only works if you have selected\n                            \n                             Specified Value\n                            \n                            as the\n                            \n                             Project Using\n                            \n                            property. For more information, see\n                            \n                             Projecting the Last Value in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Last Value Projection > Previous Values to Average\n                           \n\n\n\n                            Lets you specify the number of points to average to determine the final projected value in a bar or line chart. This only works if you have selected\n                            \n                             Average Previous Values\n                            \n                            as the\n                            \n                             Project Using\n                            \n                            property. For more information, see\n                            \n                             Projecting the Last Value in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Scale Marker Range > Minimum Value\n                           \n\n\n\n                            Lets you specify the minimum value for a scale marker range in a line chart. This value makes up the bottommost border of the range in the chart. The example at right shows a typical line chart in which a scale marker range has been set, with the arrow pointing out the minimum value of the range. For more information, see\n                            \n                             Adding a Scale Marker Range to Your Chart\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Scale Marker Range > Maximum Value\n                           \n\n\n\n                            Lets you specify the maximum value for a scale marker range in a line chart. This value makes up the topmost border of the range in the chart. The example at right shows a typical line chart in which a scale marker range has been set, with the arrow pointing out the maximum value of the range. For more information, see\n                            \n                             Adding a Scale Marker Range to Your Chart\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Scale Marker Range > Color\n                           \n\n\n\n                            Lets you select the color for the scale marker range in a line chart. For more information, see\n                            \n                             Adding a Scale Marker Range to Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Scale Marker Range > Show lines\n                           \n\n\n\n                            Determines whether minimum and maximum lines are shown for scale marker ranges in line charts. For more information, see\n                            \n                             Adding a Scale Marker Range to Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Scale Marker Range > Fill Outliers\n                           \n\n\n\n                            Determines whether outlier regions (that is, regions of a line falling outside of a scale marker range) are filled in line charts in which scale marker ranges have been set. The example at right shows a typical line chart in which a scale marker range has been set, with arrows pointing out the filled outliers. For more information, see\n                            \n                             Adding a Scale Marker Range to Your Chart\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            General > Show as Running Totals\n                           \n\n\n\n                            Lets you specify whether lines appear with running totals in several kinds of horizontal line charts. In other words, each point in a series line displays the cumulative total of all points in the line up to that point.\n                           \n\n                            The example screenshots show the same curved line chart without and with running totals. In the first example,\n                            \n                             Show as Running Totals\n                            \n                            is off so the chart appears with each data point reflecting only the new data up to that point. In the second example,\n                            \n                             Show as Running Totals\n                            \n                            is on so each data point reflects all of the data in the line up to that point.\n                           \n\n                            This property is available for the following kinds of line charts: curved line, step line, symbol line, and curved symbol line. Several types of charts have built-in running total functionality, so there is no need to set a chart property. These include the following:\n                            \n                             running total bar charts\n                            \n                            ,\n                            \n                             running total grouped bar charts\n                            \n                            ,\n                            \n                             running total stacked bar charts\n                            \n                            , and\n                            \n                             running total line charts\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Regression line > Show Linear Regression Line\n                           \n\n\n\n                            Allows you to add a regression line to your line chart. Regression lines are available for most line chart subtypes but is not available for multi-line charts.\n                           \n\n                            In the example at right, the dashed orange line represents the regression line.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Regression line > Include Last Data Point\n                           \n\n\n\n                            Determines whether the last data point in your line chart is included in the calculation for the regression line. If your chart shows a timeline that is not complete (for example, November appears as the last month in the timeline but has not yet ended), you should check this box.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Regression line > Line Style\n                           \n\n\n\n                            Lets you specify whether your regression line is solid or dashed (default).\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Regression line > Line Color\n                           \n\n\n\n                            Lets you select the color for the regression line.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Outlier Filtering > Show When Points Above\n                           \n\n\n\n                            Filters your line chart to show only those lines with any values above the value you specify. Note that\n                            \n                             any\n                            \n                            values above this threshold count toward this filter. So if you entered\n                            \n                             5000\n                            \n                            for this value, and only one point exceeded 5000, the line would still appear.\n                           \n\n                            If you enter a value in\n                            \n                             Show When Points Above\n                            \n                            that is less than the value you enter in\n                            \n                             Show When Points Below\n                            \n                            , only lines with\n                            \n                             all\n                            \n                            points between these two values are displayed.\n                           \n\n                            For more information about this property, including examples, see\n                            \n                             Filtering Outliers in a Line Chart\n                            \n                            .\n                           \n\n\n                           —\n                          \n\n\n\n                           Outlier Filtering > Show When Points Below\n                          \n\n\n                            Filters your line chart to show only those lines with any values below the value you specify. Note that\n                            \n                             any\n                            \n                            values below this threshold count toward this filter. So if you entered\n                            \n                             5000\n                            \n                            for this value, and only one point fell below 5000, the line would still appear.\n                           \n\n                            If you enter a value in\n                            \n                             Show When Points Below\n                            \n                            that is greater than the value you enter in\n                            \n                             Show When Points Above\n                            \n                            , only lines with\n                            \n                             all\n                            \n                            points between these two values are displayed.\n                           \n\n                            For more information about this property, including examples, see\n                            \n                             Filtering Outliers in a Line Chart\n                            \n                            .\n                           \n\n\n                           —\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can now create Line charts that apply Color Rules to each point on the line individually. You can set it to change the color when it is above, below, or between certain thresholds. The Line chart must have Symbols enabled in order for the colors to show.\n                          \n\n\n\n\n\n\n                          Video - How to Add Regression Lines", "Preview Article": "Click here to preview", "URL Name": "360043429233", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004703", "Archived Date": "", "Language": "English", "Primary Version": "Line Chart", "Article Total View Count": "12,382", "": "", "Article Created Date": "10/24/2022, 10:25 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Line Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}