{"file_path": "../../raw_kb_v2\\article\\360043430573\\index.html", "content": {"title": "\n\n\n Changing the Default Sentiment for Insights\n\n\n", "article_body": "\n\nThe Insights subtab, located in the\n\nCard Details view\n\n, provides an analysis of the elements of the Card, automatically generated by \"Mr. Roboto,\" Domo's native Natural Language Generation tool. By default, Mr. Roboto assumes that increasing values are positive and decreasing values are negative and may use such language in describing change. For example, it may say something like \"Good news, your Sales Revenue has gone up in the last month.\" This makes sense because an increase in sales revenue is seen as positive for a company. However, what if your Card measures success by decreasing rather than increasing values? For example, if your Card shows the number of injuries received by soccer players in the last year, it would be strange to receive a message reading, \"Good news, your Soccer Injuries have gone up in the last year.\"\n\n\n Luckily there is a way to get around this and ensure that positive change is associated with negative sentiment, and vice-versa. You must do this on the DataSet level, by adding a specific tag to the column you want to have positive or negative sentiment. The tags are...\n\n upsentiment:good\n\nif positive change for this column is to be associated with positive sentiment\n* upsentiment:bad\n\nif positive change for this column is to be associated with negative sentiment\n\nSo for our soccer injuries example, you could change the default sentiment by going into the details view for the DataSet powering the card and adding the tag\n\nupsentiment:bad\n\nto the column containing the number of injuries received.\n\n\n**To change the default sentiment for Insights,**\n\n. Open the Data Center.\n2. Locate the DataSet powering the Card you want to change the default sentiment for.\n3. Click on the\n **Data**\n tab.\n4. Click on the\n **Schema**\n subtab.\n5. Locate the column you want to update.\n6. Click\n **Add tag**\n .\n7. (Conditional) Add\n\nupsentiment:good\n\nas a tag if positive change for this column is associated with positive sentiment. Or add\n\nupsentiment:bad\n\nif positive change is associated with negative sentiment.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043430573\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004760\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nChanging the Default Sentiment for Insights\n\n", "article_total_view_count": "\n\n\n 4,781\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:30 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "changing_the_default_sentiment_for_insights", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "visualization_card_details_view_actions", "url": "/s/topic/0TO5w000000ZapOGAS"}]}