{"file_path": "../../raw_kb_v2\\article\\360043438973\\index.html", "content": {"title": "\n\n\n Managing Custom Roles\n\n\n", "article_body": "\n\n\n---\n\n***Note:****\n This feature is available\n **on demand.**\n\n\n To request that this feature be enabled,\n\n Contact\n\nTechnical Support\n* Reach out to your Domo Customer Success Manager or Technical Consultant.\n\nDepending on the feature, you may be required to complete training before you can use the feature.\n\n--\n\n*Note:**\n This feature is available for enterprise users only.\n\n\n Intro\n-------\n\nDomo has always provided\n\nbuilt-in security roles\n\nsuch as Admin, Privileged, and Participant that are used to restrict access to sensitive Domo features. These roles govern which users in your Domo instance can perform sensitive tasks such as exporting data, inviting users, and changing company settings. With the Role Management tool, you can create and manage custom security roles, giving you more flexibility and finer granularity in assigning access to Domo's powerful features.\n\n\n Using Role Management, you can...\n\n Expand the list of roles beyond the current built-in roles (Admin, Privileged, Editor, Participant, and Social).\n* Manage the privileges assigned to each new role.\n* Delete unused roles.\n* Get easy reporting on the privileges and list of assigned users in each new role.\n* Use SSO to automatically assign people to appropriate roles through a SAML assertion at each login.\n\nYou can create as many custom roles as needed for your organization.\n\n\n The Role Management tool is available in the Admin Settings in Domo, by selecting\n **More**\n**> Admin  > Governance > Roles**\n . You must have an Admin default security role or a custom role with the Manage All Roles grant enabled to access this tool.\n\n*Video - Role Management**\n\nUnderstanding the Role Management Interface\n---------------------------------------------\n\nThe Role Management area in Admin Settings is made up of three main tabs as well as several other tabs you can access from the main tabs.\n\n##\n Roles Tab\n\nThe\n **Roles**\n tab is the initial tab you see when you click\n **Roles**\n in the Admin Settings. The following screenshot shows a typical view of this tab:\n\nThis tab lists all of the roles in your Domo, both the default roles (Admin, Privileged, Editor, Participant, and Social) as well as any custom roles you have created. Default roles are referred to in the UI as Domo roles. Grants for these roles\n *cannot*\n be altered. User-created roles are referred to as Custom roles. Custom roles\n *can*\n be edited as necessary.\n\n\n For each role in the list, you can see all of the following:\n\n The description of the role\n* The number of grants (privileges) available for this role\n* The number of people in your Domo instance who have been assigned this role\n* The date when the role was created.\n\nYou can search for roles by name or sort the roles in the list using any of a number of sort methods, such as role name, number of grants, etc.\n\n\n In this tab you can also do the following:\n\n Create a copy of any existing role (Domo or custom) by clicking the\n **New**\n button and choosing the role you want to copy. This opens the Edit view for the role, in which you can select or deselect the privileges available for this role. This subtab is described in more detail in the next section. (You can also open this subtab for an existing role by clicking the role name in the\n **Roles**\n tab.)\n* Specify the default role for new users in your Domo added either through invitation or SSO.\n\n\n####\n Role Edit View\n\nWhen you click on a role in the\n **Roles**\n tab or you click\n **New**\n in that tab to copy an existing role, you are taken to an edit view in which you can select or deselect privileges assigned to the role as well as manage users with that role. This view comprises two distinct subtabs—\n **Grants**\n and\n **People**\n .\n\n\n The following screenshot shows how the\n **Grants**\n subtab might appear for a typical user:\n\nThis subtab lists all of the grants (privileges) available in Domo, with checkboxes for each individual grant. For any custom role (\n *not*\n default Domo roles), you can check or uncheck boxes as desired to assign privileges to Domo users with that role. You can search for any grant by name using the\n **Search grants**\n box.\n\n\n The following screenshot shows how the\n **People**\n subtab might appear for a typical user:\n\nThis subtab lists all users in your Domo who have been granted this role. In You can switch one or more users to a different role by checking the boxes next to their names then selecting the new role in the\n **Change Role**\n menu that appears. You can also search for a particular user in the\n **Search people**\n box or choose a different sort method in the\n **Sort by**\n box.\n\n\n Both of these subtabs also provide access to the\n **Duplicate Role**\n and\n **Add People**\n options.\n\n\n**Duplicate Role**\n is useful as it allows you to duplicate any role, Domo or custom, by clicking\n **Duplicate Role**\n . This creates a copy of the role and gives it a default name by affixing a number to the original name (such as \"Privileged copy2\"). You can change the default name and description (which remains unchanged unless you manually change it) by clicking within the name of description and making the changes. Once you have duplicated a role, you can change the grant configuration as desired, even if the original role was a default Domo role.\n\n\n As an example, you might have a subset of users who should have Participant-level access\n *except*\n you also want them to be able to deploy Appstore apps. In this case, you could easily create the new role by duplicating the Participant role, checking the box that reads \"Use Appstore,\" and saving. The new role is now available in your Domo and can be granted to new or existing users as necessary.\n\n\n**Add People**\n opens a list of all users in your Domo, which appears similar to the following:\n\nHere you can quickly and easily switch users into the selected role by checking the boxes next to their names and clicking\n **Add People**\n . You can do this for individual or multiple users. You can also search for a particular user in the\n **Search people**\n box or choose a different sort method in the\n **Sort by**\n box.\n\n##\n Grants Tab\n\nYou open the\n **Grants**\n tab by clicking\n **Grants**\n in the main view that appears when\n **Roles**\n is selected in the left panel. The following screenshot shows this tab:\n\nThis tab lists all grants (privileges) available in Domo. For each grant, you can see the roles (both Domo and custom) to which the grant has been assigned; the number of roles out of the total roles that have the role assigned to them; the associated Domo feature, and the number of users with the grant bestowed. You can search for a specific grant using the\n **Search grants**\n field.\n\n###\n Grant Edit View\n\nWhen you click on a grant in the\n **Grants**\n tab, you are taken to an edit view in which you can select or deselect the roles with access to the grant. You can also see the number of grants for the role out of the total number of grants in Domo, as well as the number of users of your Domo instance with the role applied.\n\n\n The following screenshot shows this view for the \"Manage All Roles\" grant.\n\nYou can select or deselect grants for a selected role by checking/unchecking the boxes on the left. You\n *cannot*\n select or deselect default Domo roles (indicated by a lock icon) in this view.\n\n##\n People Tab\n\nYou open the\n **People**\n tab by clicking\n **People**\n in the main view that appears when\n **Roles**\n is selected in the left panel. The following screenshot shows this tab:\n\nThis tab lists all users of your Domo instance, together with their email addresses, roles, departments, and titles. Similar to the\n **Add People**\n listing that appears when you click the\n **Add People**\n button in the\n **Roles**\n edit view, you can switch select users into a different role by checking the boxes next to their names and clicking\n **Add People**\n . You can do this for individual or multiple users. You can also search for a particular user in the\n **Search people**\n box or choose a different sort method in the\n **Sort by**\n box.\n\n\n Performing Role Management Tasks\n----------------------------------\n\nThis section lays out the steps for performing the most common role management tasks, including creating and deleting new custom roles, switching users to a different role, and so on.\n\n##\n Creating Custom Roles\n\nIn Domo, you create new roles not by building them from scratch, but by using existing roles as templates. This is not only faster than building from the bottom up but also gives you the benefit of a foundation to work from; for example, you might decide you want to create a new role that is similar in most respects to the \"Privileged\" role but includes some additional capabilities not natively available to \"Privileged\" users.\n\n\n**To create a custom role,**\n\n. Click\n **More**\n**> Admin > Governance > Roles**\n .\n2. Do one of the following:\n\n* Click\n\t **New**\n\t in the top right corner of the\n\t **Roles**\n\t tab then select the existing role (either Domo or custom) that you want to base the new role off of.\n\t* In the\n\t **Roles**\n\t tab, navigate in the list to the role you want to base your new role off of and click that role. Then, in the edit view for the role, click\n\t **Duplicate Role**\n\t .\n\n Whichever method you choose, the end result is the same—a copy of the new role is created, with the edit view open so you can choose the grants that will be available for users with this role assigned. By default the new role takes the name \"\n\t *New Role*\n\t (copy).\"\n3. (Optional) If desired, give the new role a more descriptive name and description by clicking on the name/description and entering the new name/description in the field.\n4. In the grants list, check the boxes for privileges users with this role should have, and uncheck the boxes for privileges they should not have.\n5. Click the orange\n **Save**\n button to save your new grant configuration.\n\nThe new role is now available to be assigned to users in your Domo, together with all of its associated privileges and limitations. For more information about assigning a security role, see\n\nAssigning a Security Role to a User\n\n.\n\n##\n Modifying Custom Roles\n\nYou can modify the grant configuration for custom roles by clicking on them in the\n **Roles**\n tab and making your changes. You can\n *only*\n modify custom roles, i.e. those that have been created by you or other users in your Domo. You cannot modify any of the default Domo roles (Admin, Privileged, Editor, Participant, or Social).\n\n\n**To modify a custom role,**\n\n. Click\n **More**\n**> Admin > Governance > Roles**\n .\n2. In the list in the\n **Roles**\n tab, locate and click on the custom role you want to modify.\n3. Make changes to the grants available for users with this role as desired.\n4. Click the orange\n **Save**\n button to save your new grant configuration.\n\n\n###\n Deleting Custom Roles\n\nYou can delete custom roles by clicking on them in the\n **Roles**\n tab and clicking the trash can icon\n\n. You can\n *only*\n delete custom roles, i.e. those that have been created by you or other users in your Domo. You cannot delete any of the default Domo roles (Admin, Privileged, Editor, Participant, or Social).\n\n\n**To modify a custom role,**\n\n. Click\n **More**\n**> Admin > Governance > Roles**\n .\n2. In the list in the\n **Roles**\n tab, locate and click on the custom role you want to delete.\n3. Click the\n\nicon in the top right corner of the edit view.\n4. Click\n **OK**\n .\n\n\n###\n Assigning or Removing Roles to/from a Grant\n\nIn addition to assigning/removing grants to/from a role as explained above, you can also do the opposite—assigning roles to a grant or removing them if need be. For example, maybe you have built two custom roles called \"Privileged2\" and \"Editor2,\" and you want both groups to be able to manage alerts. Instead of having to open up and edit the grant configuration for both groups individually, you could simply locate and open the \"Manage All Alerts\" grant in the\n **Grants**\n tab then check the \"Privileged2\" and \"Editor2\" boxes. As with most other role management tasks, this is only possible with custom roles; you cannot manipulate the grant configuration for default Domo roles.\n\n\n**To assign or remove a custom role to/from a grant,**\n\n. Click\n **More**\n**> Admin > Governance > Roles**\n .\n2. Click the\n **Grants**\n tab.\n3. In the list of grants, locate and click on the grant you want to reassign.\n\n\n This opens the edit view for the grant.\n4. In the list of roles, check the boxes for all custom roles that should have access to the grant, and/or uncheck the boxes for those roles that should not have access.\n5. Click\n **OK**\n .\n6. Click\n **Save Changes**\n .\n\n\n###\n Switching Users to a Different Role\n\nYou can bulk-change users to a different role in Domo. You can assign users to default Domo or custom roles. There are several different ways to do this, all with the same end result:\n\n You can choose a role and add users to that role.\n* You can open a list of all users in Domo and select users in the list to be added to a different role.\n* You can choose a role and change users who currently have that role to a different role.\n\nWith all of these options, you can switch users to a different role either individually (one at a time) or in bulk.\n\n\n**To add users to a selected role,**\n\n. Click\n **More**\n**> Admin > Governance > Roles**\n .\n2. Do one of the following:\n\n* To add users to a role from the\n\t **Roles**\n\t tab,\n\n\t1. In the list of roles, locate and click the role you want to add users to.\n\n\n\t\t The edit view for the role opens.\n\t\t2. Click the\n\t\t **Add People**\n\t\t button.\n\n\n\t\t A list of all users in your Domo instance appears.\n\t\t3. Check the boxes for all users you want to add to the selected role.\n\t\t4. Click\n\t\t **Add People**\n\t\t .\n\t\t5. Click\n\t\t **OK**\n\t\t to confirm.\n\t* To add users to a role from the\n\t **People**\n\t tab,\n\n\t1. Click the\n\t\t **People**\n\t\t tab.\n\n\n\t\t A list of all users in your Domo instance appears.\n\t\t2. Check the boxes for all users you want to switch to a different role.\n\t\t3. In the\n\t\t **Change Role**\n\t\t menu, select the role you want to switch the selected users to.\n\t\t4. Click\n\t\t **OK**\n\t\t to confirm.\n\nThe users you chose are now reassigned to the role you selected.\n\n\n**To change users with a specific role to a different role,**\n\n. Click\n **More**\n**> Admin > Governance > Roles**\n .\n2. In the list of roles, locate and click the role you want to switch users from.\n\n\n The edit view for the role opens.\n3. Click\n **People**\n to open the\n **People**\n subtab.\n\n\n A list of all users in your Domo instance with the given role appears.\n4. Check the boxes for all users you want to switch to a different role.\n5. In the\n **Change Role**\n menu, select the role you want to switch the selected users to.\n6. Click\n **OK**\n to confirm.\n\nThe users you chose are now reassigned to the role you selected.\n\n##\n Changing the Default Role for New Users\n\nWhen you add users to Domo individually via the Admin Settings as explained in\n\ninvitation\n\n, they are given a default role, which is initially set to Privileged. In\n **Admin Settings > Roles**\n , you can change this default security role to any role you want, either a default Domo role or a custom role you've created.\n\n\n**To change the default role for new users in your Domo,**\n\n. Click\n **More**\n**> Admin > Governance > Roles**\n .\n2. Select the new default role for new users in the\n **Default role**\n menu.\n\nGrants List\n-------------\n\nTo view a list all of the grants that may be assigned to users along with the specific privileges available for each:\n\n. Click\n **More > Admin > Governance > Roles**\n .\n2. Select the\n **Grants**\n tab.\n3. Click on the grant to see the associated privileges assigned to the grant.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043438973\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004059\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nManaging Custom Roles\n\n", "article_total_view_count": "\n\n\n 7,839\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "managing_custom_roles", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "controlling_access_in_domo", "url": "/s/topic/0TO5w000000ZanMGAS"}, {"text": "roles", "url": "/s/topic/0TO5w000000ZapEGAS"}]}