{"file_path": "../../raw_kb_v2\\article\\360058529933\\index.html", "content": {"Title": "Location Readiness", "Article Body": "Intro\n                       \n\n                        Use the Location Readiness App to view COVID-19 related data for a County or State. By default, the application shows data related to the United States. By searching for a County or State, all of the sections (Summary, Testing, Social Distancing, and Projections) will return data for the specific County or State you’ve selected.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            When data is not available for a County, the Location Readiness App will return data for the County’s State.\n                           \n\n\n\n\n\n\n                         Get a precise view of how COVID-19 is impacting the Counties where your offices are located.\n                        \n\n                         Make decisions about locations to open up based on new cases, testing, and social distancing metrics.\n                        \n\n                         Stay informed on any changes with daily email updates on stats for up to three Counties.\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This app is part of the\n                             \n                              Get Back to Work Solution\n                             \n                             and is available\n                             \n                              on-demand and paid\n                             \n                             .\n                            \n\n\n\n\n                            To request this feature be enabled,\n                           \n\n\n\n                              Reach out to your Domo Customer Success Manager or Account Executive.\n                             \n\n\n\n\n                               If you do not have contact information for your CSM or AE, contact Domo Support. For information on how to contact Support, please see:\n                               \n                                Getting Help\n                               \n\n\n\n\n\n\n\n\n\n                        Summary\n                       \n\n                        The\n                        \n                         Summary\n                        \n                        section shows how your specific location ranks within the State, Country, or World. It also shows the trends of new cases and new deaths.\n                       \n\n\n\n\n\n\n\n                        Testing\n                       \n\n                        The\n                        \n                         Testing\n                        \n                        section shows State and National testing data and trends.\n                       \n\n\n\n\n\n\n\n\n\n\n                        Social distancing\n                       \n\n                        The\n                        \n                         Social Distancing\n                        \n                        section shows County and State level social distancing data and trends.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                        Projections\n                       \n\n                        The\n                        \n                         Projections\n                        \n                        section shows State level projections data and trends for Beds, PPE's, and Deaths.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Daily brief\n                       \n\n                        To sign up for a Daily Brief, use the\n                        \n                         Subscribe\n                        \n                        button on any of the Location Readiness sections. Enter email addresses and select up to three Counties. Once subscribed, the email addresses that you entered will receive a daily report with data related to COVID-19 in the Counties selected.", "Preview Article": "Click here to preview", "URL Name": "360058529933", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004135", "Archived Date": "", "Language": "English", "Primary Version": "Location Readiness", "Article Total View Count": "2,364", "": "", "Article Created Date": "10/24/2022, 9:24 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Location Readiness\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}