{"file_path": "../../raw_kb_v2\\article\\360042928354\\index.html", "content": {"title": "\n\n\n FreshBooks Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nFreshBooks is an online accounting software package designed to simplify and automate tasks like invoicing, expense organization, and time keeping. To learn more about the FreshBooks API, visit their page (\n\nhttps://www.freshbooks.com/developers\n\n).\n\n\n You connect to your FreshBooks account in the Data Center. This topic discusses the fields and menus that are specific to the FreshBooks connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\na DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your FreshBooks account and create a DataSet, you must have your FreshBooks username and password.\n\n\n Connecting to Your FreshBooks Account\n---------------------------------------\n\nThis section enumerates the options in the\n ****Credentials****\n and\n ****Details****\n panes in the FreshBooks Connector page. The components of the other panes in this page,\n ****Scheduling****\n and\n ****Name & Describe Your DataSet,****\n are universal across most connector types and are discussed in greater length in\n\na DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo FreshBooks connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n ****Connect****\n (or select\n ****Add Account****\n if you have existing FreshBooks accounts in Domo) to open the FreshBooks OAuth screen where you can enter your FreshBooks credentials. Once you have entered valid FreshBooks credentials, you can use the same account any time you go to create a new FreshBooks DataSet. You can manage connector accounts in the\n ****Accounts****\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n***Note:****\n If you are already logged into FreshBooks when you connect in Domo, you are authenticated automatically when you click\n ****Add account****\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of FreshBooks.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n ****Reports****\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the FreshBooks report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Clients\n  |\n Returns a list of clients. A client is a resource representing an entity you send invoices to.\n  |\n|\n Estimates\n  |\n Returns a list of estimates. Estimates provide owners and clients with a way to agree and negotiate on the price and scope of work before it commences.\n  |\n|\n Expense Category\n  |\n Returns a list of expense categories. These group expenses together to aid in expense tracking.\n  |\n|\n Expenses\n  |\n Returns a list of expenses. Expenses are used to track expenditures your business incurs.\n  |\n|\n Gateways\n  |\n Returns a list of gateways. These are also referred to as Payment Processors. The information returned by these endpoints specifies what payment processors are enabled for your businesses.\n  |\n|\n Identity\n  |\n Returns OAuth authentication, preferences, permissions, roles, and business information.\n  |\n|\n Invoices\n  |\n Returns a list of invoices. Invoices are sent to clients and detail specific goods or services performed or provided by the Administrator of their System, and the amount that Client owes to the Admin.\n  |\n|\n Items\n  |\n Returns a list of items. Items are stored from invoice lines to make invoicing easier in the future.\n  |\n|\n Payments\n  |\n Returns payment information. Payments are a record of the payments made on your invoices.\n  |\n|\n Projects\n  |\n Returns a list of projects. These are used to track business projects and related information such as hourly rate, service(s) being offered, projected end date, etc.\n  |\n|\n Staff\n  |\n Returns a list of employees.\n  |\n|\n Systems\n  |\n Returns accounting systems information. An accounting system represents an entity that can send invoices.\n  |\n|\n Tasks\n  |\n Returns a list of tasks. Tasks in Freshbooks represent services that your business offers to clients. Tasks are used to keep track of details of the service such as name and hourly rate.\n  |\n|\n Taxes\n  |\n Returns tax information.\n  |\n|\n Time Entries\n  |\n Returns time entries. Time entries represent time spent working for a client or project.\n  |\n\n|\n|\n Account Name\n  |\n Select the name of the account you want to retrieve information for.\n  |\n|\n Business Name\n  |\n Select the name of the business you want to retrieve information for.\n  |\n|\n System Name\n  |\n Select the name of the system you want to retrieve information for.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How do I know my Freshbook credentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. You can revoke Domo's access to your account at any time.\n\n####\n Can I use the same account to create multiple DataSets?\n\nYes.\n\n####\n How often can the data be updated?\n\nAs often as needed.\n\n####\n Are there any API limits I should be aware of?\n\nNo.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928354\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003627\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFreshBooks Connector\n\n", "article_total_view_count": "\n\n\n 2,360\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "freshbooks_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}