{"file_path": "../../raw_kb_v2\\article\\360046074774\\index.html", "content": {"Title": "DataSet Views", "Article Body": "Intro\n                       \n\n                        Views Explorer is a business-friendly data exploration tool designed to make it easy to explore, wrangle, and combine your data in an easy to understand spreadsheet interface. This simple, yet powerful, DataSet Views experience allows you to perform data cleansing operations such as filtering, grouping, aggregating, and even combining data through a simple visual interface. Anyone with an Admin user or a Custom Role that has either the \"Edit DataSet\" or \"Manage DataSet\" grants enabled can use DataSet Views. For more information on Custom Roles see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n\n                          Video - DataSet Views Explorer\n                         \n\n\n\n\n\n\n\n\n\n\n\n                        How to find Views Explorer\n                       \n\n                        To get started, choose the\n                        \n                         Open With\n                        \n                        dropdown and select\n                        \n                         Views Explorer\n                        \n                        . This will take you to a new window where you will be able to explore your data.\n                       \n\n\n\n\n\n                        How to explore data using Views Explorer\n                       \n\n                        Views Explorer has many ways to manipulate and cleanse data, they are:\n                       \n\n\n\n                          Remove Columns\n                         \n\n\n\n                          Add Columns\n                         \n\n\n\n                          Rename Columns\n                         \n\n\n\n                          Move Columns\n                         \n\n\n\n                          Add Calculated Column\n                         \n\n\n\n                          Perform Joins\n                         \n\n\n\n                          Perform Unions\n                         \n\n\n\n                          Filter Data\n                         \n\n\n\n                          Group Data\n                         \n\n\n\n                          Sort Data\n                         \n\n\n\n                          Limit Data\n                         \n\n\n\n                          Undo/Revert Changes\n                         \n\n\n\n                          Save the DataSet View\n                         \n\n\n\n                        Remove Columns\n                       \n\n                        Removing columns is a common step in cleansing data, and Views Explorer makes it easy to remove columns from your DataSet. Columns can be removed by selecting the triple dot menu on each column and selecting\n                        \n                         Delete\n                        \n                        . To remove multiple columns, you can also choose the\n                        \n                         Select All\n                        \n                        option from the columns on the left and the delete icon.\n                       \n\n\n\n\n\n\n                        Add Columns\n                       \n\n                        In certain situations, it makes sense to add a duplicate of a column to your DataSet. To add columns to the DataSet, choose the\n                        \n                         Add Column\n                        \n                        button at the bottom of the columns on the left.\n                       \n\n\n\n\n                        Rename Columns\n                       \n\n                        Rename a column by selecting the triple dot menu on a column and choosing\n                        \n                         Rename\n                        \n                        . This can also be done in by using the columns on the left.\n                       \n\n\n\n\n                        Move Columns\n                       \n\n                        Reordering columns can be done in two places. To move a column select the\n                        \n                         Move\n                        \n                        option in the triple dot menu and selecting one of the four options:\n                        \n                         Left\n                        \n                        ,\n                        \n                         Right\n                        \n                        ,\n                        \n                         First\n                        \n                        , or\n                        \n                         Last\n                        \n                        . You may also drag and reorder columns by using the columns on the left.\n                       \n\n\n\n\n\n                        Add Calculated Column\n                       \n\n                        To add a new calculated column choose the plus sign and select\n                        \n                         Add Calculated Column\n                        \n                        .\n                       \n\n\n\n\n\n                        When you have finished writing the calculation, select\n                        \n                         Save and Close\n                        \n                        . This will automatically add the new calculated column to your DataSet in Views Explorer. For the new calculated column to save to your DataSet, you will need to save your DataSet as a new DataSet View.\n                       \n\n\n\n\n                        Perform Joins\n                       \n\n                        To join DataSets using Views Explorer, toggle to the DataSet side of the schema rail. From there, select the\n                        \n                         Add Join\n                        \n                        button.\n                       \n\n\n\n\n                        Next, select a DataSet to join and choose the Join Keys from each DataSet. Once you have selected the keys, choose the Join Type you would like to use (we support Left, Right, and Inner Joins.) You will then have to select the columns you would like to include in your DataSet.\n                       \n\n\n\n\n                        From the Select Columns modal choose which columns you would like to include in your DataSet and select\n                        \n                         Save\n                        \n                        . The columns you selected will now appear in your DataSet.\n                       \n\n\n\n\n                        Perform Unions\n                       \n\n                        To union DataSets using Views Explorer, toggle to the DataSet side of the schema rail. From there, select the\n                        \n                         Add Union\n                        \n                        button.\n                       \n\n\n\n\n                        Next, select the DataSet(s) to union and select\n                        \n                         Save\n                        \n                        . The data from the selected DataSets will now appear in your DataSet.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           In order for unions to work properly, both DataSets must contain the same columns. If your DataSets contain different columns, it is best to join them instead.\n                          \n\n\n\n\n\n\n                        Filter Data\n                       \n\n                        Column filtering can be done with the columns on the left, using the\n                        \n                         Filter\n                        \n                        button at the top of Views Explorer, by choosing the triple dot menu on each column and selecting\n                        \n                         Filter\n                        \n                        , or by selecting\n                        \n                         Filter\n                        \n                        on each column.\n                       \n\n\n\n\n\n                        Group Data\n                       \n\n                        Grouping data helps you to see only columns you are interested in and aggregations to summarize the data from the categories you have selected. To Group data, start by selecting the\n                        \n                         Group\n                        \n                        button.\n                       \n\n\n\n\n                        In the Group By modal, drag columns you are interested in into the Categories section.\n                       \n\n\n\n\n                        In the Group By modal, drag columns you are interested in aggregating into the Aggregations section.\n                       \n\n\n\n\n                        When you are finished, simply select the\n                        \n                         Finish\n                        \n                        button.\n                       \n\n\n\n\n                        Sort Data\n                       \n\n                        Sorting data allows you to sort your data alphabetically, by date, Low to High, or High to Low. To sort data, choose the\n                        \n                         Sort\n                        \n                        button at the top or select the triple dot menu on each column.\n                       \n\n\n\n\n\n                        Limit Data\n                       \n\n                        Limit means the DataSet will only return the number of rows you have chosen, sorted by the sorting rules you select. To limit the number of rows in your data, choose\n                        \n                         Limit\n                        \n                        and add the number of rows you would like to include in your DataSet.\n                       \n\n\n\n\n\n                        Undo/Revert Changes\n                       \n\n                        Sometimes you want to undo your last step or just start over. Use the undo and revert buttons to go back a few steps, or start over at the beginning of your data exploration.\n                       \n\n\n\n\n                        Save the DataSet View\n                       \n\n                        When you have finished your exploration, you may want to save it as a new DataSet View. To save your Views exploration as a new DataSet View choose the\n                        \n                         Save As\n                        \n                        Button. Choose a new name for your View and then Select\n                        \n                         Save\n                        \n                        .\n                       \n\n\n\n\n\n                        Your DataSet View will appear in Domo as a new DataSet that can be shared with others in Domo. PDP policies from the parent DataSet will still apply and the DataSet View will update when the parent DataSet updates.\n                       \n\n                        FAQ's\n                       \n\n                        How do DataSet Views treat NULL values?\n                       \n\n                        Null values are not considered to be equal or not equal to any other value. This means that comparing a column with a null value to another column using either = or != (<>) will always return false for that row.\n                       \n\n                        Can I use a View inside of a MySQL DataFlow?\n                       \n\n                        No, at this time Views are not supported inside of MySQL DataFlows.", "Preview Article": "Click here to preview", "URL Name": "360046074774", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004568", "Archived Date": "", "Language": "English", "Primary Version": "DataSet Views", "Article Total View Count": "7,058", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              DataSet Views\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               DataSet Views\n              \n", "url": "/s/topic/0TO5w000000ZanWGAS"}]}