{"file_path": "../../raw_kb_v2\\article\\360043431333\\index.html", "content": {"title": "\n\n\n HubSpot Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nHubSpot develops software for social media and email marketing, content management, web analytics, and search engine optimization. Use Domo's HubSpot connector to compile reports about your campaigns, contacts, blogs, lead sources, and the like. To learn about the HubSpot API, visit their website (\n\nhttp://developers.hubspot.com/docs/overview\n\n).\n\n\n The HubSpot connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your HubSpot account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the HubSpot connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Compiling reports about aspects of social media and email marketing, such as campaigns, contacts, blogs, lead sources, pipeline management, etc.\n  |\n|\n**Primary Metrics**\n | * Campaign performance\n* Open rates\n* Email bounces\n* Leads\n* MQL\n* SAO\n |\n|\n**Primary Company Roles**\n |\n Marketing/sales roles\n  |\n|\n**Average Implementation Time**\n |\n Less than 1 hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\n\n Using the Domo HubSpot connector\n----------------------------------\n\nFollow these step-by-step instructions to configure the Domo HubSpot connector:\n\n. Type \"hubspot\" in the search bar in the Domo Appstore.\n\nThe search result will fetch the relevant connector(s) as shown below.\n2. Click on the HubSpot tile.\n\n\n The HubSpot connector dashboard will open, displaying the details view for the connector.\n3. Click\n **Get the Cards**\n in the upper right corner.\n\nThe\n **Connect Data for your Sample App**\n window will pop up. To view your data, you need to connect your HubSpot account to Domo.\n4. Click\n **Connect**\n .\n\nYou are then taken to the HubSpot OAuth login window.\n5. Enter your email address and password associated with your HubSpot account. Alternatively, you can use your Google account or Single sign-on for logging in.\n\n\n A list of existing accounts appears, including your own account.\n6. Select an account that you want to connect to. In this case, select the account that you logged in with.\n\nThe\n **Connect data for your Sample App**\n window pops up. Your selected account appears in the\n **Connect data**\n field along with its Hub ID and App ID.\n7. Click\n **Finish**\n .\n\n\n The data connecting process will start. It might take a minute to connect.\n\nOnce your sample app data is connected, the visual and graphical presentation of the data associated with your account will appear in a dashboard.\n\n\n The \"Traffic Analytics\" section displays collective data about the traffic.\n\nThe \"Deals\" section displays the data related to different deals.\n\nThe \"Engagements & Contacts\" section displays the data about various engagements and contacts altogether.\n\nBest practices\n----------------\n\n\n* Your Hub ID is valid for one account in Domo. Creating an additional account in Domo will cause the original account to be disconnected.\n* Some reports are marked as beta. Use at your own risk, as these reports do not currently have any documentation on Hubspot's site and may be removed by Hubspot at any time.\n\nPrerequisites\n---------------\n\nTo connect to your HubSpot account and create a DataSet, you must have the following:\n\n Your Hub ID. This is located at the bottom of your HubSpot dashboard. For more information, see\n\nhttp://help.hubspot.com/articles/How\\_To\\_Doc/How-to-find-your-hub-id\n\n.\n* The username and password you use to log into HubSpot.\n\nConnecting to Your HubSpot account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the HubSpot Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials pane\n\nThis pane contains a single field where you enter your HubSpot Hub ID (see \"Prerequisites\" above for more details).  You are then taken to the HubSpot OAuth page where you are required to enter the email address and password for your HubSpot account. Once you have entered valid credentials, you can use the same account any time you go to create a new HubSpot DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details pane\n\nThis pane contains a primary menu in which you select your HubSpot report. One other menu,\n **Contact Fields**\n , may appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select a HubSpot report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n All Engagements\n  |\n Get all of the engagements in a portal.\n  |\n|\n All Landing Pages\n  |\n Returns data for all of your landing pages.\n  |\n|\n All Pipelines\n  |\n Returns data for all pipelines.\n  |\n|\n Analytics Breakdown\n  |\n Returns analytics data broken down by the specified category.\n  |\n|\n Associated Engagements\n  |\n Get associated engagements (tasks or activities) on an object in HubSpot.\n  |\n|\n Blog Posts\n  |\n Returns data for all posts of your blogs.\n  |\n|\n Blog Topics\n  |\n Returns data for all of your blog topics.\n  |\n|\n Blogs\n  |\n Returns high-level data for all of your blogs.\n  |\n|\n Broadcast Messages\n  |\n Returns all broadcast messages.\n  |\n|\n Call Engagement Dispositions\n  |\n Get the possible dispositions for sales calls\n  |\n|\n Campaign Events\n  |\n Returns data about specific marketing campaign events.\n  |\n|\n Companies - All\n  |\n Returns data about all companies.\n  |\n|\n Companies - Recent\n  |\n Returns data about companies created in last 30 days (maximum 10000 records).\n  |\n|\n Contacts\n  |\n Returns data about all of your contacts.\n  |\n|\n Contact Lists\n  |\n Returns data about all of your contact lists.\n  |\n|\n Contact Lists - Contacts Recently Added\n  |\n Returns information about the list and contacts that were recently added to it.\n  |\n|\n Contact Lists with Lifecycle Stage\n  |\n Returns contact lists with lifecycle stage field.\n  |\n|\n Contacts in a List\n  |\n Returns a list of contacts from a specified List.\n  |\n|\n Deals - All\n  |\n Returns data about all of your deals.\n  |\n|\n Deals - Recent\n  |\n Returns data about all of your deals that are created in last 30 days.\n  |\n|\n Deals With Stages\n  |\n Returns data about all of your deals and deal pipelines.\n  |\n|\n Email Campaigns\n  |\n Returns data about all of your email campaigns.\n  |\n|\n Email Events\n  |\n Returns data about all of your email events.\n  |\n|\n Events List\n  |\n Returns data about all of your events from the calendar.\n  |\n|\n Forms\n  |\n Returns high-level data about all forms you have created.\n  |\n|\n Owners\n  |\n Returns all of the owners that exist inside of HubSpot.\n  |\n|\n Recent Engagements\n  |\n Get the most recently created or updated engagements in a portal.\n  |\n|\n Subscriptions Timeline\n  |\n Returns subscriptions timeline data for the given date range.\n  |\n|\n Ticket Report\n  |\n Returns the detail about ticket via the properties query parameter.\n  |\n\n|\n|\n Contact Fields\n  |\n Select all fields that you want to show in your report. You must select at least one field.\n  |\n|\n Expand Field\n  |\n\nSelect this checkbox to get memberships data.\n\n|\n|\n Form Submission Mode\n  |\n\nSpecify which form submissions should be fetched.\n\n|\n|\n Show List Memberships\n  |\n\nSelect this checkbox to indicate whether current list memberships should be fetched.\n\n|\n|\n Flatten List Memberships\n  |\n\nSelect this checkbox to indicate whether there should be a row for each contact's list membership.\n\n\n**Note**\n : This can make the dataset very large.\n\n|\n|\n Property Mode\n  |\n\nSelect this checkbox to retrieve historical data for the 'Lifecycle Stage' property.\n\n|\n|\n List ID\n  |\n\nSelect the list for which you want to get contact data.\n\n|\n|\n Object Type\n  |\n\nSelect the associated Object Type(Depending on the object you want to fetch engagements for).\n\n|\n|\n Breakdown By\n\n|\n\nSelect the category to break down the analytics data.\n\n|\n|\n Select properties\n\n|\n\nSelect whether to retrieve all or some properties.\n\n|\n|\n Deal Properties\n\n|\n\nSelect the properties to retrieve.\n\n|\n|\n Retrieve deal stage property history\n  |\n Select this checkbox to retrieve the deal stage's history instead of just the current value.\n  |\n|\n Object ID\n  |\n Select the associated Id.\n  |\n|\n Time Period\n  |\n Select the time period to group the analytics data.\n  |\n|\n Filter\n  |\n\nFilter the returned data to include only the specified breakdown. Provide single or multiple values for the filter.\n\n\n Example: hubspot or hubspot,social,direct.\n\n|\n|\n Data To\n\nRetrieve\n  |\n\nSelect whether you want to retrieve all data or only the data since the last successful run.\n\n|\n|\n Object Type\n  |\n\nSelect object type.\n\n|\n|\n Include Inactive\n\n|\n\nSelect include inactive option.\n\n|\n|\n Inactive Owners Selection\n\n|\n\nSelect whether to include inactive owners or not.\n\n|\n|\n Ticket Properties\n\n|\n\nSelect the ticket properties to retrieve.\n\n|\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n1. Review the configuration to make sure all required items have been selected.\n2. Review the connector history for error messages.\n3. To reduce API calls for reports that allow date selections (\"Email Events,\" \"Events,\" \"Blog Topics,\" and \"Subscription Timeline\"), use\n **Append**\n and choose to pull data from the last successful run instead of all data.\n4. In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the time frame that you are trying to pull.\n\nFAQ\n-----\n\n\n####\n What kind of credentials do I need to power up the HubSpot Connector?\n\nYou need your Hub ID, which you can find at the bottom of your HubSpot dashboard. You need to have a 'super admin' role.\n\n###\n What kind of HubSpot account do I need to access the API?\n\nYou need a Marketing Professional or Enterprise HubSpot account to access the API.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo.\n\n###\n Can I use the same HubSpot account for multiple DataSets?\n\nYes.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431333\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003759\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nHubSpot Connector\n\n", "article_total_view_count": "\n\n\n 5,157\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "hubspot_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}