{"file_path": "../../raw_kb_v2\\article\\360043434593\\index.html", "content": {"Title": "NetSuite OpenAir Connector", "Article Body": "Intro\n                       \n\n                        NetSuite OpenAir gives professional services organizations the ability to run their core business operations including project management, resource optimization, project accounting, time and expense management, and billing and revenue recognition. To learn more about the NetSuite OpenAir API, visit their page (\n                        \n                         https://www.openair.com/download/OpenAirXMLAPIGuide.pdf\n                        \n                        ).\n                       \n\n                        You connect to your NetSuite OpenAir account in the Data Center. This topic discusses the fields and menus that are specific to the NetSuite OpenAir connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your NetSuite OpenAir account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The user ID and password for your company's NetSuite OpenAir account.\n                         \n\n\n\n                          The company ID for the account.\n                         \n\n\n\n                          The URL for the account's OpenAir instance.\n                         \n\n\n\n                          The account's API namespace.\n                         \n\n\n\n                          The account's API key.\n                         \n\n\n\n                        To obtain the API namespace and key, reach out to your NetSuite OpenAir account representative.\n                       \n\n                        Connecting to Your NetSuite OpenAir Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the NetSuite OpenAir Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your NetSuite OpenAir account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            User ID\n                           \n\n\n\n                            Enter the user ID for your company's NetSuite OpenAir account.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter the password for your company's NetSuite OpenAir account.\n                           \n\n\n\n\n\n                            Company ID\n                           \n\n\n\n                            Enter the company ID associated with the account.\n                           \n\n\n\n\n\n                            URL\n                           \n\n\n\n                            Enter the URL for the account's NetSuite OpenAir instance.\n                           \n\n\n\n\n\n                            Namespace\n                           \n\n\n\n                            Enter the account's API namespace as received from NetSuite.\n                           \n\n\n\n\n\n                            API Key\n                           \n\n\n\n                            Enter the account's API key as received from NetSuite.\n                           \n\n\n\n\n\n\n                         Once you have entered valid NetSuite OpenAir credentials, you can use the same account any time you go to create a new NetSuite OpenAir DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a single menu from which you select a report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the NetSuite OpenAir report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Attribute\n                              \n\n                               Receives data about NetSuite OpenAir Attribute reports.\n                              \n\n\n\n                               Attribute Set\n                              \n\n                               Receives data about NetSuite OpenAir Attribute Set reports.\n                              \n\n\n\n                               Booking\n                              \n\n                               Receives data about NetSuite OpenAir Booking reports.\n                              \n\n\n\n                               Booking By Day\n                              \n\n                               Receives data about NetSuite OpenAir Booking By Day reports.\n                              \n\n\n\n                               Booking Request\n                              \n\n                               Receives data about NetSuite OpenAir Booking Request reports.\n                              \n\n\n\n                               Booking Type\n                              \n\n                               Receives data about NetSuite OpenAir Booking Type reports.\n                              \n\n\n\n                               Budget\n                              \n\n                               Receives data about NetSuite OpenAir Budget reports.\n                              \n\n\n\n                               Budget Allocation\n                              \n\n                               Receives data about NetSuite OpenAir Budget Allocation reports.\n                              \n\n\n\n                               Category\n                              \n\n                               Receives data about NetSuite OpenAir Category reports.\n                              \n\n\n\n                               Customers\n                              \n\n                               Receives data about NetSuite OpenAir Customers reports.\n                              \n\n\n\n                               Department\n                              \n\n                               Receives data about NetSuite OpenAir Department reports.\n                              \n\n\n\n                               Entity Tag\n                              \n\n                               Receives data about NetSuite OpenAir Entity Tag reports.\n                              \n\n\n\n                               Hierarchy\n                              \n\n                               Receives data about NetSuite OpenAir Hierarchy reports.\n                              \n\n\n\n                               Hierarchy Node\n                              \n\n                               Receives data about NetSuite OpenAir Hierarchy Node reports.\n                              \n\n\n\n                               Invoice\n                              \n\n                               Receives data about NetSuite OpenAir Invoice reports.\n                              \n\n\n\n                               Item\n                              \n\n                               Receives data about NetSuite OpenAir Item reports.\n                              \n\n\n\n                               Job Code\n                              \n\n                               Receives data about NetSuite OpenAir Job Code reports.\n                              \n\n\n\n                               Loaded Cost\n                              \n\n                               Receives data about NetSuite OpenAir Loaded Cost reports.\n                              \n\n\n\n                               Product\n                              \n\n                               Receives data about NetSuite OpenAir Product reports.\n                              \n\n\n\n                               Project Assign\n                              \n\n                               Receives data about NetSuite OpenAir Project Assign reports.\n                              \n\n\n\n                               Project Assignment Profile\n                              \n\n                               Receives data about NetSuite OpenAir Project Assignment Profile reports.\n                              \n\n\n\n                               Project Billing Rule\n                              \n\n                               Receives data about NetSuite OpenAir Project Billing Rule reports.\n                              \n\n\n\n                               Project Billing Transaction\n                              \n\n                               Receives data about NetSuite OpenAir Project Billing Transaction reports.\n                              \n\n\n\n                               Project Budget Group\n                              \n\n                               Receives data about NetSuite OpenAir Project Budget Group reports.\n                              \n\n\n\n                               Project Budget Rule\n                              \n\n                               Receives data about NetSuite OpenAir Project Budget Rule reports.\n                              \n\n\n\n                               Project Budget Transaction\n                              \n\n                               Receives data about NetSuite OpenAir Project Budget Transaction reports.\n                              \n\n\n\n                               Project Location\n                              \n\n                               Receives data about NetSuite OpenAir Project Location reports.\n                              \n\n\n\n                               Project Group\n                              \n\n                               Receives data about NetSuite OpenAir Project Group reports.\n                              \n\n\n\n                               Project Stage\n                              \n\n                               Receives data about NetSuite OpenAir Project Stage reports.\n                              \n\n\n\n                               Project Task\n                              \n\n                               Receives data about NetSuite OpenAir Project Task reports.\n                              \n\n\n\n                               Project Task Assign\n                              \n\n                               Receives data about NetSuite OpenAir Project Task Assign reports.\n                              \n\n\n\n                               Project Task Type\n                              \n\n                               Receives data about NetSuite OpenAir Project Task Type reports.\n                              \n\n\n\n                               Projects\n                              \n\n                               Receives data about NetSuite OpenAir Projects reports.\n                              \n\n\n\n                               Ratecard\n                              \n\n                               Receives data about NetSuite OpenAir Ratecard reports.\n                              \n\n\n\n                               Ratecard Item\n                              \n\n                               Receives data about NetSuite OpenAir Ratecard Item reports.\n                              \n\n\n\n                               Resource Profile\n                              \n\n                               Receives data about NetSuite OpenAir Resource Profile reports.\n                              \n\n\n\n                               Resource Profile Type\n                              \n\n                               Receives data about NetSuite OpenAir Resource Profile Type reports.\n                              \n\n\n\n                               Resource Request\n                              \n\n                               Receives data about NetSuite OpenAir Resource Request reports.\n                              \n\n\n\n                               Revenue Container\n                              \n\n                               Receives data about NetSuite OpenAir Revenue Container reports.\n                              \n\n\n\n                               Revenue Projection\n                              \n\n                               Receives data about NetSuite OpenAir Revenue Projection reports.\n                              \n\n\n\n                               Revenue Recognition Rule\n                              \n\n                               Receives data about NetSuite OpenAir Revenue Recognition Rule reports.\n                              \n\n\n\n                               Revenue Recognition Rule Amount\n                              \n\n                               Receives data about NetSuite OpenAir Revenue Recognition Rule Amount reports.\n                              \n\n\n\n                               Revenue Recognition Transaction\n                              \n\n                               Receives data about NetSuite OpenAir Revenue Recognition Transaction reports.\n                              \n\n\n\n                               Revenue Stage\n                              \n\n                               Receives data about NetSuite OpenAir Revenue Stage reports.\n                              \n\n\n\n                               Role\n                              \n\n                               Receives data about NetSuite OpenAir Role reports.\n                              \n\n\n\n                               Schedule By Day\n                              \n\n                               Receives data about NetSuite OpenAir Schedule By Day reports.\n                              \n\n\n\n                               Schedule Exception\n                              \n\n                               Receives data about NetSuite OpenAir Schedule Exception reports.\n                              \n\n\n\n                               Schedule Request\n                              \n\n                               Receives data about NetSuite OpenAir Schedule Request reports.\n                              \n\n\n\n                               Schedule Request Item\n                              \n\n                               Receives data about NetSuite OpenAir Schedule Request Item reports.\n                              \n\n\n\n                               Slips\n                              \n\n                               Receives data about NetSuite OpenAir Slips reports.\n                              \n\n\n\n                               Slips Projection\n                              \n\n                               Receives data about NetSuite OpenAir Slips Projection reports.\n                              \n\n\n\n                               Slips Stage\n                              \n\n                               Receives data about NetSuite OpenAir Slips Stage reports.\n                              \n\n\n\n                               Tag Group\n                              \n\n                               Receives data about NetSuite OpenAir Tag Group reports.\n                              \n\n\n\n                               Tag Group Attribute\n                              \n\n                               Receives data about NetSuite OpenAir Tag Group Attribute reports.\n                              \n\n\n\n                               Target Utilization\n                              \n\n                               Receives data about NetSuite OpenAir Target Utilization reports.\n                              \n\n\n\n                               Task\n                              \n\n                               Receives data about NetSuite OpenAir Task reports.\n                              \n\n\n\n                               Task Time Cards\n                              \n\n                               Receives data about NetSuite OpenAir Task Time Cards reports.\n                              \n\n\n\n                               Timecard\n                              \n\n                               Receives data about NetSuite OpenAir Timecard reports.\n                              \n\n\n\n                               Timesheet\n                              \n\n                               Receives data about NetSuite OpenAir Timesheet reports.\n                              \n\n\n\n                               Timetype\n                              \n\n                               Receives data about NetSuite OpenAir Timetype reports.\n                              \n\n\n\n                               Uprate\n                              \n\n                               Receives data about NetSuite OpenAir Uprate reports.\n                              \n\n\n\n                               Users\n                              \n\n                               Receives data about NetSuite OpenAir Users reports.\n                              \n\n\n\n                               Users Location\n                              \n\n                               Receives data about NetSuite OpenAir Users Location reports.\n                              \n\n\n\n                               Vendor\n                              \n\n                               Receives data about NetSuite OpenAir Vendor reports.\n                              \n\n\n\n\n\n\n\n                           Include Custom Fields\n                          \n\n                           Select this option if you would like custom fields to be returned with the dataset you have selected.\n                          \n\n\n\n                           Date Type Filter\n                          \n\n                           Select the required Date Type Filter to filter the records.\n                           \n\n                           Note: Please select None, to return complete data\n                          \n\n\n\n                           User IDs\n                          \n\n                           Enter the comma separated (,) values of User Ids for which the report should run. User Ids can be found in Users report.\n                           \n\n                           Note: If User Id's are not provided, then report will run for the current user.\n                          \n\n\n\n                           Duration\n                          \n\n                           Select the duration for the report (a Single Date, or a Date Range).\n                          \n\n\n\n                           Single Date\n                          \n\n                           Select whether the report data is for a specific date or for a relative number of days back from today.\n                          \n\n\n\n                           Specific Date\n                          \n\n                           Select the specific date using the date selector.\n                          \n\n\n\n                           Relative Date\n                          \n\n                           Enter the number of days back that you would like to get data for in the\n                           \n\n                             Days Back\n                            \n\n                           field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n                          \n\n\n\n                           Date Range\n                          \n\n                           Select the specific or relative date range.\n                          \n\n\n\n                           Start Date - Specific\n                          \n\n                           Select the first date in your date range using the date selector.\n                          \n\n\n\n                           End Date - Specific\n                          \n\n                           Select the last date in your date range using the date selector.\n                          \n\n\n\n                           Start Date - Relative\n                          \n\n\n                            Enter the number of days back that you would like to get data from (start day). Combine with\n                            \n\n\n\n\n\n\n\n                                    End Date\n                                   \n\n\n\n\n\n\n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n\n\n\n\n\n\n                                    Start Date\n                                   \n\n\n\n\n\n\n\n                            and 5 for\n                            \n\n\n\n\n\n\n\n                                    End Date\n                                   \n\n\n\n\n\n\n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n                           End Date - Relative\n                          \n\n\n                            Enter the number of days back that you would like to get data to (end day). Combine with\n                            \n\n\n\n\n\n\n\n                                    Start Date\n                                   \n\n\n\n\n\n\n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n\n\n\n\n\n\n                                    Start Date\n                                   \n\n\n\n\n\n\n\n                            and 5 for\n                            \n\n\n\n\n\n\n\n                                    End Date\n                                   \n\n\n\n\n\n\n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043434593", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003462", "Archived Date": "", "Language": "English", "Primary Version": "NetSuite OpenAir Connector", "Article Total View Count": "4,713", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              NetSuite OpenAir Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}