{"file_path": "../../raw_kb_v2\\article\\360042934614\\index.html", "content": {"title": "\n\n\n Creating and Deleting PDP Policies\n\n\n", "article_body": "\n\nIntro\n=======\n\nYou can create a customized experience for users and groups in your Domo by setting PDP (Personalized Data Permissions) policies on DataSets. These policies allow you to filter data in DataSets for specified users and groups. Those users and groups then see only the data pertinent to them when viewing KPI and Sumo cards with PDP policies applied.\n\n\n For example, you might have a card showing a map with data for two regions in the U.S—West and East. You could create two PDP policies—one for the \"West\" region and one for the \"East\" region. For the \"West\" policy you would select those salespeople working in the West region, and for the \"East\" policy you would select those salespeople working in the East region. If Larry, a salesperson based in Washington, then opened the card, he would see data\n *only*\n for the states in the West region—all states in the East region would appear with no data.\n\n\n When creating PDP policies, you can use any of the following filters:\n\n **Simple filter**\n . This allows you to build policies based on specific column values. For example, you could build a policy for the \"West\" region and one for the \"East\" region, as illustrated above.\n* **Custom filter**\n . This allows you to customize a filter to use in your policy. A variety of rules is available. You can use \"greater than\" and \"less than\" rules to base a filter around a specific threshold, or you can use a \"between\" rule to build a filter around a range of values or dates. You can also apply a \"begins with\" rule to filter on strings.\n* **Filter by user or group attribute**\n . This allows you to build dynamic PDP filters based on attributes for a user or group such as name, email, or employee number. In the Domo navigation header, go to\n **More >**\n**Admin > Governance > Attributes**\n . Here you can check attributes that should be available for use in PDP. For information about enabling or disabling user attributes, see the heading for\n\nEnabling or Disabling Attributes for Dynamic PDP Policies\n\n.\n\nPDP policies are also applied in other tools in Domo, such as alerts and DataFusions. When you are subscribed to an alert on a card powered by a PDP DataSet, the alert is customized to reflect the PDP policies in place. When you build a DataFusion from one or more input DataSets with PDP policies in place, those policies are incorporated into the output DataSet.\n\n*Video - Dynamic Personalized Data Permissions (PDP)**\n\nCreating PDP Policies\n-----------------------\n\nYou create and manage PDP policies in the Data Center.\n\n*Video - Personalized Data Permissions (PDP) Policy Creation**\n\n*To create a PDP policy,**\n\n. Click\n **Data**\n in the toolbar at the top of the screen.\n2. Click\n\nin the left-hand navigation pane.\n3. Locate and click the DataSet you want to apply a policy to.\n4. Click the\n **PDP**\n tab.\n5. (Optional) Click the\n **Impact**\n button to open a list of cards and alerts that will be affected by PDP policies on this DataSet.\n\n\n Though this is not required, it is highly recommend that you review this list before proceeding. For more information, see Viewing PDP Outcomes below.\n6. (Optional) If there is anyone in addition to the DataSet owner and \"Admin\" users who should have access to all of the data in this DataSet, grant full permission to the user by doing the following:\n\n1. Click\n\n in the\n\t **All Rows**\n\t row.\n\t2. In the\n\t **Add Groups & People**\n\t dialog, enter the name of a person or group who should have full access to the data. Select a name to add it to the policy.\n\t3. Click\n\t **Apply**\n\t .\n\n**Important:**\n\t If this DataSet is an input DataSet in a DataFlow, it is highly recommended that you grant full access to the DataFlow owner; otherwise the DataFlow could break when PDP policies are set.\n7. Click\n **Add Policy**\n .\n8. Enter a descriptive name for this policy.\n9. Click\n **Add Data**\n to open the\n **Add Data Access**\n dialog.\n10. In the\n **Column Name**\n dropdown, select the column you want to filter on.\n11. In the\n **Access Type**\n menu, select the filter type you want to base this policy on.\n\n* Select\n\t **Simple filter**\n\t if you want your policy to be based on a specific column value. For example, if you were creating a region-based policy in which users in the \"East\" region should only be able to see data for their own region, you would select this filter option and then select \"East\" as the region to filter on.\n\t* Select\n\t **Custom filter**\n\t if you want to create a customized filter for your policy. For example, you might have a group of users who should only be allowed to see data within a certain date range or above or below a certain threshold. You could create such a policy using this option.\n\t* Select\n\t **Filter by user attribute**\n\t if you want to enable a dynamic PDP policy based on a selected user attribute. For example, you might want users to see only those rows that show their email address and filter out all others. You could do this by using this option. Note that for this to work, you\n\t *must*\n\t select PDP-permissible attributes in the\n\t **Attributes**\n\t section of Admin: Governance. For more information, see the heading for\n\n Enabling or Disabling Attributes for Dynamic PDP Policies\n\n below.\n12. (Conditional) If you selected\n **Simple filter**\n in step 11...\n\n1. In the\n\t **Search/Add Row Values**\n\t field, select the name of the row you want to filter on.\n\t2. (Optional) Repeat step 8 as many times as necessary until you have added all of the rows you want to filter on.\n\t3. Click\n\t **Apply**\n\t .\n13. (Conditional) If you selected\n **Custom filter**\n in step 11...\n\n1. In the menu under \"Include Values That Match These Rules,\" select the desired filter condition.\n\t2. In the field on the right, enter the value or string or select the date that completes the condition. (If you selected\n\t **Is Between**\n\t , there will be two fields—one for the minimum value or start date, and one for the maximum value or end date.)\n\n\n\t For example, if you wanted to create a policy for users who should only be allowed to see data within a certain date range, you would select\n\t **Is Between**\n\t in the menu, then choose the desired start date in the first field, and finally choose the desired end date in the second field.\n\t3. (Optional) If you want to add more custom filters, click\n\t **Add Rule**\n\t then repeat steps 13a and 13b.\n\t4. Click\n\t **Apply**\n\t when ready.\n14. (Conditional) If you selected\n **Filter by user attribute**\n in step 11, complete the following:\n\n1. Click\n\t **Select user attribute**\n\t then select the attribute you want to dynamically filter on.\n\t2. Click\n\t **Apply**\n\t .\n\n**Note:**\n\t For dynamic PDP policies to work, you must enable any selected attributes in the\n\t **Attributes**\n\t section of\n\t **Admin: Governance.**\n15. Click\n\nin the row for the newly added policy to open the\n **Add Groups & People**\n dialog.\n16. In the\n **Search/Add Groups & People**\n field, do one of the following:\n\n* Enter the name of a person or group you want to add to the policy. Select a name to add it to the policy.\n\t* Add everyone with DataSet access to the policy by clicking the blue\n\t **add everyone**\n\t link.\n17. Click\n **Apply**\n .\n18. Click\n **Save**\n .\n\nThe policy is now created. However, it is not yet applied to this DataSet. To turn on PDP for the DataSet, click\n\nnext to the \"Enable PDP\" text. Now anything in Domo powered by or associated with this DataSet is affected by the policy and includes a stamp of\n\nto inform users that they are not seeing all of the available data due to PDP.\n\n\n To turn off this policy, click\n\n.\n\n\n You can add multiple policies to the same DataSet by clicking\n **Add Policy**\n in the\n **PDP**\n tab for the DataSet and repeating the preceding steps. You can even combine different filter types in a policy (for example, you could create one rule with a custom filter and another rule with a user attribute-defined filter).\n\n##\n Adding Users to Multiple PDP Policies\n\nThere may be times when you want to add a user or group to more than one policy on the same DataSet. For example, you may have a salesperson named \"Ted\" who works within the \"East\" region but also needs access to California's data. You can accomplish this by adding a\n *new*\n policy in which the data for California is applied to Ted. Adding \"California\" to the existing policy in which you have selected the East region\n *will not work*\n —your DataSet appears empty. This is because selecting multiple values from the same DataSet applies an\n\nAND\n\nstatement, and because \"California\" is never found within the East region in the DataSet, the policy prevents data from appearing. Separate policies in the same DataSet, however, are considered\n\nOR\n\nstatements; therefore, Ted's data appears for both the East region and California.\n\n*Video - Query Creation in Personalized Data Permissions (PDP)**\n\n\n###\n Viewing PDP Outcomes\n\nBy clicking the\n **Impact**\n button, you can open a dialog that shows how setting PDP policies for a DataSet will affect DataFlows and cards tied to the DataSet. Any affected DataFlows fall under the\n **Attention**\n tab, and any affected cards fall under the\n **Personalized**\n tab. If the policies will not affect any DataFlows or cards, no tabs appear.\n\n\n It is highly recommended that you view PDP outcomes before creating policies on a DataSet, especially if the DataSet is an input DataSet in a DataFlow. In the event that a DataFlow will be broken by setting PDP policies on this DataSet, a\n **Fix It**\n button is provided. You can also include the DataFlow owner in the\n **All Rows**\n group, which ensures that the DataFlow will not break.\n\n*Video - Impact Insights - Personalized Data Permissions (PDP)**\n\n\n###\n Previewing DataSets Affected by PDP Policies\n\nAll PDP policies include the ability to preview the data in the DataSet as affected by that policy. After you create a policy, a good practice is to preview the data for that policy to make sure only the necessary data appears.\n\n\n**To preview a DataSet for a PDP policy,**\n\n. In the\n **PDP**\n tab for the DataSet you want to preview, mouse over the row for the policy you want to preview.\n2. Click the eye icon\n\nto open the preview.\n3. Click\n **Done**\n when you are finished previewing the data.\n\nDeleting PDP Policies\n-----------------------\n\nYou delete a PDP policy in the\n **PDP**\n tab for the DataSet with the policy. When you delete a policy, it is no longer applied to cards, alerts, DataFlows, etc.\n\n\n**Important:**\n Deleting all policies for a DataSet turns off PDP for the DataSet and all users with access will be able to see the data.\n\n\n**To delete a PDP policy,**\n\n. In the\n **PDP**\n tab for the DataSet with policies you want to delete, mouse over the row for the policy you want to delete.\n2. Click the trash can icon\n\nto delete the policy.\n3. Click\n **Delete**\n to confirm the deletion.\n\n\n If this is the only policy applied to the DataSet, you are given a warning that all users with access will be able to see the data if the policy is deleted.\n4. If you are sure you want to do this, click\n **Delete**\n again.\n\nEnabling or Disabling Attributes for Dynamic PDP Policies\n-------------------------------------------------------------\n\nDynamic PDP policies allow you to assign policies that are unique per individual. Instead of selecting individual values in specific columns to pertain to specific users or groups, you select a column and a user attribute. Domo then automatically allows people to see only those rows that match that user attribute. For example, you could create an attribute-defined PDP policy based on a user's email address. Then, if a user opened a card with this PDP policy applied, Domo would only show data corresponding to those rows containing the user's email address.\n\n\n To prevent security breaches, user attributes\n *must*\n be locked in Admin Settings before they can be used in PDP policies. This can be done only by users with Admin security privileges. Locked attributes can only be unlocked by Admin users and only when they are not being used in any PDP policies. For example, if a user creates a PDP policy that filters on the\n **Employee number**\n attribute, and an Admin user then goes into\n **Admin Settings**\n to unlock that attribute, he would not be able to do so. Either one of the users would first need to disable the PDP policy.\n\n\n Dynamic PDP policies can be used in conjunction with simple and custom filters.\n\n\n In continuation, we describe how to enable/lock attributes in the Admin Settings. For information about adding dynamic PDP policies on a DataSet, see Creating PDP Policies, above.\n\n\n**To enable user attributes for PDP,**\n\n. In the Domo navigation header, select\n **More**\n**> Admin > Governance > Attributes**\n . You must have an Admin security profile to access this screen. For more information about security profiles, see\n\nSecurity Role Reference\n\n.\n2. Check the boxes for all attributes you want to enable for use in PDP.\n\n\n Grayed out boxes indicate attributes already being used in PDP.\n3. Click\n **Save Changes**\n when done.\n\n*To disable user attributes for PDP,**\n\n. In the Domo navigation header, select\n **More**\n**> Admin > Governance > Attributes**\n . You must have an Admin security profile to access this screen. For more information about security profiles, see\n\nSecurity Role Reference\n\n.\n2. Clear the boxes for all attributes you want to disable.\n\n\n Grayed out boxes indicate attributes already being used in PDP. You\n *cannot*\n disable these attributes until they have been disabled in the PDP policies.\n3. Click\n **Save Changes**\n when done.\n\nExample Scenario — PDP Applied to a Card\n------------------------------------------\n\nThis straightforward example shows how adding PDP policies to a card affects how the data in the card appears to different users. Suppose the company \"Kablinko Electronics\" keeps track of sales throughout the U.S. using a DataSet in which sales are broken down by region—\"East\" and \"West.\" The data is presented using a U.S. map. By default, no PDP policies are in place, so all data in the DataSet appears, as follows:\n\nThe head of a Sales department wants to ensure that salespeople in each region see only the data that pertains to them. All salespeople belong to one of four groups—\"Kablinko East,\" \"Kablinko West,\" \"Kablinko South,\" and \"Kablinko Central\"—so this is a simple matter of connecting each group to a policy filtered to the appropriate region.\n\n\n The department goes into the Data Center, locates the pertinent DataSet, and clicks\n **PDP**\n to open the PDP tab for the DataSet. They enter a policy name—\"East Region\"—then select\n **Add Data**\n to open the\n **Add Data Access**\n dialog. They select\n **Region**\n as the column and\n **East**\n as the value, then apply the changes. Finally they select the \"Kablinko East\" group in the\n **Add Groups & People**\n dialog and save the new policy. They then repeat the same steps for a \"West Region\" policy, selecting \"West\" as the value and \"Kablinko West\" as the group. They do not create a policy for \"Kablinko Central\" or \"Kablinko South\" yet.\n\n\n Ross'\n **PDP**\n tab for the DataSet now appears as follows:\n\nNow that the policies are in place, users from the three groups see the data in the map differently depending on their group's policy. A user from the \"East\" group would see the card as follows:\n\nNotice that data only appears for those states that fall into the \"East Region.\" Also notice that the chart total has changed to reflect the PDP policy (it was 1,453,971.45 in the non-PDP version of the chart) and that a\n\nstamp appears near the title to indicate that this view shows a PDP-filtered version of the data.\n\n\n Likewise, a user from the \"West\" group would see the card as follows:\n\nBecause the department head did not create policies for \"Kablinko Central\" or \"Kablinko South,\" users from those groups attempting to access the card would see the following:\n\nThese users could then click the\n **Request Access**\n button to send a Buzz message to the department head (the DataSet owner) asking them to create the necessary policies for the users to view their pertinent \"slices\" of data.\n\n\n Deleting PDP Policies\n-----------------------\n\nYou delete a PDP policy in the\n **PDP**\n tab for the DataSet with the policy. When you delete a policy, it is no longer applied to cards, alerts, DataFlows, etc.\n\n\n**Important:**\n Deleting all policies for a DataSet turns off PDP for the DataSet and all users with access will be able to see the data.\n\n\n**To delete a PDP policy,**\n\n. In the\n **PDP**\n tab for the DataSet with policies you want to delete, mouse over the row for the policy you want to delete.\n2. Click the trash can icon\n\nto delete the policy.\n3. Click\n **Delete**\n to confirm the deletion.\n\n\n If this is the only policy applied to the DataSet, you are given a warning that all users with access will be able to see the data if the policy is deleted.\n4. If you are sure you want to do this, click\n **Delete**\n again.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042934614\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004906\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCreating and Deleting PDP Policies\n\n", "article_total_view_count": "\n\n\n 14,617\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:35 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "creating_and_deleting_pdp_policies", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "working_with_datasets_in_domo", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "personalized_data_permissions_pdp", "url": "/s/topic/0TO5w000000Zao2GAC"}]}