{"file_path": "../../raw_kb_v2\\article\\360046752694\\index.html", "content": {"Title": "Sumo Editor Layout", "Article Body": "Intro\n                       \n\n                        A Sumo card provides two possible views of a table—a standard column-based view or a more powerful pivot view with functionality similar to that found in Microsoft Excel. The Sumo card builder interface consists of a\n                        \n\n                          Column View\n                         \n\n                        and a\n                        \n\n                          Pivot View\n                         \n\n                        .\n                        \n\n                          Column View\n                         \n\n                        provides an interface for creating standard column-based tables, whereas in\n                        \n\n                          Pivot View\n                         \n\n                        you can create pivot tables. You can manipulate table data in each view independently. The view that is selected when you save your table is the view that appears in this Sumo card in the page view.\n                       \n\n\n                         In the build/edit interface for a Sumo card, you can add and remove columns, sort, aggregate, change how date data is represented, and so on. The available options are the same whether you are building a Sumo card, editing an existing card, or applying temporary edits in the\n                         \n                          Details\n                         \n                         view. When you make edits in the Details view, your changes are applied only to your own Domo instance and are temporary; when you leave the\n                         \n                          Details\n                         \n                         view, your changes disappear. In contrast, any changes you make in the\n                         \n                          Edit\n                         \n                         view are applied permanently to the Sumo table unless you or another user changes them again in the\n                         \n                          Edit\n                         \n                         view. For more information about\n                         \n                          filtering data\n                         \n                         in a card\n                         \n                          Details\n                         \n                         view, see\n                         \n                          Filtering Data in a Card Details View\n                         \n                         .\n                        \n\n                         This topic discusses the interfaces for\n                         \n\n                           Column View\n                          \n\n                         and\n                         \n\n                           Pivot View\n                          \n\n                         . For information about creating a Sumo card using the components in this view, see\n                         \n                          Sumo cards\n                         \n                         .\n                        \n\n                         Column View\n                        \n\n                         This view presents the standard columnar table view for the data in the DataSet you have selected. In this view you can add or remove columns from your table; hide or show all columns; sort column data; combine rows with like headings and aggregate their data; break up rows you have combined; change how date data is represented; change how data is aggregated in combined rows; apply filters; format numbers in value columns; and apply conditional formatting to value and string columns.\n                        \n\n                         The following screenshot calls out the most important parts of\n                         \n\n                           Column View\n                          \n\n                         :\n                        \n\n\n\n\n                         You can learn more about these components in the following table:\n                        \n\n\n\n\n\n                             Name\n                            \n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                             View toggle\n                            \n\n\n\n                             Toggles between\n                             \n                              Column View\n                             \n                             and\n                             \n                              Pivot View\n                             \n                             .\n                            \n\n\n\n\n\n                             Edit icon\n                            \n\n\n\n                             Lets you hide or show the edit controls.\n                            \n\n\n\n\n\n                             Table name\n                            \n\n\n\n                             The name of this Sumo table. You can change the name by clicking anywhere within the current name (or default text, if no name has been entered yet) and entering the desired name.\n                            \n\n\n\n\n\n                             Fiscal Calendar button\n                            \n\n\n\n                             Toggles the Fiscal Calendar on and off if one has been implemented in your Domo instance.\n                            \n\n\n\n\n\n                             DataSet\n                            \n\n\n\n                             The DataSet used to power up this Sumo table. You can add a DataSet or change the selected DataSet by clicking anywhere in the DataSet field and selecting the desired DataSet. Once a DataSet is selected, a preview of the data appears on the screen.\n                            \n\n\n\n\n\n\n\n\n\n                                 Note:\n                                \n                                The DataSet you select must already exist in Domo. You cannot upload a new DataSet in the Sumo card interface. For more information about uploading DataSets, see\n                                \n                                 Adding a DataSet Using a Data Connector\n                                \n                                .\n                               \n\n\n\n\n\n\n\n\n                             Table description\n                            \n\n\n\n                             The description that appears when you mouse over this Sumo table in the Card view or click the card name in the Details view. You can change the description by clicking anywhere within the current description (or default text, if no description has been entered yet) and entering the desired description.\n                            \n\n\n\n\n\n                             Column header\n                            \n\n\n\n                             The name of this column. Mousing over a column causes two icons to appear.\n                            \n\n                             Click to sort a column. Clicking the icon once sorts the column alphabetically; clicking it a second time applies a descending sort; and clicking it a third time turns off sorting in the column (in which case, items appear as they do in the DataSet).\n                            \n\n                             Click to access options for manipulating the data in a column. Available options include the following:\n                            \n\n                             Update all of the below links using anchors once Sumo creation topic is in place.\n                            \n\n\n\n\n                                Hide Column.\n                               \n                               Hides this column. You can show a column you have hidden by clicking its name in the column list on the left side of the table.\n                              \n\n\n\n\n                                Sort Ascending/Sort Descending.\n                               \n                               Allows you to sort columns using an ascending or descending sort. This option is available for all columns. In\n                               \n                                Column View\n                               \n                               you can only have one column sort at a time. For example, you could not sort by date and then have a separate sort for your values column for each represented date. If you want multiple sorts, create your table in\n                               \n                                Pivot View\n                               \n                               . For more information about sorting, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Group.\n                               \n                               Combines all rows with like headings for the column you apply it to and aggregates the data in those rows. Cells in columns that cannot be aggregated display a value of \"Unique\" by default, which is a count of all unique items within that column. For example, if a column with salesperson names contained five instances of the name \"Bob Jones,\" that name would only be counted once using the \"Unique\" aggregation. You can change the aggregation type by clicking in the second row or by choosing\n                               \n                                Change Aggregate\n                               \n                               in the column dropdown menu and selecting the desired aggregation type. This option is available for all columns\n                               \n                                except\n                               \n                               date columns. For more information about grouping and ungrouping, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Ungroup.\n                               \n                               Breaks apart rows that have been grouped. For more information about grouping and ungrouping, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Date Grain.\n                               \n                               Lets you change how date data is represented, either by day, week, quarter, month, or year. For more information, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Change Aggregate.\n                               \n                               Appears in the column dropdown menus after you have rolled up one or more columns (except for the menus of the column(s) you rolled up). Available aggregations include the following:\n                              \n\n\n\n                                 Sum — Totals all values in the rows for this column.\n                                \n\n\n\n                                 Average — Shows the average value for all rows.\n                                \n\n\n\n                                 Unique — Shows the number of unique items in the column.\n                                \n\n\n\n                                 Count — Shows the number of all items in the column.\n                                \n\n\n\n                                 Min — Shows the smallest value in the column.\n                                \n\n\n\n                                 Max — Shows the largest value in the column.\n                                 \n\n                                 You can also change the aggregation type for the total value for a column. Totals are shown in the \"TOTAL\" cells at the bottom of each column, along with their aggregation indicators (unless you hide the totals row).\n                                 \n\n                                 For more information about aggregating, see\n                                 \n                                  Adding a Sumo Card\n                                 \n                                 .\n                                \n\n\n\n\n\n\n                                Filter.\n                               \n                               Filters rows. For a text column, you select the specific items that you want to appear in the table. For a value column, you select the desired value range from a number of comparisons like \"greater than,\" \"less than,\" etc. For a date column, you select a date range from a number of options. When you add a filter, a bar for that filter appears above the table. You can click the bar to open the filter for editing or removal. For more information about filtering, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Formatting.\n                               \n                               Lets you apply different formatting to numbers in value and date columns. For more information about formatting, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Conditional Formatting.\n                               \n                               Lets you set rules for a value or string column so that any values or strings that meet certain conditions appear with a different text color and/or background. For more information about formatting, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n\n\n\n                             Save button\n                            \n\n\n\n                             Saves this Sumo card and updates the summary image in the card page accordingly. This image appears as a standard table or a condensed pivot table depending on whether\n                             \n                              Column View\n                             \n                             or\n                             \n                              Pivot View\n                             \n                             is selected, respectively, when you save. For more information, see\n                             \n                              Sumo cards\n                             \n                             .\n                            \n\n\n\n\n\n                             Totals toggle\n                            \n\n\n\n                             Hides/shows the \"Total\" row at the bottom of the table.\n                            \n\n\n\n\n\n                             Available columns\n                            \n\n\n\n                             The columns in this DataSet. Green indicates that this column is found in the table; gray indicates that it is not. You can click a column to add it to the table or remove it. You can also drag and drop columns within the list to reorder them in the table.\n                            \n\n                             Columns you add to a DataSet using Beast Mode appear in your list of available columns in Sumo. For more information about adding Beast Mode columns to a DataSet, see\n                             \n                              Transforming Data Using Beast Mode\n                             \n                             .\n                            \n\n\n\n\n\n                             Hide controls\n                            \n\n\n\n                             Let you hide or show columns in\n                             \n                              Column View\n                             \n                             .\n                            \n\n\n\n\n\n                             Table preview\n                            \n\n\n\n                             A preview of the table in its standard columnar format.\n                            \n\n\n\n\n\n                         Also, if your DataSet contains more than 50 rows, you can load more rows into the table preview by clicking\n                         \n\n                           Load More Rows\n                          \n\n                         , which is found at the bottom of the preview.\n                        \n\n                         Pivot View\n                        \n\n                         In this view, you can create powerful pivot tables by dragging and dropping column names into a template table with regions for rows, columns, and values. As you add column names to the template table, the data in those columns appears in your pivot table. You can also reposition column names in the template table or delete them altogether, and the pivot table is updated accordingly.\n                        \n\n                         The following screenshot calls out the most important parts of\n                         \n\n                           Pivot View\n                          \n\n                         :\n                        \n\n\n\n\n                         You can learn more about the components in the following table:\n                        \n\n\n\n\n\n                             Name\n                            \n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                             Fiscal Calendar button\n                            \n\n\n\n                             Toggles the Fiscal Calendar on and off if one has been implemented in your Domo instance.\n                            \n\n\n\n\n\n                             DataSet\n                            \n\n\n\n                             The DataSet used to power up this Sumo table. You can add a DataSet or change the selected DataSet by clicking anywhere in the DataSet field and selecting the desired DataSet. Once a DataSet is selected, a preview of the data appears on the screen.\n                            \n\n\n\n\n\n\n\n\n\n                                 Note:\n                                \n                                The DataSet you select must already exist in Domo. You cannot upload a new DataSet in the Sumo card interface. For more information about uploading DataSets, see\n                                \n                                 Adding a DataSet Using a Data Connector\n                                \n                                .\n                               \n\n\n\n\n\n\n\n\n                             Table name\n                            \n\n\n\n                             The name of this Sumo table. You can change the name by clicking anywhere within the current name (or default text, if no name has been entered yet) and entering the desired name.\n                            \n\n\n\n\n\n                             Template table\n                            \n\n\n\n                             A table with regions for rows, columns, and values. When you drag and drop column names from the unused columns pool into any of the regions in the template table, or double-click a column name to add it to the template table, the data from those columns appears in the associated region of the pivot table. For example, if you dragged a column into the rows region of the template table, the values from that column would appear on the left side of the pivot table. You can also reposition column names in the template table or delete them altogether, and the pivot table is updated accordingly.\n                            \n\n                             For more information about building a pivot table, see\n                             \n                              Adding a Sumo Card\n                             \n                             .\n                            \n\n                             When you click a column name in the template table, a dialog pops up in which you can specify filters for this column. For more information about applying filters, see\n                             \n                              Adding a Sumo Card\n                             \n                             .\n                            \n\n\n\n\n\n                             Pivot table\n                            \n\n\n\n                             Your Sumo pivot table. You can add rows, columns, and values to the table by dragging column names from the unused columns pool into the rows, columns, or values regions of the template table. As you move column names from region to region in the template table, the pivot table updates accordingly. If you have not yet added any columns to the template table, no pivot table appears.\n                            \n\n                             For more information about building a pivot table, see\n                             \n                              Adding a Sumo Card\n                             \n                             .\n                            \n\n                             When you click a column name in the pivot table, a pop-up list appears with many options. These options include the following:\n                            \n\n\n\n\n                                Hide Column.\n                               \n                               Removes this column from the pivot table, sending it back to the unused columns pool.\n                              \n\n\n\n\n                                Sort Ascending/Sort Descending.\n                               \n                               Allows you to sort columns using an ascending or descending sort. This option is available for all columns. In\n                               \n                                Pivot View\n                               \n                               , you can sort by multiple columns at once as long as you sort only date and series columns. For example, you could have a descending sort in your date column (so that the most recent date would appear at the top) and an ascending (alphabetical) sort in your series column. If you sort a value column, all other columns are sorted accordingly to match the value sort. For more information about sorting, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Date Grain.\n                               \n                               Lets you change how date data is aggregated, either by day, week, quarter, month, or year. For more information, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Change Aggregate.\n                               \n                               Appears for value columns in the pivot table. Available aggregations include the following:\n                              \n\n\n\n                                 Sum — Totals all values in the rows.\n                                \n\n\n\n                                 Average — Shows the average value for each row.\n                                \n\n\n\n                                 Unique — Shows the number of unique items for each row.\n                                \n\n\n\n                                 Count — Shows the number of items in each row.\n                                \n\n\n\n                                 Min — Shows the smallest value in each row.\n                                \n\n\n\n                                 Max — Shows the largest value in each row.\n                                 \n\n                                 For more information about aggregating, see\n                                 \n                                  Adding a Sumo Card\n                                 \n                                 .\n                                \n\n\n\n\n\n\n                                Filter.\n                               \n                               Filters rows. For a text column, you select the specific items that you want to appear in the table. For a value column, you select the desired value range from a number of comparisons like \"greater than,\" \"less than,\" etc. For a date column, you select a date range from a number of options. When you add a filter, a bar for that filter appears above the table. You can click the bar to open the filter for editing or removal. For more information about filtering, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Formatting.\n                               \n                               Lets you apply different formatting to numbers in value columns. You can also access formatting options for a column by clicking the column name in the template table or unused columns pool. For more information about formatting, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n                                Conditional Formatting.\n                               \n                               Lets you set rules for a value or string column so that any values or strings that meet certain conditions appear with a different text color and/or background. For more information about formatting, see\n                               \n                                Adding a Sumo Card\n                               \n                               .\n                              \n\n\n\n\n\n\n\n                             Save button\n                            \n\n\n\n                             Saves this Sumo card and updates the summary image in the card page accordingly. This image appears as a standard table or a condensed pivot table depending on whether\n                             \n                              Column View\n                             \n                             or\n                             \n                              Pivot View\n                             \n                             is selected, respectively, when you save. For more information, see\n                             \n                              Sumo cards\n                             \n                             .\n                            \n\n\n\n\n\n                             Edit icon\n                            \n\n\n\n                             Hides/shows the unused columns pool and template table.\n                            \n\n\n\n\n\n                             Totals toggle\n                            \n\n\n\n                             Hides/shows all \"Total\" rows and columns in the pivot table.\n                            \n\n\n\n\n\n                             View toggle\n                            \n\n\n\n                             Toggles between\n                             \n                              Column View\n                             \n                             and\n                             \n                              Pivot View\n                             \n                             .\n                            \n\n\n\n\n\n                             Unused columns\n                            \n\n\n\n                             The columns in this DataSet you have not added to your pivot table. You can add columns to your pivot table by dragging and dropping them into the desired region of the template table. Normally you drop category columns into the rows and columns regions of the template table and value columns into the values region. However, you are not required to do so. For example, you might want to show sales by zip code. The \"Zip Codes\" column would be interpreted by Domo as a values column and thus appear in your \"Values\" unused column listing. But you could drop it into the rows or columns region of your template table, and it would be treated as category data.\n                            \n\n                             For more information about building pivot tables, see\n                             \n                              Adding a Sumo Card\n                             \n                             .\n                            \n\n                             When you click a column name in the template table, a dialog pops up in which you can specify filters for this column. For more information about filters, see\n                             \n                              Adding a Sumo Card\n                             \n                             .\n                            \n\n                             Columns you add to a DataSet using Beast Mode appear in your list of unused columns in Sumo. For more information about adding Beast Mode columns to a DataSet, see\n                             \n                              Transforming Data Using Beast Mode\n                             \n                             .", "Preview Article": "Click here to preview", "URL Name": "360046752694", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004115", "Archived Date": "", "Language": "English", "Primary Version": "Sumo Editor Layout", "Article Total View Count": "5,022", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Sumo Editor Layout\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Sumo Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoHGAS"}]}