{"file_path": "../../raw_kb_v2\\article\\360043429693\\index.html", "content": {"title": "\n\n\n Formatting Data Label and Hover Text in Your Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nData labels and hovers in charts have the same purpose—to show the value of a chart element such as a bar, bubble, etc. However, they differ in the way they present this information. Data labels, when turned on, always appear for every element in a chart. This makes it easy for viewers to see information quickly but may also cause a chart to appear cluttered. Hovers, by contrast, appear only when a viewer mouses over a chart element. Using hovers rather than data labels may make identifying exact values more time-consuming; however, this also makes a chart look more clean and professional.\n\n\n By default, most charts use hovers, not data labels, to show the most important information for each chart element. You can change this default behavior by doing any of the following:\n\n Turning on data labels by entering the desired label text in\n **Data Label Settings > Text**\n in\n **Chart Properties**\n . This causes data labels to always appear. Default hover text also appears when viewers mouse over chart elements.\n* Changing the default hover text by specifying your own text in the\n **Hover Text Settings > Text**\n property in\n **Chart Properties**\n .\n* Including both data labels\n *and*\n customized hovers by specifying both data label and hover text in\n **Chart Properties**\n .\n\nSome chart types have different behavior than that explained above. These differences will be explained in continuation.\n\n*Video - Applying Data and Hover Labels**\n\nTurning on and customizing data labels\n----------------------------------------\n\nIn most chart types that allow data labels, you turn on data labels by entering the desired data label text\n **Data Label Settings > Text**\n in Chart Properties.\n\n\n There are a number of options you can use to customize data labels. These are also found in\n **Chart Properties > Data Label Settings**\n . These options do\n *not*\n work unless you enter text in\n **Data Label Settings > Text.**\n (One exception to this is Sankey charts, in which data labels are on by default unless you hide them.)\n\n\n**To turn on and customize data labels for most chart types,**\n\n. Open the Analyzer for the chart you want to edit.\n2. In\n **Chart Properties**\n , click\n **Data Label Settings**\n .\n3. (Optional) Enter the desired text in the\n **Text**\n field.\n\n\n You can insert macros here by clicking the \"+\" button and selecting the desired macro. For more information about macros, see\n\nData label macros\n\n.\n4. (Optional) Set the other options in\n **Data Label Settings**\n as desired. These options are described in continuation.\n\n\n###\n Data label options for charts\n\nThe following table lists and describes all of the options in\n **Chart Properties > Data Label Settings**\n available for charts. You can click a thumbnail image to see a larger image.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Text\n  |\n Specifies text for the data labels. This property is usually the \"on switch\" for data labels—you must specify text for them to appear. For Sankey charts, data labels are on by default unless you use the\n **Hide**\n option.\n\n\n You can insert macros here by clicking the \"+\" button and selecting the desired macro. For more information about macros, see\n\nData label macros\n\n.\n  |\n —\n  |\n|\n Hide\n  |\n Hides/shows data labels in a Sankey chart.\n  |\n —\n  |\n|\n Show One Label\n  |\n Determines whether a single label is shown for an entire stack in a vertical stacked bar chart. By default this single label represents the topmost data item in a stack, but you can change the represented data item by entering the desired macro in the\n **Text**\n field. For example, to implement a single label that represents the total value of a stack, you would enter\n\n%\\_CATEGORY\\_TOTAL\n\nin the\n **Text**\n field. This is the data label that is shown in the example at right.\n  |\n\n|\n|\n Show\n  |\n Available for pareto charts. This property determines whether data labels are shown parallel to the bars in the chart or rotated 90 degrees.\n  |\n —\n  |\n|\n Position\n  |\n Determines where data labels are shown in relation to their corresponding data items. The example shows a chart in which the data label position for a vertical bar chart has been set to\n **Inside Top**\n .\n  |\n\n|\n|\n Fill\n  |\n Lets you add a colored fill to your data labels. The example at right shows a chart in which a red fill color with 45% transparency has been added.\n  |\n\n|\n|\n Fill Color\n  |\n Lets you specify the color for the fill in your data labels. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Fill Transparency Percent\n  |\n Lets you specify the fill transparency for data labels. You can specify any number between 0 and 100, in which 0 is completely opaque and 100 is completely transparent. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Rotate\n  |\n Lets you rotate data labels 90 degrees. The example at right shows a chart in which this has been done.\n  |\n\n|\n|\n Justification\n  |\n Determines the justification for multi-line data labels—either\n\nLeft\n\n,\n\nCenter\n\n, or\n\nRight\n\n. The example chart includes multi-line data labels that have been left-justified (by selecting\n\nLeft\n\nfor the\n **Justification**\n property).\n  |\n\n|\n|\n Show when zero\n  |\n Determines whether data labels are shown for chart elements with a value of 0.\n  |\n —\n  |\n|\n Use scale format\n  |\n Determines whether data labels use the same formatting that has been set for the value scale.\n  |\n —\n  |\n|\n Use scale abbreviation\n  |\n Determines whether data labels use the same scale abbreviation that has been set for the value scale.\n  |\n —\n  |\n|\n Percent Value Decimal Places\n  |\n Determines the number of decimal places used in percentage values in data labels.\n  |\n —\n  |\n|\n Allow Overlap\n  |\n Determines whether data labels are still shown when they overlap. For most chart types, data labels will not overlap unless you select this option. Recommended only for charts with a small number of series.\n  |\n —\n  |\n|\n Show Data Labels On\n  |\n Determines whether data labels appear for lines, bars, or both in line-bar combination charts.\n  |\n —\n  |\n|\n Font Size\n  |\n Sets the font size for data labels in Sankey charts. The default size is\n **Medium**\n .\n  |\n —\n  |\n|\n Text Color\n  |\n Determines the text color for data labels. The default is\n **Black**\n . If you select\n **Complementary**\n (shown in the example at right), colors are determined automatically based on the node color.\n  |\n\n|\n\n\n###\n Data label options for maps\n\nThe following table lists and describes all of the options in\n **Chart Properties > Data Label Settings**\n available for maps. (Some map types, such as latitude-longitude maps, do not have data labels.) You can click a thumbnail image to see a larger image.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Text\n  |\n Specifies text for the data labels. This property is the \"on switch\" for data labels—you must specify text for them to appear.\n\n\n You can insert macros here by clicking the \"+\" button and selecting the desired macro. For more information about macros, see\n\nData label macros\n\n.\n  |\n —\n  |\n|\n Font Size\n  |\n Allows you to increase or decrease the data label font size. The \"Default\" font size falls between the largest and second-smallest font sizes. For more information, see\n\nChanging the Font Size in Your Chart\n\n.\n  |\n —\n  |\n|\n Text Color\n  |\n Lets you determine the text color for your map data labels. If you select \"Default,\" the color will be automatically determined based on the background color. This is shown in the example at right, in which the data labels on darker areas appear white and those on lighter areas appear dark red.\n  |\n\n|\n|\n Value Abbreviation\n  |\n Determines whether data label values are abbreviated (the default being 3 significant digits) or not.\n  |\n —\n  |\n|\n Fill\n  |\n Lets you add a colored fill to your map data labels. The example at right shows a chart in which a pale blue fill color with 60% transparency has been added.\n  |\n\n|\n|\n Fill Color\n  |\n Lets you specify the color for the fill in your map data labels. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n|\n Fill Transparency Percent\n  |\n Lets you specify the fill transparency for map data labels. You can specify any number between 0 and 100, in which 0 is completely opaque and 100 is completely transparent. This property is only available when you check the\n **Fill**\n box.\n  |\n —\n  |\n\nData label macros\n-------------------\n\nDomo lets you add macros to data labels to reference different data items. A variety of macros is available. You can open a list of selectable macros by clicking the \"+ button in the\n **Text**\n field.\n\n\n For example, if you wanted all data labels in a vertical bar chart to show the category name, followed by a colon and space, followed by the data item value, you would 1) select the\n **Category**\n**Name**\n macro from the dropdown, 2) add a colon and a space after the\n\n%\\_CATEGORY\\_NAME\n\ntext in the field, and 3) select the\n **Value**\n macro from the dropdown. The data labels would then look similar to the ones in the following chart:\n\nAvailable macros depend upon the selected chart type.\n\n###\n Data label macros for most charts\n\nData labels for most types of charts, including bar and line charts, area charts, and so on, can include the following macros:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Category Average\n  |\n The average of all series in each category in a stacked bar chart.\n  |\n|\n Category Name\n  |\n The name of the category that the data item belongs to.\n  |\n|\n Category Number\n  |\n The number of the category that the data item belongs to.\n  |\n|\n Category Total\n  |\n The sum of all the data values in the category that the data item belongs to.\n  |\n|\n Graph Total\n  |\n The sum of all the values in the chart.\n  |\n|\n Percent of Category\n  |\n The data value represented as a percentage of the sum of all the data values in the category.\n  |\n|\n Percent of Total\n  |\n The data value represented as a percentage of the sum of all the data values in the chart.\n  |\n|\n Percent of Previous\n  |\n The data value represented as a percentage of the sum of the previous category in a funnel chart.\n  |\n|\n Series Name\n  |\n The name of the data series that the item belongs to.\n  |\n|\n Series Number\n  |\n The number of the data series that the item belongs to.\n  |\n|\n Tooltip Field 1-3\n  |\n Allow you to include additional data in your chart by referencing columns you have dragged into the\n **Tooltip**\n fields above the chart (which you can toggle on or off by clicking\n **Tooltips**\n in the icon bar at the top of the Analyzer window). For more information, see\n\nReferencing tooltip fields\n\n.\n  |\n|\n Value\n  |\n The value of the data item.\n  |\n\nFor more information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n###\n Data label macros for pie and donut charts\n\nYou can customize the label text that appears in slices in pie and donut charts. You do this in Chart Properties, in the\n **Data Label Settings > Text**\n property. You can use any of the following macros:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Name\n  |\n The name of the data item for a given slice.\n  |\n|\n Value\n  |\n The value of the data item.\n  |\n|\n Percent of Total\n  |\n The data value represented as a percentage of the sum of all the data values in the chart.\n  |\n\nIn the example screenshot below, the user has entered the following text for this property:\n\n%NAME: %\\_PERCENT\\_OF\\_TOTAL\n\n###\n Data label macros for maps\n\nYou can customize the label text that appears in slices in most map types (with the exception of a few types such as latitude-longitude maps). You do this in Chart Properties, in the\n **Data Label Settings > Text**\n property. You can use any of the following macros:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Long Name\n  |\n The full name of the region (which is the name used by default).\n  |\n|\n Name\n  |\n An abbreviated designation for the region, usually a two-letter state or country abbreviation (such \"MA\" for Massachusetts).\n  |\n|\n Range Name\n  |\n The name of the range (if range names have been specified using the\n **Ranges**\n chart properties).\n  |\n|\n Tooltip Field 1-3\n  |\n Allow you to include additional data in your chart by referencing columns you have dragged into the\n **Tooltip**\n fields above the chart (which you can toggle on or off by clicking\n **Tooltips**\n in the icon bar at the top of the Analyzer window). For more information, see\n\nReferencing tooltip fields\n\n.\n  |\n|\n Value\n  |\n The value of the associated region.\n  |\n|\n Code\n  |\n (Japan map only) The name of the Japanese prefecture in Japanese characters.\n  |\n\n\n####\n Data label macros for tree maps\n\nBy default, data labels in tree maps show only the category names for each data item. You can customize these labels to show the information you want. You do this in the\n **Label Settings**\n**> Text**\n field.\n\n\n You can use any of the following macros to change the default label text in tree maps:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Category Number\n  |\n The number of the category that the item belongs to.\n  |\n|\n Graph Total\n  |\n The total of all data values in the tree map.\n  |\n|\n Name\n  |\n The category name of the data item.\n  |\n|\n Percent of Total\n  |\n The data value represented as a percentage of the sum of all the data values in the tree map.\n  |\n|\n Series Number\n  |\n The number of the data series that the item belongs to.\n  |\n|\n Value\n  |\n The value of the data item.\n  |\n\nFor example, if you wanted each square in your tree map to show the data item name followed by that item's percentage of all items in the tree map, you would 1) select the\n **Name**\n macro from the dropdown in\n **Label Settings > Text**\n , 2) add a colon and a space after the\n\n%\\_NAME\n\ntext in the field, and 3) select the\n **Percent of Total**\n macro from the dropdown. The following screenshot shows an example tree map that depicts the percentage of each U.S. state's population in the country.\n\n\n####\n Data label macros for Gantt charts\n\nBy default, data labels in Gantt and percent complete Gantt charts show category names, item names, and date ranges, in that order. For example: \"Sprint 1: Write PRD: 2013-02-05 - 2013-02-16.\" You can replace this default text with your own custom text.\n\n\n You can use any of the following macros to change the default label text in Gantt charts :\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Category\n  |\n The category for the data item. Only available if you break up the chart data by dropping a column into the\n **Category**\n field above the chart.\n  |\n|\n End Date\n  |\n The end date of the data item.\n  |\n|\n Item\n  |\n The name of the data item.\n  |\n|\n Percent Complete\n  |\n The percentage of completion of the data item. (Available in Gantt percent complete charts only.)\n  |\n|\n Start Date\n  |\n The start date of the data item.\n  |\n|\n Tooltip Field 1-3\n  |\n Allow you to include additional data in your Gantt chart by referencing columns you have dragged into the\n **Tooltip**\n fields above the chart (which you can toggle on or off by clicking\n **Tooltips**\n in the icon bar at the top of the Analyzer window). For more information, see\n\nReferencing tooltip fields\n\n.\n  |\n\n\n####\n Data label macros for Sankey charts\n\nBy default, data labels in Sankey charts show the names of the nodes. You can replace this default text with your own custom text.\n\n\n You can use any of the following macros to change the default label text in Sankey charts :\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Name\n  |\n The name of the node.\n  |\n|\n Percent Value\n  |\n The value of this node as a percentage of the total of all the nodes on the same vertical axis. (So if the node was an input node on the left side of the chart, the percent value would be the percentage of the total of all nodes on the left side of the chart.)\n  |\n|\n Value\n  |\n The actual value for the node.\n  |\n\nCustomizing hover text\n------------------------\n\nIn most chart types, hover text always appears when you mouse over chart elements and cannot be turned off. However, you can customize the text to appear the way you want. A variety of options for customizing hover text is available in\n **Chart Properties > Hover Text Settings**\n .\n\n\n Some chart types have different options for hover text. For example, in maps, hover labels appear only in the card view, not the Details view. Maps also have a different set of macros for specifying hover text, as do tree maps and Gantt charts. These chart types are discussed later.\n\n\n**To customize hover text for most chart types,**\n\n. Open the Analyzer for the chart you want to edit.\n2. In\n **Chart Properties**\n , click\n **Hover Text Settings**\n .\n3. Enter the desired text in the\n **Text**\n field.\n\n\n You can insert macros here by clicking the \"+\" button and selecting the desired macro. For more information about macros, see\n\nHover text macros\n\n.\n4. (Optional) Set the other options in\n **Hover Text Settings**\n as desired. These options are described in continuation.\n\n\n###\n Hover text options\n\n\n####\n Hover text options for charts\n\nThe following table lists and describes all of the options in the\n **Chart Properties > Hover Text Settings**\n for most chart types.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Text\n  |\n Lets you set the text that appears in chart hovers. You can insert macros here by clicking the \"+\" button and selecting the desired macro. For more information about macros, see\n\nHover text macros\n\n.\n  |\n|\n Use scale format\n  |\n Determines whether hovers use the same formatting that has been set for the value scale. This property overrides the\n **Hover Format**\n ,\n **Divide Value By**\n ,\n **Decimal Places**\n , and\n **Negative Numbers**\n properties.\n  |\n|\n Use scale abbreviation\n  |\n Determines whether hovers use the same scale abbreviation that has been set for the value scale.\n  |\n|\n Hover Format\n  |\n Determines whether values in hovers have currency or percent symbols affixed. This property is overridden by the\n **Use scale format**\n property.\n  |\n|\n Divide Value By\n  |\n When set, values in hovers are divided by the specified factor. This option is useful when the values in your chart are very large and you want to abbreviate them by dividing by a common number. For example, if the values in your chart represented millions of dollars, you could choose to divide by millions—all of the values in the hovers would then be reduced to more manageable single digits. When you choose to divide by\n **Percentage**\n , the numbers in the value scale are multiplied by 100. This property is overridden by the\n **Use scale format**\n property.\n  |\n|\n Decimal Places\n  |\n Determines the number of decimal places in values in hovers. This property is overridden by the\n **Use scale format**\n property.\n  |\n|\n Negative Numbers\n  |\n Determines the format for negative numbers. If you select\n **-100**\n , all negative numbers have a minus symbol affixed. If you select\n **(100)**\n , all negative numbers are enclosed in parentheses. This property is overridden by the\n **Use scale format**\n property.\n  |\n\n\n####\n Hover text options for maps\n\nThe properties in the following table are found in the\n **Hover Text**\n category in Chart Properties for maps.\n\n\n Option\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Hover Text\n  |\n Lets you set the text that appears in map hovers. A variety of macros for showing map values in your hovers is available.\n  |\n —\n  |\n|\n Always Show Over Map\n  |\n Specifies whether hover text specified using the\n **Hover Text**\n option is turned on for your chart.\n  |\n —\n  |\n\nHover text macros\n-------------------\n\nDomo supports macros you can use in hover text to reference different data items. Available macros differ between chart types.\n\n###\n Hover text macros for most chart types\n\nHover text macros for most chart types include the following:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Category Name\n  |\n The name of the category that the data item belongs to.\n  |\n|\n Category Number\n  |\n The number of the category that the data item belongs to.\n  |\n|\n Category Total\n  |\n The sum of all the data values in the category that the data item belongs to.\n  |\n|\n Graph Total\n  |\n The sum of all the values in the chart.\n  |\n|\n Percent of Category\n  |\n The data value represented as a percentage of the sum of all the data values in the category.\n  |\n|\n Percent of Total\n  |\n The data value represented as a percentage of the sum of all the data values in the chart.\n  |\n|\n Series Name\n  |\n The name of the data series that the item belongs to.\n  |\n|\n Series Number\n  |\n The number of the data series that the item belongs to.\n  |\n|\n Tooltip Field 1-3\n  |\n Allow you to include additional data in your chart by referencing columns you have dragged into the\n **Tooltip**\n fields above the chart (which you can toggle on or off by clicking\n **Tooltips**\n in the icon bar at the top of the Analyzer window). For more information, see\n\nReferencing tooltip fields\n\n.\n  |\n|\n Value\n  |\n The value of the data item.\n  |\n\nFor example, if you wanted all hovers in a vertical bar chart to show the category name, followed by a colon, followed by the data item value, you would 1) select the\n **Category**\n**Name**\n macro from the dropdown, 2) add a colon and a space after the\n\n%\\_CATEGORY\\_NAME\n\ntext in the field, and 3) select the\n **Value**\n macro from the dropdown.\n\n###\n Hover text macros for Gantt charts\n\nBy default, hover labels in Gantt and percent complete Gantt charts show category names, item names, and date ranges, in that order. For example: \"Sprint 1: Write PRD: 2013-02-05 - 2013-02-16.\" You can replace this default hover text with your own custom text.\n\n\n You can use any of the following macros to change the default hover text in Gantt charts:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Category\n  |\n The category for the data item. Only available if you break up the chart data by dropping a column into the\n **Category**\n field above the chart.\n  |\n|\n End Date\n  |\n The end date of the data item.\n  |\n|\n Item\n  |\n The name of the data item.\n  |\n|\n Percent Complete\n  |\n The percentage of completion of the data item. (Available in Gantt Percent Complete charts only.)\n  |\n|\n Start Date\n  |\n The start date of the data item.\n  |\n|\n Tooltip Field 1-3\n  |\n Allow you to include additional data in your Gantt chart by referencing columns you have dragged into the\n **Tooltip**\n fields above the chart (which you can toggle on or off by clicking\n **Tooltips**\n in the icon bar at the top of the Analyzer window). For more information, see\n\nReferencing tooltip fields\n\n.\n  |\n\nFor example, if you wanted each bar in your Gantt percent complete chart to show the words\n\nX% complete\n\n, where \"X\" is the percentage of completion, you would 1) select the\n **Percent Complete**\n macro from the dropdown, and 2) add the word \"complete\" after the\n\n%\\_PERCENT\\_COMPLETE%\n\ntext. The following screenshot shows an example Gantt chart in which this replacement text has been used:\n\n\n####\n Hover text macros for Sankey charts\n\nIn Sankey charts, hover text can be customized independently on the nodes, the connector lines, and the entry and exit indicators. For more information about these components, see\n\nSankey Chart\n\n.\n\n####\n Node hover text\n\nBy default, the hover text on nodes in a Sankey chart appears as follows:\n\n\n`[Node name]\n\n\n Value: [Node value]`\n\n\n You can customize this default text using any of the following macros:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n In Count\n  |\n The number of input lines entering this node.\n  |\n|\n In Value\n  |\n The total value of all of the input lines entering this node.\n  |\n|\n Maximum Value\n  |\n The highest single value of all of the input lines entering this node.\n  |\n|\n Name\n  |\n The name of the node.\n  |\n|\n Out Count\n  |\n The number of output lines exiting from this node.\n  |\n|\n Out Value\n  |\n The total value of all of the output lines exiting from this node.\n  |\n\n\n#####\n Flow hover text\n\nBy default, the hover text for connector lines in a Sankey chart appears as follows:\n\n\n`[\"From\" node name] -> [\"To\" node name]: [connector line value]`\n\n\n You can customize this default text using any of the following macros:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n From Name\n  |\n The \"From\" node for this line (i.e. the node on the left side of the line).\n  |\n|\n Percent of From\n  |\n The value of this line as a percentage of all lines coming from the same \"From\" node.\n  |\n|\n Percent of To\n  |\n The value of this line as a percentage of all lines feeding into the same \"To\" node.\n  |\n|\n To Name\n  |\n The \"To\" node for this line (i.e. the node the line feeds into on the right side).\n  |\n|\n Value\n  |\n The actual value of this line.\n  |\n\n\n#####\n Entry and exit indicator hover text\n\nBy default, the hover text for entry and exit indicators in a Sankey chart shows the actual difference between the input and output values. For example, if $500 enters a node and $800 comes out, the hover text for the entry indicator would read\n\n$300\n\n.\n\n\n You can customize this default text using any of the following macros:\n\n\n Macro\n  |\n Description\n  |\n| --- | --- |\n|\n Percent of Total\n  |\n The value of the difference between the input and output values as a percentage of the total output value for the node.\n  |\n|\n Value\n  |\n The actual value of the difference between the input and output values for the node.\n  |\n\nCreating multi-line labels\n----------------------------\n\nYou can enter line breaks in data and legend labels by specifying\n\n\\\\n\n\nin the appropriate field.\n\n\n**To enter a line break in a label**\n ,\n\n. Open the chart you want to edit in Analyzer.\n2. In\n **Chart Properties > Data Label Settings > Text,**\n append\n\n\\\\n\n\nto the label text you want to format.\n\nFor example, if you wanted to format the data labels in the preceding screenshot to look like the following...\n\n...you would enter the following in\n **Chart Properties > Data Label Settings > Text**\n :\n\n%\\_CATEGORY\\_NAME:\\\\n%\\_VALUE\n\n.\n\n\n By default, multi-line data labels are center justified. You can change the justification by clicking\n **Chart Properties > Data Label Settings**\n , then selecting the\n **Justification**\n option you want.\n\n\n Referencing tooltip fields\n----------------------------\n\nYou can use macros in data labels and hovers to reference columns you have dropped into the\n **Tooltip**\n fields above the chart preview. You can use up to 3 such fields. This is an excellent way to show data for columns that are not used to build the chart. In the following example, the chart creator has built a standard bar chart that shows sales by order date. He also wants to show the data for profit, discount percentage, and shipping costs. One way to do this would be to add those columns as series, as discussed in\n\nApplying DataSet Columns to Your Chart\n\n. However, in this case the chart creator decides he wants to keep the chart as simple to read as possible. He decides to add the columns to the\n **Tooltip**\n fields and then reference them using the\n **Tooltip 1-3**\n macros available in the dropdown in\n **Chart Properties > Hover Text Settings > Text**\n . So the text in his\n **Text**\n field would appear as follows:\n\n\n`SALES: %_VALUE \\\\n PROFIT: %_TOOLTIP1 \\\\n DISCOUNT: %_TOOLTIP2 \\\\n SHIPPING COST: %_TOOLTIP3`\n\n\n He also sets the format and decimal places of the \"Sales\" value in\n **Chart Properties > Hover Text Settings**\n and the formats and decimal places of the other values in the\n **Format**\n dropdowns in the respective fields above the chart preview (since changes to the\n **Hover Text Settings**\n affect\n *only*\n the primary value column used to build the chart).\n\n\n Now, whenever a user hovers over any of the bars in the chart, a hover label appears displaying all of the information he wanted, as shown in the screenshot:\n\n*To build data labels or hover labels referencing tooltip fields,**\n\n. Open the chart you want to edit in Analyzer.\n2. (Conditional) If the\n **Tooltips**\n fields are not appearing above your chart preview, click\n **Tooltips**\n in the icon bar to toggle them on.\n3. Drag a column you want to reference into\n **Tooltip Field 1**\n , above the chart preview.\n4. (Optional) If you want to reference more than one tooltip field, drag the desired columns into\n **Tooltip Field 2**\n and\n **Tooltip Field 3**\n .\n5. Open\n **Chart Properties > Data Label Settings**\n or\n **Chart Properties > Hover Text Settings**\n .\n6. In the\n **Text**\n field, create the text you want to appear in the data labels or hover labels, using the\n **Tooltip 1-3**\n macros from the dropdown menu and any other macros you think are appropriate.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429693\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005031\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFormatting Data Label and Hover Text in Your Chart\n\n", "article_total_view_count": "\n\n\n 8,467\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/2/2022, 9:00 PM\n\n\n", "first_published_date": "\n\n\n 11/2/2022, 9:04 PM\n\n\n"}, "title": "formatting_data_label_and_hover_text_in_your_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_properties", "url": "/s/topic/0TO5w000000ZaodGAC"}]}