{"file_path": "../../raw_kb_v2\\article\\360057028494\\index.html", "content": {"title": "\n\n\n OData Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nOData (Open Data Protocol) is an OASIS standard that defines the best practice for building and consuming queryable and interoperable REST APIs in a simple and standard way. OData helps you focus on your business logic while building RESTful APIs without having to worry about the various approaches to define request and response headers, status codes, HTTP methods, URL conventions, payload formats, query options, etc. Use Domo's OData connector to pull the data exposed through the OData endpoints. To learn more about OData, visit their page\n\nhttps://www.odata.org/\n\n.\n\n\n You connect to your OData account in the Data Center. This topic discusses the fields and menus that are specific to the OData connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your OData account and create a DataSet, you must have the username and password associated with your OData account.\n\n\n Connecting to Your OData Account\n----------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the OData Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your OData account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter the username associated with your OData account.\n  |\n|\n Password\n  |\n Enter the password associated with your OData account.\n  |\n|\n URL\n  |\n Enter the OData endpoint URL.\n  |\n\n\n Once you have entered valid OData credentials, you can use the same account any time you go to create a new OData DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Data Tag\n  |\n Enter the data tag key.\n  |\n|\n Fields To Expand\n  |\n Enter the comma separated list of fields you would like to expand in the data. This will cause multiple rows to show each object for the entered fields.\n  |\n|\n Select Data Filter\n  |\n Specify the data filter method for your data.\n  |\n|\n All Data\n  |\n Returns all available data.\n  |\n|\n Use Date Filter\n  |\n Filters the data for the selected date range.\n  |\n|\n Backfill Data\n  |\n Backfills the data for the specific field.\n  |\n|\n Data Filter Field\n  |\n Enter the same date filter field name available in response in order to filter the response.\n  |\n|\n Backfill Field\n  |\n Enter the field name that you want to backfill your data for. This functionality works only for the append mode.\n\n***Note****\n : The Backfill field must be present in the response and it must be of integer type.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360057028494\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003278\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nOData Connector\n\n", "article_total_view_count": "\n\n\n 3,948\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "odata_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}