{"file_path": "../../raw_kb_v2\\article\\000005154\\index.html", "content": {"Title": "Slope Chart", "Article Body": "Intro\n                       \n\n                        A slope chart visualizes data from a given time period based on the period's start and end points. By simplifying the data into lines, this chart type allows you to focus on relevant information rather than the clutter of intermediate data points.\n                       \n\n\n\n\n\n                         Powering Slope Charts\n                        \n\n\n                        A slope chart requires a date field and a value field. You then select the start and end points from a variety of predefined options. The chart can also include other dimensions for multiple lines per dimension.\n                       \n\n                        For information about value, category, and series data, see our article about\n                        \n                         Understanding Chart Data\n                        \n\n                         .\n                        \n\n\n                        In Analyzer, you can choose the columns containing the data for your slope chart. For more information about choosing data columns, see our article about\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        The following image shows how data from a typical column-based spreadsheet is converted into a slope chart:\n                       \n\n\n\n\n                        Customizing Slope Charts\n                       \n\n                        You can customize the appearance of a slope chart in several ways, many of which are possible with the\n                        \n                         Chart Properties\n                        \n                        tool. For more information, see our article about\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n                        Some unique properties of slope charts are shown in the following table:\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Value Format\n                           \n\n\n\n                            Determines whether currency symbols are appended to values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Percent Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in percent values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Data\n                           \n\n\n\n                            Determines the data points to display in the chart.\n                           \n\n                            For example, you may want to display the first data point and the last data point, or the first data point and the penultimate (second to last) data point.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Left Scale (Y) > Display\n                           \n\n\n\n                            Allows you to choose whether to display labels, values, both, or neither at the leftmost point of the line(s).\n                           \n\n\n\n\n\n\n\n\n\n\n                            Right Scale (Y) > Display\n                           \n\n\n\n                            Allows you to choose whether to display labels, values, both, or neither at the rightmost point of the line(s).", "Preview Article": "Click here to preview", "URL Name": "000005154", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005154", "Archived Date": "", "Language": "English", "Primary Version": "Slope Chart", "Article Total View Count": "1,058", "": "", "Article Created Date": "3/13/2023, 6:21 PM", "First Published Date": "3/13/2023, 6:29 PM"}, "title": "\n              Slope Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}