{"file_path": "../../raw_kb_v2\\article\\360042926474\\index.html", "content": {"Title": "BrightEdge Connector", "Article Body": "Intro\n                       \n\n                        BrightEdge is a content marketing platform that transforms online content such as traffic, revenue, and engagement into tangible business results. To learn more about the BrightEdge API, visit their page (\n                        \n                         http://www.brightedge.com/technology...on/connect-api\n                        \n                        ).\n                       \n\n                        You connect to your BrightEdge account in the Data Center. This topic discusses the fields and menus that are specific to the BrightEdge connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Use this connector to pull data about search engine optimization.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Keyword rankings\n                             \n\n\n\n                              Competitor rankings\n                             \n\n\n\n                              Search volume\n                             \n\n\n\n                              Tracked searches\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            Digital marketing\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            5 hours\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            3\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n                        These reports can power cards individually, but oftentimes it is helpful to combine the reports using Magic ETL. This way you can look at things like your keyword ranks compared to your competitor ranks or evaluate the search volume of your top ranked keywords. For more information about Magic, see\n                        \n                         Magic Transforms\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your BrightEdge account and create a DataSet, you must have a BrightEdge username and password.\n                       \n\n                        V3 of the BrightEdge API must be enabled to access the connector. Domains must also be enabled for API V3.\n                       \n\n                        Connecting to Your BrightEdge Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the BrightEdge Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your BrightEdge account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Username\n                          \n\n                           Enter your BrightEdge username.\n                          \n\n\n\n                           Password\n                          \n\n                           Enter your BrightEdge password.\n                          \n\n\n\n\n\n                         Once you have entered valid BrightEdge credentials, you can use the same account any time you go to create a new BrightEdge DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the BrightEdge report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Accounts\n                              \n\n                               Retrieves a list of all accounts.\n                              \n\n\n\n                               BQL Query\n                              \n\n                               Retrieves rank information for all your keywords.\n                              \n\n\n\n                               Competitors\n                              \n\n                               Retrieves a list of all competitors being tracked for your account.\n                              \n\n\n\n                               Domains\n                              \n\n                               Retrieves a list of all domains being tracked for your account.\n                              \n\n\n\n                               Domain Ranking\n                              \n\n                               Retrieves the positional rank of a domain in a given search engine, according to the domain's defined keywords.\n                              \n\n\n\n                               Keywords\n                              \n\n                               Retrieves a list of all keywords being tracked for your account.\n                              \n\n\n\n                               Keyword Groups\n                              \n\n                               Retrieves a list of all keyword groups being tracked for your account.\n                              \n\n\n\n                               Keyword Ranking\n                              \n\n                               Retrieves the account's ranking for a given domain, keyword or search engine.\n                              \n\n\n\n                               Keyword Volume\n                              \n\n                               Retrieves a list of keywords and their search volumes, organized by search engine and time.\n                              \n\n\n\n                               Keywords in Keyword Groups\n                              \n\n                               Returns a list of all the keywords that belong to the specified keyword group.\n                              \n\n\n\n                               Search Engine\n                              \n\n                               Retrieves a list of all search engines that are enabled for the specified account.\n                              \n\n\n\n\n\n\n\n                           Account\n                          \n\n                           Select the account you want to retrieve data for.\n                          \n\n\n\n                           Query\n                          \n\n\n                            Enter a query using BQL language. For example:\n                           \n\n\n                             {\n                             \n                             \"dataset\":\"keywordgroup\",\n                             \n                             \"dimension\":[\"domain\",\"search_engine\"],\n                             \n                             \"measures\":[\"rank_p1\",\"revenue\"],\n                             \n                             \"dimensionOptions\":{\"time\":\"weekly\"},\n                             \n                             \"filter\":\n                             \n                             }\n                            \n\n\n                            For more information about BQL, see\n                            \n                             http://senseidb.github.io/sensei/bql.html\n                            \n                            .\n                           \n\n\n\n\n                           Time Frequency\n                          \n\n                           Select how the report data will be aggregated.\n                          \n\n\n\n                           Start Date\n                          \n\n                           Select the start date for the report data. Data will be returned from this date until the current date.\n                          \n\n\n\n                           Search Engines\n                          \n\n                           Select all search engines you want to retrieve data for.\n                          \n\n\n\n                           Keyword Group\n                          \n\n                           Select all keyword groups you want to retrieve data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n                        This connector has strict data limits. If it fails to retrieve data, reduce the time period to 90 days or less and try again. This also means that multiple pulls and appends might be needed.", "Preview Article": "Click here to preview", "URL Name": "360042926474", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003795", "Archived Date": "", "Language": "English", "Primary Version": "BrightEdge Connector", "Article Total View Count": "2,455", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              BrightEdge Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}