{"file_path": "../../raw_kb_v2\\article\\360042925254\\index.html", "content": {"title": "\n\n\n Setting Options for Gauges\n\n\n", "article_body": "\n\nIntro\n---------\n\nYou can set properties for filled, comparative fill, radial, and face gauges in Domo. Properties are different for each gauge type. Filled and comparative fill gauges provide options for formatting the visual aspects, radial and face gauges allow you to set and edit ranges, and comparative gauges include options for formatting the color and type of displayed values.\n\n\n Because single value gauges consist of a single number with no visual aspects or ranges, they do not have visual or range properties you can set. However, you can apply value formatting to the number and change the aggregation. For more information, see\n\nCustomizing Single Value gauges\n\n.\n\n\n Progress bar gauges are not currently customizable.\n\n\n Formatting the appearance of filled and comparative fill gauges\n-----------------------------------------------------------------\n\nWith filled gauges, you can set several visual properties, including the fill color and the minimum, maximum, and target values on the gauge. You can also add labels to describe the target, current, and maximum values. The following example shows a filled gauge and its editable properties:\n\nThe following table describes each of these properties:\n\n\n Property\n  |\n Description\n  |\n| --- | --- |\n|\n Fill Color\n  |\n The color that fills the gauge up to the current value. Gray is used to indicate the \"unfilled\" portion of the gauge.\n  |\n|\n Minimum Value\n  |\n The starting point on the gauge.\n  |\n|\n Maximum Value\n  |\n The highest possible value on the gauge.\n  |\n|\n Target Value\n  |\n The value you want to reach or avoid, depending on the gauge. Entering a target value adds to the gauge a numerical label and a line to indicate the target. A target added in this way is\n *static*\n . If you want a dynamic target value that changes with your DataSet, you should add a target value by applying an optional third column to the gauge. For more information, see\n\nFilled Gauge\n\n.\n  |\n|\n Target Label\n  |\n Text that describes the target value.\n  |\n|\n Value Label\n  |\n Text that describes the current value of the gauge.\n  |\n|\n Maximum Label\n  |\n Text that describes the maximum value of the gauge.\n  |\n\n*To set properties for a filled gauge,**\n\n. Open the Analyzer for the gauge.\n2. In\n **Chart Properties**\n , click\n **General**\n .\n3. Set each property as desired.\n\nComparative fill gauges have only one visual property you can set—\n **Color Direction**\n . This lets you specify whether green fill color denotes positive or negative change. If you correlate green fill color with positive change, red denotes negative change, and vice versa. This is useful for gauges in which low values are ideal (such as a gauge that keeps track of workplace accidents).\n\n\n**To set color direction in a comparative fill gauge,**\n\n. Open the Analyzer for the gauge.\n2. In\n **Chart Properties**\n , click\n **General**\n .\n3. Select the desired color direction in the\n **Color Direction**\n menu.\n\nSetting ranges in radial and face gauges\n------------------------------------------\n\nIn radial and face gauges, you can specify ranges for values. This allows viewers to classify gauge values as belonging to a specific range. For example, a radial gauge might have three ranges, each of which corresponds to a different level of departmental proficiency, such as \"Poor,\" \"Fair,\" and \"Excellent.\" A viewer could determine the department's proficiency by seeing which range the value falls into.\n\n\n You can set range values for radial and face gauges in\n **Chart Properties**\n in the Analyzer. For more information, see\n\nApplying and Resetting Chart Properties\n\n.\n\n\n For more information about creating radial and face gauges, see\n\nFace Gauge\n\n, respectively.\n\n##\n Setting ranges in a radial gauge\n\nRanges for radial gauges are optional. You can create a radial gauge without ranges; however, ranges are highly recommended in radial gauges as they make the gauges much more useful and interesting to look at. Also, your lowest and highest range values determine the minimum and maximum values in your gauge (these are determined automatically otherwise).\n\n\n**To set ranges in a radial gauge,**\n\n. Open the Analyzer for the gauge.\n2. In\n **Chart Properties**\n , click\n **Range 1**\n .\n3. Enter a minimum value for the range in the\n **Minimum Value**\n field.\n\n\n This value is the minimum value for your gauge.\n4. Enter a maximum value for the range in the\n **Maximum Value**\n field.\n\n\n The maximum value in the last numerical range is the maximum value for your gauge.\n5. Select a color for the range.\n6. Click\n **Range 2**\n .\n7. Repeat steps 3-5 for\n **Range 2**\n .\n8. (Optional) Continue adding new ranges as desired.\n\n\n The maximum value in the last numerical range is the maximum value for your gauge.\n\n\n###\n Setting ranges in a face gauge\n\nRanges for face gauges are required. Ranges determine the color and expression of the face in the gauge, depending on where the current value falls. For example, if your\n **Red Range**\n is 0 to 33 and the value is 29, the face appears angry and red. If you do not manually specify ranges for each color, default ranges are assigned.\n\n\n**To set ranges in a face gauge,**\n\n. Open the Analyzer for the gauge.\n2. In\n **Chart Properties**\n , click\n **Green Range**\n .\n3. Enter a minimum value for the range in the\n **Minimum Value**\n field.\n4. Enter a maximum value for the range in the\n **Maximum Value**\n field.\n5. Repeat the above steps for\n **Yellow Range**\n and\n **Red Range**\n .\n\nSetting the value type and color in a comparative gauge\n---------------------------------------------------------\n\nBy default, the value that displays in a comparative gauge is the percentage of change between the previous and current value in your DataSet. In\n **Chart Properties**\n , you can select a different value type, either\n **Value Change**\n or\n **Current Value.**\n**Value Change**\n is the actual difference between the previous and current values in the DataSet. For example, if the previous value was 30 and the current value 50, the gauge would display \"20.\" If you select\n **Current Value**\n , the gauge displays the current value in the DataSet.\n\n\n To change the value type in a comparative gauge,\n\n. Open the Analyzer for the gauge.\n2. In\n **Chart Properties**\n , click\n **General**\n .\n3. In the\n **Value Displayed**\n menu, select the desired option.\n4. (Optional) In the\n **Value Format**\n menu, select the appropriate formatting.\n\nAlso by default, if the degree of change in a comparative gauge is positive, the value appears green; if it is negative, the value appears red. You can change these default settings in\n **Chart Properties**\n . In the\n **Color Direction**\n menu, you can specify whether green fill color denotes positive or negative change. If you correlate green fill color with positive change, red denotes negative change, and vice versa. This is useful for gauges in which low values are ideal (such as a gauge that keeps track of workplace accidents).\n\n\n**To set color direction in a comparative gauge,**\n\n. Open the Analyzer for the gauge.\n2. In\n **Chart Properties**\n , click\n **General**\n .\n3. Select the desired color direction in the\n **Color Direction**\n menu.\n\nYou can also choose to set an override color for the gauge. In this case, the value appears as the color you selected, regardless of direction of change. If you select an override color, your selections in the\n **Color Direction**\n menu are ignored.\n\n\n**To set an override color in a comparative gauge,**\n\n. Open the Analyzer for the gauge.\n2. In\n **Chart Properties**\n , click\n **General**\n .\n3. Select the desired color in the\n **Override Color**\n menu.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042925254\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005027\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSetting Options for Gauges\n\n", "article_total_view_count": "\n\n\n 2,602\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/2/2022, 9:00 PM\n\n\n", "first_published_date": "\n\n\n 11/2/2022, 9:04 PM\n\n\n"}, "title": "setting_options_for_gauges", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_properties", "url": "/s/topic/0TO5w000000ZaodGAC"}]}