{"file_path": "../../raw_kb_v2\\article\\000005172\\index.html", "content": {"Title": "Queues", "Article Body": "Intro\n                       \n\n                        Queues allow you to organize manual tasks into different buckets of work and control who can access them.\n                       \n\n                        This article describes how to access, configure, and manage Queues in the following topics:\n                       \n\n\n\n                          Navigation\n                         \n\n\n\n                          Required grants\n                         \n\n\n\n                          Home page\n                         \n\n\n\n                          Queue Manager\n                         \n\n\n\n                          User permissions\n                         \n\n\n\n                          Tasks\n                         \n\n\n\n\n\n                        Navigation\n                       \n\n                        You can access Queues from the side panel of any page in Workflows, Code Engine, or Forms. From the side panel, select\n                        \n\n                         Queues\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If\n                           \n\n                            Queues\n                           \n                           does not display in the side panel, contact your Domo representative for assistance.\n                          \n\n\n\n\n\n\n\n\n\n\n                        Required Grants\n                       \n\n                        There are two grants for rights to perform specific actions on queues within your Domo environment:\n                       \n\n\n\n                          Manage Queue\n                         \n                         — Allows you to perform any action on any queue in the customer instance. This should be granted to superusers, admins, or anyone who helps manage queues for customers.\n                        \n\n\n                          Create Queue\n                         \n                         — Allows you to create a new queue. This grant should be given to any user who needs the ability to create and add new queues to the workflow repository in your environment.\n                        \n\n\n                        Contact your Domo representative to receive either of these grants for your instance. For information about the available permissions for non-instance admin users, see the\n                        \n                         User Permissions\n                        \n\n\n\n\n                        section of this article.\n                       \n\n\n\n                        Home Page\n                       \n\n                        The Queues home page is the entry point for viewing and accessing the various features of the tool. On this page, you can see task counts and volumes for the queues you have access to, as well as various hyperlinks to quickly navigate to filtered tasks.\n                        \n\n\n\n\n\n\n                        Queue Manager\n                       \n\n                        If you have Admin access, you can view the Queue Manager by selecting\n                        \n\n                         Queue Manager\n                        \n                        .\n                       \n\n\n\n\n                        From this screen, admins can add or remove queues and administer access control.\n                       \n\n                        The Queue Manager screen displays all the queues in the instance.\n                       \n\n                        Create a Queue\n                       \n\n                        Admins can follow these steps to create a queue:\n                       \n\n\n                         In the Queue Manager, select\n                         \n                          + New Queue\n                         \n                         .\n                         \n                         ​​​​​The\n                         \n                          New Queue\n                         \n                         modal displays.\n                        \n\n                         In the modal, enter a name and description in the\n                         \n                          Queue Name\n                         \n                         and\n                         \n                          Queue Description\n                         \n                         fields.\n                        \n\n\n                        To delete or manage permissions, select the\n                        \n                        kebab menu at the end of each row.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           During beta, deleting a queue is not available.\n                          \n\n\n\n\n                        You can use the search, filter, and sorting controls to locate a queue or arrange the list in a different order. By default, the queue list is sorted by most recent to last recent.\n                        \n\n\n\n\n                        Selecting\n                        \n                         Manage permissions\n                        \n\n\n                        in the\n                        \n                        kebab menu launches the permission modal for the specific queue.\n                        \n\n\n\n\n\n\n                        User Permissions\n                       \n\n                        In the permissions modal, search for the user whose permissions you want to edit and select the desired option from the access list.\n                        \n\n\n\n\n                        You can grant users granular permissions, so they only have access to certain actions in a queue or task.\n                       \n\n                        The following list describes the various access levels:\n                       \n\n\n\n                          Admin\n                         \n                         — Allows a user to perform any action on a specific queue or task in that queue.\n                        \n\n\n                          Delete\n                         \n                         — Allows a user to delete a queue. This option is disabled during beta.\n                        \n\n\n                          Read\n                         \n                         — Allows a user view-only access to queue settings in\n                         \n                          Queue Manager\n                         \n                         .\n                        \n\n\n                          Write\n                         \n                         — Allows a user editing access to a queue.\n                        \n\n\n                          Share\n                         \n                         — Allows a user to grant another user access to a queue with equal or lesser permissions.\n                        \n\n\n                          Create Content\n                         \n                         — Allows a user to create a task so that it displays in a queue.\n                        \n\n\n                          Read Content\n                         \n                         — Allows a user view-only access to a task and the queue count.\n                        \n\n\n                          Update Content\n                         \n                         — Allows a user to edit and submit a task.\n                        \n\n\n                          Void Content\n                         \n                         — Allows a user to void a task, which prevents manual updates from occurring.\n                        \n\n\n                        Queue Panel\n                       \n\n                        All the queues a user has access to display in the\n                        \n                         Queue Panel\n                        \n                        on the home page. A count of all the open tasks in the queue display next to the queue name.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Queue counts are not dynamic, so you must refresh to see if volumes have changed.\n                           \n\n\n\n\n\n                        Select a queue in the panel to navigate to the task list for that queue.\n                        \n\n\n\n\n                        Navigation Tiles\n                       \n\n                        Tiles across the top of the home page provide counts and quick links to filtered task lists.\n                       \n\n                        The following list describes the tiles:\n                       \n\n\n\n                          Open Tasks\n                         \n                         — Displays the number of open tasks in all the queues you have access to.\n                        \n\n\n                          My Tasks\n                         \n                         — Displays the number of tasks assigned to you in all the queues you have access to.\n                        \n\n\n                          Completed Today\n                         \n                         — Displays the number of tasks you have completed during the day.\n                        \n\n\n                        Select any tile to navigate to a filtered list showing the corresponding tasks.\n                       \n\n                        My Recent Activity\n                       \n\n                        You can see a list of tasks you have recently interacted with from the\n                        \n                         My Recent Activity\n                        \n                        tab in the side panel on the home page.\n                        \n\n\n\n\n                        The last ten tasks you interacted with display in this tab. A change must be made in a task for it to show up as a recent activity. You can select any row in the tab to navigate to that task. This is helpful if you need to quickly access a task that you recently updated.\n                       \n\n                        Watch List\n                       \n\n                        Select the\n                        \n                         Watch List\n                        \n                        tab to view and access tasks that you have flagged as items of interest. The\n                        \n                         Watch List\n                        \n                        tab displays next to the\n                        \n                         My Recent Activity\n                        \n                        tab in the side panel on the home page.\n                        \n\n\n\n\n                        You can flag a task for the\n                        \n                         Watch List\n                        \n                        only only while viewing the task after selecting it from the task list. If you want to remove a task from the\n                        \n                         Watch List\n                        \n                        , select the flag icon to delete it.\n                       \n\n                        The\n                        \n                         Watch List\n                        \n                        displays the assignee and the status of the task for quick reference. You can select any row in the\n                        \n                         Watch List\n                        \n                        to navigate to that task.\n                       \n\n                        Graphs\n                       \n\n                        As tasks are added and completed in your queues, you can see how volumes change throughout the day in the graph options displayed in the central area of the home page. The graphs display the number of open items every fifteen minutes.\n                        \n\n\n\n\n                        There are two options for viewing the open tasks in your queues:\n                       \n\n\n\n                          All Tasks\n                         \n                         — Displays the number of open tasks and how many of them have been assigned to you throughout the day.\n                        \n\n\n                          Tasks Per Queue\n                         \n                         — Displays the number of open tasks and how many are in each queue throughout the day.\n                        \n\n\n                        Queues and Task List\n                       \n\n                        You can access tasks by selecting a queue or tile option from the home page. You are always taken to the task list after selecting a navigation option, but the results in the task list are filtered based on your selection.\n                       \n\n                        For example, if you select a queue on the home page, the task list displays the open tasks for that queue. If you select the\n                        \n                         My Tasks\n                        \n                        tile, the task list filters to show the open tasks that you are assigned to in all your queues.\n                       \n\n                        Results\n                       \n\n                        The filtered results display in the task list. Each result in the task list represents a single task. A results count displays above the task list so you know how many results are in the list.\n                        \n\n\n\n\n                        Under the column headers, metadata is provided for each task. The metadata items are described below.\n                       \n\n\n\n                          Task ID\n                         \n                         — Displays the task ID. Each task has a unique ID consisting of the creation date and an alphanumeric character set.\n                        \n\n\n                          Queue\n                         \n                         — Displays the assigned queue for the task.\n                        \n\n\n                          Assigned To\n                         \n                         — Displays the assignee for the task.\n                        \n\n\n                          Form\n                         \n                         — Displays the form name associated with the task.\n                        \n\n\n                          Status\n                         \n                         — Displays the status of the task. The options are Open, Complete, and Void, which are described in the\n                         \n                          Statuses\n                         \n                         section of this article.\n                        \n\n\n                        Filters\n                       \n\n                        You can update the task list by changing the Filters. By default, the Filters are set based on the corresponding option that you selected on the home page. However, you can clear or enter values in the filter list to see different results.\n                        \n\n\n\n\n                        You can apply multiple filters to the task list at the same time, but you can specify only one selection per Filter. The available Filters are described below.\n                       \n\n\n\n\n                           Queue Filter\n                          \n                          — Filters the task list by queue. Selecting a queue on the home page populates the Filter by default. The list displays options from other queues accessible to you. Clearing the Filter displays tasks in all queues.\n                         \n\n\n\n\n                           Assigned To Filter\n                          \n                          — Filters the task list by assignee. Select a user in this Filter to see all their assigned tasks. Clearing this Filter displays tasks for all assignees and unassigned tasks.\n                         \n\n\n\n\n                           Status Filter\n                          \n                          — Filters the task list by status. Most navigation options on the home page populate this Filter with Open. The menu displays options for Open, Complete, or Void. Clearing this Filter shows tasks with any status.\n                         \n\n\n\n\n                           Created Filter\n                          \n                          — Filters the task list by the date the task was created. The menu displays options for different time periods, including Today, Last 7 Days, Last 30 Days, Year to Date, Lifetime, and Custom. The custom option allows you to enter a specific date range. Clearing this Filter displays tasks created on any date.\n                         \n\n\n\n\n                           Completed Filter\n                          \n                          — Not implemented at this time. A Completed Filter allows you to filter by the date a task was completed. This can be used with the Status Filter when it is set to Complete.\n                         \n\n\n\n                        Search\n                       \n\n                        A search field allows you to search for a task by its Task ID. After you enter a valid ID in the\n                        \n                         Task ID\n                        \n                        field, the task list filters to display the individual task.\n                        \n\n\n\n\n\n\n                        Tasks\n                       \n\n                        Tasks are generated by a workflow and represent a manual step in that workflow. Each task is associated with a form that needs to be completed by a person. When the task is complete, the workflow progresses to the next step.\n                       \n\n                        Open a task by selecting a row in the list. The task displays in the viewer and provides various interactions controls.\n                        \n\n\n\n\n                        Slider\n                       \n\n                        A slider between the task list and form viewer allows you to adjust the width so that one display is more prominent than the other. Move the slider left or right to expand or collapse the viewer. A full view option is available in the form header if you only want to see the form after the task is selected.\n                        \n\n\n\n\n                        Task Header\n                       \n\n                        The task header in the viewer displays the metadata associated with the task, including the task ID, form name, and task status.\n                        \n\n\n\n\n                        The task header also contains controls for specific actions, which are described below.\n                       \n\n                        Assign a Task\n                       \n\n                        The\n                        \n                         Assignee\n                        \n                        field is located below the task ID. To assign the task to a user, select\n                        \n                         Edit\n                        \n                        next to the\n                        \n                         Assignee\n                        \n                        field.\n                        \n\n\n\n\n                        You can either search for a person or scroll through the list to find them.\n                       \n\n                        Workflow Instance Link\n                       \n\n\n\n                         Workflow\n                        \n                        in the form header navigates you to the Instance Details view in Workflows. It also displays the workflow instance that generated the task and where that user task sits in the workflow.\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You must have the View Instance Details or Edit Instance Details permission in Workflows to view the instance.\n                          \n\n\n\n\n                        Watch List Flag\n                       \n\n                        You can mark the task to be added to the Watch List by selecting\n                        \n\n                         Flag\n                        \n                        , which turns orange when the task is added. Select\n                        \n\n                         Flag\n                        \n                        again to remove it.\n                       \n\n                        The Watch List is accessible from the home page and provides a quick link to each task you add.\n                        \n\n\n\n\n                        Task Action Menu\n                       \n\n                        The\n                        \n                        action menu allows users with the specific permissions to perform certain actions on the task. Select this menu to access the following options:\n                       \n\n\n\n\n                           Void Task\n                          \n                          — Cancels the task and updates its status to Void. A voided task does not pass any data back to the workflow and places the workflow in a failed state.\n                         \n\n\n\n\n                           Unlock Task\n                          \n                          — Unlocks a task that is being edited by another user. When you open a task, it is locked so that other users cannot update it. An admin can unlock the task so someone else can edit it.\n                         \n\n\n\n\n                           Transfer Queue\n                          \n                          — Moves the task from one queue to another. When this option is selected, an admin must specify another queue to send the task to via a modal that displays. The admin can only select other queues that they have access to.\n                         \n\n\n\n\n                           Expand\n                          \n                          — Displays the task in a full-page view. When the task is expanded, the icon changes to\n                          \n                           Collapse\n                          \n                          , which you can select to return to the previous view.\n                         \n\n\n\n\n                           Close\n                          \n                          — Closes the task. This action does not save any data entered in the task fields.\n                         \n\n\n\n\n                        Tabs\n                       \n\n                        Each task has tabs to help you enter and review data for the associated form. The tabs are located below the task header.\n                        \n\n\n\n\n                        Form Tab\n                       \n\n                        The\n                        \n                         Form\n                        \n                        tab displays editable fields for the form. You can also save and submit forms from this tab.\n                       \n\n                        See below for the other components of this tab.\n                       \n\n                        Previous and Next\n                       \n\n                        If the form has multiple pages, you can navigate through them using\n                        \n                         Previous\n                        \n                        and\n                        \n                         Next\n                        \n                        . Selecting\n                        \n                         Next\n                        \n                        displays the following page, and selecting\n                        \n                         Previous\n                        \n                        displays the prior page in the form.\n                       \n\n                        Save\n                       \n\n                        This is not currently implemented.\n                       \n\n                        After entering data in the fields, you can save the form without submitting it by selecting\n                        \n                         Save\n                        \n                        . This saves all the data entered in the task and keeps the form in an Open status. You can then close the task and return to the form in its most recently saved state.\n                       \n\n                        For more information about task statuses, see the\n                        \n                         Statuses\n                        \n                        section of this article.\n                       \n\n                        Submit\n                       \n\n\n                         Submit\n                        \n                        is enabled only when you fill in all the required fields in the task. Selecting this option submits the data you entered in the fields and updates the task to Completed status. The workflow that created the task consumes any data marked as output in the form configuration. After you submit a task, you cannot make updates or change the status back to Pending.\n                       \n\n                        For more information about task statuses, see the\n                        \n                         Statuses\n                        \n                        section of this article.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Anyone with the Update Content permission for the queue containing an Open task can update the task, regardless of whether they are assigned to the task.\n                           \n\n\n\n\n\n                        History Tab\n                       \n\n                        The\n                        \n                         History\n                        \n                        tab displays all update events for the task. Event details include the time, the person who performed the update, the event type, and a description.\n                        \n\n\n\n\n                        Comments Tab\n                       \n\n                        The\n                        \n                         Comments\n                        \n                        tab displays comments that users have added to the task. These can be additional notes, communication with other users, or general information.\n                        \n\n\n\n\n\n\n                        Statuses\n                       \n\n                        Tasks can have one of the following statuses:\n                       \n\n                        Open\n                       \n\n                        All tasks have an Open status when they are created by a workflow. Anyone with Update Content access to the queue in which the task resides can update an Open task, regardless of whether they are assigned to the task.\n                       \n\n                        Completed\n                       \n\n                        You must submit a task for it to have a Completed status. After a task has been submitted and has a Completed status, you cannot edit it or change it back to an Open status.\n                       \n\n                        Void\n                       \n\n                        Only an admin user can apply the Void status to a task. A voided task means that you do not want to submit any data, and the associated workflow that created the task is placed in a failed state. After a task is voided, you cannot edit it or change it back to an Open status.", "Preview Article": "Click here to preview", "URL Name": "000005172", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005172", "Archived Date": "", "Language": "English", "Primary Version": "Queues", "Article Total View Count": "727", "": "", "Article Created Date": "3/29/2023, 5:25 AM", "First Published Date": "3/29/2023, 5:25 AM"}, "title": "\n              Queues\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Workflows\n              \n", "url": "/s/topic/0TO5w000000ZkAMGA0"}]}