{"file_path": "../../raw_kb_v2\\article\\1500009135201\\index.html", "content": {"title": "\n\n\n Zendesk Sell Firehose Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nZendesk Sell (formerly Base CRM) is sales force automation software to enhance productivity, processes, and pipeline visibility for sales teams. Use Domo's Zendesk Sell Firehose connector to retrieve your events related to appointments, calls, contacts, deals, leads, tags, tasks, users, etc. To learn more about the Zendesk Sell Firehose API, visit their page (\n\nhttps://developers.getbase.com/docs/...ehose/overview\n\n).\n\n\n You connect to your Zendesk Sell Firehose account in the Data Center. This topic discusses the fields and menus that are specific to the Zendesk Sell Firehose connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\n\n To connect to your Zendesk Firehose account and create a DataSet, you must have the email address and password associated with your Zendesk Sell account. Alternatively, you can directly sign in with your Zendesk account, if you have registered after January 2020.\n\nConnecting to Your\n\nZendesk\n\nAccount\n------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the\n\nZendesk Sell Firehose\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\n\n The Domo Zendesk Sell Firehose connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n\n*Connect**\n\n(or select\n\n*Add Account**\n\nif you have existing Zendesk accounts in Domo) to open the Zendesk OAuth screen where you can enter your Zendesk credentials. Once you have entered valid Zendesk credentials, you can use the same account any time you go to create a new Zendesk Sell Firehose DataSet.\n\nYou can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\nIf you are already logged into Zendesk when you connect in Domo, you are authenticated automatically when you click\n\n*Add account**\n\n. If you want to connect to an account that is different from the one you are logged into, you must first log out of Zendesk account.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the\n\nZendesk Sell Firehose\n\nreport you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Appointments\n  |\n This report returns the stream of appointment events.\n  |\n|\n Calls\n  |\n This report returns the stream of call events.\n  |\n|\n Call Upsert\n  |\n This report returns a stream of historical calls and data for both leads and contacts on the first run, and then every subsequent run will Upsert the last 72 hours of call data.\n  |\n|\n Collaborations\n  |\n This report returns the stream of collaboration events.\n  |\n|\n Collaboration Requests\n  |\n This report returns the stream of collaboration request events.\n  |\n|\n Contacts\n  |\n This report returns the stream of contacts events.\n  |\n|\n Custom Fields\n  |\n This report returns the stream of custom field events.\n  |\n|\n Deals\n  |\n This report returns the stream of deals events.\n  |\n|\n Documents\n  |\n This report returns the stream of document events.\n  |\n|\n Leads\n  |\n This report returns the stream of lead events.\n  |\n|\n Line Items\n  |\n This report returns the stream of line item events.\n  |\n|\n Loss Reasons\n  |\n This report returns the stream of loss reason events.\n  |\n|\n Notes\n  |\n This report returns the stream of note events.\n  |\n|\n Orders\n  |\n This report returns the stream of order events.\n  |\n|\n Products\n  |\n This report returns the stream of product events.\n  |\n|\n Sources\n  |\n This report returns the stream of source events.\n  |\n|\n Stages\n  |\n This report returns the stream of stage events.\n  |\n|\n Tags\n  |\n This report returns the stream of tag events.\n  |\n|\n Tasks\n  |\n This report returns the stream of task events.\n  |\n|\n Unqualified Reasons\n  |\n This report returns the stream of unqualified reason events.\n  |\n|\n Users\n  |\n This report returns the stream of user events.\n  |\n|\n Visits\n  |\n This report returns the stream of visit events.\n  |\n\n|\n|\n Retrieve Historical Data On The First Run?\n  |\n Indicate if you want to retrieve historical data on the first run of the dataset.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n###\n\nWhat API version does this connector use?\n\nThe Zendesk Sell Firehose connector uses version 3 of the Zendesk API (\n\nhttps://api.getbase.com/v3/\n\n).\n\n###\n\nWhich endpoint does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n Appointments\n  |\n /appointments/stream\n  |\n|\n Calls\n  |\n /calls/stream\n  |\n|\n Collaborations\n  |\n /collaborations/stream\n  |\n|\n Collaboration Requests\n  |\n /collaboration\\_requests/stream\n  |\n|\n Contacts\n  |\n /contacts/stream\n  |\n|\n Custom Fields\n  |\n /custom\\_fields/stream\n  |\n|\n Deals\n  |\n /deals/stream\n  |\n|\n Documents\n  |\n /documents/stream\n  |\n|\n Leads\n  |\n /leads/stream\n  |\n|\n Line Items\n  |\n /line\\_items/stream\n  |\n|\n Loss Reasons\n  |\n /loss\\_reasons/stream\n  |\n|\n Notes\n  |\n /notes/stream\n  |\n|\n Orders\n  |\n /orders/stream\n  |\n|\n Products\n  |\n /products/stream\n  |\n|\n Sources\n  |\n /sources/stream\n  |\n|\n Stages\n  |\n /stages/stream\n  |\n|\n Tags\n  |\n /tags/stream\n  |\n|\n Tasks\n  |\n /tasks/stream\n  |\n|\n Unqualified Reasons\n  |\n /unqualified\\_reasons/stream\n  |\n|\n Users\n  |\n /users/stream\n  |\n|\n Visits\n  |\n /visits/stream\n  |\n\n\n####\n\nWhat kind of credentials do I need to power up the Zendesk connector?\n\nYou need the email address and password associated with your Zendesk Sell account. Alternatively, you can directly sign in with your Zendesk account, if you have registered after January 2020.\n\n###\n\nHow do I know my Zendesk credentials are secure?\n\nThe login process uses the OAuth process, so your Zendesk credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n\nHow frequently will my data update?\n\nAs often as needed.\n\n###\n\nAre there any API limits that I need to be aware of?\n\nZendesk Sell allows up to 36,000 requests per hour (10 requests/ip/second).\n\n###\n\nCan I use the same account to create multiple datasets?\n\nYes\n\nTroubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500009135201\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003228\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nZendesk Sell Firehose Connector\n\n", "article_total_view_count": "\n\n\n 2,399\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "zendesk_sell_firehose_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}