{"file_path": "../../raw_kb_v2\\article\\360043430893\\index.html", "content": {"Title": "Bing Ads Connector", "Article Body": "Intro\n                       \n\n\n                         Bing Ads is a service that provides pay per click advertising on both the Bing and Yahoo! search engines. Use Domo's Bing Ads connector to pull Bing Ads data from marketing, sales, operations, and finance for true closed-loop reporting. This service supports a subset of the reports available in the Bing Ads web application.\n                        \n\n\n\n                         The reports that you can request are grouped into the following categories.\n                        \n\n\n\n\n\n\n                            Delivery\n                           \n\n                           Show the overall effectiveness and cost of ads and keywords for a specified time period. You can include details in the reports—such as clicks, conversions, and spending—that you can use to identify the ads and keywords that are performing well and those that you may need to adjust.\n                          \n\n\n\n\n\n\n                            Budget\n                           \n\n                           Shows your monthly budget, how much you have spent to date, and whether you are on target to spend your monthly budget.\n                          \n\n\n\n\n\n\n                            Targeting\n                           \n\n\n\n                           Determine whether your ads are reaching their intended audiences.\n                          \n\n\n\n\n\n\n                            Campaign Analytics\n                           \n\n                           Used to measure the effectiveness of the account’s ad campaigns, primarily in terms of return on investment. In addition, you can use the reports to learn which pages on your website are most commonly abandoned by visitors and then use this information to change the design of your website to improve conversions.\n                          \n\n\n\n\n\n                         To learn more about the Bing Ads API, visit their page (\n                         \n                          https://msdn.microsoft.com/en-us/library/bing-ads-getting-started.aspx\n                         \n                         ).\n                        \n\n\n                        The Bing Ads connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n\n                         You connect to your Bing Ads account in the Data Center. This topic discusses the fields and menus that are specific to the Bing Ads connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Ad conversion\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n                            Ad click-thru rates\n                           \n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            Web marketing roles\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            ~1 hour\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            4\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n                        Use the backfill to pull in historic data. The first time the report runs, historic data will be retrieved. Subsequent runs will only pull in the date ranges specified.\n                       \n\n\n                         Prerequisites\n                        \n\n\n\n                         To connect to your Bing Ads account and create a DataSet, you must have the following:\n                        \n\n\n\n\n\n                           Your Bing Ads developer token. For information about obtaining a developer token, see\n                           \n                            https://msdn.microsoft.com/en-us/library/bing-ads-getting-started.aspx\n                           \n                           .\n                          \n\n\n\n\n\n                           Secret ID and Value associated with your Microsoft Azure app\n                          \n\n\n\n\n\n\n\n                           You will also need to set the following redirect URI:\n                          \n\n\n\n\n                              https://oauth.domo.com/api/data/v1/oauth/providers/bingads/exchange\n                             \n\n\n\n\n\n\n\n                        Obtaining your Developer Token\n                       \n\n                        To find your developer token:\n                       \n\n\n                         Go to\n                         \n                          https://developers.ads.microsoft.com/Account\n                         \n\n\n                         Make sure it's a Super Admin account and that the token is a Universal token, and verify that it's the same account that is creating the Azure portal app.\n                        \n\n\n\n\n\n\n\n                        Configuring your Azure App to obtain your Secret ID and Value\n                       \n\n\n\n                          Login into\n                          \n                           Azure Portal\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n\n                            Azure Active Directory > App Registrations > New Registration\n                           \n\n                          .\n                         \n\n\n\n\n\n\n                        3. Fill out the registration form as follows:\n                       \n\n\n\n                          Name: enter a meaningful application name that will be displayed to users of the app, for example 'DomoConnector'.\n                         \n\n\n\n                          Supported account types: Select\n                          \n                           Accounts in any organizational directory (Any Azure AD directory – Multitenant) and personal Microsoft accounts\n                          \n                          .\n                         \n\n\n\n                          Redirect URI: Add and save the following URI:\n                          \n\n\n                             https://oauth.domo.com/api/data/v1/oauth/providers/bingads/exchange\n                            \n\n                           .\n                          \n                          The authentication response is sent to this URI after successfully authenticating the user. Providing the URI at this stage is optional and it can be changed later, but a value is required for most of the authentication scenarios.\n                         \n\n\n\n                        4. Click\n                        \n                         Register\n                        \n                        to create the application. An overview of your registered App will appear.\n                       \n\n\n\n\n                        5. The\n                        \n\n                          Application ID\n                         \n\n                        that appears here is the\n                        \n\n                          Client ID\n                         \n\n                        you will enter in the\n                        \n\n                          Credentials\n                         \n\n                        pane in Domo.\n                       \n\n\n\n\n                        6. Select\n                        \n                         Authentication\n                        \n                        under Manage. Under\n                        \n                         Implicit Grant\n                        \n                        , check the box to enable both Access Tokens and ID Tokens. Select\n                        \n                         Save\n                        \n                        at the top of the page to save the changes.\n                       \n\n\n\n\n                        7. Select\n                        \n                         API Permissions\n                        \n                        under Manage. You will need the\n                        \n                         User.Rea\n                        \n\n                         d\n                        \n                        and\n                        \n                         User.ReadBasic.All\n                        \n                        permissions.\n                       \n\n                        8. To add permissions, select\n                        \n                         Add a Permission\n                        \n                        . Select Microsoft Graph API, and then Delegated Permissions. Type or Navigate to\n                        \n                         User.ReadBasic.All\n                        \n                        , check the box, and click\n                        \n                         Add Permissions\n                        \n                        .\n                       \n\n\n\n\n                        9. Select\n                        \n                         Certificates & Secrets\n                        \n                        under Manage. Certificates can be used as secrets to prove the application’s identity when requesting a token. Also, can be referred to as public keys.\n                        \n                        10. Select the +\n                        \n                         New client secret\n                        \n                        button.\n                       \n\n\n\n\n                        11. Enter a value in Description, select a suitable option for Expires and click\n                        \n                         Add\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Ensure to c\n                           \n                           opy the client secret Value (not the Secret ID) before leaving the page. It's not displayed again after you leave this page.\n                           \n\n\n\n\n\n\n\n\n\n                        This will be the Client Secret within Domo.\n                       \n\n                        12. Now, enter the\n                        \n                         Developer Token\n                        \n                        ,\n                        \n                         Client ID\n                        \n                        , and\n                        \n                         Client Secret\n                        \n                        in Domo under the Credentials section for the Bing Ads connector, and click Connect. There will be a popup to Log in to Microsoft. Login using your Super Admin account and follow the prompts to complete the connection.\n                       \n\n\n\n                          Debugging the\n                         \n\n                        Azure portal app and BingAds account\n                       \n\n                        While creating your account, if you get an error \"There was a problem creating your account. Please try again\", you can check the following configuration to debug your Azure portal app and BingAds account.\n                       \n\n\n                         In your Azure portal app, check the following:\n                        \n\n\n\n                         Under Authentication -> Supported account types, select \"Accounts in any organizational directory (Any Azure AD directory – Multitenant) and personal Microsoft accounts\"\n                        \n\n\n\n\n\n\n                         Verify that the redirect URI is\n                         \n\n                           https://oauth.domo.com/api/data/v1/oauth/providers/bingads/exchange\n                          \n\n\n\n                         Under Authentication -> Implicit grant, check Access tokens and ID tokens\n                        \n\n\n\n\n\n\n                         Under API permissions, select User.Read and User.ReadBasic.All\n                        \n\n\n\n\n\n                        2. In your Developer Token which you can find at\n                        \n                         https://developers.ads.microsoft.com/Account\n                        \n                        , make sure it's a Super Admin account and that the token is a Universal token, and verify that it's the same account that is creating the Azure portal app.\n                       \n\n                        3.\n                        \n                         You need to create a new client secret in the app that you previously created, copy the Value of that secret, and use that to create the Bing Ads account in Domo. If that doesn't work, create a new app and use those credentials.\n                        \n\n\n\n                         Connecting to Your Bing Ads Account\n                        \n\n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Bing Ads Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains a single field where you enter your Bing Ads developer token.  You are then taken to the Microsoft OAuth page where you are required to enter your Microsoft username and password. Once you have entered valid Microsoft credentials, you can use the same account any time you go to create a new Bing Ads DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the\n                         \n                          Data Center\n                         \n                         . For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n                         Details Pane\n                        \n\n\n\n                         This pane contains a primary\n                         \n                          Report\n                         \n                         menu, along with various other menus which may or may not appear depending on the report type you select.\n                        \n\n\n\n\n\n\n\n\n                              Menu\n                             \n\n\n\n\n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n\n                             Select the Bing Ads report you want to run. The following reports are available:\n                            \n\n\n\n\n\n\n\n                                 Account Performance Report\n                                \n\n\n\n\n\n                                 Shows long-term account performance and trends.\n                                \n\n\n\n\n\n\n\n                                 Ad Dynamic Text Performance Report\n                                \n\n\n\n\n\n                                 Identifies which dynamic text strings are performing well and which strings you should consider changing.\n                                \n\n\n\n\n\n\n\n                                 Ad Extension by Ads Report\n                                \n\n\n\n\n\n                                 Used to compare how well different versions of your ad extensions are performing with each ad.\n                                \n\n\n\n\n\n\n\n                                 Ad Extension by Keyword Report\n                                \n\n\n\n\n\n                                 Used to compare how well different versions of your ad extensions are performing for each keyword.\n                                \n\n\n\n\n\n\n\n                                 Ad Extension Detail Report\n                                \n\n\n\n\n\n                                 Used to discover the effectiveness of individual ad extension items, such as each link of a sitelink extension.\n                                \n\n\n\n\n\n\n\n                                 Ad Group Performance Report\n                                \n\n\n\n\n\n                                 Used to compare delivery performance statistics by ad group, campaign, or account attributes, rather than at the keyword level.\n                                \n\n\n\n\n\n\n\n                                 Ad Performance Report\n                                \n\n\n\n\n\n                                 Used to determine which ads lead to clicks and conversions, and which are not performing.\n                                \n\n\n\n\n\n\n\n                                 Age Gender Demographic Report\n                                \n\n\n\n\n\n                                 Used to discover how your campaigns and ad groups are resonating with audiences of diverse age and gender.\n                                \n\n\n\n\n\n\n\n                                 Budget Summary Report\n                                \n\n\n\n\n\n                                 Used to discover how your budget is performing for the month. The report shows your monthly budget, how much you have spent to date, and whether you are on target to stay within your monthly budget.\n                                \n\n\n\n\n\n\n\n                                 Call Detail Report\n                                \n\n\n\n\n\n                                 Used to discover which accounts, campaigns, or ad groups are driving the most completed phone calls.\n                                \n\n\n\n\n\n\n\n                                 Campaign Performance Report\n                                \n\n\n\n\n\n                                 Used to view high-level performance statistics and quality attributes for each campaign or account. This is also a quick way to flag any major campaign or account problems.\n                                \n\n\n\n\n\n\n\n                                 Conversion Performance Report\n                                \n\n\n\n\n\n                                 Used to discover which campaigns and keywords are leading an audience to complete a purchase or other conversion action.\n                                \n\n\n\n\n\n\n\n                                 Destination URL Performance Report\n                                \n\n\n\n\n\n                                 Used to identify landing pages that met audience expectations and potentially resulted in high click-through or conversion rates.\n                                \n\n\n\n\n\n\n\n                                 Goals and Funnels Report\n                                \n\n\n\n\n\n                                 Used to discover whether your audience completes each step through the land, browse, prospect, and conversion pages of your website. For example, you can use this report to determine the step in which users leave the conversion funnel, so that you can improve or remove that step to increase the chance that the user will continue to the next step.\n                                \n\n\n\n\n\n\n\n                                 Keyword Performance Report\n                                \n\n\n\n\n\n                                 Used to discover which keywords are performing well and which are not.\n                                \n\n\n\n\n\n\n\n                                 Metro Area Demographic Report\n                                \n\n\n\n\n\n                                 Used to discover how your campaigns and ad groups are resonating with audiences of specific metropolitan areas.\n                                \n\n\n\n\n\n\n\n                                 Negative Keyword Conflict Report\n                                \n\n\n\n\n\n                                 Used to discover which keywords and negative keywords are in conflict, and whether the conflict is at the campaign or ad group level.\n                                \n\n\n\n\n\n\n\n                                 Publisher Usage Performance Report\n                                \n\n\n\n\n\n                                 Used to discover if any website URLs aren’t performing well enough for your campaign or ad group target settings. For example, if ad impressions at those URLs yield a low click-through rate, then you might decide to exclude those websites from your campaign.\n                                \n\n\n\n\n\n\n\n                                 Search Campaign Change History Report\n                                \n\n\n\n\n\n                                 Used to discover when changes to an account were made, as well as which user made the changes.\n                                \n\n\n\n\n\n\n\n                                 Search Query Performance Report\n                                \n\n\n\n\n\n                                 Used to discover what your audience is searching for when your ads are shown. You can use this information to make informed additions, removals, or edits to both your keyword and negative keyword lists.\n                                \n\n\n\n\n\n\n\n                                 Share of Voice Report\n                                \n\n\n\n\n\n                                 Used to view impression share (%) of successful bids for each keyword, and identify opportunities to increase impression share.\n                                \n\n\n\n\n\n                               User Location Performance Report\n                              \n\n                               Used to show where your traffic is coming from broken out by the physical location and the location people are searching for.\n                              \n\n\n\n\n\n\n\n\n\n                             Aggregate By\n                            \n\n\n\n\n\n                             Select how data in the report is broken down. For example,\n                             \n                              Weekly\n                             \n                             breaks down data by week.\n                            \n\n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n                           Backfill\n                          \n\n                           Enter the number of days before the start date that should be backfilled. This action will be performed\n                           \n                            only\n                           \n                           the first time the data source runs. On subsequent runs, the specified\n                           \n                            Start Date\n                           \n                           to\n                           \n                            End Date\n                           \n                           range is used.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n\n                          Double-check the API key.\n                         \n\n\n\n                          Try to access the data directly from the API.\n                         \n\n\n\n                        FAQ\n                       \n\n                        How frequently will my data update?\n                       \n\n                        As often as needed.\n                       \n\n                        What type of input parameters do I need to consider while creating a Bing Ads DataSet?\n                       \n\n                        You need to provide the Report type, Aggregated by (daily/weekly/hourly etc.) and PastDays value (backfill) while creating a new Bing Ads dataset.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        No.\n                       \n\n                        Does the Bing Ads connector support backfilling?\n                       \n\n                        Backfilling is supported in Bing Ads connector for the first attempt only. As you set the backfill value, the Bing Ads connector pulls the data for the mentioned number of days before the start date, along with the data between the specified start and end dates.", "Preview Article": "Click here to preview", "URL Name": "360043430893", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003794", "Archived Date": "", "Language": "English", "Primary Version": "Bing Ads Connector", "Article Total View Count": "5,213", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Bing Ads Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}