{"file_path": "../../raw_kb_v2\\article\\360043439073\\index.html", "content": {"title": "\n\n\n Time Zone Troubleshooting FAQ\n\n\n", "article_body": "\n\n\n####\n Intro\n\n\n Get answers to frequently asked questions about setting your time zone.\n\n\n####\n Why do my cards show data at the wrong hour/day?\n\nSee\n\nSetting Your Time Zone\n\nfor information.\n\n###\n What are the implications for using vs. not using company time zone settings?\n\nThe data in your cards will be altered to reflect any changes you make in your company time zone settings. All data loaded into Domo is assumed to be in UTC and the company time zone setting will adjust the data from UTC to the selected time zone.\n\n\n If you have data coming into Domo in different time zones, the four simplest options for mitigating problems with the data are as follows, in order of simplicity:\n\n Transform the data using Beast Mode so that it is normalized to UTC\n* Transform the data in a DataFlow so that it is normalized to UTC\n* Fix the data on the customer side\n* Use the API to alter the data with code\n\nBecause Domo will always assume that the date/time values in your data are coming in as UTC, changing your time zone setting is essentially telling Domo to adjust the date/time values either forward or backward by the hour offset between UTC and your selected time zone.\n\n\n For example, if you are in the Eastern time zone of the United States and have turned this setting on, when Domo goes to plot any cards with time-level granularity, it will assume the times in your data are in UTC and the visualization will reflect those times adjusted back by 5 hours (or 4 hours, depending on Daylight Saving Time). So if the time values in your DataSet are already in your local time zone, and you have turned on the time zone feature, the times that appear on your card will not be correct.\n\n\n The following table clarifies some of the specific effects of setting or not setting your company time zone:\n\n\n*With*\n Time Zone Set\n  |\n*Without*\n Time Zone Set\n  |\n| --- | --- |\n|\n All date/time values (ex: mm/dd/yy; hh:mm:ss) must be in UTC. Domo will adjust them to your chosen local time in your cards. The actual data in your DataSet is not changed.\n  |\n No changes are applied to the cards or your data. Cards will represent date/time values (ex: mm/dd/yy; hh:mm:ss)\n  |\n|\n Date values (ex: mm/dd/yy) will not be affected.\n  |\n Date values (ex: mm/dd/yy) will not be affected.\n  |\n|\n Days break at UTC +/- your local adjustment for midnight (ex: in New Your City, midnight is 5 am UTC).\n  |\n Days break at midnight of the existing date/time values in your DataSet.\n  |\n|\n Connector scheduling remains in UTC.\n  |\n Connector scheduling remains in UTC.\n  |\n\n\n**Note**\n : Many data providers will use UTC as a default. If you have some DataSets that are in UTC and others that are in local time, you will need to perform some calculations in either Beast Mode or using a DataFlow in order to normalize the date/time values into the same time zone. Or you may be able normalize the date/time values through or within your data provider prior to uploading.\n\nIf you have verified that all of the date-time values in your DataSets are in UTC, then you can simply turn on the company time zone settings and your cards will update to reflect your local time.\n\n####\n Time Zone Adjustments: Beast Mode vs DataFlows\n\nTime zone transformations can be accomplished in either Beast Mode calculations or DataFlows, but it’s important to note that there are situations where one solution may be better than the other.\n\n\n It is more appropriate to use Beast Mode for time zone transformations when the resultant field has the following requirements:\n\n Does not need to be used as the Date Range Field on the card (given that you cannot currently use Beast Mode calculations for the Date Range Field).\n* Does not need to be used in other Beast Mode calculations (because this would require duplicating the transformation code in every location where the field is to be used).\n\nIf a DataFlow is already being used to create the DataSet powering the card, it is often best to include the time zone adjustments in the already existing DataFlow. In this case, the output fields will be available for use as the Date Range Field on the card and can also be used in Beast Mode calculations.\n\n\n Also, note that the code used to adjust time zones will differ between a Beast Mode and MySQL DataFlows. In MySQL, the\n\nCONVERT\\_TZ()\n\nfunction can be used to adjust a date from one time zone to another, automatically handling Daylight Saving Time concerns in the process. When using Beast Mode calculations, Daylight Saving Time needs to be considered in the code.\n\n###\n How can I adjust Beast Mode functions to account for Daylight Saving Time?\n\nProblem*\n :\n\n\n Timestamp outputs for DataFlows will timestamp according the local time zone settings of your instance. Even if the transform's preview shows UTC, it will convert to your settings upon generating the output. However, timestamp functions in Beast Mode will stamp according to UTC time.\n\n\n This can cause some major issues when writing Beast Mode calculations off these fields/functions and if your state recognizes Daylight Saving Time.\n\n\n*Solution*\n :\n\n\n Create a Beast Mode calculations to convert UTC into the correct time zone while also taking into account the correct dates to handle Daylight Saving Time.\n\n\n The following example will show you how to do it. Specifically, this formula will give you the value of the `date` column shifted according to whether you’re in Daylight Saving Time or not:\n\n*Note:**\n Daylight Saving Time for the US begins at 2:00 AM on the second Sunday in March, and ends at 2:00AM on the first Sunday in November.\n\nCASE`\n\n\n`WHEN `date` >= ADDDATE(STR_TO_DATE(CONCAT(YEAR(`date`),'03','01'),'%Y%m%d'),(MOD(15 - DAYOFWEEK(STR_TO_DATE(CONCAT(YEAR(`date`),'03','01'),'%Y%m%d')),7) + 7))`\n\n\n`AND `date` < ADDDATE(STR_TO_DATE(CONCAT(YEAR(`date`),'11','01'),'%Y%m%d'),MOD(1 - DAYOFWEEK(STR_TO_DATE(CONCAT(YEAR(`date`),'11','01'),'%Y%m%d')),7))`\n\n\n`then DATE_SUB(`date`,INTERVAL 4 HOUR)`\n\n\n`else DATE_SUB(`date`,INTERVAL 5 HOUR)`\n\n\n`END`\n\n###\n Why are my connector jobs running at the wrong time?\n\nProblem:*\n\n\n Say you scheduled a DataSet to update at a particular time but the update history shows it running at a different time.\n\n\n*Solution:*\n\n\n When a customer sets a time for a DataSet to update, this time is based on UTC time. However, the time shown in the update history will show the actual time of the update based on your company's time zone setting. Verify that the job is set for the right time using UTC. If Daylight Saving Time is an issue, you may have to update your connector schedule twice a year to account for the change.\n\n###\n Why are the times not what I expect in my timestamps in my DataSets?\n\nProblem:*\n\n\n This can happen as a result of two issues. The most common cause is that you don’t have your time zone set properly in your company settings. The second most common reason is that your data was scheduled to upload in a time zone other than UTC, and your company settings are shifting the timestamp to the time zone you’ve selected in you company settings. Essentially, this means Domo is assuming your data is coming in at UTC, even though it isn’t.\n\n\n*Possible Solutions:*\n\n Adjust your company settings\n* Adjust your data set or connector upload schedule\n* Create a Beast Mode or DataFlow calculation that will allow you to resolve the disparity between the different time zones\n\n\n####\n (Workbench) How do I set the time zone for a DataSet job in Workbench 4?\n\nYou have the option to set the time zone for a DataSet Job within Workbench. When the job is sent to Domo, all of the date-time data is based on the time zone you selected. You apply a time zone to a DataSet using the Shift Date Timezone Transform.\n\nHere’s how to set the time zone for a DataSet job:\n\n. In the\n **Accounts**\n pane, select the DataSet job in which you want to set the time zone.\n2. In the\n **Transforms**\n grouping in the\n **Buttons**\n toolbar at the top of the Workbench window, click\n **Add New**\n .\n3. In the\n **Transform Type**\n menu, select\n **Shift Date Timezone**\n then select\n **Next**\n .\n4. Then select\n **Finish**\n .\n\n\n At this point, a\n **Shift Date Timezone**\n item is added under\n **Transforms**\n for this DataSet job.\n5. Next, select the new\n **Shift Date Timezone**\n item under\n **Transforms**\n .\n6. In the\n **Data Timezone**\n menu, select the desired time zone.\n7. Click\n **Save**\n in the DataSet Jobs grouping in the Buttons toolbar at the top of the Workbench window.\n\n\n####\n How can I convert Time Zones Using a MySQL DataFlow?\n\nMySQL offers a\n\nCONVERT\\_TZ\n\nfunction that you can use to convert the time zone in a DataFlow. This function is also designed to accommodate Daylight Saving time.\n\n\n For example, to convert a datetime column from UTC to Pacific Standard, do the following:\n\n\n`CONVERT_TZ(`Date`, 'UTC', 'PSTUS/Pacific')`\n\n\n Please go to your favorite resource on MySQL to learn more on how to perform this function.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043439073\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003060\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nTime Zone Troubleshooting FAQ\n\n", "article_total_view_count": "\n\n\n 6,046\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:09 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "time_zone_troubleshooting_faq", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "administrating_domo", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "specifying_company_settings", "url": "/s/topic/0TO5w000000ZaoGGAS"}]}