{"file_path": "../../raw_kb_v2\\article\\4404652354583\\index.html", "content": {"title": "\n\n\n DataFlows Disabled Due to Extended Inactivity\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo may automatically disable a DataFlow when the system has identified that the outputs of a DataFlow are no longer in active use by your users.\n\n\n What causes a DataFlow to be disabled?\n----------------------------------------\n\nThere are several factors considered when a DataFlow is evaluated for inactivity. Some factors considered will exclude the DataFlow from being eligible to be system disabled while others depend on the amount of time something hasn’t been used.\n\n\n The primary consideration given when Domo evaluates whether a DataFlow should be disabled is the length of time that DataFlow has been unused.\n\n\n What does “unused” mean?\n--------------------------\n\nUsage is defined as meaningful consumption of a DataFlow’s output DataSets in any way. There are a lot of factors that are considered “meaningful usage.” A few of the most common examples are as follows:\n\n A Card from an Output DataSet of that DataFlow was viewed.\n\t+ i.e. accessed via a Story, Dashboard, direct URL, published in Embed, Slideshow, Scheduled Report, or Export to PDF are all considered.\n* Configured Alert exists for an Output DataSet or Card built off an Output DataSet triggered.\n\t+ i.e. DataSet Alert, Card Alert, or Watchdog.\n* An Output DataSet was used in Fusion, View DataSet, or as an input to another DataFlow.\n* An Output Dataset was recently copied to another instance.\n\t+ i.e. DataSet Copy Connector, Publish v2, or Writeback Connector.\n\nWhat excludes a DataFlow from disablement?\n--------------------------------------------\n\nShould the system evaluate a DataFlow and determine it is no longer in use, a number of additional checks are evaluated before any auto-disablement. If a DataFlow meets any of the following criteria, it will NOT be considered for auto-disablement:\n\n The DataFlow has a recursive Output or Input DataSet.\n* The DataFlow’s Output DataSets are used as an input to a Fusion, View DataSet, or in another active DataFlow.\n* The DataFlow is an Adrenaline DataFlow (Premium feature).\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4404652354583\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004547\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDataFlows Disabled Due to Extended Inactivity\n\n", "article_total_view_count": "\n\n\n 5,359\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "dataflows_disabled_due_to_extended_inactivity", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "transforming_data_in_domo", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "dataflow_management", "url": "/s/topic/0TO5w000000ZanUGAS"}]}