{"file_path": "../../raw_kb_v2\\article\\360043430293\\index.html", "content": {"Title": "Downloading and Running the Buzz Desktop Version", "Article Body": "Intro\n                       \n\n                        Buzz comes in two varieties—the version found within the Domo application as well as a free downloadable version that functions as an independent application on your computer. These versions are exactly the same, save for a set of additional toolbar options in the free version. For more information about these options, see\n                        \n                         Desktop version toolbar options\n                        \n                        .\n                       \n\n                        System Requirements\n                       \n\n                        Windows\n                       \n\n\n\n                          Runs on Windows 7 and later versions. (Older versions will not work.)\n                         \n\n\n\n                          Both x86 and amd64 (x64) binaries are provided. The ARM version of Windows is not supported.\n                         \n\n\n\n                          Intel Pentium 4 processor or later that's SSE2-capable\n                         \n\n\n\n                          512 MB of RAM\n                         \n\n\n\n                        Mac\n                       \n\n\n\n                          Runs on OS X 10.9 and later versions. (Older versions will not work.)\n                         \n\n\n\n                          Only 64-bit binaries are provided.\n                         \n\n\n\n                          64-bit Intel processor\n                         \n\n\n\n                          512 MB of RAM\n                         \n\n\n\n                        Linux\n                       \n\n\n\n                          Runs on Ubuntu 12.04+, Fedora 21, and Debian 8\n                         \n\n\n\n                          Intel Pentium 4 processor or later that's SSE2-capable\n                         \n\n\n\n                        Downloading the Desktop Version of Buzz\n                       \n\n                        You can download the desktop version of Buzz from the Domo product.\n                       \n\n\n                         To download the desktop version of Buzz,\n                        \n\n\n\n\n                          Open the Domo product.\n                         \n\n\n\n                          (Conditional) If Buzz is not open, open it by clicking\n                          \n                          in the toolbar in the upper right corner of Domo.\n                         \n\n\n\n                          Select\n                          \n                           Download the Buzz App\n                          \n                          in the\n                          \n                           Buzz\n                          \n                          dropdown menu in the top left corner of Buzz.\n                          \n\n\n\n\n\n\n                          Choose your desired operating system.\n                         \n\n\n\n                        The Buzz application is downloaded to your computer. It then opens automatically.\n                       \n\n                        Running the Desktop Version of Buzz\n                       \n\n                        Follow these steps to get going with the desktop version of Buzz.\n                       \n\n\n                         To run the desktop version of Buzz,\n                        \n\n\n\n\n                          (Conditional) If you just installed Buzz, it opens automatically. Otherwise, locate the Buzz file on your machine and double-click it.\n                         \n\n\n\n                          Enter your company domain in the field. This is the portion of your company's Domo URL that comes before\n                          \n                           .\n                           \n                            domo.com\n                           \n                           .\n                          \n                          For example, if the URL of your company's Domo instance was\n                          \n\n                            myURL.domo.com\n                           \n\n                          , you would enter\n                          \n                           myURL\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             If at any time you want to return to this screen to add a new domain, you may do so by selecting\n                             \n                              Team > Add Team.\n                             \n\n\n\n\n\n\n\n\n\n\n\n                          Click\n                          \n                           Continue\n                          \n                          .\n                          \n\n                          One of two things now happens:\n                         \n\n\n\n                            If you are already signed into the Domo instance you specified in step 2, a dialog appears asking if you want to sign in using your current credentials, as shown here:\n                            \n\n\n\n\n                            If this dialog appears, go to step 4.\n                           \n\n\n\n                            Otherwise, the normal Domo login screen appears for the specified instance.\n                            \n\n\n\n                            If this dialog appears, go to step 5.\n                           \n\n\n\n\n\n                          (Conditional) If the sign-in dialog appears as shown in the first image above...\n                         \n\n\n\n                            If you want to sign in using the account shown here, click\n                            \n                             Sign In\n                            \n                            .\n                           \n\n\n\n                            Otherwise close the browser window, log out of Domo, reopen Buzz Desktop. enter your desired domain, then enter your credentials.\n                           \n\n\n\n\n\n                          (Conditional) If the regular Domo login screen appears as shown in the second image above, enter your credentials, then click\n                          \n                           Sign In\n                          \n                          .\n                         \n\n\n\n                        Buzz now opens on your desktop. You can now collaborate with coworkers just as you can in the online version of Buzz. For more information, see\n                        \n                         Chatting in Buzz\n                        \n                        .\n                       \n\n                        The desktop version of Buzz includes a number of menu options not found in the online version. For descriptions of these, see\n                        \n                         Desktop version toolbar options\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043430293", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004314", "Archived Date": "", "Language": "English", "Primary Version": "Downloading and Running the Buzz Desktop Version", "Article Total View Count": "4,888", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Downloading and Running the Buzz Desktop Version\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Buzz\n              \n", "url": "/s/topic/0TO5w000000ZanCGAS"}]}