{"file_path": "../../raw_kb_v2\\article\\360042926694\\index.html", "content": {"title": "\n\n\n DoubleClick Campaign Manager via Google Cloud Storage (DTV2) Connector\n\n\n", "article_body": "\n\n*Important:**\n\nDue to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. All pre-existing DataSets will continue to run normally. Current Connectors that rely on Google OAuth authentication will no longer be able to power up new DataSets. These connectors include the following:\n * Google BigQuery\n* Google Adwords via Google BigQuery\n* DoubleClick Campaign Manager via Google Cloud Storage (DTV2)\n* Google Cloud Storage\n* Google Contacts\n* Google Drive\n* Google Gmail\n* Google Admin SDK Reports\n\nIf you need to change a pre-existing Google OAuth DataSet, please use the corresponding Service Account connector. The following Service Account connectors are now available:\n\n Google BigQuery Service\n* Google Ads (fomerly AdWords) via Google BigQuery Service\n* Google Drive Service\n* Google Cloud Storage Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Admin SDK Reports Service\n\nAll other equivalent Google Service Account connectors are currently in development. Domo will communicate when these connectors become available. You will need to look for the Service Account equivalent connector in Data Center or the App Store and use that connector to get their data.\n\n\n Domo recommends that you proactively repower existing Google connections by creating new DataSets utilizing the new Service Account Key connectors as the connectors become available.  Domo will notify you if any further migration changes should arise.\n\n\n Intro\n-------\n\nGoogle Cloud Storage is an Internet service used to store data in Google's cloud. You can use Domo’s Double Click Campaign Manager via Google Cloud Storage (DTV2) connector to retrieve DoubleClick Campaign Manager and DoubleClick Bid Manager data. The connector brings in impression-level data and is able to join the data automatically. To learn more about the DoubleClick Campaign Manager API, visit their page (\n\nhttps://developers.google.com/double...k-advertisers/\n\n).\n\n\n**Note:**\n The user interface for building this connector is not yet available in our Connectors listing in the Data Center, meaning you will not be able to configure the connector on your own. However, we at Domo are more than happy to configure the connector for you so you can begin using it to pull your data into Domo. Please don't hesitate to reach out to your CSM or Domo Support. For contact information, see\n\n\n Getting Help\n\n\n .\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector pulls DCM tables from Google Cloud Storage into Domo. If you indicate that you want match tables included, these tables will be joined.\n  |\n|\n**Primary Metrics**\n |\n The connector brings in raw data, but you can aggregate the data to show metrics such as...\n * Impressions\n* Clicks\n* CTR\n* Rich media delivered\n* Activities for DCM campaigns\n |\n|\n**Primary Company Roles**\n | * Data specialists\n* Analysts\n* Major Domos\n |\n|\n**Average Implementation Time**\n |\n Average time for the phases of implementation for this connector are as follows:\n * Configuring an export of your 4 tables to Google Cloud Storage - 2 hours\n* Configuring credentials in Domo - 15 minutes or less\n* Configuring the connector - 20 minutes\n\n\n The total time may also depend on the size of the files coming from DCM.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 7\n  |\n\nYou connect to your DoubleClick Campaign Manager account in the Data Center. This topic discusses the fields and menus that are specific to the DoubleClick Campaign Manager connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to a Google account and create a DataSet, you must have the username and password for the account you want to connect to.\n\n\n You must also export these four tables from DCM to Google Cloud Storage before configuring this connector:\n\n Activities\n* Clicks\n* Impressions\n* Rich Media\n\nYou can refer to this page to find the names of all of the fields that come through for these four tables:\n\nhttps://developers.google.com/doubleclick-advertisers/udt/reference/v1/file-format\n\nDo not change the output files names—Google will automatically assign these file names.\n\n\n Connecting to Your DoubleClick Campaign Manager via Google Cloud Storage Account\n----------------------------------------------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the DoubleClick Campaign Manager via Google Cloud Storage Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo DoubleClick Campaign Manager via Google Cloud Storage connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing DoubleClick Campaign Manager via Google Cloud Storage accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new DoubleClick Campaign Manager via Google Cloud Storage DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the DoubleClick Campaign Manager via Google Cloud Storage report you want to run. The Master Report pulls all 4 DCM tables into a single report. (see\n\nPrerequisites\n\nfor more information about these tables). All other reports allow you to retrieve individual DCM tables, with or without match tables. Match tables are used to perform joins between tables.\n\n\n The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Activities Raw Data\n  |\n Retrieves the raw data from your DCM Activities table.\n  |\n|\n Activities Report with Match Tables\n  |\n Retrieves your DCM Activities data with match tables.\n  |\n|\n Clicks Raw Data\n  |\n Retrieves the raw data from your DCM Clicks table.\n  |\n|\n Clicks Report with Match Tables\n  |\n Retrieves your DCM Clicks data with match tables.\n  |\n|\n Impressions Raw Data\n  |\n Retrieves the raw data from your DCM Impressions table.\n  |\n|\n Impressions Report with Match Tables\n  |\n Retrieves your DCM Impressions data with match tables.\n  |\n|\n Master Report\n  |\n Compiles a report with data from all of your DCM tables—Activities, Clicks, Impressions, and Rich Media.\n  |\n|\n Rich Media Raw Data\n  |\n Retrieves the raw data from your DCM Rich Media table.\n  |\n|\n Rich Media Report with Match Tables\n  |\n Retrieves your DCM Rich Media data with match tables.\n  |\n\n\n |\n|\n Bucket Name\n  |\n Enter the name of the bucket in Google Cloud Storage where the DCM files are stored.\n  |\n|\n Backfill Days for Initial Run\n  |\n Enter the number of past days you want to retrieve data for on the first run. Depending on the file size, you may not be able to backfill very many days.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure you have the right bucket name and the report desired.\n* Make sure you have exported the required tables from DCM to Google Cloud Storage. (See\n\nPrerequisites\n\nfor more information.)\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042926694\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003782\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDoubleClick Campaign Manager via Google Cloud Storage (DTV2) Connector\n\n", "article_total_view_count": "\n\n\n 2,478\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "doubleclick_campaign_manager_via_google_cloud_storage_dtv2_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}