{"file_path": "../../raw_kb_v2\\article\\360043440753\\index.html", "content": {"Title": "Public API SDKs FAQ", "Article Body": "Intro\n                       \n\n                        This topic provides answers to frequently asked questions regarding our public API SDKs.\n                       \n\n                        Product Details\n                       \n\n                        Why do we need this feature?\n                       \n\n                        As businesses attempt to leverage and extend the Domo platform via automation through its APIs, many have found challenges with the complexity of maintaining authentication to the Domo’s API layer as well as the effort required to maintain additional code required to integrate with RESTful endpoints.\n                       \n\n                        Domo has now provided first class SDKs to significantly reduce the level of effort that customers, partners, and developers need to implement integrations with Domo’s set of Public APIs – ultimately providing the ability to create more solutions in much less time.\n                       \n\n                        What specifically has improved?\n                       \n\n                        Specific improvements include:\n                       \n\n\n\n                          Graceful handling of Authentication\n                          \n                          Previously, you had to continue to authenticate via OAuth every hour. With each SDK, you no longer are forced through the tedious effort of managing connections to the APIs.\n                         \n\n\n\n                          Inline Documentation\n                          \n                          While editing code inside an editor like IntelliJ, a user will be able to drill into each object and learn specific details about parameters. In addition, each object guides the developer on required parameters and overall structure.\n                         \n\n\n\n                          Ability to branch code for custom solutions\n                          \n                          With the open-source nature of each SDK, users can download the latest version of an SDK and then personalize it to create solutions for specific use cases and needs.\n                         \n\n\n\n                        Is a migration required? What is the plan?\n                       \n\n                        No migration is needed.\n                       \n\n                        Product Setup\n                       \n\n                        Is a feature switch required for this Product?\n                       \n\n                        No\n                       \n\n                        Are there any requirements for using this Product?\n                       \n\n                        Knowledge of Python, Java, or Node languages.\n                       \n\n                        Are there any role restrictions for this product?\n                       \n\n                        Role restrictions will continue to be observed with the authentication process.  If you are not an admin, you will not be able to leverage the APIs.\n                       \n\n                        Can I control who can use this product?\n                       \n\n                        No.\n                       \n\n                        Are there any other admin capabilities around this product?\n                       \n\n                        Yes, you can manage access tokens for people who are using a token to integrate with any of the Public APIs.\n                       \n\n                        Is there anything else about the setup users should know about?\n                       \n\n                        No, all SDKs can be found on Domo’s Github repo here:\n                        \n                         https://github.com/domoinc/\n                        \n\n\n                        Product Compatibility\n                       \n\n                        Does this product work for customers who have SSO enabled?\n                       \n\n                        No, we are working to enable obtaining Client ID and Secrets for customers using SSO.\n                       \n\n                        Does this product work with PDP?\n                       \n\n                        Yes, there is a PDP API that is a part of each SDK.\n                       \n\n                        Does this product work with internal or external Publication Groups, Alerts, Buzz, Mobile, page filters, card filters, or card Save As?\n                       \n\n                        No.\n                       \n\n                        Product Cost and Freemium\n                       \n\n                        Is there a cost associated with using this product?\n                       \n\n                        No.\n                       \n\n                        Where does this product fit in Domo’s pricing tier?\n                       \n\n                        This product is included with Domo Professional and Enterprise versions. It is not included with Free Domo or Starter versions.\n                       \n\n                        Product Limitations\n                       \n\n                        Are there any limitations that users should be aware of with this Product?\n                       \n\n                        No.", "Preview Article": "Click here to preview", "URL Name": "360043440753", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003171", "Archived Date": "", "Language": "English", "Primary Version": "Public API SDKs FAQ", "Article Total View Count": "4,898", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Public API SDKs FAQ\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Other Connection Methods\n              \n", "url": "/s/topic/0TO5w000000ZanzGAC"}]}