{"file_path": "../../raw_kb_v2\\article\\360043430473\\index.html", "content": {"Title": "Filtering Project Tasks", "Article Body": "You can filter the tasks in a project details view by doing any of the following:\n                       \n\n\n\n                          Entering a keyword in the\n                          \n\n                            Filter tasks\n                           \n\n                          field. The project view filters to show only tasks with that keyword in their description.\n                         \n\n\n\n                          Clicking on a tag in the \"Tags in this project\" area. The project view filters to show only tasks that contain that tag. For \"Tags in this project\" to appear, you must specify a tag in at least one task in the project. You can do this when creating or editing a task. For more information, see\n                          \n                           Creating and Assigning Project Tasks\n                          \n                          .\n                         \n\n\n\n                          Clicking on the pictures of the team members assigned to the tasks you want to show.\n                         \n\n\n\n                          Combining any of the above. For example, you could click a team member's photo to filter to show tasks assigned to that team member, and then enter a tag. This would filter to show tasks that are assigned to that team member\n                          \n                           and\n                          \n                          contain the tag you entered.\n                         \n\n\n\n\n\n\n\n\n\n                              Tip:\n                             \n                             When you filter asks in a project, your URL is updated to reflect your filter configuration. If you bookmark this URL, you can return to your project view with this specific filter configuration whenever you want.\n                            \n\n\n\n\n\n\n\n                         To filter tasks by keyword,\n                        \n\n\n\n\n                          Show the filter panel options by clicking the filter toggle button\n                          \n                          .\n                         \n\n\n\n                          Enter the keyword in the\n                          \n\n                            Filter tasks\n                           \n\n                          field.\n                          \n                          Tasks are filtered as you add or remove letters.\n                         \n\n\n\n                        You can remove a keyword filter by deleting the keyword from the\n                        \n\n                          Filter tasks\n                         \n\n                        field.\n                       \n\n\n                         To filter by tag,\n                        \n\n\n\n\n                          Show the filter panel options by clicking the filter toggle button\n                          \n                          .\n                         \n\n\n\n                          Click the tag you want to filter by.\n                          \n                          The project is filtered so that only tasks containing the tag appear.\n                         \n\n\n\n                        You can remove a tag filter by clicking on that tag a second time.\n                       \n\n\n                         To filter by team member,\n                        \n\n\n\n\n                          Show the filter panel options by clicking the filter toggle button\n                          \n                          .\n                         \n\n\n\n                          Click the picture of a team member assigned to the task(s) you want to show.\n                          \n                          All pictures except for the one you clicked are grayed out, and the project is filtered so that only tasks to which this team member is assigned appear.\n                         \n\n\n\n                          (Optional) To add team members to the filter, click the grayed-out pictures of all team members you want to add.\n                         \n\n\n\n                          (Optional) To remove a team member from the filter, click their colorized photo.\n                          \n                          This grays out the photo and removes the team member from the filter.\n                         \n\n\n\n\n                         To reset all filters,\n                        \n\n\n\n\n                          Click\n                          \n\n                            Clear filters\n                           \n\n                          , on the right side of the filter panel.", "Preview Article": "Click here to preview", "URL Name": "360043430473", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004362", "Archived Date": "", "Language": "English", "Primary Version": "Filtering Project Tasks", "Article Total View Count": "4,705", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Filtering Project Tasks\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Projects And Tasks\n              \n", "url": "/s/topic/0TO5w000000Zao5GAC"}]}