{"file_path": "../../raw_kb_v2\\article\\4403486465687\\index.html", "content": {"Title": "Domo Everywhere Launch Page", "Article Body": "Intro\n                       \n\n                        The Domo Everywhere Launch Page helps you to quickly learn how leading customers are using each version of Domo Everywhere. This allows you to choose the right Domo Everywhere product for your needs.\n                       \n\n                        Accessing the Domo Everywhere Launch Page\n                       \n\n                        To access the Domo Everywhere Launch Page, click on the\n                        \n                         More\n                        \n                        menu in the top navigation pane and select the\n                        \n                         Domo Everywhere\n                        \n                        icon.\n                       \n\n\n\n                         >\n                        \n\n\n\n                        Power Your Portal tab\n                       \n\n                        The first tab of the Domo Everywhere Launch Page is Power Your Portal. This allows you to embed live analytics where people already work. Share insights outside of your company without forcing a separate login or extra training. Bring live answers right next to the workflows where people are already comfortable so you can:\n                       \n\n\n                         Inform decisions.\n                        \n\n                         Increase adoption.\n                        \n\n                         Improve retention.\n                        \n\n\n\n\n\n                        Distribute Your Data tab\n                       \n\n                        The second tab of the Domo Everywhere Launch Page is Distribute Your Data. This allows you to publish across tenants. Every company is a data company. When data is shared across teams, it quickly drives productivity. When it is shared across companies, it drives profit even faster. If you do not have a portal to host the experience, let Domo handle that for you. Publish data and content to thousands of subscribers so you can:\n                       \n\n\n                         Monetize data.\n                        \n\n                         Encourage collaboration.\n                        \n\n                         Launch in minutes.\n                        \n\n\n\n\n\n                        Accelerate Your Software tab\n                       \n\n                        The second tab of the Domo Everywhere Launch Page is Accelerate Your Software. This allows you to integrate the full platform. The most advanced companies integrate the full power of the platform. Start with the majority of your functionality already built so you can focus on your expertise. Your most strategic customers demand more than dashboards. OEM all of Domo in your interface so they can:\n                       \n\n\n                         Create totally new content.\n                        \n\n                         Connect their own data.\n                        \n\n                         Transform both sides together.", "Preview Article": "Click here to preview", "URL Name": "4403486465687", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004242", "Archived Date": "", "Language": "English", "Primary Version": "Domo Everywhere Launch Page", "Article Total View Count": "5,109", "": "", "Article Created Date": "10/24/2022, 9:34 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Domo Everywhere Launch Page\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}