{"file_path": "../../raw_kb_v2\\article\\1500002456742\\index.html", "content": {"title": "\n\n\n Salesforce Pardot Connector with Single Sign-On support\n\n\n", "article_body": "\n\nIntro\n-------\n\nSalesforce Pardot is a marketing automation SaaS company that develops automated marketing and demand generation software and services for business-to-business marketers. Once your data is in Domo, you can combine it with views of other data sources for a deeper understanding of your buyers. See your latest stats in real-time, interactive dashboards that you can access from your computer, tablet, or phone. You can even get alerts when your key metrics change. To learn more about the Salesforce Pardot API, visit their page (\n\nhttp://developer.pardot.com/\n\n).\n\n\n The Salesforce Pardot with Single Sign-On connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Salesforce Pardot account in the Data Center. This topic discusses the fields and menus that are specific to the Salesforce Pardot with Single Sign-On connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n | * Results of email marketing activities\n* Lead generation success\n* Response to specific campaigns\n |\n|\n**Primary Metrics**\n | * Response rate to email marketing\n* Number of leads generated\n* Response rate\n* Conversion rate\n* Open rate\n* Click rate\n |\n|\n**Primary Company Roles**\n | * Email marketing analyst\n* CMO\n* Creative director\n |\n|\n**Average Implementation Time**\n |\n Less than 1 hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 3\n  |\n\nBest Practices\n----------------\n\n\n* Use Append to pull only the data modified or created since the last run to limit the number of calls.\n* When pulling deleted prospects, use the\n **Updated date**\n filter since this is the date that is modified when a prospect is deleted in Pardot.\n\nPrerequisites\n---------------\n\nTo connect to your Salesforce Pardot account and create a DataSet, you must have the following:\n\n Your Pardot business unit ID\n* Your concurrency limit\n* Your Salesforce username and password\n\n###\n\nTo find the Pardot Business Unit ID:\n\n\n1. Visit\n\n\n**Setup**\n in Salesforce.\n2. Enter \"Pardot Account Setup\" in the\n\n\n**Quick Find box**\n .\n3. Your Pardot Business Unit ID will appear. It begins with \"0Uv\" and is 18 characters long.\n\n\n####\n\nTo find the Pardot environment:\n\n\n1. In Salesforce, click the gear icon to access Setup.\n2. From Setup, enter \"Installed Packages\" in the\n\n\n**Quick Find box**\n , and then select\n\n\n**Installed Packages**\n .\n3. Find the package\n\n\n**b2bmaIntegration**\n .\n4. If the prefix is \"b2bma\", select Production otherwise select Sandbox.\n\n\n Connecting to Your Salesforce Pardot Account\n----------------------------------------------\n\n\n This section enumerates the options in the\n\n*Credentials**\n\nand\n\n*Details**\n\npanes in the Salesforce Pardot with Single Sign-On support Connector page. The components of the other panes in this page,\n\n*Scheduling**\n\nand\n\n*Name & Describe Your DataSet**\n\n, are universal across most connector types and are discussed in greater length in\n\n\n Adding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Salesforce Pardot account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Pardot Business Unit\n  |\n Enter your Pardot business unit ID. Visit\n\n\n Prerequisites\n\n\n for more details.\n  |\n|\n Salesforce Environment\n  |\n Select the Salesforce environment you want to authenticate against (i.e.\n\nlogin.salesforce.com\n\nor\n\ntest.salesforce.com\n\n).\n  |\n|\n Pardot Environment\n  |\n Select the Pardot environment. Visit\n\n\n Prerequisites\n\n\n for more details.\n  |\n|\n Concurrency Limit\n  |\n Enter the maximum amount of concurrent connections to Salesforce Pardot. If you are unsure how many concurrent connections to Pardot you are allowed, please contact your Salesforce administrator.\n  |\n\n\n Once you have entered valid Salesforce Pardot credentials, you can use the same account any time you go to create a new Salesforce Pardot with Single Sign-On support DataSet. You can manage connector accounts in the Accounts tab in the Data Center. For more information about this tab, see\n\n\n Managing User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu, along with two fields that allow you to set a date range for your data.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Salesforce Pardot report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Campaign\n  |\n Returns information about campaigns, including id, list id, name and cost etc.\n  |\n|\n Custom Fields\n  |\n Returns information about custom fields defined in Salesforce Pardot.\n  |\n|\n Custom Redirect\n  |\n Returns information about custom redirects defined in Salesforce Pardot.\n  |\n|\n Email Clicks\n  |\n Returns information about email clicks including prospect id and URL clicked.\n  |\n|\n Email Statistics\n  |\n Returns information about all email lists sent during the selected time period. This report returns information such as total clicks, bounces, opens, click through rate, etc.\n  |\n|\n Forms\n  |\n Returns information about Forms.\n  |\n|\n Lifecycle History\n  |\n Returns information about lifecycle history, including Pardot id, prospect id, previous stage id etc.\n  |\n|\n Lifecycle Stage\n  |\n Returns information about lifecycle stage, including lifecycle stage id, name, position etc.\n  |\n|\n List\n  |\n Returns all lists matching the specified criteria, including list name, title, description, etc.\n  |\n|\n Membership List\n  |\n Returns information about membership, including id, list id, prospect id, opted out etc.\n  |\n|\n Opportunity\n  |\n Returns all opportunities matching the specified criteria, including name, opportunity stage and status, campaign name, etc.\n  |\n|\n Prospect\n  |\n Returns information about prospects matching the specified criteria.\n  |\n|\n Prospect Bulk\n  |\n Returns information about prospects matching the specified criteria. Returns data more efficiently than regular prospect report, without custom fields.\n  |\n|\n Prospect Accounts\n  |\n Returns information about prospect accounts, including id, name, created\\_at etc.\n  |\n|\n Prospect Email Activities\n  |\n Returns information about email activities by prospects.\n  |\n|\n Prospect Email Activities (Historical data)\n  |\n Returns information about email activities by prospects (use this report to retrieve large amount of historical data. Will only run in Append mode.\n  |\n|\n Prospect Email Activities via bulk export\n  |\n Returns information about email activities by prospects.\n  |\n|\n Tag\n  |\n Returns information about Tag, including id, name, created\\_at etc.\n  |\n|\n Tag Object\n  |\n Returns information about tag object, including id, tag id, type, object id, created\\_at.\n  |\n|\n User\n  |\n Returns information about the authenticated user, including first and last name, email, role, account number, etc.\n  |\n|\n Visit\n  |\n Returns information about all page visits matching the specified criteria.\n  |\n|\n Visitor\n  |\n Returns information about page visitors, including page view count, IP address, host name, etc.\n  |\n|\n Visitor With Details\n  |\n Returns information about page visitors, including referrer, identified company and activities. This report uses 1 API call per visitor.\n  |\n|\n Visitor Activity\n  |\n Returns information about visitor activity, including number of page views, campaign name, visit type, etc.\n  |\n|\n Visitor Page Views\n  |\n Returns information about visitor page views, including page title, URL, and time the page view occurred.\n  |\n\n|\n|\n Date Filter\n  |\n Select whether to filter by created date, updated date, or date of last activity.\n  |\n|\n Include Custom Fields\n  |\n Select whether to include custom fields in this dataset\n  |\n|\n Skip Data for Failed Prospects\n  |\n Select this checkbox to skip the failed prospects calls. Email activities will be returned without prospect details in case of failure of the prospect call.\n  |\n|\n Prospects Fields\n  |\n Select the prospect fields to include in the data.\n  |\n|\n Activity Fields\n  |\n Select the activity fields to include in the data.\n  |\n|\n Custom Fields\n  |\n Select the custom fields to include in the data.\n  |\n|\n Identified Visitors\n  |\n Select whether to include all visitors or only visitors flagged as 'identified'.\n  |\n|\n Deleted Prospects\n  |\n Select whether to include deleted prospects or only retrieve current prospects.\n  |\n|\n Standard Fields to Exclude From Prospects Report\n  |\n Select the standard fields you want to exclude from the report.\n  |\n|\n Custom Fields to Exclude From Prospects Report\n  |\n Enter a comma separated list of the custom fields you want to exclude from the Prospect report.\n  |\n|\n Duration\n  |\n Select the duration for the report (a Single Date, or a Date Range).\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n ****Days Back****\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ****************End Date****************\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****************Start Date****************\n and 5 for\n ****************End Date****************\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ****************Start Date****************\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****************Start Date****************\n and 5 for\n ****************End Date****************\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Append Data Type\n  |\n Select how to retrieve data when using Append method.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Some Pardot accounts may have IP security enabled. In that case, Pardot returns \"Client IP address/location must be activated before accessing API.\" If that happens, Domo IP addresses must be whitelisted. For more information, see\n\nhttp://help.pardot.com/customer/port...ion-activation\n\n.\n* Pardot requires a very specific \"dictionary\" to decipher its results. The connector returns codes specific to every implementation. The mapping of codes to definitions requires significant maintenance.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500002456742\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003246\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSalesforce Pardot Connector with Single Sign-On support\n\n", "article_total_view_count": "\n\n\n 2,451\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "salesforce_pardot_connector_with_single_signon_support", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}