{"file_path": "../../raw_kb_v2\\article\\7884725265559\\index.html", "content": {"title": "\n\n\n Amazon S3 Analytics Assume Role Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Amazon S3 Analytics Assume Role Connector is an online file storage web service offered by Amazon Web Services that you can use to store and retrieve any amount of data, at any time, from anywhere on the web. To learn more about the Amazon S3 API, visit their page (\n\n\n http://docs.aws.amazon.com/AmazonS3/...I/Welcome.html\n\n\n ).\n\n\n The Amazon S3 and Amazon S3 Advanced connectors are almost the same. The only difference is in how they handle multiple files that begin with the prefix string you provide in the\n **Details**\n section of the connector.\n\n\n By using Amazon S3 analytics\n *Storage Class Analysis*\n you can analyze storage access patterns to help you decide when to transition the right data to the right storage class. This new Amazon S3 analytics feature observes data access patterns to help you determine when to transition less frequently accessed STANDARD storage to the STANDARD\\_IA (IA, for infrequent access) storage class. For more information about storage classes, see\n\nUsing Amazon S3 storage classes\n\n.\n\n\n You connect to your Amazon S3 Analytics Connector account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon S3 connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n\n|  |  |\n| --- | --- |\n| **Primary Use Cases**  |\n This connector is an excellent choice for retrieving flat files when APIs are not an option.\n  |\n| **Primary Metrics**  |\n NA\n  |\n| **Primary Company Roles**  | * Data specialists\n* Marketing roles\n* Finance roles\n* Anyone who has data stored in S3\n |\n| **Average Implementation Time**  |\n Less than an hour if you have the correct file types in S3.\n  |\n| **Ease of Use (on a 1-to-10 scale with 1 being easiest)**  |\n 4\n  |\n\nBest Practices\n----------------\n\n\n* Understanding the data stored in S3 Analytics Connector and its relation to other S3 databases will be a huge asset in using this connector.\n\nPrerequisites\n---------------\n\nYou must create a user with the proper permissions in the IAM Amazon Console before you can connect to S3 data in Domo.\n\n\n**To configure your user in the IAM Amazon Console,**\n\n. Add a new user, setting options as follows:\n\n1. In the\n\n\n\t**Details**\n\n\n\t pane, check the box for\n\n\n\t**Programmatic Access**\n\n\n\t under\n\n\n\t**Select AWS access type**\n\t .\n\t2. In the\n\n\n\t**Permissions**\n\n\n\t pane, select\n\n\n\t**Attach existing policies directly**\n\t , then check the box for either\n\n\n\t**AmazonS3FullAccess**\n\n\n\t or\n\n\n\t**AmazonS3ReadOnlyAccess**\n\t .\n\n\n\t Customer-managed policies\n\n\n\t*do not work*\n\t .\n\t3. In the\n\n\n\t**Review**\n\n\n\t pane, click\n\n\n\t**Create User**\n\t .\n2. After you create your user, copy the access and secret keys to use in the\n\n\n**Credentials**\n\n\n pane in Domo.\n\nConnecting to Your\n\nAmazon S3 Analytics Assume Connector\n\nAccount\n-------------------------------------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the [insert Connector name here] Connector page. The components of the other panes in this page,\n\n\n**Scheduling**\n\n\n and\n\n\n**Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Creating an IAM role (console)\n\nYou can use the AWS Management Console to create a role that an IAM user can assume. For example, assume that your organization has multiple AWS accounts to isolate a development environment from a production environment. For high-level information about creating a role that allows users in the development account to access resources in the production account, see\n\nExample scenario using separate development and production accounts\n\n.\n\n*To create a role (console)**\n\n. Sign in to the AWS Management Console and open the IAM console at\n\n\n https://console.aws.amazon.com/iam/\n\n\n .\n2. In the navigation pane of the console, choose\n\n\n**Roles**\n\n\n and then choose\n\n\n**Create role**\n .\n3. Choose\n\n\n**AWS account**\n\n\n role type.\n4. To create a role for your account, choose\n\n\n**This account**\n . To create a role for another account, choose\n\n\n**Another AWS account**\n\n\n and enter the\n\n\n**Account ID**\n\n\n to which you want to grant access to your resources.\n\n\n The administrator of the specified account can grant permission to assume this role to any IAM user in that account. To do this, the administrator attaches a policy to the user or a group that grants permission for the\n\n\n`sts:AssumeRole`\n\n\n action. That policy must specify the role's ARN as the\n\n\n`Resource`\n .\n5. If you are granting permissions to users from an account that you do not control, and the users will assume this role programmatically, select\n\n\n**Require external ID**\n . The external ID can be any word or number that is agreed upon between you and the administrator of the third-party account. This option automatically adds a condition to the trust policy that allows the user to assume the role only if the request includes the correct\n\n\n`sts:ExternalID`\n . For more information, see\n\nHow to use an external ID when granting access to your AWS resources to a third party\n\n.\n\n\n Important\n\n\n Choosing this option restricts access to the role only through the AWS CLI, Tools for Windows PowerShell, or the AWS API. This is because you cannot use the AWS console to switch to a role that has an\n\n\n`externalId`\n\n\n condition in its trust policy. However, you can create this kind of access programmatically by writing a script or an application using the relevant SDK. For more information and a sample script, see\n\n\n How to Enable Cross-Account Access to the AWS Management Console\n\n\n in the AWS Security Blog.\n6. If you want to restrict the role to users who sign in with multi-factor authentication (MFA), select\n\n\n**Require MFA**\n . This adds a condition to the role's trust policy that checks for an MFA sign-in. A user who wants to assume the role must sign in with a temporary one-time password from a configured MFA device. Users without MFA authentication cannot assume the role. For more information about MFA, see\n\nUsing multi-factor authentication (MFA) in AWS\n7. Choose\n\n\n**Next**\n .\n8. IAM includes a list of the AWS managed and customer managed policies in your account. Select the policy to use for the permissions policy or choose\n\n\n**Create policy**\n\n\n to open a new browser tab and create a new policy from scratch. For more information, see\n\nCreating IAM policies\n\n. After you create the policy, close that tab and return to your original tab. Select the check box next to the permissions policies that you want anyone who assumes the role to have. If you prefer, you can select no policies at this time, and then attach policies to the role later. By default, a role has no permissions.\n9. (Optional) Set a\n\npermissions boundary\n\n. This is an advanced feature.\n\n\n Open the\n\n\n**Set permissions boundary**\n\n\n section and choose\n\n\n**Use a permissions boundary to control the maximum role permissions**\n . Select the policy to use for the permissions boundary.\n10. Choose\n\n\n**Next**\n .\n11. For\n\n\n**Role name**\n , enter a name for your role. Role names must be unique within your AWS account. They are not distinguished by case. For example, you cannot create roles named both\n\n\n`PRODROLE`\n\n\n and\n\n\n`prodrole`\n . Because other AWS resources might reference the role, you cannot edit the name of the role after it has been created.\n12. (Optional) For\n\n\n**Description**\n , enter a description for the new role.\n13. Choose\n\n\n**Edit**\n\n\n in the\n\n\n**Step 1: Select trusted entities**\n\n\n or\n\n\n**Step 2: Add permissions**\n\n\n sections to edit the use cases and permissions for the role.\n14. (Optional) Add metadata to the role by attaching tags as key–value pairs. For more information about using tags in IAM, see\n\nTagging IAM resources\n\n.\n15. Review the role and then choose\n\n\n**Create role**\n .\n\n##\n Credentials Pane\n\nThe Domo\n\nAmazon S3 Analytics\n\nConnector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n\n\n**Connect**\n\n\n (or select\n\n\n**Add Account**\n\n\n if you have existing\n\nAmazon S3 Analytics Connector\n\naccounts in Domo to open the\n\nAmazon S3 Analytics Connector\n\nOAuth screen where you can enter your\n\nAmazon S3 Analytics\n\nusername and password. Once you have entered valid\n\n\n credentials, you can use the same account any time you go to create a new\n\nAmazon S3 Analytics\n\nDataSet. You can manage connector accounts in the\n\n\n**Accounts**\n\n\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\n\n If you are already logged into\n\nAmazon S3 Analytics Assume Connector\n\nwhen you connect in Domo, you are authenticated automatically when you click\n\n\n**Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of\n\nAmazon S3 Analytics Connector.\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Role ARN\n  |\n Enter your Amazon Resource Name (ARN) of the role to assume.\n  |\n|\n Session Name\n  |\n Enter the identifier for the assumed role session.\n  |\n|\n External ID\n  |\n Generate the ExternalID by clicking the generate button and paste it into the trust relationship document of IAM Role.\n  |\n|\n Region\n  |\n Enter the amazon S3 Region.\n  |\n\n\n###\n Details Pane\n\nThis pane contains various menus for locating and configuring the file you want to pull into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n S3 Bucket Region\n  |\n Select the S3 Bucket Region where your file is located.\n\n\n |\n|\n File Type to Import\n  |\n Select the type of file you want to import into Domo, either CSV, JSON, or XML.\n  |\n|\n How Would You Like to Choose Your Filename?\n  |\n Select how you want Domo to identify your file. Options are as follows:\n\n\n|  |  |\n| --- | --- |\n|\n Complete Filename\n  |\n You enter the complete path to the file.\n  |\n|\n Partial Filename\n  |\n You enter a partial file name and specify whether the file to retrieve starts with or contains the name you have entered.\n  |\n|\n FilesDiscovery\n  |\n A list of files in the selected bucket appears and you choose the one you want. This option is available\n\n\n*only*\n\n\n when your selected S3 bucket contains fewer than 100 files.\n  |\n\n|\n|\n Prefix (Optional)\n  |\n Enter a prefix to filter results by. A prefix limits results to only those keys that begin with the given prefix. Note that with this standard version of the connector, only the latest modified file will be imported. The advanced version of the connector retrieves all files with the same prefix, provided they have the same schema. For more information, see\n\nAmazon S3 Advanced Connector\n\n.\n  |\n|\n Enter Complete Filepath\n  |\n Enter the complete path for the desired file.\n  |\n|\n File Name\n  |\n Enter the name of the file you want to import, with or without the file path. For example:\n\nfolder\\_name/file\\_name*\n\n|\n|\n File Name Match Type\n  |\n Specify whether the file you want to retrieve starts with or contains the text you entered under\n\n\n**File Name**\n .\n  |\n|\n File Compression Type\n  |\n Select the compression type for the file you want to retrieve. If the file is not compressed, select\n\n\n**None**\n .\n  |\n|\n Are Headers Present in CSV File?\n  |\n Select\n\n\n**Yes**\n\n\n if the CSV file you are importing contains headers; otherwise select\n\n\n**No**\n .\n  |\n|\n List of Files\n  |\n Select the file you want to retrieve.\n  |\n|\n Select the Delimiting Character\n  |\n Select the delimiter used in the CSV file you want to retrieve. If your delimiter is not listed, select\n\n\n**Other**\n .\n  |\n|\n Quote Character\n  |\n Select a quote character to parse the CSV file you want to retrieve. A double quote (\") is the CSV standard.\n  |\n|\n Escape Character\n  |\n Select an escape character to parse the CSV file you want to retrieve. A backslash (\\) is the CSV standard.\n  |\n|\n Enable Parsing for Large JSON Files?\n  |\n Specify whether parsing is enabled for large JSON files.\n  |\n|\n Does Your JSON Text Require a Line Reader?\n  |\n Specify whether the text in your JSON file includes multiple lines that should be read.\n  |\n|\n Should the Backslash be Escaped?\n  |\n Specify whether the text in your JSON file contains backslash characters that should be escaped.\n  |\n|\n Enter Your Data Tag\n  |\n Enter the tag for the data in your JSON or XML file.\n  |\n|\n Enter Fields to Exclude\n  |\n Provide a comma-separated list of fields to exclude in your JSON/XML import.\n  |\n|\n Enter Your Header Tag\n  |\n Enter the tag for the header in your JSON or XML file.\n  |\n|\n Do You Require Attributes in Data?\n  |\n Specify whether you require attributes values as part of your XML data.\n  |\n|\n Enter XPath Expression\n  |\n Enter your XPath expression.\n  |\n|\n Is Password Protected?\n  |\n Select\n\n\n**Yes**\n\n\n if the file you are retrieving is password-protected; otherwise select\n\n\n**No**\n .\n  |\n|\n Header Start Row\n  |\n Enter the number of the header row in the Excel file you are retrieving.\n  |\n|\n Data Start Row\n  |\n Enter the number of the first data row in the Excel file you are retrieving.\n  |\n|\n Footer\n  |\n Enter the number of the footer row in the Excel file you are retrieving.\n  |\n|\n Blank Rows\n  |\n Select the action that should be taken if blank rows are encountered. If you select\n\n\n**Skip blank rows**\n , any blank rows are skipped; if you select\n\n\n**Stop at the first blank column**\n , the data import stops when a column with a blank row is encountered.\n  |\n|\n Empty Column Headers\n  |\n Specify what should happen if empty column headers are encountered. If you choose\n **Add blank columns**\n , column names are automatically generated for the new columns. If you select\n\n\n**Stop at the first blank column**\n , the data import stops when an empty header is encountered.\n  |\n\nTroubleshooting\n-----------------\n\n\n* Ensure that the file is present in the S3 bucket and that the correct file type is specified in the connector settings.\n* NULL columns\n\n\n*must*\n\n\n be removed before the connector can successfully retrieve data.\n* If you run into a \"Failed to Import Successfully\" error when trying to import a CSV file, you can often get around this by changing the option in the\n **Quote Character**\n menu to\n **No Quote Character**\n .\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 7884725265559\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003840\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon S3 Analytics Assume Role Connector\n\n", "article_total_view_count": "\n\n\n 2,396\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "amazon_s3_analytics_assume_role_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}