{"file_path": "../../raw_kb_v2\\article\\360043437133\\index.html", "content": {"title": "\n\n\n Updating Your Workbench 5\n\n\n", "article_body": "\n\nIntro\n---------\n\nThere are many reasons to upgrade to the latest version of Workbench—bug fixes, performance enhancements and added features, to name a few. Domo Support will always be willing to troubleshoot issues with legacy versions, but we provide our best support when you’re running the latest version. Please consider regularly checking and upgrading to the latest version wherever possible. This will help you receive the best possible experience with Domo Workbench.\n\n\n Please note, before proceeding with any update or migration, that you should back up your jobs. If there are any issues or errors, you may need backups. If possible, ask your IT department to take a full snapshot or backup of your VM, Server, or PC before doing any upgrade.\n\nFinding Your Current Version\n-------------------------------\n\nYou m\n\n\n ay be wondering whic\n\n\n h version you’re using now. You may also be asked by Domo Support to identify the version in order to provide customized support. There should be a blue icon in the system tray. If you hover over that icon, the version will be displayed.\n\nIf you don’t see the blue icon, try clicking this up arrow first\n\n. Alternatively, the version number will also be contained within the Workbench log files. (The default location for Workbench 5 log files is C:\\ProgramData\\Domo\\Workbench\\Logs.)\n\n*Note:**\n You may see multiple Workbench monitors in the system tray. You only need one monitor running and can close out all others.\n\n\n Turning Off Automatic Updates\n--------------------------------\n\nBy default, automatic updates are enabled and applicable to the latest major version, currently 5.x.\n\n\n A\n\n\n utomatic updates include a restart of the Workbench service. Users who want change control and planned maintenance may be interested in turning the off the automatic update feature, as shown in the following screenshot:\n\nPlease plan for regular manual maintenance and updates to ensure the best performance from your Workbench application.\n\n\n Migrating from Workbench 4 to Workbench 5\n-------------------------------------------\n\nThis migration should take place automatically, so you should not need to do anything to initiate the process.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043437133\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004815\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUpdating Your Workbench 5\n\n", "article_total_view_count": "\n\n\n 5,007\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:31 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "updating_your_workbench_5", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_5", "url": "/s/topic/0TO5w000000ZapTGAS"}]}