{"file_path": "../../raw_kb_v2\\article\\360042924274\\index.html", "content": {"title": "\n\n\n Available Line Charts\n\n\n", "article_body": "\n\nLine charts are most often used to represent trends over time. Data items in a line chart are represented by points, and these are connected by a line. Some types of line charts, such as grouped bar with line charts, combine lines with elements found in other types of charts.\n\n\n The following tables list the types of line charts available in Domo. You can click a thumbnail image to see a larger image.\n\n###\n Horizontal line charts\n\nLine charts are usually displayed with the line running left to right, with the value scale on the vertical axis and the category scale on the horizontal axis. There are 12 such chart types in Domo (counting 5 line-bar combination-type charts, which in the Chart Picker in Domo are found under the Bar charts section).\n\n\n Chart Type\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Line chart\n\n|\n Basic line charts use a single trendline to display data.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Symbol line chart\n\n|\n A symbol line chart is a sub-type of the basic line chart in which symbols are included at each data point.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Curved line chart\n\n|\n A curved line chart is a sub-type of the basic line chart in which points are connected by curved lines instead of straight lines.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Curved symbol line chart\n\n|\n A curved symbol line chart is the same as a curved line chart except that it includes symbols at each data point.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Step line\n\n|\n A step line is a sub-type of the basic line chart in which step lines are used instead of straight lines.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Multi-line chart\n\n|\n A multi-line chart is a basic line chart with one or more additional lines that represent comparison trends.\n\n\n For more information, see\n\nMulti-line chart\n\n.\n  |\n\n|\n|\n Grouped bar with line chart\n\n|\n A grouped bar with line chart is a combination of a line chart and a grouped bar chart. It includes two y-axes, one on each side of the chart. One of these is used to measure the values along the line, and the other is used to measure the values of the bars. This type of chart is useful in situations in which you need to show a trend along with the specific quantities or amounts associated with that trend.\n\n\n For more information, see\n\nGrouped Bar with Line chart\n\n.\n  |\n\n|\n|\n Grouped bar with symbols chart\n\n|\n A grouped bar with symbols chart is the same as a grouped bar with line chart, except that it includes symbols instead of lines.\n\n\n For more information, see\n\nGrouped Bar with Line chart\n\n.\n  |\n\n|\n|\n Stacked bar with line chart\n\n|\n A stacked bar with line chart combines the features of a line chart and a vertical stacked bar chart. There are two y-axes, one on the left and the other on the right. The y-axis on the left measures the values along the line, and the one on the right measures the values of the bars.\n\n\n For more information, see\n\nStacked Bar with Line chart\n\n.\n  |\n\n|\n|\n Stacked bar with symbols chart\n\n|\n A stacked bar with symbols chart is the same as a stacked bar with line chart, except that it includes symbols instead of lines.\n\n\n For more information, see\n\nStacked Bar with Line chart\n\n.\n  |\n\n|\n|\n Grouped and stacked bar with line chart\n\n|\n A grouped and stacked bar with line chart is a combination of a vertical grouped and stacked bar chart and a stacked bar with line chart. As in a stacked bar with line chart, two value scales are present and series can appear as either lines or bars; this chart type also gives you the ability to divide series segments between bars, as in a grouped and stacked bar chart. As with standard grouped and stacked bar charts, this chart type is useful when you want to compare a primary series against several secondary series; however, because it includes a trendline, it is more compatible with time-series data than a regular grouped and stacked bar chart.\n\n\n For more information, see\n\nGrouped and Stacked Bar with Line chart\n\n.\n  |\n\n|\n|\n Running total line chart\n\n|\n In a running total line chart, each data point shows the cumulative value of all data points up to that point. If more than one series is present, each series displays as its own individual line.\n\n\n For more information, see\n\nRunning Total Line chart\n\n.\n  |\n\n|\n\n\n####\n Vertical line charts\n\nLess commonly, line charts can be displayed with values on the horizontal axis and categories on the vertical axis. If the chart exceeds the vertical confines of the display area, scroll bars appear so users can scroll to see more of the chart. There are 5 types of vertical line charts in Domo.\n\n\n Chart Type\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Vertical line chart\n\n|\n A vertical line chart includes one or more lines that represent comparison trends. The chart in the first example includes only one trendline so the chart appears solid blue. The chart in the second example includes multiple lines.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n\n |\n|\n Vertical curved line chart\n\n|\n A vertical curved line chart is a sub-type of the basic vertical line chart in which points are connected by curved lines instead of straight lines.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Vertical step line chart\n\n|\n A vertical step line chart is a sub-type of the basic line chart in which step lines are used instead of straight lines.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Vertical symbol line chart\n\n|\n A vertical symbol line chart is a sub-type of the basic vertical line chart in which symbols are included at each data point.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n|\n Vertical curved symbol line chart\n\n|\n A vertical curved symbol line chart is the same as a vertical curved line chart except that it includes symbols at each data point.\n\n\n For more information, see\n\nLine chart\n\n.\n  |\n\n|\n\n\n####\n Miscellaneous line charts\n\nThough technically a horizontal line chart, the spark line chart is included here because it is vastly different in many respects from standard line charts. This chart type is found in the\n **Other Charts**\n category in the Chart Picker.\n\n\n Chart Type\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Spark line chart\n\n|\n A spark line chart is essentially a line chart with no axes (providing a cleaner, uncluttered experience) and a built-in gauge that by default shows the degree of change between the first and last data points in the chart. Spark line charts are excellent for quickly showing relative rises and falls in data over time.\n\n\n For more information, see\n\nSpark line chart\n\n.\n  |\n\n|\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924274\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004740\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAvailable Line Charts\n\n", "article_total_view_count": "\n\n\n 9,692\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:28 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "available_line_charts", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}