{"file_path": "../../raw_kb_v2\\article\\360042925574\\index.html", "content": {"title": "\n\n\n Chatting in Buzz\n\n\n", "article_body": "\n\nIntro\n-------\n\nChatting with coworkers in Buzz is easy. All you do is decide whether you want your conversation to center around people or a data element (a Card, Page, or Project). If your message centers around people, you just open Buzz and write a message to the person or people you want (or add to the conversation if one already exists). If your message centers around a data element, you locate that element in Domo, and a Buzz conversation window opens for the element automatically. You then decide who you want to see it, then post away.\n\n\n You have many options available when posting. You can attach files; reference Cards, users, or Projects; invite new users to a conversation; add emojis; and so on.\n\n\n You can also interact with others' messages in a variety of ways, such as adding them to favorites, \"liking\" them, quoting them in replies; etc.\n\n*Video - Buzz Overview**\n\n\n**Video - Sharing Domo Data with Buzz**\n\nStarting or opening a conversation\n------------------------------------\n\nYou can start a new Buzz conversation or open an existing conversation.\n\n##\n Starting a conversation\n\nYou start a Buzz conversation using the\n **Add Conversation**\n option, which is available either by clicking the\n\nicon in the top right corner of Buzz or the\n\nicon next to \"Conversations\" in the navigation pane. This opens a dialog in which you select the users and/or groups you want to converse with. (You can also open existing conversations from this dialog.) Once you find the user or group you want to start a conversation with, you indicate whether you want to begin a new topic of conversation or join an existing one. If the topic is new, you are prompted to enter a title for the topic as well as set privacy options. Finally, you can compose your message.\n\n\n**To start a Buzz conversation,**\n\n. (Conditional) If Buzz is not open, open it by clicking\n\nin the toolbar in the top right corner of Domo.\n2. Click\n\n, which appears in the black bar above Buzz in the top right corner.\n\n\n Alternatively, if you are in the navigation pane, you can click\n\nnext to \"Conversations.\"\n\n\n The\n **New Message**\n dialog opens.\n3. In the\n **People, Groups, or Conversations**\n field, enter the name of a person or group you want to start a conversation with.\n\n\n This adds the name of the person or group to the field.\n4. (Optional) Repeat step 3 to add more users and groups to this conversation, if desired.\n5. Turn on the\n **New Topic**\n toggle.\n6. Enter a name for the new topic in the\n **Conversation Topic**\n field.\n7. (Optional) Specify whether this conversation is to be private or public.\n\n\n If it is private, only the users whose names you have added to the filter box will be able to see it. If it is public, anyone in your company will be able to see it.\n8. Enter your initial message for the conversation in the\n **Write a message**\n field at the bottom of the dialog.\n\n\n For more information about writing messages, see\n\nPosting to Buzz\n\n.\n9. Hit Enter when done.\n\nThe conversation is added to Domo and appears in the\n **Conversations**\n tab in your Inbox so you can access it easily. For more information, see\n\nPosting to Buzz\n\n.\n\n\n You can also initiate a conversation with a specified user from their Profile page.\n\n\n**To start a Buzz conversation from a user's Profile page,**\n\n. Click the\n\nicon found under the user's photo in the top left corner of their Profile, then click the\n **Message**\n**[User Name]**\n button under it.\n2. Enter your message in the\n **Write a message**\n field at the bottom of the dialog.\n\n\n For more information about writing messages, see\n\nPosting to Buzz\n\n.\n3. Hit Enter when done.\n\nThe conversation is added to Domo and appears in the\n **Conversations**\n tab in your Inbox so you can access it easily. For more information, see\n\nPosting to Buzz\n\n.\n\n##\n Opening an existing conversation\n\nYou can open an existing People conversation in one of several ways. The most straightforward way is to open it from the\n **Conversations**\n list in the Buzz navigation pane (or the\n **Favorites**\n list, if you have added it as a Favorite). If the conversation does not appear here, you can find it easily by searching in the\n **Search Buzz**\n dialog. You can also open it from the\n **Discover**\n pane, though it may be harder to find the specific conversation you want. On top of this, you can open a conversation from the\n **Add Conversation**\n\ndialog.\n\n###\n Opening a conversation from the Conversations or Favorites List\n\nYou can open an existing conversation from the\n **Conversations**\n or\n **Favorites**\n list in the Buzz navigation menu.\n\n\n**To open a conversation from the Conversations or Favorites list,**\n\n. (Conditional) If Buzz is not open, open it by clicking\n\nin the toolbar in the top right corner of Domo.\n2. Locate the desired conversation by doing any combination of the following:\n\n* Navigating through the list of recent conversations in the\n\t **Conversations**\n\t list.\n\t* Navigating through conversations you have favorited in the\n\t **Favorites**\n\t list.\n\t* Searching for the desired conversation by clicking in the\n\t **Search**\n\t field to open the\n\t **Search Buzz**\n\t pane then entering a keyword into the search box. This search returns results for titles, users, and message content.\n3. Click the conversation to open it in the conversation pane.\n\n\n You can now read it, reply to it, etc.\n\n\n####\n Opening a conversation from the New Message dialog\n\nYou can open a conversation from the\n **New Message**\n dialog (the same dialog you use when starting a conversation, as explained above).\n\n\n**To open a conversation from the New Message dialog,**\n\n. (Conditional) If Buzz is not open, open it by clicking\n\nin the toolbar in the top right corner of Domo.\n2. Click\n\n, which appears in the black bar above Buzz in the top right corner.\n\n\n Alternatively, if you are in the navigation pane, you can click\n\nnext to \"Conversations.\"\n\n\n The\n **New Message**\n dialog opens.\n3. In the\n **People, Groups, or Conversations**\n field, enter the name of the user, group, Page, Card, or Project that your desired Buzz conversation is centered around.\n4. (Conditional) If you want to open an existing one-on-one conversation, select the name of the user in the\n **People & Groups**\n list. Otherwise, select the conversation in the\n **Existing Conversations**\n list (which opens below\n **People & Groups**\n ).\n\n\n The conversation opens in the pane on the right.\n5. Enter your message in the\n **Write a message**\n field.\n\n\n For more information about writing messages, see\n\nPosting to Buzz\n\n.\n\n\n####\n Opening a conversation from the Discover Pane\n\nYou can open conversations from the\n **Discover**\n pane; however, if you are searching for a specific conversation, it is recommended you use one of the previously discussed methods.\n\n\n**To open a conversation from the Discover pane,**\n\n. (Conditional) If Buzz is not open, open it by clicking\n\nin the toolbar in the top right corner of Domo.\n2. Click\n **Discover**\n .\n3. Scroll through the pane until you find the conversation you're looking for.\n4. Click the conversation to open it in the conversation pane.\n\n\n You can now read it, reply to it, etc.\n\n\n####\n Opening a conversation from the Profile page\n\nYou can open an existing one-on-one conversation with a user from his/her Profile page.\n\n\n**To open a Buzz conversation from a user's Profile page,**\n\n. Click the\n\nicon found under the user's photo in the top left corner of their Profile, then click the\n **Message**\n**[User Name]**\n button under it.\n\n\n You can now read the conversation, reply to it, etc.\n\nPosting to Buzz\n-----------------\n\nOnce you have started or opened a conversation, you can post by entering your message in the\n **Write a message**\n field at the bottom of the conversation pane.\n\n\n You can do all of the following when posting to Buzz:\n\n Enter carriage returns using Shift+Enter.\n* Copy and paste text from other sources, including web pages.\n* Reference users, groups, Cards, Pages, and Projects by entering the @ symbol followed by the item you want to reference. Or you can use @all to reference all users and groups with access to the conversation. In a conversation centered on a Card, Page, or Project, if you attempt to reference a user or group without access to that Card, Page, or Project, you are given a warning and the option to grant access, as shown here:\n\nIf you click\n **Grant Access**\n , the user or group members are given access to the Card, Page, or Project. For more information about access sharing, see\n\nSharing Access to Cards and Pages\n\n.\n\n\n When you reference a Card, you can open a preview of the Card with different options. This is discussed later in this list.\n* Enter URLs. These appear as working hyperlinks when posted. You do\n *not*\n need to include \"\n\nhttp://\"\n\n\" in a URL for it to be converted into a hyperlink.\n* Attach files to your message by clicking the\n\nbutton, selecting\n **Upload**\n**a file**\n , and browsing to the desired file on your computer.\n\n\n In the interest of preventing users from uploading malicious files into Domo accounts, Domo allows a specific set of file types to be uploaded. If you attempt to upload a file not within this list, an error message appears. For more information, see\n\nPreviewing a Document\n\n. If you click an attached file with an unpreviewable file type, the standard \"What would you like to do with this file?\" dialog opens.\n* Reference Cards in your message by clicking the\n\nbutton, selecting\n **Add a Card**\n , and searching for the Card using the\n **Search**\n box. (You can also reference Cards using @, as described previously.) You can only attach Cards you have access to. As with attached files, referenced Cards appear as thumbnails under the conversation pane and can be removed by clicking the red \"x.\" If you attempt to reference a Card in a discussion with a user without access, you are given the option to grant them access.\n\n\n If you click a referenced Card either before or after sending your message, a preview of the Card opens. The preview provides options for jumping to the\n\nDetails view\n\n, adding the Card to a\n\nFavorites\n\n.\n* Add an emoji to your message by clicking\n\nand selecting the desired emoji.\n* Use special commands using \"/.\" The following table lists some of these:\n\n\n|  |  |\n| --- | --- |\n|\n Command\n  |\n Description\n  |\n|\n\n/invite [\n\n\n someone@domain.com\n\n\n ]\n\n|\n Can be used to invite anyone to a Buzz conversation, even if they do not have a Domo account. Domains in invited users' email addresses\n *must*\n be authorized in the\n **Company Settings**\n tab in Admin Settings for this to work. For more information, see\n\nSpecifying Authorized Domains for Invited Users\n\n.\n  |\n|\n\n/giphy [text]\n\n|\n Lets you insert an animated GIF in a message based on text inserted afterward. For example, if you said\n\n/giphy sasquatch,\n\na GIF image of a sasquatch would appear in your Buzz\n\n. You can select from available GIFs after entering the\n\n\n giphy\n\ncommand, or you can insert a random GIF by pressing Enter after entering the command.\n  |\n|\n\n/roll\n\n|\n \"Rolls\" a random number between 0 and 100.\n  |\n|\n\n/support\n\n|\n Opens a window to the Help Center options. For specific information about creating a Support ticket, see\n\nGetting Help\n\n.\n  |\n|\n /todo [text]\n  |\n Creates a personal task and adds it to your personal tasks list in Projects & Tasks. For more information, see\n\nProjects and Tasks\n\n.\n  |\n\nIf you have NLQ Bots enabled, you can also communicate with these Bots using natural language to retrieve information from connectors right in Buzz. For more information, see\n\nAdding a Bot to Buzz\n\n.\n\n\n Working with messages\n-----------------------\n\nWhen you mouse over any message in a conversation, a toolbar pops up with a number of options for that message:\n\nThe three most commonly used options appear here; you can also click the ellipsis icon (...) to view several more. The following table describes the available options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Like icon\n\n|\n Lets you \"like\" this message.\n  |\n|\n Reaction icon\n\n|\n Lets you include a reaction icon after this message and sets the value to 1.\n  |\n|\n Quote reply icon\n\n|\n Lets you reply to this message specifically. When you do this, the message is \"quoted\" in your reply so users understand the context.\n  |\n|\n Favorite icon\n\n|\n Adds this message to your\n **Favorited Messages**\n listing for in the details pane for this conversation.\n  |\n|\n Flag for follow-up\n  |\n Adds this message to your\n **Flag for follow-up**\n pane, allowing you to revisit it later.\n  |\n|\n Create thread icon\n\n|\n Lets you create a new thread using this message as a starting point.\n  |\n|\n Create task icon\n\n|\n Lets you create a task based on this message. For more information, see\n\nCreating and Assigning Project Tasks\n\n.\n  |\n|\n Edit icon\n  |\n Lets you edit a message you have already posted.\n  |\n|\n Delete icon\n\n|\n Lets you delete this message from Buzz. Only appears if you wrote the message or you have an \"Admin\" default security role or a custom role with \"Edit Conversations and Messages\" enabled. For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n  |\n\n\n###\n Favoriting a message\n\nWhen you \"favorite\" a message, the message appears with an orange star to indicate the \"favorite\" status, and it appears in your\n **Favorited Messages**\n in the Details pane for this conversation. You can access\n **Favorited Messages**\n by opening the Details pane for the conversation and expanding the\n **Favorited Messages**\n tab.\n **Favorited Messages**\n are specific to users in a conversation; if two users in the same conversation add different messages as favorites, each will see only the specific messages he favorited,\n *not*\n those of his coworker.\n\n\n**To favorite a message in Buzz,**\n\n. Mouse over the message you want to favorite.\n2. Click the ellipsis icon (...).\n3. Select\n **Favorite**\n .\n\nThe message is added to your\n **Favorited Messages**\n . You can see it anytime by opening the Details pane for this message and expanding the\n **Favorited Messages**\n tab.\n\n\n**To \"unfavorite\" a message you've added as a Favorite,**\n\n. Do one of the following:\n\n* Click the orange star before the time stamp in the conversation thread.\n\t* Open the\n\t **Favorited Messages**\n\t tab in the Details pane for the conversation and click the orange star.\n\n\n###\n Liking a message\n\nYou can like a message in a conversation by mousing over the message and clicking the\n\nicon. If the message has not yet been liked, a\n\nicon appears after the message and the value is set to 1. If another user then clicks the toolbar icon or the thumbs up icon, the value is raised by 1.\n\n\n If a user clicks the toolbar icon or thumbs up icon a second time, his/her \"like\" is removed and the value decreases by 1.\n\n\n You can see all of your liked items in Domo in your Profile page. For more information, see\n\nViewing a User's Liked Items\n\n.\n\n\n**To like a message in Buzz,**\n\n. Mouse over the message you want to like.\n2. Click the like icon\n\n. (If the message has already been liked by another user, you can also click the\n\nicon.)\n\nIf this is the first time the message has been liked, a\n\nicon appears and the value is set to 1. Otherwise the value of\n\nis raised by 1.\n\n\n**To \"unlike\" a message you have already liked,**\n\n. Click the\n\nicon. (You can also mouse over the message and click the\n\nicon in the toolbar.)\n\nThe value of\n\ndecreases by 1. If the value was already set to 1, the\n\nicon disappears.\n\n##\n Adding a reaction to a message\n\nYou can select a \"reaction icon\" to appear after a message. When you do so, the value of the icon is set to 1. If another user then clicks the reaction icon, the value is raised by 1. If a user clicks the reaction icon a second time, his/her reaction is removed and the value decreases by 1. If the icon is clicked a second time when the value is already set to 1, it disappears.\n\n\n**To add a reaction icon to a message,**\n\n. Mouse over the message you want to add a reaction to.\n2. Click\n\n.\n3. Select the desired reaction emoji from the library.\n\nThe icon you selected is added after the message and the value is set to 1.\n\n\n**To agree with another user's reaction to a message,**\n\n. Click the reaction icon.\n\nThe value of the icon is raised by 1.\n\n\n**To retract your reaction to a message,**\n\n. Click the reaction icon you have already clicked.\n\nThe value of the icon decreases by 1. If the value was already set to 1, the icon disappears.\n\n##\n Creating a new thread based on a message\n\nYou can create a new thread based on an existing message by mousing over the message, clicking the ellipsis icon, and selecting\n\n. This icon appears only for top-level conversations; you\n *cannot*\n create threads of threads (subthreads). When you add a thread for a private conversation, you can choose whether to make the thread available to all members of the conversation or those you specifically add to the thread. You do this by toggling the\n **Private**\n switch. You can also add new members to the thread, in which case a message appears stating that access will be granted to new individuals and/or groups.\n\n\n For example, in the following screenshot, access is granted to the original members of the conversation, along with the \"Development.UI\" group and user \"Ben Green,\" both of which are not part of the original group with access. However, now that they have been added, they are considered members of the thread and will continue to receive notifications.\n\nFor information about finding a thread in the Buzz menu, see\n\nBuzz Layout\n\n.\n\n###\n Changing the privacy status of a thread\n\nYou can switch private threads to public so that everyone included in the conversation has access. You\n *cannot*\n switch public threads back to private.\n\n\n**To switch a private thread to be public,**\n\n. Click the thread title to open the thread in its own view in the conversation pane.\n2. Click the ellipsis (...) to open the details view.\n3. Click\n **Make Public**\n .\n\n\n####\n Deleting a thread\n\nYou can delete a thread if you have an \"Admin\" security profile or a custom role with \"Edit Conversations and Messages\" enabled or you started the thread.\n\n\n**To delete a thread,**\n\n. Click the thread title to open the thread in its own view in the conversation pane.\n2. Click the ellipsis (...) to open the details view.\n3. Click\n **Delete**\n .\n4. Click\n **Delete**\n to confirm.\n\n\n###\n Quoting a message in a reply\n\nWhen replying to a conversation, you can quote a message from earlier in the conversation. When you do this, the message is \"quoted\" in your reply so users understand the context.\n\n\n**To quote a message in a reply,**\n\n. Mouse over the message you want to quote.\n2. Click\n\n.\n\n\n Your cursor appears in the \"New message\" field and the quoted message appears under the field to indicate that you are referencing it.\n\n\n###\n Creating a task based on a message\n\nYou can create a task based on a message, specify it as a personal task or part of a Project, assign it to someone, and/or specify a due date and tags. For more information, see\n\nCreating and Assigning Project Tasks\n\n.\n\n##\n Deleting a message\n\nLets you delete this message from Buzz. When you delete a message, it is replaced with the text \"This message has been deleted\" so viewers know a piece of the conversation is missing. You can delete a message only if you wrote it or you have an \"Admin\" default security profile or a custom role with \"Edit Conversations and Messages\" enabled. For more information about default security roles, see\n\nDefault Security Role Reference\n\n. For more information about custom roles, see\n\nManaging Roles\n\n.\n\n\n**To delete a message from Buzz,**\n\n. Mouse over the message you want to delete.\n2. Click\n\n.\n\nUnfollowing a Buzz conversation\n---------------------------------\n\nBuzz conversations can be unfollowed but not deleted. See\n\nUnfollowing a Buzz Conversation\n\nfor a step by step guide.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042925574\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004312\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nChatting in Buzz\n\n", "article_total_view_count": "\n\n\n 5,193\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:36 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "chatting_in_buzz", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "buzz", "url": "/s/topic/0TO5w000000ZanCGAS"}]}