{"file_path": "../../raw_kb_v2\\article\\360042928314\\index.html", "content": {"Title": "Amazon MWS Connector", "Article Body": "ATTENTION:\n                           \n                           This connector is being\n                           \n                            deprecated\n                           \n                           on September 12, 2022. On that date, MWS will no longer be able to connect to Amazon to obtain data for orders, merchant fulfillment, and reports. If you are currently using the MWS connector, you need to migrate to Domo's Selling Partner (SP) connector on or before September 12, 2022 to continue to get Amazon Marketplace data. For more information on this deprecation and how it affects your organization, as well as the link to the Selling Partner connector, see the\n                           \n                            Deprecation Announcement\n                           \n                           in the Community Forum.\n                          \n\n\n\n\n                        Intro\n                       \n\n\n\n\n\n                            Amazon Marketplace Web Service (Amazon MWS) is an integrated Web service API that helps Amazon sellers programmatically exchange data on listings, orders, payments, reports, and more. By using the Domo Amazon Marketplace Web Services Connector, sellers can increase selling efficiency, reduce labor requirements, and improve response time to customers. To learn more about the Amazon MWS API, visit their page (\n                            \n                             https://developer.amazonservices.com/\n                            \n                            ).\n                           \n                           You connect to your Amazon MWS account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon MWS connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                           \n                            a DataSet Using a Data Connector\n                           \n                           .\n                          \n\n\n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Use this connector to pull data about Amazon products sales, inventory, and fulfillment.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Sales Performance\n                             \n\n\n\n                              Inventory Numbers\n                             \n\n\n\n                              Canceled Orders\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              Sales\n                             \n\n\n\n                              Marketing\n                             \n\n\n\n                              C-Suite\n                             \n\n\n\n                              Warehousing\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            This depends on the report.\n                           \n\n                            For the \"Orders - Order Items\" report, it could take from 1 day to several months to get all data. However, you can start building KPIs after the first day.\n                           \n\n                            The other reports take at most a few hours. Only run these reports once per day.\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            9\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n\n                         For most reports, be conservative on date ranges. Only pull the data you need.\n                        \n\n\n                          Know that the \"Orders - Order Items\" report will take 22 hours to run, every time. Make sure you set this report to \"Append,\" never to \"Replace.\" It will pull 1 day of the current data. Then, if it has time left in the 22-hour window, it will begin to get data, starting with now and going backwards, and will stop when it can't get any more data in 22 hours. The next day it runs to get the one day of the current append, and then starts again to fill in the historical data.\n                         \n\n\n\n                          Amazon has very heavy throttles. The details of each throttle limit are in the API docs.\n                         \n\n\n\n                          For \"Orders & Order Items,\" ONLY make 1 DataSet each for each Marketplace (the\n                          \n                           Geo\n                          \n\n                           Location\n                          \n                          parameter in authentication - US, IT, UK, etc.). If you make more than that, the DataSets will fight over the API calls and you won't get data as fast.\n                         \n\n\n\n                          Don't go back in backfill for more than a few years. It will take a long time to get that data, and it probably isn't relevant to get sales on Amazon products from 3 years ago.\n                         \n\n\n\n                          These reports ABSOLUTELY have to be set to \"Append.\" \"Replace\" does not behave well in this model.\n                         \n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your Amazon MWS account and create a DataSet, you must have the following:\n                       \n\n\n\n                          An MWS Auth Token\n                         \n\n\n\n                          An Amazon Seller ID\n                         \n\n\n\n                        To find your Amazon Auth Token and Seller ID, do the following:\n                       \n\n\n\n                          Navigate to\n                          \n                           https://sellercentral.amazon.com/apps/manage\n                          \n                          and log in.\n                         \n\n\n\n                          Click\n                          \n                           Authorize New Developer\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Register Domo Inc. with developer ID \"181964952887\" for JP or developer ID \"473744043762\" for CA, US, and MX then click\n                          \n                           Next\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Check the box and click\n                          \n                           Next\n                          \n                          .\n                          \n\n\n\n\n\n\n                        You are taken to a screen with your Seller ID, the MWS Auth Token, and the Marketplaces you have access to. You will need all of these to authenticate in the\n                        \n                         Credentials\n                        \n                        pane.\n                       \n\n\n\n\n                        Connecting to Your Amazon MWS Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Amazon MWS Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Amazon MWS account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Marketplace\n                           \n\n\n\n                            Select the Amazon Marketplace where you sell your products.\n                           \n\n\n\n\n\n                            Seller ID\n                           \n\n\n\n                            Enter your Amazon Seller ID. For information about obtaining a Seller ID, see \"Prerequisites,\" above.\n                           \n\n\n\n\n\n                            MWS Auth Token\n                           \n\n\n\n                            Enter your MWS Auth Token. For information about obtaining an Auth Token, see \"Prerequisites,\" above.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Amazon MWS credentials, you can use the same account any time you go to create a new Amazon MWS DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Amazon MWS report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Fulfillment Inbound Shipment - Inbound Shipment Items\n                              \n\n                               Returns a list of items in a specified inbound shipment, or a list of items that were updated within a specified time frame.\n                              \n\n\n\n                               Fulfillment Inbound Shipment - List Inbound Shipments\n                              \n\n                               Returns a list of inbound shipments based on criteria that you specify.\n                              \n\n\n\n                               Fulfillment Inventory - Inventory Supply\n                              \n\n                               Returns a list of inventory supply from a specific date.\n                              \n\n\n\n                               Fulfillment Outbound Shipment - Fulfillment Orders\n                              \n\n                               Return lists shipments outbound fulfilled by Amazon/Seller.\n                              \n\n\n\n                               Orders - Order Items\n                              \n\n                               Returns line item level data for orders between the dates you specify. This report can only be run once per day. The update mode will be set to append by the connector.\n                              \n\n\n\n                               Order - Order Items by inputData - BETA\n                              \n\n                               Returns line item level data for orders based off of the OrderIDs in the input DataSet you specify. The update mode will be set to append by the connector.\n                              \n\n\n\n                               Orders - Orders\n                              \n\n                               Returns orders created or updated during a time frame that you specify. This report can only be run once per day. The update mode will be set to append by the connector.\n                              \n\n\n\n                               Orders - Order Items Upsert\n                              \n\n                               Returns line item level data for orders created since the date you specify. The connector will automatically get the latest data up to 15 minutes ago. This report can be run as frequent as every 15 minutes. The update mode will be set to merge by the connector.\n                              \n\n\n\n                               Orders - Orders Upsert\n                              \n\n                               Returns orders updated since the date you specify. The connector will automatically get the latest data up to 15 minutes ago. This report can be run as frequent as every 15 minutes. The update mode will be set to merge by the connector.\n                              \n\n\n\n                               Products - Competitive Prices By SKU\n                              \n\n                               Returns the current competitive price of a product, based on SellerSKU.\n                              \n\n\n\n                               Products - List Matching Products\n                              \n\n                               Returns a list of products and their attributes, based on a search query.\n                              \n\n\n\n                               Products - My Price for SKU\n                              \n\n                               Returns pricing information for your own offer listings, based on SellerSKU.\n                              \n\n\n\n                               Products - Product Categories for SKU\n                              \n\n                               Returns the parent product categories that a product belongs to, based on SellerSKU.\n                              \n\n\n\n                               Recommendations - List Recommendations\n                              \n\n                               Returns your active recommendations for a specific category or for all categories for a specific marketplace.\n                              \n\n\n\n                               Reports - Get Report\n                              \n\n                               Returns the contents of a report and the Content-MD5 header for the returned report body.\n                              \n\n\n\n                               Reports - List Reports\n                              \n\n                               Returns a list of reports that were created in the previous 90 days.\n                              \n\n\n\n                               Reports - Schedule List\n                              \n\n                               Returns a list of order report requests that are scheduled to be submitted to Amazon MWS for processing.\n                              \n\n\n\n\n\n\n\n\n                            Data Selection Mode\n                           \n\n\n\n                            Select the method to use to retrieve reports when \"Reports - Get Report\" is selected in the\n                            \n                             Report\n                            \n                            dropdown menu.\n                           \n\n\n\n                              With the\n                              \n                               Easy\n                              \n                              method, you select your report type from a dropdown menu. The latest version of the selected type will be retrieved automatically.\n                             \n\n\n\n                              With the\n                              \n                               Advanced\n                              \n                              method, you enter a report ID into a text field.\n                             \n\n\n\n                            Both of these report types require that the report is generated and available in Amazon MWS.\n                           \n\n\n\n\n\n\n                             Orders Report Dataset ID\n                            \n\n\n\n\n\n                             Enter your Domo dataset ID(GUID) for your Orders Report. It is located in the dataset URL.\n                            \n\n\n\n                             Example:\n                             \n                              https://customer.domo.com/datasources/\n                             \n\n                              aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee\n                             \n                             /details/settings\n                            \n\n\n\n\n\n\n                            Report Type\n                           \n\n\n\n                            Select the desired report type. Reports must already be generated and available in Amazon MWS.\n                           \n\n\n\n\n\n                            Report Detail Filter (for \"Easy\" data selection method)\n                           \n\n\n\n                            Select the desired report detail filter.\n                           \n\n\n\n\n\n                            Report ID\n                           \n\n\n\n                            Enter the generated Report ID for the report you want to import from Amazon MWS. You may also enter the ReportType enumeration value from the Amazon MWS\n                            \n                             API documentation\n                            \n                            .\n                           \n\n\n\n\n\n                            Report Detail Filter (for \"Advanced\" data selection method)\n                           \n\n\n\n                            Enter the column you want to flatten. Any column that returns \"List\" can be used. Try running the report once without this field, then select the column name from the header you want to flatten in the preview pane.\n                           \n\n\n\n\n\n                            CSV Report Quote Character\n                           \n\n\n\n                            Select the quote character for your CSV report in Amazon MWS. Double quotes are the default. If your report data contains double quotes, try selecting the\n                            \n                             Null Character\n                            \n                            option.\n                           \n\n\n\n\n\n                            Recommendation Category\n                           \n\n\n\n                            Select the desired recommendation category for your \"List Recommendations\" report.\n                           \n\n\n\n\n\n                            Select Statuses\n                           \n\n\n\n                            Select the status you want to retrieve data for. You can select up to 10 statuses.\n                           \n\n\n\n\n\n                            SKU Selection Method\n                           \n\n\n\n                            Select the method you want to use to enter SKUs. If you select\n                            \n                             All\n                            \n                            , all available SKUs are returned from your Inventory Supply. If you select\n                            \n                             Discovery\n                            \n                            , SKUs are shown dynamically based on the query date selected. If you select\n                            \n                             Advanced\n                            \n                            , you will supply the list of SKUs yourself.\n                           \n\n\n\n\n\n                            Date Report Type\n                           \n\n\n\n                            Select the method to use to receive data for date-based reports.\n                           \n\n\n                             Current\n                            \n                            retrieves data for the last 14 days and appends new data after each run.\n                           \n\n\n                             Historical\n                            \n                            receives data from the date fields below up to 15 days ago. Each run backfills 14 days at a time starting with the newest data and moving backwards in time.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report. Specify either\n                            \n                             today\n                            \n                            (or\n                            \n                             0\n                            \n                            ),\n                            \n                             yesterday\n                            \n                            (or\n                            \n                             1\n                            \n                            ), or\n                            \n                             today-7\n                            \n                            (or\n                            \n                             7\n                            \n                            ) to get data for 7 days into the past.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Specify either\n                            \n                             today\n                            \n                            (or\n                            \n                             0\n                            \n                            ),\n                            \n                             yesterday\n                            \n                            (or\n                            \n                             1\n                            \n                            ), or\n                            \n                             today-7\n                            \n                            (or\n                            \n                             7\n                            \n                            ) to get data for 7 days into the past. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Specify either\n                            \n                             today\n                            \n                            (or\n                            \n                             0\n                            \n                            ),\n                            \n                             yesterday\n                            \n                            (or\n                            \n                             1\n                            \n                            ), or\n                            \n                             today-7\n                            \n                            (or\n                            \n                             7\n                            \n                            ) to get data for 7 days into the past. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Select Query Start Date\n                           \n\n\n\n                            Select the start date for your query.\n                           \n\n\n\n\n\n                            Query Date Type\n                           \n\n\n\n                            Select the date type for the query.\n                            \n                             Created\n                            \n                            returns data based on the creation date.\n                            \n                             Last Updated\n                            \n                            will return data based on the date of the last update.\n                           \n\n\n\n\n\n                            Select Seller SKUs\n                           \n\n\n\n                            Select the seller SKUs you want to retrieve data for. You can select up to 100 SKUs.\n                           \n\n\n\n\n\n\n\n\n                                 Tip:\n                                \n                                If you want to bring in more than 100 SKUs, then you will need to select advanced mode and paste the SKU list, comma separated. SKUs can be obtained from the Inventory Report (\n                                \n                                 _GET_FLAT_FILE_OPEN_LISTINGS_DATA_\n                                \n                                ).\n                                \n\n                                To choose that report in the Amazon MWS connector, select\n                                \n                                 Reports\n                                \n                                >\n                                \n                                 Get Reports\n                                \n                                . Then, select Inventory Report if using easy mode or paste in the name of the report (\n                                \n                                 _GET_FLAT_FILE_OPEN_LISTINGS_DATA_\n                                \n                                ) if using advanced mode.\n                                \n                                For more information on Amazon report types, see\n                                \n                                 https://docs.developer.amazonservices.com/en_US/reports/Reports_ReportType.html\n                                \n\n\n\n\n\n\n\n\n\n\n                            Seller SKU List\n                           \n\n\n\n                            Enter the list of SKUs you want to retrieve data for, separated by commas.\n                           \n\n\n\n\n\n                            Continue on Invalid SKU Error?\n                           \n\n\n\n                            Select\n                            \n                             Skip Invalid SKUs\n                            \n                            if you want to continue your DataSet import even if invalid SKUs are discovered. Select\n                            \n                             Warn about Invalid SKUs\n                            \n                            if you want the import to stop and provide an error message if invalid SKUs are discovered.\n                           \n\n\n\n\n\n                            Query\n                           \n\n\n\n                            Enter a text-based query to pull data for products matching that query.\n                           \n\n\n\n\n\n                            Select Recommendation Categories\n                           \n\n\n\n                            Select a Recommendation Category to retrieve data for. If you select no categories, data is retrieved for all categories.\n                           \n\n\n\n\n\n                            Report ID\n                           \n\n\n\n                            Enter the Report Type or the generated Report ID you want to get data for. Specific Report IDs can be retrieved using the\n                            \n                             List Reports\n                            \n                            report.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n                        If you run into problems with the \"Get Report\" report, make sure the report you are trying to pull has been generated in Amazon MWS.\n                       \n\n                        FAQ\n                       \n\n                        My Amazon store sells in multiple marketplaces across the world. How do I get all of my orders, inventory and other important Amazon MWS data?\n                       \n\n                        You will need to create an account for each marketplace. We recommend naming the accounts with the marketplace location: for example, 'United States' or 'Italy'. Once you have created the needed accounts, create connector datasets using each account to receive the data that matters to you. If you would like to join the data, use Domo's Magic ETL or Dataflow tools to bring the different marketplaces together.\n                       \n\n                        How should I configure the Orders or Order Items report?\n                       \n\n                        Due to API limitations, the connector can only be set up with Append mode. To set up the connector with Append mode:\n                       \n\n\n                         Select the desired start date for your historic backfill, and use a relative end date with a value of 'yesterday' or '1'.\n                        \n\n                         Set the connector to only run once per day.\n                        \n\n\n                        The connector will get the most current day's data, then start getting backfill data from the most recent data to older, one day at a time. The connector will run up to 24 hours, and then will remember where it left off in the historical backfill. The next day, when the connector runs again, it will get the most current day's data appended to it first, then pick up where it left off with the historical backfill. This pattern will continue until the connector has received all data for the historical backfill. Once all the backfill is completed, it will continue to append the most current day's data, one day at a time. If the connector doesn't run or is unsuccessful during a run, it is designed to receive the data it missed in both the current and historical backfill.\n                       \n\n                        Can Domo schedule Amazon MWS Reports on my behalf?\n                       \n\n                        No. The connector is not able to schedule Amazon MWS Reports on your behalf in the Amazon MWS API. The connector will deliver all reports in the discovery drop-down for your convenience, but you may receive a \"Report not generated\" error if the report is not generated. The error message will contain the name of the report in Amazon MWS that needs to be generated before the connector can run successfully. Generate the report and add it to the report scheduler in your Amazon MWS dashboard and try again. The connector report 'Reports - Schedule List' lists all scheduled reports.", "Preview Article": "Click here to preview", "URL Name": "360042928314", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003632", "Archived Date": "", "Language": "English", "Primary Version": "Amazon MWS Connector", "Article Total View Count": "4,766", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Amazon MWS Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}