{"file_path": "../../raw_kb_v2\\article\\360042927854\\index.html", "content": {"Title": "PipelineDeals Connector", "Article Body": "Intro\n                       \n\n                        PipelineDeals provides customer relationship management and sales CRM software to organize, track, and manage your deals, leads, and contacts. Use Domo's PipelineDeals connector to retrieve data about activities, tasks and events, companies, deals, documents and people. To learn more about the PipelineDeals API, visit their page (\n                        \n                         https://app.pipelinedeals.com/api/docs/\n                        \n                        ).\n                        \n\n\n\n                        You connect to your PipelineDeals account in the Data Center. This topic discusses the fields and menus that are specific to the PipelineDeals connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your PipelineDeals account and create a DataSet, you must have a PipelineDeals API key. To find your API key, do the following:\n                       \n\n\n\n                          Log into your CRM account.\n                         \n\n\n\n                          Click\n                          \n                           Account Settings\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Pipeline Deals API\n                          \n                          in the sidebar.\n                         \n\n\n\n                          Enable API access.\n                         \n\n\n\n                        Your API key should now appear on the screen.\n                       \n\n                        Connecting to Your PipelineDeals Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the PipelineDeals Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your PipelineDeals account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            API Key\n                           \n\n\n\n                            Enter your PipelineDeals API key. For information about finding your API key, see \"Prerequisites,\" above.\n                           \n\n\n\n\n\n\n                         Once you have entered valid PipelineDeals credentials, you can use the same account any time you go to create a new PipelineDeals DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a single menu from which you select a report type. No other parameters are required.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the PipelineDeals report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Activities\n                               \n\n\n\n                                Returns a list of all activities in your account.\n                               \n\n\n\n\n\n                                Calendar Events and Tasks\n                               \n\n\n\n                                Returns a list of all calendar events and tasks in your account.\n                               \n\n\n\n\n\n                                Companies\n                               \n\n\n\n                                Returns a list of companies in your account.\n                               \n\n\n\n\n\n                                Deals\n                               \n\n\n\n                                Returns a list of deals in your account.\n                               \n\n\n\n\n\n                                Deals Custom Field Labels\n                               \n\n\n\n                                Returns a list of deals custom field labels for your account.\n                               \n\n\n\n\n\n                                Deals Details\n                               \n\n\n\n                                Returns detailed information about deals in your account.\n                               \n\n\n\n\n\n                                Documents\n                               \n\n\n\n                                Returns a list of documents in your account.\n                               \n\n\n\n\n\n                                People\n                               \n\n\n\n                                Returns a list of people in your account.\n                               \n\n\n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042927854", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003676", "Archived Date": "", "Language": "English", "Primary Version": "PipelineDeals Connector", "Article Total View Count": "2,363", "": "", "Article Created Date": "10/24/2022, 9:14 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              PipelineDeals Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}