{"file_path": "../../raw_kb_v2\\article\\360042923754\\index.html", "content": {"Title": "Enterprise Stacker", "Article Body": "Intro\n                       \n\n                        Enterprise Stacker is a highly configurable alternative data structure that transforms large amounts of data quickly and easily. It allows you to combine data from multiple platforms in such a way that multiple inputs can be defined as one single metric without the use of SQL or custom programming. Stacker also provides change records to administrators through the Domo activity log, ensuring security and optimizing governance possibilities. You can access the activity log from the navigation header by selecting\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        . Under\n                        \n                         Governance\n                        \n                        , select\n                        \n                         Activity log\n                        \n                        .\n                       \n\n                        Using Enterprise Stacker, you can combine the following two tables that come from two different channels into one impressions table.\n                       \n\n\n\n\n\n\n                        Using `Views` as the metric we are stacking, here is our output impressions table:\n                       \n\n\n\n\n\n\n\n\n                        When to use Enterprise Stacker\n                       \n\n                        Enterprise Stacker works well in the following situations:\n                       \n\n\n\n\n\n                            Use Case\n                           \n\n\n\n                            Benefits of Stacker\n                           \n\n\n\n\n\n\n\n                            Data exists in multiple platforms or DataSets\n                           \n\n\n\n\n                             Combines and standardizes metrics across platforms and visualizations\n                            \n\n                             Supports inconsistent granularities\n                            \n\n                             Doesn't require technical skill sets\n                            \n\n\n\n\n\n\n                            One Master DataSet is required or preferred\n                           \n\n\n\n\n                             Brings data into one DataSet for visualization\n                            \n\n                             Simplifies Domo Page Analyzer\n                            \n\n                             Simplifies PDP policy application\n                            \n\n                             Provides one source of truth\n                            \n\n\n\n\n\n\n                            Data size is more than 50-100M rows\n                           \n\n\n\n\n                             Leverages Domo Query Performance\n                            \n\n                             Allow for aggregation or filtering down data\n                            \n\n                             Billions of rows quickly aggregated to millions of rows in minutes\n                            \n\n\n\n\n\n\n                        Other benefits include:\n                       \n\n\n                         Output is dynamic based on configured dimensions and metrics\n                        \n\n                         Wildcard inputs — thousands of DataSets combined quickly\n                        \n\n                         Thousands of input data sources\n                        \n\n                         Hundreds of possible metrics/dimensions\n                         \n\n\n\n\n\n\n\n\n                              Tip:\n                             \n                             We recommend fewer than 50 metrics to optimize speed.\n                            \n\n\n\n\n\n\n\n                        This article describes Enterprise Stacker setup and how to complete various tasks within it in the following topics:\n                       \n\n\n\n                          Getting Enterprise Stacker\n                         \n\n\n\n                          Prerequisite\n                         \n\n                          s\n                         \n\n\n\n                          Creating a job\n                         \n\n\n\n                          Adding multiple metrics to a job\n                         \n\n\n\n                          Activity logs\n                         \n\n\n\n\n\n                        Getting Enterprise Stacker\n                       \n\n                        Contact your Account Executive (AE) or Technical Consultant (TC) to begin the deployment process.\n                       \n\n                        Domo will access your instance to deploy Enterprise Stacker and align it with the provided system user account's email.\n                       \n\n\n\n\n                        Prerequisites\n                       \n\n                        There are a few things to prepare and consider before using Enterprise Stacker:\n                       \n\n\n                         Ensure the cleanliness of the data before stacking. Check the numerical and data values to ensure the columns include only numerical values.\n                        \n\n\n                          Ensure you're applying the data type consistently (string, double, date, and so on).\n                         \n\n\n\n                          If you are using a wildcard metric, ensure that at least 99% of the DataSets that match the wildcard rule have the columns you wish to query in their schema.\n                         \n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             If even one of the columns you specify in the metric is\n                             \n                              not\n                             \n                             in the schema, the data from that DataSet is not included in the output.\n                            \n\n\n\n\n\n\n\n\n                        Creating a Job\n                       \n\n\n                         In Enterprise Stacker, ​s​​​​​elect\n                         \n                          + New Configuration\n                         \n                         .\n                        \n\n\n                          Choose which DataSet to use for the metric:\n                         \n\n\n                           Select a DataSet\n                          \n\n                           —\n                          \n                          Allows you to search by name and select one DataSet\n                          \n\n                           Select all DataSets that match a rule\n                          \n\n                           —\n                          \n                          Allows you to select all DataSets where the name contains whatever string you specify.\n                         \n\n\n\n\n\n\n\n\n\n                              Tip:\n                             \n                             When using\n                             \n                              Select all DataSets that match a rule\n                             \n                             , you must use all matching DataSets. For example, in the following image, all 43 DataSets are used in the setup of that metric.\n                            \n\n\n\n\n\n\n\n\n\n\n                          Name your metric and you can, optionally, set a metric alias. This is an alternative name you could use to search for this metric in your output DataSet.\n                         \n\n\n\n                          Select\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Choose the value column that corresponds to the metric.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If you must, you can choose a string. The Enterprise Stacker engine attempts to cast the string as a numeric value. However, if there are true string values in your column and it cannot be cast as a number, then you receive an error after you run the job.\n                            \n\n\n\n\n\n\n                          (Optional) Create an aggregation on the value column. Select\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             When you choose to aggregate a value, Stacker will automatically group by all other non-aggregated columns that are included in the table.\n                            \n\n\n\n\n\n\n                          Choose a date column. This should be the date that lines up with the numeric metric you chose. You can select\n                          \n                           I don't have a date column\n                          \n                          if you don't want to specify one. Select\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             You can select a string type column here if needed. Stacker will attempt to cast the string as a date type. However, if there are values that aren't true dates in your column and cannot be cast as a date, then you will receive an error after you run the job.\n                            \n\n\n\n\n\n\n                          (Optional) Apply any necessary filters by selecting\n                          \n                           + add a filter\n                          \n                          . Select the column, operand, and value you would like to filter on. Filters provide the option for rolling windows of data, reducing data size, targeting specific numbers, targeting specific date ranges, etc. You can add as many filters as you would like. Select\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Filters are applied with an `and` method. You cannot apply one filter or the other.\n                            \n\n\n\n\n\n\n                          (Optional) Add additional columns. You can create custom constant columns, select which columns are included, rename columns, and select data types\n                         \n\n\n\n\n                             Custom constant column —\n                            \n                            Select\n                            \n                            and type in the column name and choose a value you would like to be populated on every row for this DataSet.\n                           \n\n\n\n\n                             Select DataSet columns —\n                            \n                            Choose which columns to include in the output DataSet.\n                           \n\n\n\n\n                             Rename columns —\n                            \n                            You can rename any column you choose to include from the DataSet.\n                           \n\n\n\n\n                             Select data type —\n                            \n\n                            Choose the data type you want the column to be in the output.\n                            \n\n\n\n\n\n\n\n\n                          Select\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Name the output DataSet. This is also the name of this Enterprise Stacker job.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Since Stacker uses the job name as the name for the output DataSet, there must be one, and only one, DataSet at any time that has the same name as the Stacker job tied to it. Otherwise the job fails and the data does not update.\n                            \n\n\n\n\n\n\n                          Select an\n                          \n                           Update Schedule\n                          \n                          for the job.\n                         \n\n\n\n                          Select\n                          \n                           Finish\n                          \n                          .\n                         \n\n\n\n\n\n                        Adding Multiple Metrics to a Job\n                       \n\n\n\n                          Select the job you want to add additional metrics to.\n                         \n\n\n\n                          Select\n                          \n                           + Add Metric\n                          \n                          and follow the steps to\n                          \n                           create a job\n                          \n                          .\n                         \n\n\n\n\n\n\n                        Metric Actions\n                       \n\n                        In the\n                        \n                         Configuration\n                        \n                        tab for the job, you can\n                        \n\n                         Copy\n                        \n                        ,\n                        \n\n                         Edit\n                        \n                        , or\n                        \n\n                         Delete\n                        \n                        a metric.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           After you delete a configuration, it cannot be recovered, and the DataSet is orphaned and stops updating.\n                          \n\n\n\n\n                        Edit Job Configuration\n                       \n\n                        To change the DataSet name or the job run schedule, select\n                        \n\n                         Edit Configuration\n                        \n                        .\n                       \n\n\n\n\n\n\n                        Activity Logs\n                       \n\n                        Any changes to jobs, or executions of jobs, are logged in the\n                        \n                         Activity Logs\n                        \n                        . For more information, see our article on\n                        \n                         Viewing Activity Logs\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042923754", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004570", "Archived Date": "", "Language": "English", "Primary Version": "Enterprise Stacker", "Article Total View Count": "4,837", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Enterprise Stacker\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Enterprise Stacker\n              \n", "url": "/s/topic/0TO5w000000ZaniGAC"}]}