{"file_path": "../../raw_kb_v2\\article\\360042930134\\index.html", "content": {"title": "\n\n\n Yelp Reporting Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nYelp is a local business directory service and review site with social networking features. To learn more about the Yelp Reporting API, visit their page (\n\nhttps://www.yelp.com/developers\n\n).\n\n\n You connect to your Yelp Reporting account in the Data Center. This topic discusses the fields and menus that are specific to the Yelp Reporting connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Yelp account and create a dataset, you must have your Yelp Reporting API username and password. This username and password is different from your standard Yelp login. To request your credentials, please reach out to your Yelp sales representative. Your Yelp sales representative will create the credentials and share them with you.\n\n\n Connecting to Your Yelp Reporting Account\n-------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Yelp Reporting Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Yelp account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter your Yelp username.\n  |\n|\n Password\n  |\n Enter your Yelp password.\n  |\n\n\n Once you have entered valid Yelp credentials, you can use the same account any time you go to create a new Yelp Reporting DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Yelp Reporting report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Daily Report\n  |\n Returns a report containing daily business/advertiser metrics for specified Business IDs over a date range. You can request daily data for up to the last 2 months for Business Metrics and up to the last 12 months for Advertiser Metrics.\n  |\n|\n Monthly Report\n  |\n Returns a report containing monthly business/advertiser metrics for specified Business IDs over a date range. You can request monthly data for up to the last 12 months for all metrics in monthly reports.\n  |\n\n|\n|\n Business IDs\n  |\n Enter a comma-separated list of IDs of the businesses you want to retrieve data for. You can find business IDs by running the \"Search\" report in the Yelp connector.\n  |\n|\n Business and Advertising Metrics\n  |\n Select the business and advertising metrics you want to see in your report.\n\n\n**Business Metrics**\n\n\n For daily reports, you can request business metrics for the last 2 months. For monthly reports, you can request metrics for the last year.\n\n\n|\n Metric\n  |\n Description\n  |\n| --- | --- |\n|\n Calls Tracked\n  |\n Number of calls tracked.\n  |\n|\n Clicks to Website\n  |\n Number of clicks to the business URL from the Yelp business profile.\n  |\n|\n Deals Sold\n  |\n Number of deals sold.\n  |\n|\n Desktop Appearances in Search\n  |\n Number of times a business appeared in a search on desktop devices.\n  |\n|\n Desktop Call-to-Action Clicks\n  |\n Number of Call-to-Action clicks on desktop devices.\n  |\n|\n Desktop User Views\n  |\n Number of page views on desktop devices.\n  |\n|\n Direction & Map Views\n  |\n Number of direction and map views from the Yelp business profile.\n  |\n|\n Mobile Appearances in Search\n  |\n Number of times a business appeared in search on mobile devices.\n  |\n|\n Mobile Call-to-Action Clicks\n  |\n Number of Call-to-Action clicks on mobile devices.\n  |\n|\n Mobile Calls\n  |\n Number of phone calls initiated from the Yelp business profile.\n  |\n|\n Mobile Check-Ins\n  |\n Number of mobile check-ins from the Yelp business profile.\n  |\n|\n Mobile User Views\n  |\n Number of page views on mobile devices.\n  |\n|\n Online Bookings\n  |\n Number of online bookings.\n  |\n|\n Online Orders\n  |\n Number of online orders.\n  |\n|\n Request a Quote Messages\n  |\n Number of messages sent to a business including messages sent through Request a Quote.\n  |\n|\n Total User Views\n  |\n Number of total page views on desktop and mobile devices.\n  |\n|\n User Uploaded Photos\n  |\n Number of user-generated photos added to the Yelp business profile.\n  |\n|\n Yelp Bookmarks\n  |\n Number of times a business has been bookmarked by users.\n  |\n\n\n**Advertiser Metrics**\n\n\n For both daily and monthly reports, you can request advertiser metrics for up to 1 year ago.\n\n\n|\n Metric\n  |\n Description\n  |\n| --- | --- |\n|\n Ad Cost\n  |\n Cost of ad.\n  |\n|\n AD-DRIVEN Clicks to Website\n  |\n Number of clicks to the business URL from the Yelp business profile that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Deals Sold\n  |\n Number of deals sold that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Directions and Map Views\n  |\n Number of direction and map views from the Yelp business profile that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Mobile Calls\n  |\n Number of phone calls initiated from the Yelp business profile that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Mobile Check-ins\n  |\n Number of mobile check-ins from the Yelp business profile that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Online Reservations\n  |\n Number of Yelp Reservations and Yelp No-Wait bookings that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Request-a-Quote Messages\n  |\n Number of messages sent to a business including messages sent through Request a Quote that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Total Call-to-Action Clicks\n  |\n Number of Call-to-Action clicks on desktop devices that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN User-Uploaded Photos\n  |\n Number of user-generated photos added to the Yelp business profile that can be attributed to an Ad impression.\n  |\n|\n AD-DRIVEN Yelp Bookmarks\n  |\n Number of times a business has been bookmarked by users that can be attributed to an Ad impression.\n  |\n|\n Billed Ad Clicks\n  |\n Number of clicks from a billed impression.\n  |\n|\n Billed Ad Impressions\n  |\n Number of times Ad is displayed and will be billed.\n  |\n\n\n |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How can I find the ID for the business I want to retrieve data for?\n\nYou can find IDs for specific businesses by running the \"Search\" report in the standard Yelp connector.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042930134\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003436\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nYelp Reporting Connector\n\n", "article_total_view_count": "\n\n\n 2,381\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "yelp_reporting_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}