{"file_path": "../../raw_kb_v2\\article\\360043438833\\index.html", "content": {"Title": "YouTube Viewer Demographic App", "Article Body": "Intro\n                       \n\n                        The YouTube Viewer Demographic app allows you to see who's interacting with your content, how they're interacting with it, and which of your videos your viewers prefer. You can use the YouTube Connector to connect your data with the app or upload your own data into Domo and connect it with the app.\n                       \n\n\n\n\n                        Parts of the App\n                       \n\n                        The YouTube Viewer Demographic app is divided into sections so that you are able to easily view and navigate the metrics that matter. Note that the app displays up to 60 days of content.\n                       \n\n                        Viewer Gender\n                       \n\n                        The Viewer Gender section shows you the percentage of male and female viewers that are watching your content on YouTube.\n                       \n\n\n\n\n                        Viewer Age % Breakdown\n                       \n\n                        The Viewer Age % Breakdown section breaks down the age of your viewers into 6 sections: 18-24, 25-34, 35-44, 45-54, 55-64, and 65+. If you hover over individual portions of the filled-graph percentage for each age section will be displayed in the center of the graph.\n                       \n\n\n\n\n                        Ratings\n                       \n\n                        The Ratings section displays the number of total likes and dislikes using a comparison bar graph.\n                       \n\n\n\n\n                        Geography\n                       \n\n                        The Geography section displays where in the world your viewers are watching your content. The name of the country is shown alongside what percentage of your viewers are in that country. If you hover each country, you'll be able to see the total number of viewers in each one.\n                       \n\n\n\n\n                        Views by Device Type\n                       \n\n                        The Views by Device Type section is displayed as a bar graph that shows the number of views according to each device type: laptop, smartphone, tablet, gaming console, monitor, and other. If you hover over the individual bars, the total number of views by device will be displayed.\n                       \n\n\n\n\n                        Most/Least Viewed Videos\n                       \n\n                        The Most/Least Viewed Videos section displays your top 3 most-viewed videos and your bottom 3 least-viewed videos.\n                       \n\n\n\n\n                        Views, Comments, and Shares\n                       \n\n                        This last section displays your total number of views, comments, and shares for your entire YouTube channel that you've connected to the app.\n                       \n\n\n\n\n                        How Do I Get This?\n                       \n\n\n                         You can install this app to your Domo Instance today by heading to the Domo Appstore and searching for \"YouTube Viewer Demographic\" in the search bar. The app is entirely free, so download today!", "Preview Article": "Click here to preview", "URL Name": "360043438833", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004158", "Archived Date": "", "Language": "English", "Primary Version": "YouTube Viewer Demographic App", "Article Total View Count": "2,378", "": "", "Article Created Date": "10/24/2022, 9:26 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              YouTube Viewer Demographic App\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}