{"file_path": "../../raw_kb_v2\\article\\1500008621522\\index.html", "content": {"title": "\n\n\n MQTT Subscription Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMQTT is a publish/subscribe, extremely simple and lightweight messaging protocol, designed for constrained devices and low-bandwidth, high-latency or unreliable networks. The MQTT Subscription Connector is designed for those who have their own MQTT broker and want the Subscriber to subscribe to an existing topic. Use this connector to see you MQTT data in real time, from hundreds of devices.\n\n\n You connect to your MQTT Subscription account in the Data Center. This topic discusses the fields and menus that are specific to the MQTT Subscription connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your MQTT Subscription account and create a DataSet, you must have the following:\n\n The host for the MQTT Broker\n* The port number. Typically this will be 1883 for non-SSL or 8883 for SSL.\n* The username and password used for the MQTT Broker\n\nConnecting to Your\n\nMQTT Subscription\n\nAccount\n----------------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the\n\nMQTT Subscription\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your\n\nMQTT Subscription\n\naccount. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Broker Host\n  |\n Enter the host for the MQTT Broker.\n  |\n|\n Port\n  |\n Enter the port number. Typically this will be 1883 for non-SSL or 8883 for SSL.\n  |\n|\n Username\n  |\n Enter the username used for the MQTT Broker.\n  |\n|\n Password\n  |\n Enter the password used for the MQTT Broker.\n  |\n\nOnce you have entered valid\n\nMQTT Subscription\n\ncredentials, you can use the same account any time you go to create a new\n\nMQTT Subscription\n\nDataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the\n\nMQTT Subscription\n\nreport you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Subscriptions\n  |\n Gets the subscriptions that the subscriber has subscribe to.\n  |\n\n|\n|\n MQTT Topics, Comma Delimited\n  |\n These are the messages the subscriber will subscribe to. Mosquitto is the standard and can provide more information about setting up wildcards.\n  |\n|\n Include Metadata About the Request, Including the Topic And Timestamp\n  |\n Select 'Yes' if you wish to include the metadata about the request, including the topic and timestamp; otherwise, select 'No.'\n  |\n|\n Enable Flattening\n  |\n Select the checkbox to expand the list in the response.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n###\n\nHow much data can I send in one packet?\n\nThe recommended data size is 100k.\n\n###\n\nWhat type of security is best to use in the MQTT Subscription Connector?\n\nThe most secure approach is to use SSL on the host URL, and a username and password. Neither are required, but they are encouraged.\n\n###\n\nDoes this Connector require HTTPS or SSL encryption from the data providers?\n\nHTTPS or SSL encryption are not required from the data providers.\n\n###\n\nWhat kind of credentials do I need to power up this connector?\n\nYou need the host, port number, and the username and password used for the MQTT Broker. The port will be 1883 for non-SSL or 8883 for SSL.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500008621522\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003235\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMQTT Subscription Connector\n\n", "article_total_view_count": "\n\n\n 2,407\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "mqtt_subscription_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}