{"file_path": "../../raw_kb_v2\\article\\360043430273\\index.html", "content": {"Title": "Adding a Bot to Buzz", "Article Body": "Intro\n                       \n\n                        NLQ Bots are third-party connector integrations with Buzz. You can add NLQ Bots to any conversation in Buzz. You can then ask these Bots a question in Buzz using natural language and get an immediate response based on your DataSet data.\n                       \n\n                        Many NLQ Bots in Domo use webhooks, meaning you set up an integration with a third-party system. That system then pushes notifications to the Domo conversation where the Bot has been set up.\n                       \n\n                        Because all Bots are set up differently depending on the third-party connector, the instructions provided in this topic are general for all Bots. More specific instructions for each Bot are available when you go to add a Bot in Domo.\n                       \n\n                        Adding an NLQ Bot\n                       \n\n                        Follow these instructions to add a Bot to a Buzz conversation.\n                       \n\n\n                         To add a Bot to Buzz,\n                        \n\n\n\n\n                          Open Buzz and find the conversation where you want the Bot to post.\n                         \n\n                          For more information about locating and opening conversations, see\n                          \n                           Chatting in Buzz\n                          \n                          .\n                         \n\n\n\n                          Click the details icon (\n                          \n                          ) next to the conversation name to open the Details pane.\n                         \n\n\n\n                          Click\n                          \n                           Bots\n                          \n                          to expand the\n                          \n                           Bots\n                          \n                          section of the pane.\n                          \n\n\n\n\n\n\n                          Click the \"+\" button.\n                          \n                          The\n                          \n                           Add a Bot\n                          \n                          dialog opens.\n                         \n\n\n\n                          Locate the desired Bot in the dialog either by scrolling to it or entering the name in the search box.\n                         \n\n\n\n                          Click the Bot.\n                          \n                          A dialog with options for configuring this Bot appears.\n                         \n\n\n\n                          Follow the provided instructions for configuring the Bot.\n                          \n                          For more information about configuring NLQ for the Bot, see\n                          \n                           Understanding NLQ\n                          \n                          .\n                         \n\n\n                         Enter a name for the Bot.\n                         \n                         This is the name that is shown for the Bot in the conversation.\n                        \n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        The Bot is now set up, and you will receive Buzz notifications in this conversation depending on the third-party system and the triggers you have defined.\n                       \n\n                        Deleting a Bot\n                       \n\n                        You can remove a Bot from a Buzz conversation quickly and easily.\n                       \n\n\n                         To remove a Bot from a Buzz conversation\n                        \n                        ,\n                       \n\n\n                         Open Buzz and find the conversation where the Bot has been added.\n                         \n                         For more information about locating and opening conversations, see\n                         \n                          Chatting in Buzz\n                         \n                         .\n                        \n\n\n                          Click the details icon (\n                          \n                          ) next to the  conversation name.\n                          \n                          The Details pane opens for the conversation.\n                         \n\n\n\n                          Click\n                          \n                           Bots\n                          \n                          to expand the\n                          \n                           Bots\n                          \n                          section of the pane.\n                          \n\n\n\n\n\n                          Mouse over the Bot you want to delete.\n                         \n\n\n\n                          Click the trash can icon\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Delete\n                          \n                          to confirm.\n                         \n\n\n\n                        The Bot is now removed, and you will no longer receive notifications for this third-party system in this conversation.\n                       \n\n                        Understanding NLQ\n                       \n\n                        For all Bots, you configure NLQ (Natural Language Query) by entering a command name in the\n                        \n                         Command Name\n                        \n                        field. For many Bots, this field does not appear until you configure the webhook for the Bot.\n                       \n\n\n\n\n                        You can enter any name in this field that you want, though it is recommended you choose something related to this connector that is short and easy to remember. Once you have configured the Bot and added a command name, you can invoke the Bot in Buzz by entering\n                        \n                         /[commandname]\n                        \n                        then asking your question.\n                       \n\n                        For example, let's say you have Shopify data in Domo and you want to find out how many refunds you gave during the month of March. You would first configure the Bot as explained above, being sure to enter a command in the\n                        \n                         Command Name\n                        \n                        field. In this example, we'll just use the name \"shopify.\" After successfully connecting to your Shopify store and adding the Bot, you would then write a Buzz message as follows:\n                       \n\n\n                         /shopify how many refunds for March\n                        \n\n\n                        Buzz would immediately respond with the answer to your question.\n                       \n\n                        Because NLQ Bots understand natural language, there is no required syntax for your questions. You could rephrase the above query using any of the following structures, and because the keywords (\"refunds\" and \"march\") are always present, the reply would be the same:\n                       \n\n\n                         /shopify how many refunds did I give in March\n                        \n\n\n\n                         /shopify refunds for March\n                        \n\n\n\n                         /shopify March refunds", "Preview Article": "Click here to preview", "URL Name": "360043430273", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004315", "Archived Date": "", "Language": "English", "Primary Version": "Adding a Bot to Buzz", "Article Total View Count": "4,879", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Adding a Bot to Buzz\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Buzz\n              \n", "url": "/s/topic/0TO5w000000ZanCGAS"}]}