{"file_path": "../../raw_kb_v2\\article\\4624885410583\\index.html", "content": {"title": "\n\n\n OfficeRnD Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n The OfficeRnD co-working and flex platform helps customers book office space. It simplifies the process by automating administrative tasks, providing key details to make data-driven decisions, and delivering an amazing digital experience to customers. It helps space administrators focus on work, get access to required knowledge, and connect with like-minded professionals to enable sustainable growth in their business.\n\n\n The Domo OfficeRnD connector enables you to retrieve various details about bookings, credits, contracts, offices, payments, and more. When you connect OfficeRnD with Domo, you’ll see all the critical data you need to manage your workspaces along with costs and customer management. Your team will be able to use this data to have an all-in-one view of how your business is functioning and where potential problems may occur.\n\n\n You can create powerful visualizations and reports to track all the data your OfficeRnD solution captures to keep your business running. Combine your OfficeRnD data with all your information on Domo to see how your workspaces affect your bottom line and plan for future business demands.\n\nTo learn more about the\n\nOfficeRnD\n\nAPI, visit their page (\n\nhttps://developer.officernd.com/docs\n\n).\n\n\n The\n\nOfficeRnD\n\nConnector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your\n\nOfficeRnD\n\naccount in the Data Center. This topic discusses the fields and menus that are specific to the\n\nour Officernd API\n\nConnector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your\n\nOfficeRnD\n\naccount and create a DataSet, you must have the following:\n\n The client ID and client secret associated with y\n\nour OfficeRnD API.\n* The Organization name for your OfficeRnD environment. You can find this in the API URL. For example, if your API URL is \"\n\nhttps://app.officernd.com/api/v1/organizations/domo\"\n\n\" then your organizations is \"domo\".\n\nConnecting to Your\n\nOfficeRnD\n\nAccount\n--------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the\n\nOfficeRnD\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your\n\nOfficeRnD\n\naccount. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Client ID\n  |\n Enter the client ID associated with your OfficeRnD API.\n  |\n|\n Client Secret\n  |\n Enter the client secret associated with y\n\nour OfficeRnD API.\n\n|\n|\n Organization\n  |\n Enter t\n\nhe Organization name for your OfficeRnD environment. You can find this in the API URL.\n\n\n For example, if your API URL is \"\n\nhttps://app.officernd.com/api/v1/organizations/domo\"\n\n\" then your organizations is \"domo\".\n\n|\n\nOnce you have entered valid\n\nOfficeRnD\n\ncredentials, you can use the same account any time you go to create a new\n\nOfficeRnD\n\nDataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the\n\nOfficeRnD\n\nreport you want to run. The following reports are available:\n\n\n|\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Bookings\n  |\n Retrieves all bookings made for reservation of resources.\n  |\n|\n Booking Occurrences\n  |\n Retrieves a list of all booking occurrences for a specified period.\n  |\n|\n Charges\n  |\n Retrieves all charge objects. A charge object describes a single payment associated with an invoice.\n  |\n|\n Checkins\n  |\n Retrieves all checkins. Checkins represent member presence at a certain office.\n  |\n|\n Contracts\n  |\n Retrieves all contracts. A contract object allows one to associate contract data to the companies.\n  |\n|\n Credit Accounts\n  |\n Retrieves coin credit balance for a team/member in a specific month.\n  |\n|\n Fees\n  |\n Retrieves all fee objects. A fee object describes one-off charges or groups of one-off charges.\n  |\n|\n Floors\n  |\n Retrieves all floors in the space.\n  |\n|\n Issues\n  |\n Retrieves all issues.\n  |\n|\n Members\n  |\n Retrieves all members. A member has all the member's data in a single place like memberships, invoices, charges, fees, etc.\n  |\n|\n Memberships\n  |\n Retrieves all memberships. A membership object allows to assign recurring charges (price plans) to individual members or teams.\n  |\n|\n Offices\n  |\n Retrieves all separate physical locations in the space.\n  |\n|\n Passes\n  |\n Retrieves all passes.\n  |\n|\n Payments\n  |\n Retrieves all payment objects (invoices / credit notes)\n  |\n|\n Plans\n  |\n Retrieves all plans. A plan object allows to create one-off or recurring named charges.\n  |\n|\n Rates\n  |\n Retrieves all resource rates.\n  |\n|\n Resources\n  |\n Retrieves all types of resources.\n  |\n|\n Resource Types\n  |\n Retrieves all resource types in the organization.\n  |\n|\n Teams\n  |\n Retrieves all teams.\n  |\n|\n Visits\n  |\n Retrieves visits in the organization.\n  |\n\n|\n|\n Field To Expand\n  |\n Select the field that you would like to expand in the data. This will cause multiple rows to show each object in the selected field. You will not be able to expand any data, if \"None\" is selected.\n  |\n|\n Date Selection Criteria\n  |\n Select the type of date you want to filter the data for. Select \"All Data\" if you don't want to filter the data or want to get all data.\n  |\n|\n Filter Data By Date\n  |\n S\n\nelect this check box if you would like to filter the data for the selected duration.\n  |\n|\n Date Selection\n  |\n Select the date format for your data.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n\n\n**Days Back**\n\n\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ********End Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ********Start Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Time Period\n  |\n Specify the time period that you would like to receive data for.\n  |\n|\n Starting Day of the Week\n  |\n Select the day you would like your week to start with.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What endpoint is the base URL for this connector?\n\nThe base URL for the OfficeRnD connector is\n\nhttps://app.officernd.com/api/v1/organizations/{\n\norgSlug}).\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Bookings\n  |\n /bookings\n  |\n|\n Booking Occurrences\n  |\n /bookings/occurrences\n  |\n|\n Charges\n  |\n /charges\n  |\n|\n Checkins\n  |\n /checkins\n  |\n|\n Contracts\n  |\n /contracts\n  |\n|\n Credit Accounts\n  |\n /credit-accounts/stats\n  |\n|\n Fees\n  |\n /fees\n  |\n|\n Floors\n  |\n /floors\n  |\n|\n Issues\n  |\n /issues\n  |\n|\n Members\n  |\n /members\n  |\n|\n Memberships\n  |\n /memberships\n  |\n|\n Offices\n  |\n /offices\n  |\n|\n Passes\n  |\n /passes\n  |\n|\n Payments\n  |\n /payments\n  |\n|\n Plans\n  |\n /plans\n  |\n|\n Rates\n  |\n /rates\n  |\n|\n Resources\n  |\n /resources\n  |\n|\n Resource Types\n  |\n /resource-types\n  |\n|\n Teams\n  |\n /teams\n  |\n|\n Visits\n  |\n /visits\n  |\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need your client ID and client secret associated with your OfficeRnD API. You also need the organization for your OfficeRnD environment.\n\n###\n Where can I find my organization?\n\nYou can find your organization in the API URL.\n\n\n For example, if your API URL is \"\n\nhttps://app.officernd.com/api/v1/organizations/domo\"\n\n\" then your organization is \"domo\".\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4624885410583\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003183\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nOfficeRnD Connector\n\n", "article_total_view_count": "\n\n\n 4,637\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "officernd_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}