{"file_path": "../../raw_kb_v2\\article\\360043435133\\index.html", "content": {"title": "\n\n\n Wrike Connector\n\n\n", "article_body": "\n\n*Important:**\n Due to Wrike deprecating their API version 3, Wrike can no longer guarantee that API calls using the Wrike Connector will continue to work.\n\n\n**Authentication Changes**\n\n\n Wrike has updated the way that accounts are authenticated. When creating a Wrike account connection in Domo, previously you were able to connect to all accounts in your system. Now, Wrike only allows for connection to a single account. For this reason, you will need to re-connect your Domo Wrike account in order to use it for future Wrike API connections.\n\n\n**Connector Changes**\n\n\n In conjunction with the authentication changes, the current Wrike DataSets in your account are no longer compatible with their API. Domo has created a new Wrike connector that works with the new API version. You will need to recreate your DataSets on the new Wrike connector, which is denoted with a \"beta\" banner. This can also be found by going to https://[yourinstance].\n\ndomo.com/connectors/com.domo.connector.wrike4\n\nIntro\n-------\n\nWrike, Inc. produces a project management tool that gets distributed and co-located teams working together so that projects are completed faster to save time and money.  To learn more about the Wrike API, visit their page (\n\nhttps://developers.wrike.com/\n\n).\n\n\n You connect to your Wrike account in the Data Center. This topic discusses the fields and menus that are specific to the Wrike connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Wrike account and create a DataSet, you must have a Wrike username and password. Alternatively, you can connect using Google or Microsoft Office 365 credentials, or SSO credentials if these have been set up for your company.\n\n\n Connecting to Your Wrike Account\n----------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Wrike Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Wrike connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Wrike accounts in Domo) to open the Wrike OAuth screen where you can enter your credentials to connect to Wrike. Once you have entered valid credentials, you can use the same account any time you go to create a new Wrike DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Wrike when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Wrike.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Wrike report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Accounts\n  |\n Returns all accounts you have access to.\n  |\n|\n Attachments\n  |\n Returns all attachments for tasks and folders in the selected account.\n  |\n|\n Comments\n  |\n Returns comments for all accounts.\n  |\n|\n Contacts\n  |\n Returns a list of user and user group contacts for all accounts.\n  |\n|\n Custom Fields\n  |\n Returns a list of custom fields for the selected account.\n  |\n|\n Dependencies\n  |\n Returns a list of task dependencies.\n  |\n|\n Folder\n  |\n Returns information about the selected folders.\n  |\n|\n Folder Tree\n  |\n Returns a list of tree entries for the selected account.\n  |\n|\n Groups\n  |\n Returns all groups for the selected account.\n  |\n|\n Invitations\n  |\n Returns all invitations for the selected account.\n  |\n|\n Query Workflows\n  |\n Returns a list of workflows with custom statuses.\n  |\n|\n Tasks\n  |\n Returns all tasks in all accounts.\n  |\n|\n Timelogs\n  |\n Returns all timelog records for all accounts.\n  |\n\n|\n|\n Accounts\n  |\n Select the account you want to retrieve data for.\n  |\n|\n Folders\n  |\n Select the folders you want to retrieve data for.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043435133\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003407\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nWrike Connector\n\n", "article_total_view_count": "\n\n\n 2,409\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "wrike_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}