{"file_path": "../../raw_kb_v2\\article\\360043436693\\index.html", "content": {"title": "\n\n\n Microsoft Azure Blob Storage Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Microsoft Azure Blob Storage is designed to easily and efficiently store any type of unstructured data, such as images, videos, audio, and documents. Use Domo's Microsoft Azure Blob Storage connector to pull CSV, TSV, and TXT data files from your Microsoft Azure Blob Storage account into Domo. Combine your Azure data with data from other data sources throughout your company for a comprehensive view of your business. Set up custom alerts to be notified in real-time when your key metrics change, so you can make faster, better business decisions. To learn more about the Azure Blob Storage API, visit their page (\n\n\n https://docs.microsoft.com/en-us/res...rvice-rest-api\n\n\n ).\n\nYou connect to your Microsoft Azure Blob Storage account in the Data Center. This topic discusses the fields and menus that are specific to the Azure Blob Storage connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Azure Blob Storage account and create a DataSet, you must have the following:\n\n Your Microsoft Azure Blob Storage account name\n* Your Microsoft Azure Blob Storage account key\n\nIf you do not know your credentials, reach out to your Microsoft account representative.\n\n\n Connecting to Your Azure Blob Storage Account\n-----------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Azure Blob Storage Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Azure Blob Storage account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Account Name\n  |\n Enter your Microsoft Azure Blob Storage account name.\n  |\n|\n Account Key\n  |\n Enter your Microsoft Azure Blob Storage account key.\n  |\n\n\n Once you have entered valid Azure Blob Storage credentials, you can use the same account any time you go to create a new Azure Blob Storage DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains various options for selecting and configuring the file you want to import into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n What File Type Would You Like to Import?\n  |\n Select whether you want to pull a CSV, TSV, or TXT file into Domo.\n  |\n|\n Blob Container\n  |\n Select the container with the file that you want to import into Domo.\n  |\n|\n Blobs Search Type (Advanced)\n  |\n Select wheter you want to filter the blobs with simple or advanced options.\n\n\n|\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Limit the search to directory\n  |\n Enter the path to limit the search to a directory, subdirectory. Leave it empty if you want to search for the blob in container root and all directories.\n\nFor example,\n\n**directory/subdirectory/nesteddirectory/***\n\n\n**Note:**\n The file extension (.CSV, .TSV, or .TXT) must match the selected file type in the connector.\n\nExample: If you want to select 'File1.csv' then you must select CSV as the file type from the drop down first.\n\n\n |\n|\n Blob Name\n  |\n Enter partial or full name of the blob (Do not include extension).\n  |\n|\n Ignore Case\n  |\n Select this checkbox for Domo to ignore the cases while matching the provided Blob Name\n  |\n|\n Invert Match\n  |\n Pull the files with the provided prefix that do not match the provided criteria of Blob Name match.\n  |\n\n|\n|\n Do your blob containers have directories?\n  |\n Select 'Yes' if your blob containers have directories.\n  |\n|\n Blob Directory\n  |\n Select the directory with the file that you want to import into Domo.\n  |\n|\n Pull All Files\n  |\n Select this check box if you would like to pull all files from the selected blob directory.\n  |\n|\n How would you like to choose your Block Blob?\n  |\n Choose whether you want to select your block blob from a list or enter the name manually.\n  |\n|\n Select Block Blob\n  |\n Select the desired file.\n  |\n|\n Enter Block Blob\n  |\n Enter the name of the desired file. In\n **Block Blob Match Type**\n , you can specify how to match this string to the block blob name.\n  |\n|\n Block Blob Match Type\n  |\n Specify whether the file name starts with or contains the name you have entered in\n\n\n**Enter Block Blob**\n field.\n\n\n**Note:**\n\nYou need to provide the file extension of the selected file type along with the file name.\n\nExample: If you want to pull 'File1.csv' then you need to provide 'File1.csv' in the Enter Block Blob field.\n\n\n |\n|\n File Encoding\n  |\n Select the file encoding. By default,\n\n\n**UTF-8**\n is selected.\n  |\n|\n Select the delimiting character\n  |\n Select the delimiting character used in your file. If your delimiter is not listed select 'Other.'\n  |\n|\n Specify your delimiter\n  |\n Enter the character used to delimit your character separated values (CSV) text.\n  |\n|\n Quote Character\n  |\n Select the desired quote character for parsing CSV files (Double quote is the default quote character for CSV standard.)\n  |\n|\n Custom Quote Character\n  |\n Enter the desired CSV Quote character.\n  |\n|\n Escape Character\n  |\n Select the desired escape character for parsing CSV files.\n  |\n|\n Custom Escape Character\n  |\n Enter the desired CSV escape character.\n  |\n|\n Date Format\n  |\n\nSelect the required date format. By default,\n **MMDDYYYY**\n\n\n will be used.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436693\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003932\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft Azure Blob Storage Connector\n\n", "article_total_view_count": "\n\n\n 4,998\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "microsoft_azure_blob_storage_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}