{"file_path": "../../raw_kb_v2\\article\\360043429413\\index.html", "content": {"title": "\n\n\n Overlay Bar Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nAn Overlay Bar chart is similar to a standard\n\nStacked Bar chart\n\nexcept that instead of being stacked, all series items begin from the baseline, so overlapping of series items occurs in a category when multiple series are present. In its initial non-rollover state, an Overlay chart is rather meaningless, as shown in the following example:\n\nHowever, by mousing over a series item in the legend, you can see just that series in the chart, as shown in the following example:\n\nIn many applications this may be more useful than a Stacked Bar because you can more quickly compare series items in different categories. (In a Stacked Bar this is difficult because series in different categories do not usually begin from the same baseline.)\n\n\n Overlay Bar charts include both vertical and horizontal sub-types.\n\n\n Powering Overlay Bar charts\n-----------------------------\n\nAn Overlay Bar chart requires three data columns or rows from your DataSet—one for categories, one for the series in each category, and one for values. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your Overlay Bar chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nKPI Card Building Part 2: The Analyzer.\n\nThe following graphic shows you how the data from a typical column-based spreadsheet is converted into a vertical Overlay Bar chart:\n\nThe following graphic shows you how the data from a typical column-based spreadsheet is converted into a horizontal Overlay Bar chart:\n\nCustomizing Overlay Bar charts\n--------------------------------\n\nYou can customize the appearance of an Overlay Bar chart in a number of ways. Many customizations are possible by setting\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429413\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004689\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nOverlay Bar Chart\n\n", "article_total_view_count": "\n\n\n 5,044\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:22 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "overlay_bar_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}