{"file_path": "../../raw_kb_v2\\article\\360042922914\\index.html", "content": {"Title": "Standard Domo Support", "Article Body": "Intro\n                       \n\n                        This article provides instructions and resources for users on self-serve domains who run into problems with the Domo product or its tools/plug-ins.\n                       \n\n                        Resources\n                       \n\n                        Self-serve domains are currently offered the following resources for support:\n                       \n\n\n\n\n                           Knowledge Base\n                          \n                          . The Knowledge Base (the tool you are using now) contains thousands of articles about the Domo product and its features, tools, plug-ins/add-ons, and more.\n                         \n\n\n\n\n                           Community Forum\n                          \n                          . The Community Forum is the place for you to ask questions and learn from other Domo users. View discussion boards and popular posts, and share your thoughts and ideas with those who might be working on similar projects.\n                         \n\n\n\n\n                           Live Chat\n                          \n                          . Chat with a live representative by clicking on the\n                          \n                           ?\n                          \n                          icon in the bottom right-hand corner of your Domo environment.\n                         \n\n\n\n                        If you need additional Support outside of these channels (as well as phone, email, Buzz, etc.), please visit the following page for more details on Domo pricing:\n                        \n                         https://www.domo.com/pricing\n                        \n\n\n                        FAQ\n                       \n\n                        What is a Domo subscription?\n                       \n\n                        A Domo subscription gives you a core set of Domo functionality over a set period of time. Domo has three pricing levels: Standard, Professional, and Enterprise. You may choose whatever subscription is best suited for you.\n                       \n\n                        Does Domo offer different support levels and services for each subscription level?\n                       \n\n                        Yes. Depending on your needs and the subscription level you choose, Domo offers a variety of support packages. All customers, regardless of subscription level, will receive a core set of support services to make you successful in Domo.\n                       \n\n                        Standard customers will receive support from the Domo Help Center, Domo University, and Community Forum. This includes an ever-expanding collection of videos and webinars, a Knowledge Base, and a system status dashboard.\n                       \n\n                        Professional and Enterprise customers will receive customized support packages that scale based on your needs. Consulting services are also available for purchase for custom projects for Professional and Enterprise customers.\n                       \n\n                        If I am an existing customer or an existing Free Trial user, what changes?\n                       \n\n                        Nothing. If you are an existing customer, your current pricing and your current functionality will not change. You may, however, upgrade your subscription at any time. If you are currently using the Free version of Domo, the terms of your trial will not change.", "Preview Article": "Click here to preview", "URL Name": "360042922914", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004369", "Archived Date": "", "Language": "English", "Primary Version": "Standard Domo Support", "Article Total View Count": "2,495", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Standard Domo Support\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Support Resources\n              \n", "url": "/s/topic/0TO5w000000ZaoIGAS"}]}