{"file_path": "../../raw_kb_v2\\article\\360042923054\\index.html", "content": {"Title": "Viewing DataFlow Details", "Article Body": "All DataFlows have a Details view that provides basic information for the DataFlow. The view is divided into four tabs—\n                        \n                         Settings\n                        \n                        ,\n                        \n                         DataSets\n                        \n                        ,\n                        \n                         History\n                        \n                        and\n                        \n                         Versions\n                        \n                        .\n                        \n\n\n\n\n\n                        The\n                        \n                         Settings\n                        \n                        tab lets you control scheduling for a DataFlow. When you check a box for a component DataSet, the DataFlow updates whenever that DataSet updates.\n                       \n\n                        The\n                        \n                         DataSets\n                        \n                        tab shows you the input and output DataSets in this DataFlow. You can click a DataSet to open the details view for that DataSet.\n                       \n\n                        The\n                        \n                         Lineage\n                        \n\n                         tab displays the flow of data from each DataSet that has been combined and/or transformed to create this DataFlow.\n                        \n\n\n                        The\n                        \n                         History\n                        \n                        tab provides information about runs, such as the number of successful and failed runs, the average number of successful runs, the run history, whether a run was executed manually or due to an input DataSet being updated, and the status of each run.\n                       \n\n                        If a\n                        \n                         DataFlow\n                        \n                        fails for any reason, you will have a failed status icon for that run\n                        \n                        . You can hover over the failed icon to see the error message. If you would like to see exactly which transform(s) failed, then click on the status icon. This will bring you to a detailed view of your DataFlow execution. Each transform will have either a green outline for successful or red for failure.\n                       \n\n\n\n\n                        The\n                        \n                         Versions\n                        \n                        tab shows a list of versions of the DataFlow. Each time you save edits to a DataFlow, a new version is added to this list.\n                       \n\n                        The Details view includes a\n                        \n                        icon that provides access to commands such as\n                        \n                         , View Tags,\n                        \n\n                         Run\n                        \n                        ,\n                        \n                         Disable, Notifications,\n                        \n\n                         Create Copy\n                        \n                        , and\n                        \n                         Delete.\n                        \n                        The Details view also includes a\n                        \n                        icon that allows you to edit your DataFlow.\n                       \n\n\n                         See the Details view for a DataFlow by doing one of the following:\n                        \n\n\n\n\n                          In Domo, click\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Click\n                          \n                          in the left-hand navigation pane.\n                          \n                          The\n                          \n                           DataFlows\n                          \n                          tab opens.\n                         \n\n\n\n                          Locate and click the DataFlow you want to see details for.\n                          \n                          You can use the filter options to narrow down the DataFlows that appear in the list. For more information, see\n                          \n                           Data Center Layout\n                          \n                          .\n                          \n                          You can also open the DataFlow details view by mousing over the DataFlow entry, clicking the gear icon, and selecting\n                          \n                           Details\n                          \n                          .\n                         \n\n\n\n                        OR\n                       \n\n\n\n\n\n\n\n                            Important:\n                           \n                           Only Admins can access DataFlows details in this way.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                          In Domo, click\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Click\n                          \n                          in the left-hand navigation pane.\n                         \n\n\n\n                          Locate and click the output DataSet of the DataFlow you want to see the details for.\n                         \n\n\n\n                          Click\n                          \n                          and select\n                          \n                           View DataFlow\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            If you are not an Admin or the DataSet has either been removed as an output or the DataFlow has been deleted altogether, then clicking\n                            \n                             View DataFlow\n                            \n                            will cause nothing to happen.", "Preview Article": "Click here to preview", "URL Name": "360042923054", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004558", "Archived Date": "", "Language": "English", "Primary Version": "Viewing DataFlow Details", "Article Total View Count": "5,005", "": "", "Article Created Date": "10/24/2022, 10:14 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Viewing DataFlow Details\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               DataFlow Management\n              \n", "url": "/s/topic/0TO5w000000ZanUGAS"}]}