{"file_path": "../../raw_kb_v2\\article\\360043436673\\index.html", "content": {"title": "\n\n\n JSON Connector with Custom Parsing\n\n\n", "article_body": "\n\nIntro\n-------\n\nJavaScript Object Notation (JSON) is a lightweight data-interchange format that is easy to use. The Domo JSON Custom connector allows you to access JSON files that you have uploaded to an SFTP server. You can also import files via HTTP and HTTPS calls or upload them directly from your computer. To learn more about the JSON API, visit their page (\n\nhttp://jsonapi.org\n\n).\n\n\n You connect to your JSON account in the Data Center. This topic discusses the fields and menus that are specific to the JSON connector user interface. General information for adding DataSets, setting updating schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Best Practices\n----------------\n\nCheck your JSON code in a\n\nJSON validator\n\nbefore using the connector.\n\n\n Prerequisites\n---------------\n\nTo connect to your JSON account and create a DataSet, you must have credentials for the server in which the JSON file is found.\n\n\n Connecting to your JSON Account\n---------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the JSON Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your JSON account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Enter a username if using SFTP or Basic Authentication, otherwise, leave blank.\n  |\n|\n Password\n  |\n Enter a password if using SFTP or Basic Authentication, otherwise, leave blank.\n  |\n\nOnce you have entered valid JSON credentials, you can use the same account any time you go to create a new Custom JSON DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nIn this pane, you specify the server/SFTP site to connect to, the name of the JSON file, and other configuration settings.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Connection Type\n  |\n Select the type of connection you would like to make. The options include:\n * HTTP Request\n* File Transfer (SFTP)\n* Upload file containing JSON data\n |\n|\n Choose the HTTP Method to use\n  |\n If HTTP Request is selected as the\n **Connection Type**\n , choose from either GET or POST as the HTTP method.\n  |\n|\n Enter the URL to your JSON file\n  |\n Enter the URL of your JSON file.\n  |\n|\n How will you provide the certificate\n  |\n If HTTP Request is selected as the\n **Connection Type**\n , choose the method in which the certificate will be provided:\n * No certificate\n* URL Path to the Certificate\n* Certificate Content\n |\n\n\n####\n Advanced Settings\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n HTTPS Headers\n  |\n Enter the Key and Value of the HTTPS Headers. This option is only available for the HTTP Request Connection Type.\n  |\n|\n Query Parameters\n  |\n Enter the Key and Value of the Query Parameters. This option is only available for the HTTP Request Connection Type.\n  |\n|\n Date Query Parameters\n  |\n Select No Date Filter, Single Date, or Date Range as the Date Query Parameter. This option is only available for the HTTP Request Connection Type.\n  |\n|\n JSON Settings\n  |\n Specify whether your JSON text requires a line reader and if the backslash character should be escaped.\n  |\n\n\n###\n Parsing\n\n\n####\n Pagination\n\nSelect how to paginate the data:\n\n No Paging\n* Get next URL from results\n* Get next page token from results\n* Offset by records\n* Offset by pages\n\n\n####\n Parsing\n\nUsing the data preview, you can click on a column to format the data for parsing.\n\n##\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQ\n-----\n\n*What kind of credentials do I need to power up this connector?**\n\n\n For SFTP files you need the username and password. If you are importing data using HTTP, you may enter the username and password if your URL supports basic authentication. If needed, authentication can also be passed through parameters or headers.\n\n\n**How often can the data be updated?**\n\n\n DataSets can run as often as every 15 minutes.\n\n\n**Does this connector support paging?**\n\n\n Yes. In order to activate paging, select the paging type supported by your API and fill out the requested details.\n\n\n**How do I parse my data?**\n\n\n Select the column containing the data you want to expand or modify in the Parsing tab of the Parsing Pane. Hover over the suggested actions to see the effect and select the desired action by clicking on it. Repeat until the data looks the way you want it to look. Use the history section on the right to undo actions if desired.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436673\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003926\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nJSON Connector with Custom Parsing\n\n", "article_total_view_count": "\n\n\n 4,936\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "json_connector_with_custom_parsing", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}