{"file_path": "../../raw_kb_v2\\article\\360042934894\\index.html", "content": {"Title": "Viewing a User's Owned DataSets", "Article Body": "In a user's\n                        \n                         Profile\n                        \n                        page, you can see all of the DataSets that user owns. You can find this information in the\n                        \n\n                          Owned DataSets\n                         \n\n                        tab, which is located in the tab row under the user statistics panel.\n                       \n\n\n\n\n\n                         To see the DataSets a user owns,\n                        \n\n\n\n\n                          Navigate to that user's\n                          \n                           Profile\n                          \n                          page by clicking that user's profile picture anywhere it appears. If you want to see your own DataSets, you can access your personal\n                          \n\n                            Profile\n                           \n\n                          page by clicking your profile picture in the top right corner of the screen. (If you have not yet selected a profile picture, a\n                          \n                          icon appears instead.)\n                         \n\n\n\n                          Click\n                          \n\n                            Owned DataSets\n                           \n\n                          in the tab row under the user statistics panel.\n                         \n\n\n\n                        Each DataSet a user owns appears in its own entry in the tab. Each entry includes the DataSet name, an icon that indicates the connector type (such as Excel, Salesforce, etc.), the amount of time since the DataSet was last updated, the number of cards being powered by the DataSet, and the number of columns and rows in the DataSet.\n                       \n\n                        If you click a DataSet entry, you are taken to the\n                        \n\n                          Details\n                         \n\n                        view for the DataSet. For more information about this view, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042934894", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004380", "Archived Date": "", "Language": "English", "Primary Version": "Viewing a User's Owned DataSets", "Article Total View Count": "4,746", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Viewing a User's Owned DataSets\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}