{"file_path": "../../raw_kb_v2\\article\\360043439693\\index.html", "content": {"Title": "November 2018 Release Notes", "Article Body": "New Features and Enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        OpenID Connect (OIDC)\n                       \n\n                        Domo customers can now access Domo through OpenID Connect--an industry standard, lightweight method for Single Sign-On (SSO). Domo already supports the industry leading protocol SAML 2.0 for SSO. The addition of OpenID Connect provides customers with a simpler, lower cost option. OpenID Connect is also better-suited than SAML 2.0 for developers, mobile users, and Domo Embed users.\n                        \n\n                        OpenID Connect can be run in conjunction with SAML, which makes it easy for users to include both internal and external personnel in a single instance. This is particularly useful for companies that already utilize a stable SSO connection for their employees but want to extend Domo to their suppliers and customers.\n                       \n\n                        OpenID Connect is available now available for all customers.\n                       \n\n\n\n                        For more information, see\n                        \n                         Configuring Domo SSO Using OpenID Connect\n                        \n                        .\n                       \n\n                        Custom Security Roles\n                       \n\n                        Domo has always provided\n                        \n                         built-in security roles\n                        \n                        such as \"Admin,\" \"Privileged,\" and \"Participant\" that are used to restrict access to sensitive Domo features. These roles govern which users in your Domo instance can perform sensitive tasks such as exporting data, inviting users, and changing company settings. These built-in roles have not always provided the flexibility needed to meet the security needs of larger organizations. Now, with the Role Management tool, you can create and manage custom security roles, giving you more flexibility and finer granularity in assigning access to Domo's powerful features.\n                       \n\n                        Using Role Management, you can...\n                       \n\n\n\n                          Expand the list of roles beyond the current built-in roles (Admin, Privileged, Editor, Participant, and Social).\n                         \n\n\n\n                          Manage the privileges assigned to each new role.\n                         \n\n\n\n                          Delete unused roles.\n                         \n\n\n\n                          Get easy reporting on the privileges and list of assigned users in each new role.\n                         \n\n\n\n                          Use SSO to automatically assign people to appropriate roles through a SAML assertion at each login.\n                         \n\n\n\n                        You can create as many custom roles as needed for your organization.\n                       \n\n\n\n                        This feature is available\n                        \n                         on demand.\n                        \n                        To request that this feature be enabled...\n                       \n\n\n\n                          Contact Technical Support by using\n                          \n                           /support\n                          \n                          in Buzz or by emailing\n                          \n                           support@domo.com\n                          \n                          .\n                         \n\n\n\n                          Reach out to your Domo Customer Success Manager or Technical Consultant.\n                         \n\n\n\n                        For more information, see\n                        \n                         Managing Roles\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        Need help with Domo? Click the\n                        \n                        icon in the top navigation bar to access a wealth of knowledge in the Help Center.\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n                          \n                           /support\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439693", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004425", "Archived Date": "", "Language": "English", "Primary Version": "November 2018 Release Notes", "Article Total View Count": "4,669", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              November 2018 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}