{"file_path": "../../raw_kb_v2\\article\\360042924574\\index.html", "content": {"title": "\n\n\n Grouped and Stacked Bar Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nA grouped and stacked bar chart combines the features of a\n\nstacked bar chart\n\n. Categories in grouped and stacked bar charts always consist of two bars shown side-by-side, as in a grouped bar chart. When categories contain more than two series, one of these two bars appears as a typical bar, but the other is divided into series segments, as in a stacked bar chart. This may be useful in situations when you want to compare a primary series (such as a series representing sales data for your company headquarters) against several secondary series (such as those series representing sales data for branch offices).\n\n\n Grouped and stacked bar charts have both vertical and horizontal subtypes. Another related chart, the grouped and stacked bar with line chart, combines the features of a vertical grouped and stacked bar chart and a\n\nGrouped and Stacked Bar with Line Chart\n\n.\n\n\n By default, the first bar in any category grouping in a grouped and stacked bar chart appears as a normal, undivided bar, and the second bar in the category grouping is divided into series segments. However, you can change this default behavior in\n **Chart Properties**\n by entering the number of series you want to appear in the first bar.\n\n\n Powering grouped and stacked bar charts\n-----------------------------------------\n\nA grouped and stacked bar chart requires three data columns or rows from your DataSet—one for categories, one for the series in each category, and one for values. For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your grouped and stacked bar chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how the data from a typical column-based spreadsheet is converted into a vertical grouped and stacked bar chart:\n\nThe following graphic shows you how the data from a typical column-based spreadsheet is converted into a horizontal grouped and stacked bar chart:\n\nCustomizing grouped and stacked bar charts\n--------------------------------------------\n\nYou can customize the appearance of a grouped and stacked bar chart by editing its\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of grouped and stacked bar charts include the following:\n\n\n Property\n  |\n Description\n  |\n| --- | --- |\n|\n Bar Settings > First Bar Series Count\n  |\n Lets you specify how many series make up the first bar of any category. The default setting for this property is\n\n1\n\n, meaning the first bar is made up of only one series, and the second bar is divided up into all the remaining series. If you change this value, the first bar is divided into the indicated number of series, and the second bar is adjusted accordingly. For example, if a category contained three series, by default the first bar would contain one series and the second would contain the other two. However, if you entered\n\n2\n\nfor\n **First bar Series Count**\n , the first bar would be divided into two series, and the second bar would contain only one.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924574\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004710\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGrouped and Stacked Bar Chart\n\n", "article_total_view_count": "\n\n\n 7,906\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:25 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "grouped_and_stacked_bar_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}