{"file_path": "../../raw_kb_v2\\article\\360042924774\\index.html", "content": {"Title": "Multi-Value Gauge", "Article Body": "Intro\n                        \n\n\n\n                        A gauge is a simple chart that indicates progress towards meeting a target. A multi-value gauge displays the current value of your as DataSet as a numeral, along with the degree of change for the gauge data, whether positive or negative. You can aggregate the current value of the gauge using any of a variety of aggregation functions (sum, average, minimum or maximum value, etc.). You can also show the degree of change as a percentage or a value. In addition, a number of other customization options are available.\n                       \n\n                        This chart type is useful when you want to see a change in value quickly, without having to interpret bars, lines, etc. This gauge is similar to a\n                        \n                         single value gauge\n                        \n                        , which displays the current value without the degree of change indicator. Other gauge types in Domo include\n                        \n                         filled gauges\n                        \n                        ,\n                        \n                         progress bar gauges\n                        \n                        ,\n                        \n                         radial gauges\n                        \n                        ,\n                        \n                         face gauges\n                        \n                        , and\n                        \n                         comparative fill gauges\n                        \n                        .\n                       \n\n                        Powering multi-value gauges\n                       \n\n                        A multi-value gauge requires only one column or row of data in your DataSet, which should contain the values. You can also include an optional column for grouping your data. In most cases, this will be a date column; this way, your change value will reflect change in the data over time. Finally, you can apply a column of target values to the gauge by clicking the\n                        \n                         Tooltips\n                        \n                        icon at the top of the screen then dragging the desired column into the\n                        \n                         Target Values\n                        \n                        field that opens. Target values are not reflected in the gauge itself but may be referenced using certain chart properties, which are discussed later in this article.\n                       \n\n                        For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        For more information about aggregating data, see\n                        \n                         Aggregating your data\n                        \n                        .\n                       \n\n                        For more information about\n                        \n                         Chart Properties\n                        \n                        , see\n                        \n                         Chart Properties\n                        \n                        .\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your multi-value gauge. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         KPI Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from the category and value columns in a typical column-based spreadsheet is converted into a multi-value gauge:\n                       \n\n\n\n\n                        Customizing multi-value gauges\n                       \n\n                        You can customize the appearance of a multi-value gauge by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Setting Properties for Gauges\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Property\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n                             Example\n                            \n\n\n\n\n\n\n\n\n\n                             General > Layout\n                            \n\n\n\n\n\n\n\n\n\n\n                              Lets you one of a number of different layouts for the values in your gauge. (\n                              \n                               Split Right\n                              \n                              is the default.) At right, you can see an example of each layout.\n                             \n\n\n\n\n\n                              Note that for the\n                              \n                               Domo Summary 1\n                              \n                              and\n                             \n\n\n\n                              Domo Summary 2\n                             \n                             layouts, the date grain elements (e.g. \"by Day\") only appear if you turn them on using the\n                             \n                              Date Grain Options > Show\n                             \n                             option.\n                            \n\n\n\n\n\n\n                              Domo Summary 1\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n                              Domo Summary 2\n                              \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Horizontal\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n                              Split Right\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n                              Split\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n                              Split Left\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n                              Center Vertical\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             General > Sizing\n                            \n\n\n\n\n\n                             Lets you select a size option for gauge elements.\n                             \n                              Scale to Fit\n                             \n                             , the default option, fills the card space with the selected elements. All fixed size options sets elements to different sizes, relative to other elements. Fixes sizes allow for consistency between cards but do not check for overlapping text.\n                            \n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             General > Vertical Alignment\n                            \n\n\n\n\n\n                             Lets you determine the vertical alignment for the elements within the gauge.\n                             \n                              Middle\n                             \n                             is the default.\n                            \n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Title Options > Text\n                            \n\n\n\n\n\n                             Lets you add a title to your gauge. The title text actually appears within the content area of the gauge (so it is separate from the card name). The title is incorporated into the layout you have selected in\n                             \n                              General > Layout\n                             \n                             . In the example, it is used with the\n                             \n                              Center Vertical\n                             \n                             layout.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Title Options > Color\n                            \n\n\n\n\n\n                             Lets you set the color for your title. You can choose colors from a color picker, enter a hexadecimal value, or change the opacity using a slider. This option is only available when text has been entered into the\n                             \n                              Title Options > Text\n                             \n                             field.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Title Options > Style\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n                              Lets you choose the style for your title. You can choose bold, italic, or bold with italic. This option is only available when text has been entered into the\n                              \n                               Title Options > Text\n                              \n                              field.\n                             \n\n\n\n\n\n                              In the example, the\n                              \n                               Bold Italic\n                              \n                              style is used.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Title Options > Size\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n                              Lets you set the size of your title in relation to the other text in the gauge. A variety of sizes is available.\n                              \n                               X-Small\n                              \n                              is the default.\n                             \n\n\n\n\n\n                              In the example, the\n                              \n                               X-Large\n                              \n                              size is used.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Value Options > Hide\n                            \n\n\n\n\n\n                             Lets you hide the value of the gauge. This is useful when you\n                             \n                              only\n                             \n                             want your users to see the degree of change rather than a specific value.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Value Options > Value\n                            \n\n\n\n\n\n\n                              Lets you specify the value for the gauge. A variety of calculations are available for determining the value:\n                              \n\n\n\n\n\n\n\n\n\n                                 Last Value\n                                \n\n\n\n\n\n                                 The last value in the DataSet is used. This is the default option.\n                                \n\n\n\n\n\n\n\n                                 First Value\n                                \n\n\n\n\n\n                                 The first value in the chart is used.\n                                \n\n\n\n\n\n\n\n                                 Sum\n                                \n\n\n\n\n\n                                 The total of all of the values in the chart is used.\n                                \n\n\n\n\n\n\n\n                                 Average\n                                \n\n\n\n\n\n                                 The average of all of the values in the chart is used.\n                                \n\n\n\n\n\n\n\n                                 Minimum\n                                \n\n\n\n\n\n                                 The lowest value out of all values in the chart is used.\n                                \n\n\n\n\n\n\n\n                                 Maximum\n                                \n\n\n\n\n\n                                 The highest value out of all values in the chart is used.\n                                \n\n\n\n\n\n\n\n                                 Count\n                                \n\n\n\n\n\n                                 The number of individual values in the chart is used.\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Value Options > Size\n                            \n\n\n\n\n\n\n                              Lets you set the size of the gauge value in relation to the other text in the gauge. A variety of sizes is available.\n                              \n                               Medium\n                              \n                              is the default.\n                             \n\n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Value Options > Color\n                            \n\n\n\n\n\n\n                              Lets you set the color for your gauge value. You can choose colors from a color picker, enter a hexadecimal value, or change the opacity using a slider.\n                             \n\n\n\n\n\n                              In the example, the value has been set to blue.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Value Options > Use Change Color\n                            \n\n\n\n\n\n                             Lets you dynamically match the color of the gauge value to that of the change value. If another color has been selected for the gauge value, it will be overridden by the change value color.\n                            \n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Change Value Options > Hide\n                            \n\n\n\n\n\n                             Lets you hide the change value of the gauge. This is useful when you\n                             \n                              only\n                             \n                             want your users to see the specific value rather than the degree of change.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Change Value Options > Value\n                            \n\n\n\n\n\n                             Lets you specify whether the degree of change in your chart is represented as a percentage (default) or a change in the specific value.\n                            \n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Change Value Options > Data\n                            \n\n\n\n\n\n\n                              Determines how the degree of change in the gauge is calculated. A variety of calculations are available for determining the degree of change:\n                              \n\n\n\n\n\n\n\n\n\n                                 First and Last Values\n                                \n\n\n\n\n\n                                 The difference between the first and last values in your DataSet is used. This is the default setting.\n                                \n\n\n\n\n\n\n\n                                 Last 2 Values\n                                \n\n\n\n\n\n                                 The difference between the last two values in your DataSet is used.\n                                \n\n\n\n\n\n\n\n                                 Last and X Periods Ago\n                                \n\n\n\n\n\n                                 The difference between the last value and the specified number of date grain periods as determined from your DataSet. For example, if your DataSet was broken down by week, and you entered\n                                 \n                                  3\n                                 \n                                 in the\n                                 \n                                  Periods Ago\n                                 \n                                 field, your change value would be the difference between the last value in the DataSet and the value for three weeks ago.\n                                \n\n\n\n\n\n\n\n                                 Last Target Value and Last Value\n                                \n\n\n\n\n\n                                 The difference between the last value in your\n                                 \n                                  Gauge Values\n                                 \n                                 column and the last value in your\n                                 \n                                  Target Values\n                                 \n                                 column. Note that the field for applying a target values column appears only when you click\n                                 \n                                  Tooltips\n                                 \n                                 in the toolbar at the top of Analyzer.\n                                \n\n\n\n\n\n\n\n                                 Penultimate Target Value and Penultimate Value\n                                \n\n\n\n\n\n                                 The difference between the second-to-last value in your\n                                 \n                                  Gauge Values\n                                 \n                                 column and the second-to-last value in your\n                                 \n                                  Target Values\n                                 \n                                 column. Note that the field for applying a target values column appears only when you click\n                                 \n                                  Tooltips\n                                 \n                                 in the toolbar at the top of Analyzer.\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Change Value Options > Periods Ago\n                            \n\n\n\n\n\n\n                              Lets you specify the number of past date grain periods to use in your calculation when\n                              \n                               Last and X Periods Ago\n                              \n                              is selected in the\n                              \n                               Change Value Options > Data\n                              \n                              menu.\n                             \n\n\n\n\n\n                              For example, if your DataSet was broken down by week, and you entered\n                              \n                               3\n                              \n                              in the\n                              \n                               Periods Ago\n                              \n                              field, your change value would be the difference between the last value in the DataSet and the value for three weeks ago.\n                             \n\n\n\n\n\n\n                             —\n                             \n\n\n\n\n\n\n\n\n                             Change Value Options > Size\n                            \n\n\n\n\n\n                             Lets you set the size of the change value in relation to the other text in the gauge. A variety of sizes is available.\n                             \n                              Small\n                             \n                             is the default.\n                            \n\n\n\n\n\n                             —\n                             \n\n\n\n\n\n\n\n\n                             Change Value Options > Hover Text\n                            \n\n\n\n\n\n                             Lets you specify the hover text that appears when a user mouses over the change value in the gauge. A variety of replacement macros is available. For more information, see\n                             \n                              Formatting Data Label and Hover Text in Your Chart\n                             \n                             .\n                            \n\n\n\n\n\n                             —\n                             \n\n\n\n\n\n\n\n\n                             Change Value Options > Direction Indicator\n                            \n\n\n\n\n\n                             Specifies whether the symbol used to represent change in the change value is an arrow (default), a curved arrow, or a triangle. Examples of all three of these are shown at right.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Change Value Options > Indicator Position\n                            \n\n\n\n\n\n                             Lets you specify whether the change indicator symbol next to your gauge's change value appears before the value (the default) or after (which is shown in the example at right).\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Change Value Options > Color Indicator Only\n                            \n\n\n\n\n\n                             When checked, only the indicator symbol will take on the color specified in\n                             \n                              Change Value Options > Positive Color\n                             \n                             or\n                             \n                              Change Value Options > Negative Color\n                             \n                             . The change value itself will appear dark gray.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Change Value Options > Reverse Color Direction\n                            \n\n\n\n\n\n                             When checked, positive values are shown using the color you have selected in the\n                             \n                              Change Value Options > Negative Color\n                             \n                             menu, and negative values are shown using the color you have selected in the\n                             \n                              Change Value Options > Positive Color\n                             \n                             menu. This is useful in scenarios where positive values are associated with negative sentiment (e.g. the number of bugs reported in a software application).\n                            \n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Change Value Options > Value Format\n                            \n\n\n\n\n\n                             Determines whether the general number format for your change value. Options include\n                             \n                              Number\n                             \n                             (which includes no special formatting),\n                             \n                              Currency\n                             \n                             (in which a currency symbol is affixed), and\n                             \n                              Percentage\n                             \n                             (in which a percent symbol is affixed).\n                            \n\n\n\n\n\n                             —\n                             \n\n\n\n\n\n\n\n\n                             Change Value Options > Positive Color\n                            \n\n\n\n\n\n                             Lets you specify the color associated with positive change in your change value. You can choose colors from a color picker, enter a hexadecimal value, or change the opacity using a slider. The default color is green.\n                            \n\n\n\n\n\n                             —\n                             \n\n\n\n\n\n\n\n\n                             Change Value Options > Negative Color\n                            \n\n\n\n\n\n                             Lets you specify the color associated with negative change in your change value. You can choose colors from a color picker, enter a hexadecimal value, or change the opacity using a slider. The default color is red.\n                            \n\n\n\n\n\n                             —\n                             \n\n\n\n\n\n\n\n\n                             Additional Text Options > Text\n                            \n\n\n\n\n\n                             Lets you specify additional text to appear under the regular content in the gauge. A variety of replacement macros is available for dynamically including calculations in the text. For example, in the screenshot at right, the gauge shows the average stock price for the period in addition to the gauge value and change value. For more information about macros, see\n                             \n                              Formatting Data Label and Hover Text in Your Chart\n                             \n                             .\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Additional Text Options > Color\n                            \n\n\n\n\n\n                             Lets you specify the color used for additional text in the gauge. You can choose colors from a color picker, enter a hexadecimal value, or change the opacity using a slider. The default color is black. This option is only available if additional text has been added using the\n                             \n                              Additional Text Options > Text\n                             \n                             field.\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Additional Text Options > Style\n                            \n\n\n\n\n                            Lets you choose the style for your additional text. You can choose bold, italic, or bold with italic. This option is only available when text has been entered into the\n                            \n                             Additional Text > Text\n                            \n                            field.\n                           \n\n                            In the example, the\n                            \n                             Bold Italic\n                            \n                            style is used.\n                           \n\n\n\n\n\n\n\n\n\n                             Additional Text Options > Size\n                            \n\n\n\n\n\n                             Lets you set the size of the additional text in relation to the other text in the gauge. A variety of sizes is available. If you do not scale to fill the chart space, this will be a fixed size. This option is only available when text has been entered into the\n                             \n                              Additional Text > Text\n                             \n                             field.\n                            \n\n\n\n\n\n                             —\n                            \n\n\n\n\n\n\n\n                             Date Grain Options > Show\n                            \n\n\n\n\n\n                             Determines whether to show the date grain (e.g. \"by Day\" for day-based DataSets) in multivalue gauges with the layout (\n                             \n                              General > Layout\n                             \n                             ) set to\n                             \n                              Domo Summary 1\n                             \n                             or\n                             \n                              Domo Summary 2\n                             \n                             .\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Date Grain Options > Color\n                            \n\n\n\n\n\n\n                              Lets you specify the color used for date grain elements in the gauge. You can choose colors from a color picker, enter a hexadecimal value, or change the opacity using a slider. The default color is black. This option is only available if you have enabled date grain elements by selecting\n                              \n                               Date Grain Options > Show\n                              \n                              .\n                             \n\n\n\n\n\n                              Date grain elements only appear in the gauge when you select\n                              \n                               Domo Summary 1\n                              \n                              or\n                              \n                               Domo Summary 2\n                              \n                              in\n                              \n                               General > Layout\n                              \n                              .\n                             \n\n\n\n\n\n                              In the example, this color has been set to red.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Date Grain Options > Style\n                            \n\n\n\n\n\n\n                              Lets you choose the style for your date grain elements. You can choose bold, italic, or bold with italic. This option is only available if you have enabled date grain elements by selecting\n                              \n                               Date Grain Options > Show\n                              \n                              .\n                             \n\n\n\n\n\n                              Date grain elements only appear in the gauge when you select\n                              \n                               Domo Summary 1\n                              \n                              or\n                              \n                               Domo Summary 2\n                              \n                              in\n                              \n                               General > Layout\n                              \n                              .\n                             \n\n\n\n\n\n                              In the example, the\n                              \n                               Bold Italic\n                              \n                              style is used.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Date Grain Options > Size\n                            \n\n\n\n\n\n\n                              Lets you set the size of the date grain elements in relation to the other text in the gauge. A variety of sizes is available. If you do not scale to fill the chart space, this will be a fixed size.\n                              \n\n                              This option is only available if you have enabled date grain elements by selecting\n                              \n                               Date Grain Options > Show\n                              \n                              .\n                             \n\n\n\n\n\n                              Date grain elements only appear in the gauge when you select\n                              \n                               Domo Summary 1\n                              \n                              or\n                              \n                               Domo Summary 2\n                              \n                              in\n                              \n                               General > Layout\n                              \n                              .\n                             \n\n\n\n\n\n\n                             —", "Preview Article": "Click here to preview", "URL Name": "360042924774", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004691", "Archived Date": "", "Language": "English", "Primary Version": "Multi-Value Gauge", "Article Total View Count": "5,720", "": "", "Article Created Date": "10/24/2022, 10:22 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Multi-Value Gauge\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}