{"file_path": "../../raw_kb_v2\\article\\360043432053\\index.html", "content": {"title": "\n\n\n The Trade Desk Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Trade Desk is an online demand-side platform that provides buying tools for digital media buyers. Use Domo's The Trade Desk connector to generate reports about ads, audiences, campaigns, and the like. To learn more about The Trade Desk's API, visit their page (\n\nhttps://api.thetradedesk.com/v3/doc\n\n).\n\n\n You connect to your The Trade Desk account in the Data Center. This topic discusses the fields and menus that are specific to the The Trade Desk connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is useful for pulling data about ads and campaigns filtered by one or more advertisers.\n  |\n|\n**Primary Company Roles**\n |\n Marketing roles\n  |\n|\n**Average Implementation Time**\n |\n Less than an hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 3\n  |\n\nBest Practices\n----------------\n\n\n* It is best to select\n **All Advertisers**\n in the\n **Advertiser Type**\n menu instead of choosing to manually select advertisers. This way, as you add/remove advertisers, the DataSet will dynamically grab those advertisers when it runs in the future. That way you don't have to go back and edit your DataSet after you make changes.\n\nPrerequisites\n---------------\n\nTo connect to your The Trade Desk account and create a DataSet, you must have the following:\n\n The username and password for your The Trade Desk account\n* Your The Trade Desk partner ID\n\nIf you do not know any of these credentials, please reach out to your The Trade Desk account representative.\n\n\n Connecting to Your The Trade Desk Account\n-------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the The Trade Desk Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Credentials Pane\n-------------------\n\n\n This pane contains fields for entering credentials to connect to your The Trade Desk account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter your The Trade Desk username.\n  |\n|\n Password\n  |\n Enter your The Trade Desk password.\n  |\n|\n Environment\n  |\n Select whether you are using a production or sandbox environment.\n  |\n|\n Partner ID\n  |\n Enter your The Trade Desk partner ID.\n  |\n\n\n Once you have entered valid The Trade Desk credentials, you can use the same account any time you go to create a new The Trade Desk DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\nDetails Pane\n--------------\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the The Trade Desk report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Ad Formats supported\n  |\n Get the Ad Formats supported by The Trade Desk.\n  |\n|\n Ad Groups with an Advertiser\n  |\n Query for a page of Ad Groups within an Advertiser.\n  |\n|\n Ad Groups with a campaign\n  |\n Retrieves ad groups associated with a selected campaign.\n  |\n|\n Ad Technologies\n  |\n Get the available Ad Technologies.\n  |\n|\n Advertisers\n  |\n Retrieves all advertisers that belong to the specified partner.\n  |\n|\n App Event Tracking for an Advertiser\n  |\n Retrieve a list of AppEventTrackers set up for a particular advertiser, along with some basic activity statistics.\n  |\n|\n Audiences owned by an Advertiser\n  |\n Retrieves the Audiences owned by an Advertiser.\n  |\n|\n Campaigns belonging to an Advertiser\n  |\n Retrieves all Campaigns that belong to the specified Advertiser.\n  |\n|\n Creatives belonging to an Advertiser\n  |\n Retrieves all of an advertiser's creatives.\n  |\n|\n Data Groups owned by an Advertiser\n  |\n Retrieves all the Data Groups owned by an Advertiser\n  |\n|\n First Party Data by Advertiser\n  |\n Get the First Party Data that matches the query.\n  |\n|\n Geo Segments available to an Advertiser\n  |\n Retrieves all the Geo Segments available for use by an Advertiser.\n  |\n|\n My Reports - Advertisers\n  |\n Downloads the selected report for the selected advertiser ids and date range.\n  |\n|\n My Reports - Advertisers Schedule Creation\n  |\n Create report schedule and download the scheduled report for selected advertiser ids and the date range.\n  |\n|\n My Reports - Partner Execution Report\n  |\n Downloads the selected report for the selected date range.\n  |\n|\n Right Media Offer Types\n  |\n Retrieves all the Right Media Offer Types.\n  |\n|\n Site Lists Summaries belonging to an Advertiser\n  |\n Retrieves summaries of the Site Lists that belong to an Advertiser.\n  |\n|\n Summaries IP Targeting List for an Advertiser\n  |\n Get summaries of the IP Targeting Lists that belong to an Advertiser.\n  |\n|\n Supply Vendors\n  |\n Get the Supply Vendors available to this Partner\n  |\n|\n Third Party Data by Advertiser\n  |\n Retrieves the facets of Third Party Data that can be retrieved and/or queried by the Advertiser\n  |\n|  |  |\n\n|\n|\n Advertiser Type\n  |\n Select whether you want your report to retrieve data for all advertisers or only those you select.\n  |\n|\n Select Advertiser\n  |\n Select whether to retrieve all or some advertiser.\n  |\n|\n Advertiser\n  |\n Select all of the advertisers you want to retrieve data for.\n  |\n|\n Campaign\n  |\n Select the campaign you want to retrieve data for.\n  |\n|\n Enter Report Name\n  |\n Make sure to enter the correct report name as it is case sensitive.\n  |\n|\n Scope\n  |\n Select the scope for the report, either\n **Advertiser**\n or\n **Partner**\n .\n  |\n|\n Number of Days Back\n  |\n Enter the number of past days you want to pull information for.\n  |\n|\n Specific Date\n  |\n Select the date you want to retrieve information for.\n  |\n|\n Delimiting character\n  |\n Select the delimiting character used in your file. If your delimiter is not listed select 'Other'\n  |\n|\n Specify your delimiter\n\n|\n Enter the character used to delimit your character separated values (CSV) text.\n  |\n|\n Quote Character\n\n|\n Select the desired quote character for parsing CSV files. (A double quote is the CSV standard.)\n  |\n|\n Custom Quote Character\n\n|\n Enter the desired CSV Quote character.\n  |\n\nOther Panes\n-------------\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQ\n-----\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the login username, password, and partner id associated with your The Trade Desk account. If you do not know any of these credentials, please reach out to your Trade Desk account representative.\n\n###\n Can I use the same account multiple times to create datasets?\n\nYes\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n\n Troubleshooting\n-----------------\n\nIf you run into issues, try going into the\n **Accounts**\n page in Domo and making sure the account you linked is still validated. If not, revalidate it.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043432053\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003698\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nThe Trade Desk Connector\n\n", "article_total_view_count": "\n\n\n 4,775\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "the_trade_desk_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}