{"file_path": "../../raw_kb_v2\\article\\360047403773\\index.html", "content": {"title": "\n\n\n Understanding the Workbench 4 User Interface\n\n\n", "article_body": "\n\n\n**Important:**\n Support for Workbench 4 ended on\n **April 15, 2021**\n . Workbench may continue to run on installed machines, but it will no longer receive feature enhancements and security updates. When issues are encountered in Workbench 4, the recommended course of action from the Domo Support team will be to upgrade to the latest version of Workbench 5. To see this article for Workbench 5, click\n\n*here**\n\n.\n\nIntro\n-------\n\nIn the Workbench application, you can connect to your Domo server; configure settings for creating DataSet Jobs; import and export job files; preview, schedule, validate, and run jobs; etc.\n\n\n This topic discusses the user interface components of Workbench.\n\n\n Workbench Interface\n---------------------\n\nThe following screenshot points out the main sections of the Workbench user interface. These sections are discussed in more detail throughout the remainder of this topic.\n\nThe following table describes the sections pointed out in the preceding screenshot:\n\n\n Section\n  |\n Description\n  |\n| --- | --- |\n|\n Accounts pane\n  |\n Lists all connected accounts. For each account, you can access\n **Logs**\n and\n **Settings**\n options, along with all of the DataSet Jobs associated with the account. For each DataSet Job, you can access options such as\n **Settings**\n ,\n **Schedule**\n ,\n **Transforms**\n , etc. Clicking an item in the\n **Accounts**\n pane opens information or options for that item in the Dynamic Options pane in the center of the application. For example, selecting\n **Settings > Account**\n for a particular account would open options for configuring this account in the Options pane.\n\n\n You can move the\n **Accounts**\n pane anywhere on the screen by clicking on the pushpin icon in the top corner of the pane and dragging the pane.\n\n\n For more information about adding accounts, see\n\nAdding an Account in Workbench 4\n\n.\n  |\n|\n Buttons toolbar\n  |\n Provide access to various Workbench options. Buttons are divided across two tabs—\n **Home**\n and\n **More**\n . The\n **Home**\n tab provides options for working with accounts, DataSet jobs, and transforms. The\n **More**\n tab provides options for getting help with Workbench, such as accessing online help, opening help videos, viewing log files, etc., and also provides access to the Plugin Manager.\n  |\n|\n Job status pane\n  |\n Provides you with insights around when jobs are being run and allows you to make changes, pause, cancel and run jobs.\n  |\n|\n Dynamic Options pane\n  |\n Provides information and/or options depending on the item currently selected in the\n **Accounts**\n pane.\n  |\n|\n Preview/output panes\n  |\n Show preview and output information for a DataSet job. These panes are not populated until you click\n **Preview**\n for a DataSet job in the buttons toolbar at the top of the screen. A tab for the DataSet job is then added to both the\n **Preview**\n and\n **Output**\n panes. If you click\n **Preview**\n for another DataSet job, separate tabs for that job are added to the\n **Preview**\n and\n **Output**\n panes.\n  |\n\nButtons toolbar\n-----------------\n\nThe options in the Buttons toolbar provide various functions within Workbench. These are organized into two tabs,\n **Home**\n and\n **More**\n . You can switch between these by clicking\n **Home**\n or\n **More**\n at the top of the window.\n\n##\n Home buttons\n\nThe buttons in the\n **Home**\n tab provide options for working with accounts, DataSet Jobs, and transforms.\n\n\n Button\n  |\n Description\n  |\n| --- | --- |\n|\n Add New (Account)\n  |\n Opens the account creation wizard so you can add a new server account to your Workbench. For more information, see\n\nAdding an Account in Workbench 4\n\n.\n  |\n|\n Delete (Account)\n  |\n Lets you delete a server account from Workbench.\n  |\n|\n Save (Account)\n  |\n Lets you save changes made to the account in the\n **Settings**\n options.\n  |\n|\n Add New (DataSet Job)\n  |\n Opens the DataSet Job Creation Wizard so you can add a new DataSet Job to Workbench. For more information, see\n\nCreating a Job for Uploading Data Using Workbench 4\n\n.\n  |\n|\n Delete (DataSet Job)\n  |\n Lets you delete one or more DataSet Jobs from Workbench. You can also delete a DataSet Job by right-clicking on the job name in the\n **Accounts**\n pane and selecting\n **Delete DataSet Job**\n .\n  |\n|\n Save (DataSet Job)\n  |\n Lets you save changes made to the DataSet Job currently selected in the\n **Accounts**\n pane.\n  |\n|\n Revert\n  |\n Cancels all changes made to the currently selected DataSet Job since you last saved.\n  |\n|\n Preview\n  |\n Opens a preview of the currently open job in the\n **Preview**\n field and an output log in the\n **Output**\n field. You can also open the preview and output log for a DataSet Job by right-clicking on the job name in the\n **Accounts**\n pane and selecting\n **Preview DataSet Job**\n .\n  |\n|\n Run\n  |\n Runs the currently selected DataSet Job, i.e. builds or updates the specified DataSet in Domo. You can also execute a job by right-clicking on the job name in the\n **Accounts**\n pane and selecting\n **Execute DataSet Job**\n .\n  |\n|\n Cancel\n  |\n Cancels a currently running DataSet Job.\n  |\n|\n Tools\n  |\n Provides access to a number of options, including the following:\n\n\n|  |  |\n| --- | --- |\n|\n Import\n  |\n Lets you import a DataSet Job file in JSON format into Workbench.\n  |\n|\n Export\n  |\n Lets you export DataSet Job files from Workbench in JSON format.\n\n\n New with Workbench 4.5.1, you can bulk-export Jobs. If you choose this option while\n **DataSet Jobs**\n or anything higher is selected in your hierarchy, Workbench returns all Jobs in your account. You can then export as many Jobs as you want just by clicking their checkboxes then choosing the directory you want to export them to.\n\n\n If you choose the\n **Export**\n option while a Job is selected in the hierarchy, your File Explorer opens, allowing you to select a single Job for export.\n\n\n You can also export a DataSet Job by right-clicking on the job name in the\n **Accounts**\n pane and selecting\n **Export DataSet Job**\n .\n  |\n|\n Schedule\n  |\n Lets you set up and manage groups of DataSet Jobs with the same update schedule. For more information, see\n\nCreating a Schedule Group in Workbench 4\n\n.\n  |\n|\n Fetch Jobs\n  |\n Checks to see if there are DataSet Jobs that need to be run.\n  |\n|\n Migrate\n  |\n Searches for Workbench 2 DataSet Jobs and allows you to migrate them into Workbench 4.\n  |\n\n|\n|\n Add New (Transform)\n  |\n Lets you add a transform to the currently selected DataSet Job. Transforms let you transform the data in a DataSet in a number of ways, including changing the date format, encrypting sensitive data, creating calculated fields, etc.\n\n\n For more information, see all of the following:\n * Creating Columns in Workbench 4 Using Calculations\n* Setting the Time Zone for a Workbench 4 Job\n* Encrypting and Decrypting Workbench 4 Data\n* Setting a Custom Date Format on a Column in Workbench 4\n* Filtering Columns in Workbench 4\n* Replacing a Column Value in Workbench 4\n* Combining DataSets in Workbench 4\n |\n|\n Delete (Transform)\n  |\n Deletes the currently selected transform.\n  |\n|\n Authorize Company File (QuickBooks only)\n  |\n Lets you authorize Workbench to connect to the selected QuickBooks file. For more information, see\n\nConnecting to QuickBooks data\n\n.\n  |\n\n\n###\n More buttons\n\nThe buttons in the\n **More**\n tab provide options for getting help with Workbench and accessing the Plugin Manager.\n\n\n Button\n  |\n Description\n  |\n| --- | --- |\n|\n Send Logs\n  |\n Copies your log files to your Windows Clipboard so you can email them to Domo as a\n\n.zip\n\nfile.\n  |\n|\n View Logs\n  |\n Opens the log file folder in Windows Explorer. Typically, log files are located in\n\nC:\\ProgramData\\DomoWorkbench\n\n. You can open log (\n\n.txt\n\n) files in a text editor.\n\n\n Log files for manual or scheduled jobs are named based on the job (\n\n.xml\n\n) filename and the date:\n\nmyjob\\_yyyy-mm-dd\n\n.\n\n\n Log entries for jobs run at the command line are named based on the application name and the date:\n\nDomoWorkbench\\_yyyy-mm-dd\n\n. For more information about running Workbench from the command line, see\n\nRunning Workbench 4 from the command line\n\n.\n  |\n|\n Wiki\n  |\n Opens Domo's Workbench help documentation.\n  |\n|\n Community\n  |\n Opens the Workbench help forum.\n  |\n|\n Videos\n  |\n Opens training videos for Workbench.\n  |\n|\n Plugins\n  |\n Opens the Plugin Manager. Here you can see existing plugins by category and add new plugins for use in Workbench. For more information, see\n\nManaging Plugins in Workbench 4\n\n.\n  |\n\nAccounts pane\n---------------\n\nIn the\n **Accounts**\n pane, you can view logs, edit settings, and access DataSet Job options for individual accounts. Clicking any item in this list (except for top-level accounts) opens information and/or options in the Dynamic Options panel in the center of Workbench.\n\n\n Items in this pane are laid out in a tree structure with five levels of navigation, with accounts on the topmost level. Each account includes the following branches, which make up the second level of navigation:\n **Logs**\n ,\n **Settings**\n , and\n **DataSet Jobs**\n .\n **Settings**\n includes three sub-branches—\n **Account**\n ,\n **Proxy**\n , and\n **Updates,**\n and\n **DataSet Jobs**\n includes a sub-branch for each DataSet job associated with this account; these make up the third level of navigation. For each job sub-branch, these options are available:\n **Settings**\n ,\n **Schedule**\n ,\n **Source**\n ,\n **Schema**\n ,\n **Transforms**\n ,\n **Notifications**\n , and\n **Logs**\n (fourth level). In addition,\n **Transforms**\n may include one or more sub-branches of its own (fifth level).\n\n\n The following screenshot shows an example of this tree structure:\n\nA\n\nto the left of a list item indicates that there are items hidden beneath it; click the icon to expand those items. Click\n\nto the left of an item to collapse the items beneath that item.\n\n\n You can drag the\n **Accounts**\n pane anywhere you want it in the Workbench interface. When you drag the pane, arrow buttons appear, indicating the top, bottom, left side, and right side of the interface. If you drag the pane onto one of these buttons, the corresponding area of the interface is highlighted. Dropping the pane onto a button causes it to be \"docked\" in the corresponding area. For example, if you dropped the pane onto either up arrow, it would dock in the upper portion of the Workbench window.\n\n*Note:**\n A pane must be in Dock mode to be draggable. To put a pane in Dock mode, click the sideways pushpin icon\n\n. This allows you to drag it and dock it.\n\n\n###\n Jobs List\n\nYou can open the jobs list view by clicking\n **View Jobs List**\n just above the status panel. This list view allows you to search and sort DataSet jobs, see upcoming schedules, and organize jobs by status, giving better visibility into jobs to facilitate job management in an instance.\n\n\n###\n Logs\n\nWhen you click\n **Logs**\n for a given account, the logs for that account are shown in the Dynamic Options panel.\n\nLog information is shown chronologically in reverse. You can show the logs for any day by clicking in the\n **Log Date**\n menu and selecting the desired date from the date picker. You can sort the logs in chronological or reverse chronological order. You can also filter logs by error level (\n\nERROR\n\n,\n\nINFO\n\n, or\n\nWARN\n\n).\n\n##\n Settings\n\nIn\n **Settings**\n , you can see a connection summary, change your account information, configure proxy settings, and set your update URL and frequency. You can access settings options by clicking\n **Settings**\n or any of its subtabs in the pane on the left side of Workbench. (Note that there are two\n **Settings**\n items available in the\n **Accounts**\n pane. The version of\n **Settings**\n discussed here refers to the one on the 2nd level of navigation, located under\n **Logs**\n . These settings are used to configure account and connection details in your Workbench, while the settings discussed later on are specific to DataSet Jobs.)\n\n###\n Connection summary\n\nClick\n **Settings**\n to see a summary of your connection information, including your agent ID, Domo server, job check frequency, proxy, and software update settings.\n\n\n####\n Account tab\n\nLets you edit your connection information for Domo.\n\nYou can refer to the following table to find out more about the components in this tab:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Domo Server\n  |\n The URL for the connected server, which you specify when you set up your Workbench account.\n  |\n|\n API Key\n  |\n The API key for the account to use in connecting to Domo. You can generate a new API key by clicking the arrow on the right side of the field, entering your email address and password, and clicking\n **Create Token**\n .\n  |\n|\n Ignore Certificate Errors\n  |\n If turned on, certificate errors are ignored when connecting to this server.\n\n\n |\n|\n Test Connection\n  |\n Lets you test the provided connection credentials.\n  |\n|\n Check for new DataSet Job every\n  |\n Specifies the frequency at which Workbench checks to see if DataSet Jobs need to be processed. Units range from\n **Seconds**\n to\n **Years**\n . Set\n **Never**\n if you don't want Workbench to check for unprocessed jobs.\n  |\n|\n Limit Concurrent Jobs\n  |\n Lets you limit the number of DataSet Jobs that may run at the same time.\n  |\n|\n Only run locally managed jobs\n  |\n If checked, Workbench runs only DataSet Jobs managed locally,\n *not*\n those on networks.\n  |\n|\n Require impersonation credentials for all jobs (Workbench 4.5 only)\n  |\n If checked, Workbench requests non-default credentials for all DataSet Jobs (that is, the\n **Requires Impersonation**\n toggle for all Jobs is turned off and cannot be switched back on). This option is only available if you have administrator privileges.\n  |\n\n\n####\n Proxy tab\n\nLets you specify settings for more securely connecting to Domo using a proxy server.\n\n*Note:**\n When you initially connect to Domo via Workbench, Workbench leverages your Windows system proxy settings; you cannot enter your proxy settings manually at this time. However, after you connect to Domo for the first time, you can manually configure the proxy settings in the\n **Proxy**\n tab.\n\n\n You can refer to the following table to find out more about the components in this tab:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n No Proxy Server\n  |\n Does\n *not*\n use a proxy server to connect.\n  |\n|\n Automatically Detect Proxy Settings\n  |\n Determines your proxy settings automatically.\n  |\n|\n Manual Proxy Configuration\n  |\n Lets you manually specify the proxy server information to use in connecting. You can do this only after initially connecting to Domo via Workbench. (The first time you connect, your system proxy settings are used.)\n\n\n Enter the server address and port.\n\n\n If the proxy server requires credentials, set\n **Requires Authentication**\n to\n **On**\n , then specify the username and password.\n  |\n|\n Use System Proxy Settings (Workbench 4.5 only)\n  |\n Determines your proxy settings based on your system proxy settings.\n  |\n\nAfter you enter proxy credentials, you can test your connection by clicking\n **Test Proxy**\n . The color of the icon next to this button indicates whether the proxy settings have been validated.\n\n###\n Updates tab\n\nLets you specify how Workbench software updates are handled.\n\nYou can refer to the following table to find out more about the components in this tab:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Workbench Update URL\n  |\n Specifies the URL that is to be used for Workbench software updates.\n  |\n|\n When to Check for Software Updates\n  |\n Specifies how frequently Workbench should check for software updates. Units range from minutes to years.\n\n\n Select\n **Never**\n if you don't want Workbench to check for software updates.\n  |\n|\n Install updates automatically\n  |\n When turned on, Workbench software is updated automatically.\n  |\n\n\n###\n DataSet Jobs\n\nIn the\n **DataSet Jobs**\n section of the\n **Accounts**\n pane, you can access information and options for all DataSet Jobs that have been created in your Workbench instance.\n\n\n When you click\n **DataSet Jobs**\n , a summary of all your created jobs appears in the Dynamic Options pane. Each summary shows the job ID, DataSet name, creation date, dates of the last run and the next scheduled run, and a message. Jobs in a healthy state are shown with green circles; jobs in an unhealthy state are shown with orange circles.\n\nWhen you click a job (i.e. the job name, not any of the options beneath it in the hierarchy), details about the job and its execution history open in the\n **Dynamic Options**\n pane. The following screenshot shows the job details for a DataSet Job named \"Europe Sales\":\n\nRight-clicking the name of a DataSet Job provides quick access to a number of options also available in the Buttons toolbar at the top of the Workbench window, namely\n **Preview DataSet Job**\n (which also sends an output log to the\n **Output**\n pane, like the\n **Preview**\n button),\n **Execute DataSet Job**\n ,\n **Delete DataSet Job**\n , and\n **Export DataSet Job**\n .\n\nWhen a DataSet Job name appears in italics with an asterisk, this indicates that unsaved changes have been made to the job settings.\n\n\n Each DataSet Job includes a number of parameters that are shown beneath the job name in the hierarchy in the\n **Accounts**\n pane. Clicking a parameter opens information and/or options for that parameter in the Dynamic Options pane. For example, clicking the\n **Schedule**\n parameter for the \"Europe Sales\" DataSet job would open an interface with options for setting the run schedule for that job.\n\n\n The following table lists and describes the parameters available for each job in the\n **Accounts**\n pane. These are all described in greater detail in continuation.\n\n\n Parameter\n  |\n Description\n  |\n| --- | --- |\n|\n Settings\n  |\n Lets you configure the DataSet Job name, the DataSet type, the destination DataSet, update method, error handling, and additional settings.\n  |\n|\n Schedule\n  |\n Lets you configure how often this DataSet is updated.\n  |\n|\n Source\n  |\n Lets you configure settings for your source DataSet—transport method, credentials, data source properties, etc.\n  |\n|\n Schema\n  |\n Shows the schema for your DataSet (but only appears after you click\n **Preview**\n for the job). Here you can rename destination columns, change the data type, and include or exclude columns.\n  |\n|\n Transforms\n  |\n Lets you edit all transforms that have been added to this DataSet Job.\n  |\n|\n Notifications\n  |\n Lets you configure notifications for individual users in Domo.\n  |\n|\n Logs\n  |\n Shows all of the logs for this DataSet Job.\n  |\n\n\n####\n Settings\n\nWhen you select\n **Settings**\n for a DataSet job in the\n **Accounts**\n pane, options for configuring settings for the job appear in the Dynamic Options pane. (Note that there are two\n **Settings**\n items available in the\n **Accounts**\n pane. The version of\n **Settings**\n discussed here refers to the one found under the DataSet Jobs heading and is specific to the selected DataSet Job.)\n\nThe following table describes the options available in the\n **Settings**\n for a DataSet job:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Name\n  |\n The name of this job. You initially name a job when you create it in the\n **Workbench DataSet Job Creation Wizard**\n , but you can rename it here.\n  |\n|\n Domo DataSet\n  |\n The DataSet generated by Workbench in Domo, i.e. the destination data source. A blue \"i\" next to the DataSet name indicates that the DataSet has not yet been created in Domo.\n  |\n|\n Update Method\n  |\n Determines whether new data replaces or is appended to the DataSet when updating.\n  |\n|\n DataSet Type\n  |\n The type of DataSet as shown in Domo. You can select a type from the menu or enter a custom name.\n\n\n The DataSet type you select or enter here is for informational purposes in Domo only. For example, you might be connecting to an ODBC database that contains Twitter data. In this case the best option would be to enter \"Twitter\" rather than selecting\n **ODBC**\n because the data you are representing in Domo is from Twitter.\n  |\n|\n DataSet Description\n  |\n The description for this DataSet you entered when you went through the\n **Workbench DataSet Job Creation Wizard**\n . You can edit the description here.\n  |\n|\n Disable Job\n  |\n Prevents this job from executing.\n  |\n|\n Error Handling\n  |\n Determines what happens when errors are encountered in a DataSet Job. Options include the following:\n * Replace invalid cells with NULL value\n\nWhen invalid cells are encountered, the values are replaced with a \"NULL\" value.\n* Skip entire row if it contains invalid cell(s)\n\nWhen invalid cells are encountered, the rows in which they are found are skipped.\n* Abort Job on invalid data error\n\nWhen invalid cells are encountered, the entire DataSet Job is aborted.\n |\n|\n Requires Impersonation\n  |\n Used when you need to authenticate using non-default credentials. New to 4.5, if an admin user checked the box for\n **Require impersonation credentials for all jobs**\n under\n **Settings > Account**\n , this option is turned on by default and cannot be turned off.\n  |\n|\n Domain\n  |\n Specifies the domain when you are authenticating using non-default credentials (impersonation).\n  |\n|\n Username\n  |\n Specifies your username when you are authenticating using non-default credentials (impersonation).\n  |\n|\n Password\n  |\n Specifies your password when you are authenticating using non-default credentials (impersonation).\n  |\n|\n Terminate job if it runs longer than\n  |\n Lets you specify a time frame (in hours) in which a long-running job is to be terminated.\n  |\n|\n Upload even if data hasn't changed\n  |\n Lets you upload data to Domo even though the data has not changed. Useful when you want the DataSet freshness in Domo to be updated.\n  |\n|\n Clear Domo DataSet if DataSet Job returns zero rows\n  |\n Lets you clear the DataSet in Domo if zero rows are returned when a job runs. If disabled, Workbench does\n *not*\n send a command to Domo to clear out data in the DataSet. If you have a process where you want to upload data in a table after data in another table has been updated, you could disable this option and add some script in your query that looks at the \"status\" table, running the query if the data is ready.\n  |\n|\n Allow schema changes\n  |\n Allows schema changes to be pushed to Domo when the job is left unattended.\n  |\n|\n Wait for Adrenaline Indexing (Workbench 4.5 only)\n  |\n Tells Workbench to wait for Adrenaline indexing (Domo indexing data in the cloud) after a DataSet Job uploads. If this option is turned off, Workbench marks the job as successful immediately after an upload.\n  |\n\n\n####\n Schedule\n\nWhen you select\n **Schedule**\n for a DataSet Job in the\n **Accounts**\n pane, options for scheduling updates for the job appear in the Dynamic Options pane.\n\nIn the\n **Schedule Type**\n menu you select the type of schedule you want.\n\n\n In the\n **Update**\n menu you select the update frequency for this DataSet Job. Options range from\n **Every 30 Minutes**\n to\n **Every Month**\n . If you select\n **Manually**\n , the DataSet does\n *not*\n update on a schedule; you must run the DataSet Job yourself from within Workbench. If you select\n **Watch File**\n , this DataSet Job will run every time the file is updated.\n\n\n For more information about updating a DataSet, see\n\nUpdating or Refreshing the DataSet for a Visualization Card\n\n.\n\n\n When you select a frequency in the menu, the next four upcoming update times are shown at the bottom of the Options pane.\n\n\n For more information about setting a schedule, see\n\nScheduling a Job in Workbench 4\n\n.\n\n\n You can also create a group of DataSet Jobs that share the same update schedule. For more information, see\n\nCreating a Schedule Group in Workbench 4\n\n.\n\n###\n Source\n\nWhen you select\n **Source**\n for a DataSet Job in the\n **Accounts**\n pane, options for configuring the transport method and data source for the job appear in the Dynamic Options pane.\n\n####\n Transport Method\n\nTransport methods determine how data sources are brought into Workbench. You select a transport method in the\n **Workbench DataSet Job Creation Wizard**\n and configure options for the selected method in the\n **Source**\n pane for the DataSet Job. Options are different for each transport method.\n\n#####\n Local File Provider\n\nThe\n **Local File Provider**\n transport method lets you select a file from your machine or a network. This method is used for transporting\n\nXML\n\ndata sources into Domo.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n File Path\n  |\n Specifies the file path for the local file you want to pull into Workbench.\n  |\n|\n Network Username/Password\n  |\n Specifies the username and password for the network the file is located on, if any.\n  |\n|\n Validate Configuration\n  |\n Lets you validate the transport settings you have configured.\n  |\n\n\n######\n SFTP File Provider\n\nUse the SFTP File Provider transport method when you want to retrieve a file via FTP, SFTP (SSH-FTP) or FTPS (FTP-SSL). This method is used for transporting\n\nXML\n\ndata sources into Domo.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Server\n  |\n Specifies the server URL for your FTP server.\n  |\n|\n Username\n  |\n Specifies your username for connecting to the server.\n  |\n|\n Password\n  |\n Specifies your password for connecting to the server.\n  |\n|\n Protocol\n  |\n Determines whether you are retrieving data via FTP, SFTP, or FTPS.\n  |\n|\n Host Key Fingerprint (SSL Certificate Settings)\n  |\n Specifies the host key fingerprint for your SSL certificate, if one is required. Host fingerprints are used to ensure that the SFTP server is the same one you are expecting.\n  |\n|\n Allow untrusted server certificates\n  |\n Lets you upload SSL certificates that don't meet trust requirements. If you are using a self-signed certificate, you must check this box.\n  |\n|\n PKCS#8 File (SSL Certificate Settings)\n  |\n Specifies the PKCS#8 file for your SSL certificate. This is used alongside username and password credentials for more secure authentication.\n  |\n|\n Password (SSL Certificate Settings)\n  |\n Specifies the password for your SSL certificate.\n  |\n|\n Remote File\n  |\n Specifies the file path for the file you want to connect to.\n  |\n|\n Validate Configuration\n  |\n Lets you validate the transport settings you have configured.\n  |\n\n\n######\n External Process File Provider\n\nUse the External Process File Provider transport method when you are using a third-party application to pull data into Domo using a script. When you use this method, you select the executable file for your application, specify arguments, and enter a file path for the output. For CSV files, you can also set a\n **Direct Upload**\n option. Virtually any kind of executable file can be converted into an\n\nXML\n\ndata source in Workbench. For example, you could use this method to convert a MySQL database file to an Excel file. You could then specify options for the Excel file and send it to Domo.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Program Executable\n  |\n Lets you select the executable application file to use to pull data into Domo.\n  |\n|\n Arguments\n  |\n Specifies arguments for your script.\n  |\n|\n Output File Path\n  |\n Specifies the file path for the output. The file type should be the same as the data source type you selected in the\n **Workbench DataSet Job Creation Wizard**\n .\n  |\n|\n Direct Upload (CSV only)\n  |\n Lets you turn on Direct Upload for this job. For more information, see\n\nSetting Up Direct Upload in Workbench 4\n\n.\n  |\n|\n Validate Configuration\n  |\n Lets you validate the transport settings you have configured.\n  |\n\n\n######\n OLEDB Connection Provider\n\nUse the OLEDB Connection Provider when you want to send data to Domo using an OLEDB (OLAP) connection. The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n OLAP Connection\n  |\n Opens the\n **Connection Builder**\n , where you specify all of the details of your OLAP connection.\n  |\n|\n Requires 32b Execution\n  |\n Determines whether this file transport requires 32b execution.\n  |\n|\n Data Source\n  |\n Specifies the server where the database is located.\n  |\n|\n Provider\n  |\n Select a provider, either MSOLAP or Essbase.\n  |\n|\n Catalog\n  |\n Specifies the Initial Catalog for your OLAP connection.\n  |\n|\n Username\n  |\n Specifies the username for this OLAP connection.\n  |\n|\n Password\n  |\n Specifies the password for this OLAP connection.\n  |\n|\n Validate Configuration\n  |\n Lets you validate the transport settings you have configured.\n  |\n\nFor more information about connecting to OLAP data, see\n\nConnecting to an OLAP cube\n\n.\n\n#####\n ODBC Connection Provider\n\nUse the ODBC Connection Provider when you want to send data to Domo using an ODBC connection. The following screenshot shows many of the options available when this method is selected. (In this example,\n **System DSN**\n is selected as the\n **Connection Type**\n . Other options appear if you select a different\n **Connection Type**\n .)\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Connection Type\n  |\n Lets you select a method for connecting to ODBC data.\n\n\n|\n Connection Type\n  |\n Description\n  |\n| --- | --- |\n|\n System DSN\n  |\n You select the DSN to use for the desired DataSet from all of the DSNs available in your system. You can indicate whether credentials are required.\n\n\n**Note:**\n When uploading data from an ODBC DataSet, you must specify an existing Data Source Name (DSN). You can create a DSN using the Windows ODBC Data Source Administrator. (You can access the the Windows ODBC Data Source Administrator by entering \"ODBC\" in the Start Menu search, then selecting \"Data Sources (ODBC)\".) For more information about creating a DSN, refer to the Windows ODBC Help (by searching for \"ODBC\" in Windows Help and Support) or view the training video in\n\nWorkbench 4 FAQs\n\n.\n\n\n For information about defining DataSet names (DSNs) and using Open Database Connectivity (ODBC) to access data, refer to documentation for ODBC.\n\n\n |\n|\n User DSN\n  |\n You select the DSN to use for the desired DataSet from those DSNS for which you have access. You can indicate whether database credentials are required. The selection menu does not populate with your DSNs until you configure the\n **Impersonation**\n settings in the\n **Settings**\n tab for the DataSet Job.\n\n\n**Note:**\n When uploading data from an ODBC DataSet, you must specify an existing Data Source Name (DSN). You can create a DSN using the Windows ODBC Data Source Administrator. (You can access the the Windows ODBC Data Source Administrator by entering \"ODBC\" in the Start Menu search, then selecting \"Data Sources (ODBC)\".) For more information about creating a DSN, refer to the Windows ODBC Help (by searching for \"ODBC\" in Windows Help and Support) or view the training video in\n\nWorkbench 4 FAQs\n\n.\n\n\n For information about defining DataSet names (DSNs) and using Open Database Connectivity (ODBC) to access data, refer to documentation for ODBC.\n\n\n |\n|\n Connection Builder\n  |\n You enter details for your ODBC connection, such as login credentials, driver, server URL, database name, port, timeout value, and connection parameters.\n  |\n|\n Connection String\n  |\n You enter a single string for your connection.\n  |\n\n|\n|\n System DSN (System DSN only)\n  |\n Lets you select the DSN to use for the desired DataSet from all of the DSNs available in your system.\n  |\n|\n Requires Credentials (System DSN and User DSN)\n  |\n Determines whether credentials are required for the specified DSN.\n  |\n|\n Username (System DSN and Connection Builder)\n  |\n Specifies the username you use to connect to the database.\n  |\n|\n User DSN (User DSN only)\n  |\n Lets you select the DSN to use for the desired DataSet from the DSNs available to you. This menu does\n *not*\n populate until you turn on\n **Requires Impersonation**\n in the DataSet Job\n **Settings**\n tab and fill in the parameters.\n  |\n|\n Connection Username (User DSN only)\n  |\n Specifies the username to connect to the database.\n  |\n|\n Connection Password (User DSN only)\n  |\n Specifies the password to connect to the database.\n  |\n|\n Password (System DSN and Connection Builder)\n  |\n Specifies the password you use to connect to the database.\n  |\n|\n Driver (Connection Builder only)\n  |\n Specifies the name of the driver used to access the database.\n  |\n|\n Server (Connection Builder only)\n  |\n Specifies the server name or URL for the database.\n  |\n|\n Port (Connection Builder only)\n  |\n Specifies the port number where the database is found. The default port is the MySQL port.\n  |\n|\n Database (Connection Builder only)\n  |\n Specifies the name of the database to access.\n  |\n|\n Timeout (Connection Builder only)\n  |\n Lets you select the desired timeout value in seconds (60=1 minute) that the connection is kept alive before it is refreshed from the DataSet.\n  |\n|\n Connection Parameters (Connection Builder only)\n  |\n Lets you specify additional parameters for connecting to the DataSet.\n  |\n|\n Connection String (Connection String only)\n  |\n Enter a connection string to connect to the DataSet.\n  |\n|\n Validate Configuration\n  |\n Lets you validate the transport settings you have configured.\n  |\n\nFor more information, see\n\nConnecting to ODBC data\n\n.\n\n#####\n JIRA Connection\n\nUse the JIRA Connection transport method when you want to send JIRA or JSO Ndata to Domo. The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Specifies the username used to connect to your JIRA instance.\n  |\n|\n Password\n  |\n Specifies the password used to connect to your JIRA instance.\n  |\n|\n Server URL\n  |\n Specifies the URL of your company's JIRA server.\n  |\n|\n JIRA Query\n  |\n Specifies the query for the JIRA data you want to send to Domo.\n  |\n|\n Validate Configuration\n  |\n Lets you validate the transport settings you have configured.\n  |\n\nFor more information, see\n\nConnecting to JIRA data\n\n.\n\n####\n Data Source Properties\n\nYou can use the options in\n **Data Source Properties**\n to configure properties for your data source before it is sent to Domo.\n **Data Source Properties**\n are dependent on the Data Source you have selected in the Workbench DataSet Job Creation Wizard. For example, if you selected\n **CSV**\n as the Data Source, you are given options for configuring delimiters, specifying start and end rows, etc., whereas if you selected\n **OLAP**\n , options center around writing queries.\n\n#####\n CSV\n\nWhen CSV is the selected Data Source type, you can specify the delimiter and escape sequence characters and configure advanced settings.\n\n*Notes:**\n\n\n* The name and description for a DataSet in Domo can be different than the name and description in Workbench if someone edits the name and description in Domo. (DataSets do not depend on the names and descriptions matching for data uploads to occur properly.)\n* A CSV file\n *must*\n\n+ be a text file\n\t+ have data delimited by a single character\n\nThe following screenshot shows all of the components of\n **Data Source Properties**\n for a CSV data source.\n\nYou can use the following table to find out more about all of these components:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Field Delimiters\n  |\n Specifies the delimiter character to use in the specified CSV file.\n  |\n|\n Encapsulate Fields With\n  |\n Specifies the character to use for encapsulating fields.\n  |\n|\n Escape Sequence Character\n  |\n Specifies the character to use for escaping.\n  |\n|\n Comment Character\n  |\n Specifies the character to use for commenting.\n  |\n|\n Missing Fields Handling\n  |\n Determines whether to generate an error for missing field values or replace the fields with empty values.\n  |\n|\n First row contains column headers\n  |\n Indicates whether file defines column headers in the first row.\n\n\n If the file has column headers, they should be defined in the first row.\n  |\n|\n Ignore starting rows\n  |\n Specifies the number of rows to skip at the beginning of the data so you can start importing a specific row.\n\n\n The\n **Ignore starting rows**\n field does\n *not*\n include the header row containing the column names.\n  |\n|\n Ignore ending rows\n  |\n Specifies the number of rows to skip at the end of the data.\n  |\n|\n Text encoding\n  |\n Specifies the character encoding used in the CSV file.\n  |\n\nFor more information about connecting to CSV files, see\n\nConnecting to CSV data\n\n.\n\n#####\n Excel\n\nWhen Excel is the selected Data Source type, you can specify the range of data you want to send to Domo. This can be a specific range of cells, a named range, or a dynamic range.\n\n*Note:**\n A Microsoft Excel spreadsheet file\n *must*\n be in a supported file format:\n\n.xlsx\n\n,\n\n.xls\n\n,\n\n.xlsm\n\n\n The following screenshot shows many of the components of\n **Data Source Properties**\n for an Excel data source. (In this example,\n **Cell Range**\n is selected as the\n **Selection Range**\n . Other options appear if you select a different\n **Selection Range**\n .)\n\nYou can use the following table to find out more about these components:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Selection Range\n  |\n Lets you select a method for pulling ranged data from the specified Excel file. Methods are as follows:\n\n\n|\n Method\n  |\n Description\n  |\n| --- | --- |\n|\n Cell Range\n  |\n Lets you specify the Excel sheet from which you want to pull data, along with the starting cell, ending row, and ending column.\n  |\n|\n Named Range\n  |\n Lets you select a named range from a list. If you have not created any named ranges for this file in Excel, no options appear in this menu.\n  |\n|\n Dynamic Range\n  |\n Lets you skip a specified number of lines at the end of the Excel sheet.\n  |\n\n|\n|\n Sheet Name (Cell Range and Dynamic Range)\n  |\n Lets you select the Excel sheet from which you want to pull data.\n  |\n|\n Starting Cell (Cell Range and Dynamic Range)\n  |\n Specifies the first cell in the Excel sheet from which data will be pulled.\n  |\n|\n Ending Row (Cell Range only)\n  |\n Specifies the ending row for the cell range you want to pull data for. This option is available only when\n **Continue until empty row**\n is unchecked.\n  |\n|\n Ending Column (Cell Range only)\n  |\n Specifies the ending column for the cell range you want to pull data for. This option is available only when\n **Continue until empty column**\n is unchecked.\n  |\n|\n First row contains column headers\n  |\n Determines whether the first row contains column headers. This is important when building cards in Domo because column headers are used to reference the data in those columns. For more information, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n|\n Named Ranges (Named Range only)\n  |\n Lets you pick a named range from a list.\n  |\n|\n Ignore Ending Rows (Dynamic Range only)\n  |\n Specifies how many rows at the end of the sheet you want to ignore.\n  |\n\nFor more information about connecting to Excel data, see\n\nConnecting to Excel data\n\n.\n\n#####\n JSON\n\nWhen JSON is the selected Data Source type, you can specify the desired data node, the delimiter, and flattening options.\n\nFor more information about connecting to JSON data, see\n\nConnecting to JSON data\n\n.\n\n#####\n XML\n\nWhen XML is the selected Data Source type, you can specify the desired data node and also indicate nodes that should be ignored.\n\nFor more information about connecting to XML data, see\n\nConnecting to XML data\n\n.\n\n#####\n OLAP and ODBC\n\nWhen OLAP or ODBC is the selected Data Source type, you can configure queries and replacement variables.\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Query\n  |\n Lets you enter the query you want to get data.\n\n\n |\n|\n Replacement Variables\n  |\n Lets you define replacement variables for use in your query.\n\n\n |\n\nFor more information about connecting to databases, see\n\nConnecting to ODBC data\n\n.\n\n#####\n QuickBooks\n\nWhen QuickBooks is the selected Data Source type, you can choose from any of a variety of different reports. You can also instruct Workbench to stop QuickBooks if connection errors are encountered.\n\n*Note:**\n In order to run QuickBooks jobs, you must authorize Workbench to connect to QuickBooks by clicking\n **Authorize Company File**\n in the Buttons toolbar at the top of Workbench.\n\n\n**Important:**\n You\n *must*\n be running the 32-bit version of Workbench to use the QuickBooks DataSet type. For information about running Workbench, see\n\nRunning Workbench 4\n\n.\n\nThe following screenshot shows many of the components of\n **Data Source Properties**\n for a QuickBooks data source. (In this example,\n **General Summary Report**\n is selected as the report type. Other options appear if you select a different report type.)\n\nYou can use the following table to find out more about all of these components.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Allow Workbench to stop QuickBooks on connection errors\n  |\n If checked, QuickBooks shuts down if Workbench encounters errors while executing a DataSet job.\n  |\n|\n Report Type\n  |\n Lets you select a primary report type. All report types have a number of sub-reports you can choose from.\n\n\n Primary report types are as follows:\n\n\n|\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n General Detail Report\n  |\n Shows detailed information for any of a number of different report types, such as \"Income by Customer Detail,\" \"Check Detail,\" \"Pending Sales,\" etc. You can select the desired date range for your report by selecting the start and end dates using the\n **From**\n and\n **To**\n date pickers, respectively. If you want, you can manually select which columns appear in the report by selecting them in the\n **Columns**\n menu.\n  |\n|\n General Summary Report\n  |\n Shows summary information for any of a number of different report types, such as \"CustomerBalanceSummary,\" \"IncomeTaxSummary,\" \"PhysicalInventoryWorksheet,\" etc. You can select the desired date range for your report by selecting the start and end dates using the\n **From**\n and\n **To**\n date pickers, respectively. You can also select a date granularity for your report data (for example, you could summarize data by day, by month, etc.).\n  |\n|\n Budget Summary Report\n  |\n Shows balance sheet and profit and loss reports. You can select the desired fiscal year for your report.\n  |\n|\n List\n  |\n Shows any of a number of reports in list format, such as \"Employee\" (a list of company employees), \"Vendors\" (a list of your vendors), and so on. Because this information is not arranged by date, there are no options for setting a date range or choosing a fiscal year.\n  |\n\n\n |\n|\n Report Date Range (General Detail Report and General Summary Report)\n  |\n Lets you select the start and end date for this report from a date picker.\n  |\n|\n Maximum days to return in single result (General Detail Report only)\n  |\n Specifies the maximum number of days to return in your QuickBooks report.\n  |\n|\n Columns (General Detail Report only)\n  |\n Lets you select the columns that appear in your QuickBooks report.\n  |\n|\n Summarize Report Columns By (General Summary Report only)\n  |\n Lets you choose the date granularity for your QuickBooks report. For example, if you\n **Month**\n , report data is broken down by month.\n  |\n|\n Fiscal Year (Budget Summary Report only)\n  |\n Lets you select the fiscal year for the report.\n  |\n\nFor more information about connecting to QuickBooks data, see\n\nConnecting to QuickBooks data\n\n.\n\n#####\n JIRA\n\nWhen JIRA is the selected Data Source type, you can unselect attributes from the data source that you do not want to be included in the DataSet. You can also add new attributes.\n\nFor more information about connecting to JIRA, see\n\nConnecting to JIRA data\n\n.\n\n###\n Schema\n\nWhen you select\n **Schema**\n for a DataSet job in the\n **Accounts**\n pane, options for configuring properties for columns in your data source appear in the Dynamic Options pane. (You must click\n **Preview**\n in the Buttons toolbar for schema information to appear here.) Here you can change column names and data types and include or exclude certain columns.\n\n\n The following screenshot shows an example of the\n **Schema**\n tab for a DataSet job.\n\nYou can use the following table to learn more about the components of the\n **Schema**\n interface:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Source Column\n  |\n The name of this column in the original data source. You cannot interact with a source column; any changes you make are applied to the\n *destination*\n column (i.e. the column in the Domo DataSet after you execute this DataSet job).\n  |\n|\n Destination Column\n  |\n The name of this column in the Domo DataSet. Any changes you make to a column are applied to this column, not the column from the original data source. You can rename a destination column by clicking in the name field and typing in the desired name.\n  |\n|\n Data Type\n  |\n Indicates the data type for the given column. You can change a data type by clicking in the field and selecting the new data type from the menu. The following data types are available:\n * LONG\n\nstores numbers as numeric values, including fractional and whole numbers.\n* DOUBLE\n\nstores double-precision floating point number values.\n* DECIMAL\n\nstores numbers as decimal values.\n* STRING\n\nstores alphanumeric characters as text.\n* DATETIME\n\nstores year, month, day, hour, minute, and second values.\n* DATE\n\nstores year, month, and day values.\n* TIME\n\nstores hour, minute, and second values.\n |\n|\n Include\n  |\n Determines whether data for this column appears in the DataSet in Domo. You can choose which columns of data are uploaded by checking or unchecking\n **Include**\n for each column heading.\n  |\n\n\n####\n Transforms\n\nWhen you select\n **Transforms**\n for a DataSet job in the\n **Accounts**\n pane, a list of transforms you have added to this DataSet job appear in the Dynamic Options pane. If you have not added any transforms by clicking\n **Add**\n**New Transform**\n in the Buttons toolbar (or right-clicking\n **Transforms**\n in the navigation tree) then selecting the desired transform type, nothing appears here.\n\n\n You can interact with your transforms individually by selecting the desired transform in the\n **Accounts**\n pane. All transforms you have added to a DataSet are arranged in a numbered list under the\n **Transforms**\n heading.\n\nSelecting a transform opens options for configuring that transform in the Dynamic Options pane. All transforms have different options. You can have as many transforms for a DataSet as you want.\n\n\n Transforms are applied in the same order in which they appear in the navigation tree. You can rearrange transforms in the list by right-clicking the transform you want to move then selecting\n **Move Up**\n or\n **Move Down**\n as necessary.\n\n\n For information about all available transforms, see the following topics:\n\n Creating Columns in Workbench 4 Using Calculations\n* Setting the Time Zone for a Workbench 4 Job\n* Encrypting and Decrypting Workbench 4 Data\n* Setting a Custom Date Format on a Column in Workbench 4\n* Filtering Columns in Workbench 4\n* Replacing a Column Value in Workbench 4\n* Combining DataSets in Workbench 4\n\n\n#####\n Calculation\n\nWith the\n **Calculations**\n transform, you can you specify a calculation to use to derive a value in a new column based on a value in another column. Clicking\n **Calculations**\n in the\n **Accounts**\n pane opens the Calculation Builder in the Dynamic Options pane. Here you can specify a name for the calculation then build your calculation by applying functions to columns in your data source as necessary.\n\nFor more information about building calculations, see\n\nCreating Columns in Workbench 4 Using Calculations\n\n.\n\n####\n Custom Date Format\n\nYou can use the\n **Custom Date Format**\n transform to change the date format for a given column.\n\nFor more information, see\n\nSetting a Custom Date Format on a Column in Workbench 4\n\n.\n\n####\n Filter\n\nYou can use the\n **Filter**\n transform to apply filters to a selected column. You can choose to have Workbench return matches or non-matches for the specified filter query. You can also include or exclude blank cells in your filtered data.\n\nFor more information, see\n\nFiltering Columns in Workbench 4\n\n.\n\n####\n Lookup Table\n\nYou can combine data sources in Workbench by using Lookup Tables. A \"Lookup Table\" is a DataSet you combine with a primary DataSet. The Lookup Table DataSet and primary DataSet must both contain one column with unique matching values (\"key columns\"). Once you match key columns, a new DataSet is created by joining all columns from both DataSets. Combining DataSets in this way is equivalent to using a LEFT JOIN in SQL.\n\nFor more information, see\n\nCombining DataSets in Workbench 4\n\n.\n\n####\n Shift Date Timezone\n\nWith the\n **Shift Date Timezone**\n transform, you can set the time zone for the data in a data source by selecting your desired time zone from a menu.\n\nFor more information, see\n\nSetting the Time Zone for a Workbench 4 Job\n\n.\n\n####\n Encrypt\n\nYou can use the\n **Encrypt**\n transform to encrypt one or more columns of data in your data source. After the DataSet has been pulled into Domo, it can only be decrypted in a Sumo table, by users who have been given special access in the\n **User Access**\n listing for the DataSet job in Workbench. For more information about Sumo, see\n\nUnderstanding Sumo cards\n\n.\n\nFor more information about encryption and decryption, see\n\nEncrypting and Decrypting Workbench 4 Data\n\n.\n\n####\n Search & Replace\n\nYou can use the\n **Search & Replace**\n transform to replace a specified value in a column with another value. You can also specify a default value to appear in cells in which your search value does not appear. For search and replace values you can open a regular expression builder that includes a number of categories of regular expression constructs.\n\nFor more information, see\n\nReplacing a Column Value in Workbench 4\n\n.\n\n###\n Notifications\n\nWhen you select\n **Notifications**\n for a DataSet job in the\n **Accounts**\n pane, options for configuring notifications for the job appear in the Dynamic Options pane. Here you can specify who in your Domo instance is notified when jobs are completed successfully and/or fail. For any user in your instance, you can specify whether he/she is notified upon job success, failure, or both. You can also filter the rows in any column as well as set up custom filters. For more information about notifications, see\n\nSetting Notifications in Workbench 4\n\n.\n\n\n####\n Logs\n\nWhen you select\n **Logs**\n for a DataSet job in the\n **Accounts**\n pane (as opposed to selecting the\n **Logs**\n option at the top of the\n **Accounts**\n pane, which opens the logs for the account), you can view the logs for that DataSet job in the Dynamic Options pane. For each log item, you can see the process ID, the thread ID, the error level (either \"Info\" or \"Error\"), the timestamp, and the log message. You can select logs for any day you want using a date picker. You can also sort logs in ascending or descending timestamp order of filter by error level (\n\nERROR\n\n,\n\nINFO\n\n, or\n\nWARN\n\n).\n\nDynamic Options pane\n----------------------\n\nIn the Dynamic Options pane, you can configure options for DataSet jobs. The options available in this pane update according to what you select in the\n **Accounts**\n pane. Unlike the other panes in Workbench, this pane cannot be moved.\n\n\n Preview and Output panes\n--------------------------\n\nThe\n **Preview**\n and\n **Output**\n panes provide information about a selected DataSet job. The\n **Preview**\n pane shows a preview of what the DataSet looks like with all of the settings you have applied, and the\n **Output**\n pane provides a log of actions taken as the preview is loaded. Nothing appears in either pane until you click\n **Preview**\n in the Buttons toolbar at the top of the Workbench window. If you click\n **Preview**\n for more than one DataSet job, tabs for each job appear in the\n **Preview**\n and\n **Output**\n panes. The following screenshot shows an example of this, where the user has enabled previews for the DataSet jobs \"Monthly Sales Data\" and \"Revenue2012\":\n\nPreview and output data is lost when you close Workbench.\n\n\n By default, the\n **Preview**\n and\n **Output**\n panes are located side by side in the bottom left corner of the Workbench window. Mousing over a pane causes it to pop open for viewing; if you move the cursor away from a pane, it closes, but you can force it to stay open by clicking anywhere on it.\n\n\n You can drag the\n **Preview**\n and\n **Output**\n panes anywhere you want it in the Workbench interface. When you drag a pane, arrow buttons appear, indicating the top, bottom, left side, and right side of the interface. If you drag the pane onto one of these buttons, the corresponding area of the interface is highlighted. Dropping the pane onto a button causes it to be \"docked\" in the corresponding area. For example, if you dropped the pane onto either up arrow, it would dock in the upper portion of the Workbench window.\n\n*Note:**\n A pane must be in Dock mode to be draggable. To put a pane in Dock mode, click the sideways pushpin icon\n\n. This allows you to drag it and dock it.\n\nDataSet Job Groups Wizard\n---------------------------\n\nIn the\n **DataSet Job Groups Wizard**\n , you can select any number of DataSet jobs to run on the same schedule. After selecting DataSet jobs for a schedule group, Windows Task Scheduler opens and you can set up scheduling for the jobs in the group there. You can also use the\n **DataSet Job Groups Wizard**\n to edit your existing groups. For more information about managing groups, see\n\nCreating a Schedule Group in Workbench 4\n\n.\n\n\n Plugin Manager\n----------------\n\nIn the\n **Plugin Manager**\n , you can view all of the plugins in Workbench 4, with their names, publishers, version numbers, descriptions, and assembly names. You can add a plugin to your registered plugins list by entering a search path.\n\nTo access the\n **Plugin Manager**\n , click\n **Plugin Manager**\n in the\n **More**\n tab at the top of the Workbench window.\n\n\n For more information about managing plugins, see\n\nManaging Plugins in Workbench 4\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360047403773\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004796\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUnderstanding the Workbench 4 User Interface\n\n", "article_total_view_count": "\n\n\n 4,781\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:30 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "understanding_the_workbench_4_user_interface", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_4", "url": "/s/topic/0TO5w000000ZapSGAS"}]}