{"file_path": "../../raw_kb_v2\\article\\360043430713\\index.html", "content": {"Title": "Sharing a DataSet", "Article Body": "Intro\n                       \n\n                        By default, when you create a DataSet, you are set as the owner of that DataSet and are the only person with access to the DataSet. You can share DataSets with users and groups so those people will have access to view and edit the data. You do this in the details view for the DataSet, which is located in the Data Center. For more information about the parts of the Data Center, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n                        When sharing DataSets, you can optionally choose to send email notifications to let recipients know the DataSet is being shared with them.\n                       \n\n                        You can also share DataSets by sharing cards powered by those DataSets. For information about sharing cards, see\n                        \n                         Sharing and Removing Access to Content\n                        \n                        .\n                       \n\n\n                         Video - DataSet Sharing\n                        \n\n\n\n\n\n\n                        Access Rights\n                       \n\n                        When sharing a DataSet with a user or group, you can assign that user or group to any of a number of different roles, as shown below. (Owners of DataSets have all rights. Both Owners and Co-Owners are added to the \"All rows\" PDP policy for the DataSet.)\n                       \n\n\n\n\n                           Role\n                          \n\n                           Can see all data in the DataSet?\n                          \n\n                           Can build cards?\n                          \n\n                           Can change the DataSet configuration?\n                          \n\n                           Can assign users or group members as Co-Owners or Editors when sharing?\n                          \n\n                           Can share the DataSet?\n                          \n\n                           Can view the DataSet?\n                          \n\n\n\n\n\n\n                            Co-Owner\n                           \n\n\n\n                            x\n                           \n\n\n                           x\n                          \n\n\n                            x\n                           \n\n\n\n                            x\n                           \n\n\n\n                            x\n                           \n\n\n\n                            x\n                           \n\n\n\n\n\n                            Can Edit\n                           \n\n\n\n                            x (unless restricted by PDP)\n                           \n\n\n                           x\n                          \n\n\n\n\n\n\n                            x (Owners and Co-Owners only)\n                           \n\n\n\n                            x\n                           \n\n\n\n                            x\n                           \n\n\n\n\n\n                            Can Share\n                           \n\n\n\n\n\n\n                           x\n                          \n\n\n\n\n\n\n\n\n\n\n                            x\n                           \n\n\n\n                            x\n                           \n\n\n\n\n\n                        To learn about changing the owner of a DataSet, see\n                        \n                         Changing the Owner of a DataSet\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Users with an \"Admin\" security role or a custom role with \"Manage DataSets\" can view and edit ALL DataSets and build cards from them. So, for example, if an \"Admin\"-level user was set to \"Can Edit\" level for a DataSet, he or she would still have all of the same access privileges as an Owner or Co-Owner. For more information about access rights, see\n                            \n                             Managing Roles\n                            \n                            .\n                           \n\n\n\n\n\n                        DataFlow Access\n                       \n\n                        If you share all the input DataSets of a DataFlow with a user or group, the user or group members will gain access to edit the DataFlow. So, for example, if DataSet A and DataSet B were the only inputs to DataFlow C, and you shared DataSet A and DataSet B with the members of group \"Sales Team West Region,\" all members of that group would then be able to edit DataFlow C.\n                       \n\n                        Sharing the output DataSet from a DataFlow does\n                        \n                         not\n                        \n                        grant access to the DataFlow. To be able to edit the DataFlow, a user must be shared on all input and output DataSets used in the DataFlow.\n                       \n\n                        For more information about DataFlows, see\n                        \n                         DataFlow Management.\n                        \n\n\n                        PDP Impact\n                       \n\n                        In general, sharing a DataSet with a user has no impact on PDP. The only exception is when you make someone an Owner or Co-Owner, in which case the user is automatically added to the \"all rows\" PDP policy and has access to the entire DataSet. So if you want to preserve PDP restrictions for a user, make sure to set them to Editor when sharing the DataSet.\n                       \n\n                        Sharing a DataSet\n                       \n\n                        You can share access to a DataSet with users and/or groups in the details view for the DataSet.\n                       \n\n\n                         To share a DataSet with one or more users or groups,\n                        \n\n\n\n\n                          Click\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                          \n                          The Data Center opens, with the\n                          \n                           Data Warehouse\n                          \n                          tab opened by default.\n                         \n\n\n\n                          Click the\n                          \n                          icon on the left side of the screen to open the\n                          \n                           DataSets\n                          \n                          tab.\n                         \n\n\n\n                          Use the various filters and search options to locate the DataSet you want to share.\n                          \n                          For more information about using these options, see\n                          \n                           Data Center Layout\n                          \n                          .\n                         \n\n\n\n                          Click the DataSet to open its details view.\n                         \n\n\n\n                          Select\n                          \n\n                           >\n                           \n\n\n\n\n\n                          Click\n                          \n                           Add People\n                          \n                          at the bottom of the dialog.\n                         \n\n\n\n                          Enter the name of a user or group into the\n                          \n                           Search\n                          \n\n                           users\n                          \n                          field.\n                          \n                          The top results for your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n                         \n\n\n\n                          Select the user or group you want to share the DataSet with in the list.\n                          \n                          The name of the user or group appears in the field.\n                         \n\n\n\n                          Select the desired access level for the user or group.\n                          \n                          For a table showing privileges for each level, see\n                          \n                           Access rights\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              The options available here depend on your own access rights for the DataSet (unless you have an \"Admin\" security profile or a custom role with \"Manage All DataSets\" enabled, in which case you can always see all options).\n                             \n\n\n\n\n\n\n\n                          (Optional) Add additional users or groups and set access for them by repeating the previous three steps.\n                         \n\n\n\n                          (Optional) Remove a user or group from the field by clicking the \"x\" to the right of the name.\n                         \n\n\n\n                          (Optional) Write a message in the\n                          \n                           Message to include\n                          \n                          field to let the recipients know you're sharing a DataSet with them.\n                         \n\n\n\n                          Click\n                          \n                           Share\n                          \n                          .\n                         \n\n\n\n                        The users and groups you selected now have access to the DataSet. In addition, if you wrote a message and checked the box, all users and group members receive an email notifying them about the action.\n                       \n\n                        Changing a User's DataSet Access Level\n                       \n\n                        For users who already have access to a DataSet, you can change their access level or remove their access entirely. You can do this in the details view for the DataSet. Keep in mind that if you want to switch a user's access to \"Co-Owner,\" you must be a Co-Owner yourself (or have an \"Admin\" security profile or a custom role with \"Manage All DataSets\" enabled).\n                       \n\n\n                         To change the DataSet access level for a user or group,\n                        \n\n\n\n\n                          Click\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                          \n                          The Data Center opens, with the\n                          \n                           Data Warehouse\n                          \n                          tab opened by default.\n                         \n\n\n\n                          Click the\n                          \n                          icon on the left side of the screen to open the\n                          \n                           DataSets\n                          \n                          tab.\n                         \n\n\n\n                          Use the various filters and search options to locate the DataSet you want to change access for.\n                          \n                          For more information about using these options, see\n                          \n                           Data Center Layout\n                          \n                          .\n                         \n\n\n\n                          Click the DataSet to open its details view.\n                         \n\n\n\n                          Select\n                          \n\n                           > Manage Sharing\n                          \n                          .\n                         \n\n\n\n                          Locate the user or group in the list you want to change/remove access for.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            To change the access level for the user or group, select the desired access level in the dropdown menu.\n                           \n\n\n\n                            To remove DataSet access entirely for the user or group, click the \"x\" to the right of the dropdown menu.", "Preview Article": "Click here to preview", "URL Name": "360043430713", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004911", "Archived Date": "", "Language": "English", "Primary Version": "Sharing a DataSet", "Article Total View Count": "6,058", "": "", "Article Created Date": "10/24/2022, 10:35 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Sharing a DataSet\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Working With DataSets In Domo\n              \n", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "\n\n               Sharing Access To DataSets\n              \n", "url": "/s/topic/0TO5w000000ZaoFGAS"}]}