{"file_path": "../../raw_kb_v2\\article\\4408174643607\\index.html", "content": {"Title": "Beast Mode FIXED Functions", "Article Body": "Intro\n                       \n\n                        With FIXED functions in Beast Mode, you can perform Level of Detail Expressions. These expressions allow you to calculate values based on the DataSet\n                        \n\n                        instead of the standard row-by-row comparisons performed in Beast Mode calculations. They also allow analysts to create powerful subquery calculations for more flexible data grouping, joining, and comparisons.\n                       \n\n                        Two aggregations must be used for the Beast Mode to work as you are applying an aggregation over an aggregated expression. You can use any of the standard aggregations such as Min, Max, Sum, and Avg. You can also add filter logic to these functions to specify how the calculation is affected by filters applied to the visualization.\n                       \n\n                        Using FIXED Functions\n                       \n\n                        The following example use cases of FIXED functions are written using the different functions.\n                       \n\n                        Use Case #1: FIXED\n                       \n\n                        The following syntax allows you to find the total value of the DataSet.\n                       \nSUM(SUM(`Total Sales`) FIXED ())\n\n\n                        Use Case #2: FIXED BY\n                       \n\n                        The following syntax allows you to find the total value for a specific category.\n                       \nSUM(SUM(`Total Sales`) FIXED (BY `Region`))\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You may add multiple columns to the FIXED functions separated by a comma.\n                          \n\n\n\n\n\n                        Use Case #3: FIXED ADD\n                       \n\n                        Using FIXED ADD returns the aggregate value and adds the dimension that is specified in the calculation. The graphic below displays live states in the west region and the max city sales for each state. Because we are using the FIXED ADD function, we can add the 'City' dimension to the calculation without having to display it in the visualization.\n                       \n\n                        The following syntax allows you to find the max city sales for each state in your visualization.\n                       \nMAX(SUM(`Total Sales`) FIXED (ADD `City`))\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You may add multiple columns to the FIXED function separated by a comma.\n                          \n\n\n\n\n\n\n\n                        Use Case #4: FIXED Remove\n                       \n\n                        Using FIXED REMOVE returns the aggregate value and removes the dimension\n                        \n\n                        specified in the calculation. The graphic below displays the average unit price by product category alongside the overall average unit price across all categories. Since we are using the FIXED REMOVE function, we can remove the 'Product Category' dimension from the calculation in order to\n                        \n\n                        display the overall average alongside the product category average in our visualization.\n                       \n\n                        The following syntax allows you to find the overall average unit price while displaying the average unit price per product category in your visualization.\n                       \nAVG(AVG(`Unit Price`) FIXED (REMOVE `Product Category`))\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You may add multiple columns to the FIXED function separated by a comma.\n                          \n\n\n\n\n\n                        Use Case #5: Percent of Total\n                       \n\n                        The following syntax allows you to find the percent of total for the values in your card as compared to the category total of the DataSet.\n                       \nSUM(`Total Sales`)/SUM(SUM(`Total Sales`) FIXED (BY `Region`))\n\n\n                        Applying Filter Logic\n                       \n\n                        The following example use cases specify how the calculation is affected by filters applied to the visualization.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you do not set up the filter logic, all filters will be applied.\n                          \n\n\n\n\n\n\n                        Use Case #1: Filter None\n                       \n\n                        Using the Filter None argument will prevent any filters from being applied to the calculation.\n                       \nSUM(SUM(`Total Sales`) FIXED (BY `Region` FILTER NONE))\n\n                        The following gif displays sales by state, region, and country for various states in the west region. Region Sales and US Sales in the chart on the left are not fixed, while Region Sales and US Sales in the chart on the right are fixed.\n                       \n\n                        We select the 'California' pill to demonstrate what happens to the visualizations when we filter to a single state.\n                       \n\n                        Note that the chart on the left filters to only sales in California, displaying only Region Sales and US Sales for California, which is inaccurate. The chart on the right is using a FIXED calculation to display Region Sales and US Sales so they are unaffected by the California filter and remain accurate.\n                       \n\n\n\n\n\n\n                        Use Case #2: Filter Allow\n                       \n\n                        Using the Filter Allow argument will prevent any filters from being applied to the calculation, except for the specified fields or expressions.\n                       \nSUM(SUM(`Total Sales`) FIXED (BY `Region` FILTER ALLOW `Product Category`))\n\n                        The following gif shows sales by state, region, and country for various states in the west region. The Region Sales and US Sales in the chart on the left are not fixed, while Region Sales and US Sales in the chart on the right are fixed.\n                       \n\n                        We select both the 'California' pill and the 'Apparel' pill to demonstrate what happens to the visualizations when we use state and category filters at the same time. Note that in the chart on the left, Region Sales and US Sales remain unchanged by the category filter for apparel. In the chart on the right, Region Sales and US Sales are using a FIXED calculation with the Filter Allow argument to allow for the category filter and are displaying only the apparel sales for each geographical area.\n                       \n\n\n\n\n\n\n                        Use Case #3: Filter Deny\n                       \n\n                        Using the Filter Deny argument is the opposite of Filter Allow and will allow any filters to be applied to the calculation, except for the specified fields or expressions.\n                       \nSUM(SUM(`Total Sales`) FIXED (BY `Region` FILTER DENY `State`))\n\n                        The following gif shows sales by state, region, and country for various states in the west region. In the chart on the left, Region Sales and US Sales are fixed but are using the Filter None argument to prevent any filters from being applied. In the chart on the right, Region Sales and US Sales are using the Filter Deny argument to deny region or state filters from being applied to the calculations.\n                       \n\n                        We select both the 'California' pill and the 'Apparel' pill to demonstrate what happens to the visualizations when we use state and category filters at the same time. Note that in the chart on the left, Region Sales and US Sales remain unchanged by the category filter for apparel. In the chart on the right, Region Sales and US Sales are using a FIXED calculation with the Filter Deny argument to prevent any state filters and are allowing the category filter to display Apparel sales for each geographical area.\n                       \n\n\n\n\n                        Frequently Asked Questions\n                       \n\n\n\n\n                         Can I use FIXED functions on a federated dataset such as Snowflake or BigQuery?\n                        \n\n                        Currently, Fixed Functions are only available on non-federated datasets.\n                       \n\n\n                         Can I use FIXED functions with Window functions?\n                        \n\n                        Currently, Fixed Functions are not compatible with window functions in the same calculation.\n                       \n\n\n                         Can I use a calculation containing a FIXED function as a filter in my card?\n                        \n\n                        Currently, calculations containing FIXED functions are not compatible with card or Dashboard filters.", "Preview Article": "Click here to preview", "URL Name": "4408174643607", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004072", "Archived Date": "", "Language": "English", "Primary Version": "Beast Mode FIXED Functions", "Article Total View Count": "12,183", "": "", "Article Created Date": "10/24/2022, 9:20 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Beast Mode FIXED Functions\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Beast Mode\n              \n", "url": "/s/topic/0TO5w000000ZanAGAS"}]}