{"file_path": "../../raw_kb_v2\\article\\360042925754\\index.html", "content": {"Title": "Importing an Email Thread into Buzz", "Article Body": "Intro\n                       \n\n                        You can import an existing email thread into a Buzz conversation, together with all collaborators and attachments for that thread. By transferring long, slow-moving email threads to Buzz, you can take advantage of the clear context visibility and speed to collaborate that Buzz provides.\n                       \n\n                        You import an email thread into Buzz by following these basic steps:\n                       \n\n\n\n                          Generate a unique email address within Buzz just by clicking a button.\n                         \n\n\n\n                          Copy the email address into your email conversation as a recipient.\n                         \n\n\n\n                          Send the email.\n                         \n\n\n\n                        This pulls the conversation into Buzz as a new conversation, along with its context, collaborators, and attachments. All collaborators are notified by email that the conversation has been imported into Buzz; the email also provides a link allowing them to jump directly into the new conversation. Collaborators may also continue to participate in the conversation via email, and their messages will still appear in Buzz.\n                       \n\n\n\n                          Video - Sending Emails to Buzz\n                         \n\n\n\n\n\n\n\n\n\n                        Things to Note\n                       \n\n                        Here are some things to keep in mind when using this tool:\n                       \n\n\n\n                          The email address you generate in Buzz is unique to you. You can use it anytime you want to send an email from your Inbox into Buzz. All Buzz users can generate their own unique \"Buzz This\" email address.\n                         \n\n\n\n                          If you want to send an email thread to an existing conversation, you may retrieve a unique email address for that conversation by going into the\n                          \n                           Conversation Pane\n                          \n                          and clicking the\n                          \n                           Import Email\n                          \n                          link. This is discussed in more detail in the next section.\n                         \n\n\n\n                          Users who do not have access to Buzz\n                          \n                           will not\n                          \n                          be able to join you in the conversation.\n                         \n\n\n\n                        Detailed Steps\n                       \n\n                        Follow the steps in this section to pull an email conversation into Buzz with its collaborators and attachments.\n                       \n\n\n                         To import an email conversation into Buzz,\n                        \n\n\n\n\n                          Open the\n                          \n                           Details Pane\n                          \n                          for the conversation you want to pull the thread into.\n                         \n\n\n\n                          Click\n                          \n                           Import Email\n                          \n                          .\n                          \n\n\n\n\n                          A help dialog opens.\n                         \n\n\n\n                          In the help dialog, copy the automatically generated email address.\n                          \n\n\n\n\n\n\n                          In the email conversation you want to import into Domo, start a reply.\n                         \n\n\n\n                          Add the copied email address as a new recipient in the conversation.\n                          \n\n\n\n\n\n\n                          Send the email.\n                         \n\n\n\n                        The conversation is imported into Buzz with all of the same collaborators, and any attachments are included. You and the other members of the conversation can now continue this conversation in real-time in Buzz.", "Preview Article": "Click here to preview", "URL Name": "360042925754", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004317", "Archived Date": "", "Language": "English", "Primary Version": "Importing an Email Thread into Buzz", "Article Total View Count": "4,688", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Importing an Email Thread into Buzz\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Buzz\n              \n", "url": "/s/topic/0TO5w000000ZanCGAS"}]}