{"file_path": "../../raw_kb_v2\\article\\5395550067095\\index.html", "content": {"Title": "Asana Personal Access Token Connector", "Article Body": "Intro\n                       \n\n\n                         Asana's cloud-based project management platform helps organizations track their productivity. Domo brings your Asana projects into clearer focus by analyzing every piece of the process-users, tasks, and projects-so users can create reports, share the data with stakeholders, and get more done in less time.\n                        \n\n\n                         The Asana Connector is a safe and quick data connection that you can use to measure success and progress of initiatives at your company. Get automated reports in just seconds. Domo pulls only the most pertinent data to create lightning fast Asana reports, so you're never making choices based on outdated information. Domo's easy-to-use platform encourages more productive collaboration.\n                        \n                        To learn more about the Asana API, visit their page (\n                        \n                         https://asana.com/developers/documen...arted/overview\n                        \n                        ).\n                       \n\n                        You connect to your Asana account in the Data Center. This topic discusses the fields and menus that are specific to the Asana connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Asana account and create a DataSet, you must have the personal access token associated with your Asana account..\n                       \n\n                        Connecting to Your Asana Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Asana Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n\n                         This pane contains fields for entering credentials to connect to your Asana\n                        \n\n                         account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Personal Access Token\n                          \n\n                           Enter your Asana personal access token.\n                          \n\n\n\n\n                        Once you have entered valid\n                        \n                         Asana\n                        \n                        credentials, you can use the same account any time you go to create a new\n                        \n                         Asana\n                        \n                        DataSet. You can manage Connector accounts in the\n                        \n\n\n                         Accounts\n                        \n\n\n                        tab in the Data Center. For more information about this tab, see\n                        \n\n\n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select. If you select the \"Tasks\" report, a \"Subreport\" menu appears from which you may select a secondary report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Asana report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Report\n                              \n\n                               Description\n                              \n\n\n\n\n\n                               Attachments\n                              \n\n                               This report pulls your asana attachments for a specified workspace.\n                              \n\n\n\n                               Custom Fields\n                              \n\n                               This report pulls your asana custom fields for a specified workspace.\n                              \n\n\n\n                               Goals\n                              \n\n                               This gets detail Goals record for all Goals associated with the selected workspace.\n                              \n\n\n\n                               Parent Goals\n                              \n\n                               This gets detail Parent Goals records for all Goals associated to a selected workspace.\n                              \n\n\n\n                               Projects\n                              \n\n                               This report gets all projects in a workspace.\n                              \n\n\n\n                               Stories\n                              \n\n                               This report gets all stories in a workspace\n                              \n\n\n\n                               Subgoals\n                              \n\n                               This gets detail Subgoals records for all Goals associated to a selected workspace.\n                              \n\n\n\n                               Subtasks\n                              \n\n                               This report gets all subtasks in a workspace\n                              \n\n\n\n                               Supporting Work\n                              \n\n                               This gets detail Supporting Work records for all Goals associated to a selected workspace.\n                              \n\n\n\n                               Tags\n                              \n\n                               This report gets all tags made on all tasks in a workspace.\n                              \n\n\n\n                               Tasks\n                              \n\n                               This report gets all tasks in a workspace.\n                              \n\n\n\n                               Teams\n                              \n\n                               This report gets all teams in a workspace.\n                              \n\n\n\n                               Users\n                              \n\n                               This report gets all users on a workspace\n                              \n\n\n\n                               Workspaces\n                              \n\n                               This gets all workspaces for a client.\n                              \n\n\n\n\n\n\n\n                           Subreport\n                          \n\n\n                            Select the desired subreport for the \"Tasks\" report. The following subreports are available:\n                           \n\n\n\n\n                               Sub-report\n                              \n\n                               Description\n                              \n\n\n\n                               None\n                              \n\n                               This report gets all tasks in a workspace.\n                              \n\n\n\n                               Custom Fields\n                              \n\n                               This report gets all tasks in a workspace enhanced with custom fields data.\n                              \n\n\n\n                               Followers\n                              \n\n                               This report gets all tasks in a workspace enhanced with followers data.\n                              \n\n\n\n                               Hearts\n                              \n\n                               This report gets all tasks in a workspace enhanced with hearts data.\n                              \n\n\n\n                               Memberships\n                              \n\n                               This report gets all tasks in a workspace enhanced with memberships data.\n                              \n\n\n\n                               Projects\n                              \n\n                               This report gets all tasks in a workspace enhanced with task projects.\n                              \n\n\n\n\n\n\n\n                           Workspace\n                          \n\n                           Select the workspace you want to retrieve data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        What version of the Asana API does this connector use?\n                       \n\n                        This connector uses version 1 of the Asana API (\n                        \n                         https://app.asana.com/api/1.0\n                        \n                        ).\n                       \n\n                        Which endpoint(s) does each report call in this connector?\n                       \n\n\n\n\n                           Report Name\n                          \n\n                           Endpoint URL(s)\n                          \n\n\n\n                           Attachments\n                          \n\n                           /tasks/{task-id}/attachments\n                          \n\n\n\n                           Custom Fields\n                          \n\n                           /workspaces/{workspace-id}/custom_fields\n                          \n\n\n\n                           Goals\n                          \n\n                           /goals/{id}\n                          \n\n\n\n                           Parent Goals\n                          \n\n                           /goals/{id}/parentgoals\n                          \n\n\n\n                           Projects\n                          \n\n                           /workspaces/{workspace-id}/users\n                          \n\n\n\n                           Stories\n                          \n\n                           /tasks/{task-id}/stories\n                          \n\n\n\n                           Subgoals\n                          \n\n                           /goals/{id}/subgoals\n                          \n\n\n\n                           Subtasks\n                          \n\n                           /tasks/{task-id}/subtasks\n                          \n\n\n\n                           Supporting Work\n                          \n\n                           /goals/{id}/supportingWork\n                          \n\n\n\n                           Tags\n                          \n\n                           /workspaces/{workspace-id}/tags\n                          \n\n\n\n                           Tasks\n                          \n\n                           /projects/{project-id}/tasks\n                          \n\n\n\n                           Teams\n                          \n\n                           /organizations/{organization-id}/teams\n                          \n\n\n\n                           Users\n                          \n\n                           /users\n                          \n\n\n\n                           Workspaces\n                          \n\n                           /workspaces\n                          \n\n\n\n\n                        What kind of credentials do I need to power up this connector?\n                       \n\n                        You need the personal access token associated with your Asana account.\n                       \n\n                        Can I use the same account multiple times to create datasets?\n                       \n\n                        Yes\n                       \n\n                        How often can the data be updated?\n                       \n\n                        Datasets can be updated as often as once an hour.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        No", "Preview Article": "Click here to preview", "URL Name": "5395550067095", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003190", "Archived Date": "", "Language": "English", "Primary Version": "Asana Personal Access Token Connector", "Article Total View Count": "4,670", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Asana Personal Access Token Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}