{"file_path": "../../raw_kb_v2\\article\\360042935434\\index.html", "content": {"title": "\n\n\n Data Processing and Tools Best Practices\n\n\n", "article_body": "\n\nIntro\n-------\n\nThere are multiple ways to bring data into Domo and process or transform that data once it has been brought in. There are three stages in which you can choose to process your data:\n\n. *Pre-Domo Processing Options:*\n\n\n You’ll generally use Workbench and Domo connectors to bring data into Domo, and you can perform some minimal transformations within Workbench and certain connectors before you upload the data into Domo.\n2. *In-Domo Processing Options:*\n\n\n After you’ve brought your data into Domo, you’ll generally use Magic Transforms (ETL, MySQL, Redshift, or DataFusion) to create and transform new DataSets within Domo.\n3. *In-Card Processing Options:*\n\n\n After you’ve created DataSets and started to build cards with them, you can use Beast Mode within Analyzer to add any additional dimensions or calculations that you need.\n\nEach tool has its own unique affordances as well as potential advantages or disadvantages depending on the type and size of data that you need to process and how quickly you want that data to be able to refresh or update. Review the following sections to identify which tool will work best for your current or future data processing needs.\n\nPre-Domo Processing Options\n--------------------------------\n\n\n###\n Connectors\n\n\n####\n\n\n When to Use Connectors\n\nDomo has developed hundreds of proprietary public-facing connectors that make it easy for you to bring in data from a host of popular applications. With Domo’s developer kit, you’re also able to build connectors of your own.\n\n\n Depending on the specific connector, you may have different options in terms of tailoring the reports or DataSets you would like to bring into Domo. Visit the documentation for each individual connector in the\n\nHelp Center\n\nto learn more about what each connector offers you in terms of processing and transformation capability.\n\n###\n\n\n Pro Tips\n\n\n* To the extent possible, preprocess your data before you bring your data into Domo using connectors, which will help minimize the need for creating DataFlows later and ultimately reduce processing time.\n* If possible, it is better to remove or filter out columns or categories of data that don’t need to be included in the DataSet to minimize load times and simplify later use of that DataSet\n\n\n .\n\n\n###\n Workbench\n\nWorkbench is a secure, client-side solution for routinely uploading your on-premise data to Domo. To learn more about Workbench, visit\n\nhttp://knowledge.domo.com?cid=workbench\n\n.\n\n###\n\n\n When to Use Workbench\n\n\n* You are trying to automate data import into Domo from local files or internally managed databases or servers (CSV, Excel, Jira, ODBC, OLAP, Quickbooks, XML).\n* You are trying to do basic data manipulations (lookup tables, simple calculations, change data formats, change data types, search/replace, rename column headers) before importing transformations into Domo\n\n\n .\n* You want to utilize existing SQL queries to grab data from a database (uses an ODBC connection).\n* You are trying to get data from a data warehouse cube (can only grab one slice at a time).\n* You have pre-existing scripts (ex:\n\nPowershell\n\n, etc.) that are outside the default list of connections.\n* You are willing to build custom plugins into Workbench if you cannot convert your data or systems into a generic database (ODBC, OLAP) or generic file type ( Excel, CSV, JSON, XML) or find matching connectors for your data systems/type\n\n\n .\n\n\n####\n\n\n When NOT to Use Workbench\n\n\n* You are trying to do complex formulas (unless contained within a SQL query).\n* You are not willing to build custom plugins in Workbench if you cannot convert your data or systems into a generic database (ODBC, OLAP) or generic file type (Excel, CSV, JSON, XML) or find matching connectors for your data systems/type.\n\n\n####\n\n\n Pro Tips\n\n\n* To the extent possible, preprocess your data before bringing it into Workbench or use Workbench to process data, which will help minimize the need for creating DataFlows later and ultimately reduce processing time.\n* If possible, it is better to remove or filter out columns or categories of data that don’t need to be included in the DataSet to minimize load times and simplify later use of that DataSet\n\n\n .\n\n\n In-Domo Processing Options\n-------------------------------\n\n\n###\n ETL\n\nYou can create ETL DataFlows using an intuitive drag-and-drop interface available in the Data Center of Domo. To learn more about ETL, visit\n\nhttp://knowledge.domo.com?cid=createmagic\n\n.\n\n###\n\n\n When to Use ETL\n\n\n* If you aren’t familiar with SQL-based languages and are more of a business user vs. technical/power user.\n* If you want the DataSet to be added to or managed by someone who is unfamiliar with SQL-based languages.\n* You need to combine dissimilar DataSets or normalize your data easily.\n* You prefer to see a visual of how you want to make the DataFlow\n\n\n .\n* If your inputs total less than 100 million rows.\n\n\n####\n\n\n When NOT to Use ETL\n\n\n* Your inputs total over 100 million rows.\n* You need to utilize things such as current date or custom functions, statistical functions, windowing functions (ex: row numbers), and current date.\n\n\n####\n\n\n Pro Tip\n\n\n* It is better to remove or filter out columns or categories of data that don’t need to be included in the DataFlow at the beginning of the process instead of at the end. For example, if you know that you will only need data for year 2016, filter the 2016 data out from the very beginning.\n\n\n###\n DataFusion\n\nDataFusion lets you select and merge data sources so you can begin visualizing your data. DataFusion makes joining data simple, and there’s no need for SQL or ETL expertise. To learn more about using DataFusion, visit\n\nhttp://knowledge.domo.com?cid=usingdatafusion\n\n.\n\n###\n\n\n When to Use DataFusion\n\n\n* You have DataSets that you need to be instantaneously joined or unioned and updated often, and you need to rename columns or drop columns; it is the quickest method for joining inputs of 100+ million rows or larger\n\n\n .\n* Because a Data Fusion is not processing or indexing the data, it renders more quickly inside of Domo.\n* You want to be able to leverage creative Beast Mode calculations within Analyzer to specify which data you want to display and how.\n* You don’t need to manipulate data while joining.\n* You are not familiar with writing SQL.\n* Your DataSets are larger than 100 million rows.\n\n\n####\n\n\n When NOT to Use DataFusion\n\n\n* Your joins aren’t straight-forward (ex: functions on join clauses, where clauses needed, order by needed, calculations needed).\n* You need to use the DataFusion as an input to a DataFlow.\n* You need a lot of back-end control over renaming or editing column names after the initial creation of the DataFusion.\n\n\n###\n MySQL\n\nMySQL DataFlows allow for the use of common SQL commands so that data can be accessed, joined, cleansed, and transformed within Domo. To learn more about adding a SQL DataFlow in Domo, visit\n\nhttp://knowledge.domo.com?cid=createsqldf\n\n.\n\n###\n\n\n When to Use MySQL\n\n\n* If you are familiar with SQL-based languages or it is your current preference.\n* You are familiar with optimization techniques and know how to create tailored indexes; for example, using indexes can reduce an 8-hour processing time to about 30 minutes.\n* If you want to optimize processing; MySQL can often exceed the processing efficiency of Redshift if the calculation is optimized properly.\n* You need to use custom functions, stored procedures, or want to have full control over indexing.\n* When you can’t get the desired result using Magic ETL, Beast Mode, or Fusion.\n\n\n####\n\n\n When NOT to Use MySQL\n\n\n* Your input DataSets are over 100 million rows.\n* If you are dealing with DataSets that hold mass amounts of columns and/or rows that are being combined into a DataFlow (that also aren’t going to be grouped down), it will take significantly longer to update these DataSets and cards built on those DataSets in Domo. It can sometimes take hours for these assets to update.\n* If you plan to have multiple nested queries (performance is poor on these\n *unless*\n you pull the nested queries into their own transform, then index and reference them).\n* You don’t know how to optimize or index data.\n* If others who will be maintaining, modifying, or needing to understand the DataFlow in the future don’t prefer to use MySQL.\n\n\n####\n\n\n Pro Tip\n\n\n* Documentation on MySQL is readily available online, so if you run into issues, you’ll be able to find the resources you need there.\n\n\n###\n Amazon Redshift\n\nAmazon Redshift is a hosted data warehouse project that is part of the larger cloud computing platform Amazon Web Services. Redshift handles analytics workloads on large scale DataSets stored by a column-oriented DBMS principle. To learn more about using Redshift, visit\n\nhttp://knowledge.domo.com?cid=amazonredshift\n\n.\n\n###\n\n\n When to Use Redshift\n\n\n* *Most*\n\n\n of your DataSets are 10 million rows or more.\n* You have a DataSet of 100 million or more rows as an input.\n* You need windowed functions (windowing functionality is available through MySQL as well, but is not built in natively).\n* Customer is a heavy Redshift shop who wants to work with technology they’re already familiar with so they can leverage existing expertise and easily copy/paste queries from their other systems into Domo without having to translate to MySQL, Magic, etc.\n* In order to leverage Multiple Parallel Processing when intentionally creating massive Cartesians or working with any other joins between extremely large DataSets.\n\n\n####\n\n\n When NOT to Use Redshift\n\n\n* The majority of your input DataSets are under 1 million rows.\n* You need custom functions, indexes or stored procedures.\n* Using sub-selects in your SQL (different than sub-queries). Performance is greatly reduced. See reference below:\n\n+ SUBSELECT (AVOID): select \\*, (select a from table) as content from table\n\t+ SUBQUERY (OK TO USE): select \\* from (select a from table)\n* When any other methods appropriately and adequately provide the solution.\n* If others who will be maintaining, modifying, or needing to understand the DataFlow in the future don’t prefer to use Redshift.\n\n\n####\n\n\n Pro Tip\n\n\n* Documentation on Redshift is readily available online, so if you run into issues, you’ll be able to find the resources you need there.\n\n\n In-Card Processing Options\n-------------------------------\n\n\n###\n Beast Mode\n\nIn the Analyzer, you can add a calculation, or create column transforms, by defining calculations that reference other columns in your DataSet. To learn more about Beast Mode, visit\n\nhttp://knowledge.domo.com?cid=beastmodecalculation\n\n.\n\n###\n\n\n When to Use Beast Mode\n\n\n* Anytime you need to create an instantaneous calculation or calculated column or you want your calculations to be dynamic (recalculates on the fly when using filters and analyzer), which is especially the case when you want to do a SUM, MIN, MAX, or AVG calculation.\n* You want to split up your data into different groupings (ex: split age column into multiple series like 0-10, 11-30, 31+; set “below goal” and “above goal,\" etc.).\n* You want to create comparison calculationss (ex:\n\nYear over Year, Period over Period\n\n) or create ratios between groups of data.\n* You want to create\n\nmultiple summaries\n\nor manipulate table cards using basic HTML.\n* You want to optimize the time it takes for a query to complete. Beast Modes offer this advantage because these are not saved in the DataSet itself.\n\n\n####\n\n\n When NOT to Use Beast Mode\n\n\n* You are trying to compare data from one row to another (other than using SUM, MIN, MAX, AVG).\n* You need advanced statistical functions (some statistical functions exist through Beast Mode, so check the\n\nFunctions list\n\nto see if the one you need is available).\n* You want variables.\n* You need a calculated date that can be recognized/used in a card’s dynamic date filtering (use a DataFlow instead).\n\n\n####\n\n\n Pro Tip\n\n\n* If you need to apply a calculation to a DataSet, it is generally best to use Beast Mode, as it adds dynamic filtering capabilities to your calculation.\n* Fusion can be used to quickly join large, historical pre-processed DataSets with the latest versions and make turnaround processing time much faster because you won’t need to perform additional processing and indexing on the pre-processed DataSet each time.\n\n\n Help Option — Domo ETL Team\n--------------------------------\n\nThis is a special team of data specialists that develop solutions when Domo tools may not offer the most efficient route.\n\n###\n\n\n When to Contact Domo ETL Team (\n\nextra fee may apply\n\n)\n\n\n* Your data sources are hundreds of millions or even billions of rows.\n* You are needing an \"outside of the box\" solution to receive/prep data for Domo.\n\n\n####\n\n\n When NOT to Contact the ETL Team\n\n\n* When any of the other methods listed above work efficiently\n\nTips for Processing Big Data\n--------------------------------\n\n\n* When uploading data to Domo, break up the large data file by row so the file part is between 100 and 200 Mb.\n* Upload your data using our multi-part streaming API. For more information, visit\n\nhttps://developer.domo.com/docs/streams-api-reference/streams\n\n.\n* If an data part upload fails unexpectedly, you can re-upload that data part using the same part ID before closing the multi-part stream upload.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042935434\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004477\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nData Processing and Tools Best Practices\n\n", "article_total_view_count": "\n\n\n 5,548\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "data_processing_and_tools_best_practices", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "training", "url": "/s/topic/0TO5w000000ZamyGAC"}, {"text": "selfservice_training", "url": "/s/topic/0TO5w000000ZaoCGAS"}, {"text": "best_practices_resources", "url": "/s/topic/0TO5w000000ZaoXGAS"}]}