{"file_path": "../../raw_kb_v2\\article\\360042929254\\index.html", "content": {"title": "\n\n\n Google Analytics Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGoogle Analytics generates detailed statistics about a website's traffic and helps measure sales and conversions. The Google Analytics Advanced connector extracts data from the Google Analytics API. You can connect Google data to Domo, including page views, unique visitor counts, return visitor counts, referring domains, geographic patterns, and more. You can use predefined reports or create your own.\n\n\n With your Google Analytics data in Domo, you can get immediate insights into your web performance metrics so you can better understand your customers and assess the performance of your content. Create visualizations in just minutes, and easily share them with your team to help drive better user experiences. Use Domo's Google Analytics Advanced Connector to efficiently generate reports about campaign, device, location, social network, and traffic metrics to make sure the customer behavior you're seeing now translates to sales and revenue down the line. To learn more about the Google Analytics API, visit\n\n\n https://developers.google.com/analytics/\n\n\n .\n\n\n You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Analytics Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding\n\n\n a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n | * Understanding visitor traffic patterns on your website\n* Understanding visitor behavior patterns on your website\n* Understanding the relationship between geography and user behavior on your website\n* Understanding the difference between user behavior on mobile devices vs. desktop browsers\n* Understanding how social media drives traffic to your website\n* Understanding how users interact with products on your website\n |\n|\n**Primary Metrics**\n | * Page Views\n* Unique Visitor Counts\n* Return Visitor Counts\n* Product Sales Numbers\n* Geographic Patterns\n* Referring Domains\n* Conversion metrics\n* Bounce Rate\n* Exit Pages\n |\n|\n**Primary Company Roles**\n | * Data analysts\n* Digital marketers\n* Editorial teams\n* Marketing leads\n |\n|\n**Average Implementation Time**\n |\n If choosing the basic reporting functions you can plan on about an hour depending on how many reports you are pulling. However, if choosing the custom route, the time may be up to 2 hours. Also, depending on how much data you are pulling, it may take several hours for the data to be available in Domo.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 7\n  |\n\nBest Practices\n----------------\n\n\n* It's important to note that when the report uses sample data, the sampled data is optimal. This can cause output discrepancies when comparing the Google API data to the reports available in the Google Analytics reporting tool. The sampling is designed to help the API perform optimally while still providing representative data.\n* When starting out, consider deploying the\n\nGoogle Analytics Dashboard\n\n. The Base Metrics report has many of the fundamental metrics that are key to a Google Analytics Dashboard.\n\nPrerequisites\n---------------\n\nTo connect to the Google Analytics API and create a DataSet, you must have a Google email address and password.\n\n\n**Video - Google Analytics Advanced Connector**\n\n\n Connecting to Your Google Account\n-----------------------------------\n\nThis section enumerates the options in the\n\nCredentials\n\nand\n\nDetails\n\npanes in the Google Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google Analytics Advanced connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google accounts in Domo) to open the Google OAuth screen where you can enter your Google email address and password. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Analytics Advanced DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Data Selection Pane\n\nThis pane contains a number of subpanes in which you can select a report, set a date range, choose your segments, and more.\n\n\n Subpane\n  |\n Description\n  |\n| --- | --- |\n|\n View\n  |\n Choose whether you want to pull data from a specific view or all views. If you choose\n ********Specific views********\n , you are asked to choose the desired profiles. Be aware that you won't be able to use custom metrics and dimensions if you choose more than one web property.\n  |\n|\n Report\n  |\n The Google Analytics reports are divided  into three categories, namely- Custom report, Google Analytics Audience reports, and Curated Domo reports. The number of available Metrics and Dimensions for the selected report appear next to the reports drop down. You can view the names of the metrics and dimensions as you hover the pointer over the respective field. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Custom Report\n  |\n Custom Report allows you to create a customized report. You can select a base report for your custom report from the\n ****Base Report****\n drop down. Depending on your base report selection, the number of metrics and dimensions that you can combine in your custom report appear next to the report drop down as well as in the left pane. You can select the categories from list available. A list of available metrics and dimensions for the selected category appears in the right pane. As you select/deselect the desired metrics and dimensions, you can see the changes in the respective numbers in the left pane as well as next to the report drop down.\n  |\n| ****Google Analytics Audience reports**** |\n|\n Active Users\n  |\n Returns data for Users, New Users, and Sessions.\n  |\n|\n Behavior\n  |\n Returns data for % New Sessions, Avg. Session Duration, Bounce Rate, Goal Completions, Goal Conversion Rate, Goal Value, New Users, Pages / Session, Page views, and Sessions broken down by Count of Sessions, Days Since Last Session, and Session Duration.\n  |\n|\n Cohort Analysis\n  |\n Returns data for Goal Completions, Page views, Revenue, Session Duration, Sessions, Transactions, and Users broken down by Date.\n  |\n|\n Demographics\n  |\n Returns data for % New Sessions, Avg. Session Duration, Bounce Rate, Goal Completions, Goal Conversion Rate, Goal Value, New Users, Pages / Session, and Sessions broken down by Age and Gender.\n  |\n|\n Geo\n  |\n Returns data for % New Sessions, Avg. Session Duration, Bounce Rate, Goal Completions, Goal Conversion Rate, Goal Value, New Users, Pages / Session, and Sessions broken down by City, Continent, Country, Language, Region, and Sub Continent.\n  |\n|\n Mobile\n  |\n Returns data for % New Sessions, Avg. Session Duration, Bounce Rate, Goal Completions, Goal Conversion Rate, Goal Value, New Users, Pages / Session, Page views, and Sessions broken down by Device Category, Mobile Device Branding, Mobile Device Info, Mobile Input Selector, Operating System, Screen Resolution, and Screen Provider.\n  |\n|\n Overview\n  |\n Returns data for % New sessions, Avg. Session Duration, Bounce Rate, New Users, Pages / Session, Page views, Sessions, and Users broken down by Browser, City, Country, Language, Operating System, Screen Resolution, and Service Provider.\n  |\n|\n Technology\n  |\n Returns data for % New Sessions, Avg. Session Duration, Bounce Rate, Goal Completions, Goal Conversion Rate, Goal Value, New Users, Pages / Session, and Sessions broken down by Browser, Flash Version, Hostname, Operating System, Screen Colors, Screen Resolution, and Service Provider.\n  |\n| ****Curated Domo reports**** |\n|\n Base Metrics\n  |\n Returns data for Bounces, Goal Completions, Goal Value, New Users, Page views, Revenue, Session Duration, Sessions, Transactions, and Users broken down by Date.\n  |\n|\n Campaign Metrics\n  |\n Returns data for Bounces, Goal Completions, Goal Value, New Users, Page views, Revenue, Session Duration, Sessions, Transactions, and Users broken down by Date and Campaign.\n  |\n|\n Device Metrics\n  |\n Returns data for Bounces, Goal Completions, Goal Value, New Users, Page views, Revenue, Session Duration, Sessions, Transactions, and Users broken down by Date, Device, and Operating System.\n  |\n|\n Location Metrics\n  |\n Returns data for Bounces, Goal Completions, Goal Value, New Users, Page views, Revenue, Session Duration, Sessions, Transactions, and Users broken down by Country, Date and Region.\n  |\n|\n Mobile Metrics\n  |\n Returns data for Bounces, Goal Completions, Goal Value, New Users, Page views, Revenue, Session Duration, Sessions, Transactions, and Users broken down by Date, Device Category, Mobile Device Branding, Mobile Device Info, Mobile Device Model, and Operating System.\n  |\n|\n Product Metrics\n  |\n Returns data for Product Revenue, Quantity, and Unique Purchases broken down by Date, Product, Product Category, and Product SKU.\n  |\n|\n Social Network\n  |\n Returns data for Avg. Session Duration, Pages / Session, Page views, and Sessions broken down by Date and Social Network.\n  |\n|\n Traffic Metrics\n  |\n Returns data for Bounces, Goal Completions, Goal Value, New Users, Page views, Revenue, Session Duration, Sessions, Transactions, and Users broken down by Date, Medium, and Source.\n  |\n\n|\n|\n Range\n  |\n Choose a predefined date range (30 days, 60 days, 90 days, or all days since the last successful run) or set a custom date range. If you choose to set a custom date range, you are asked to choose whether to pull data for a single date or a range of dates. With both options, you can choose whether the dates in the range are specific or relative. If you choose specific dates, you are prompted to choose those dates in a date picker. If you choose relative dates, you are asked to pick the number of days back you want to start pulling/stop pulling data for.\n\n\n For example, you might choose to pull in data for a date range and then opt to have relative start and end dates for the range. If you were to select 14 days back for the start date and 7 days back for the end date, every time the report ran it would pull data for the last 14 days up until the last 7 days.\n  |\n|\n Segments\n  |\n Select whether you want to use Segments in your data. A Segment is a subset of Google Analytics data. For example, of the entire set of users, one Segment might be users from a particular country or city. Segments let you isolate and analyze those subsets of data so you can examine and respond to the component trends in your business.\n\n\n You can build dynamic Segments within Domo. You do this by inputting JSON code formatted as follows:\n\n\n`[\n\n{\n\n\"dynamicSegment\": {\n\n\"name\": \"Sessions with Safari browser\",\n\n\"userSegment\": {\n\n\"segmentFilters\": [\n\n{\n\n\"simpleSegment\": {\n\n\"orFiltersForSegment\": [\n\n{\n\n\"segmentFilterClauses\": [\n\n{\n\n\"dimensionFilter\": {\n\n\"dimensionName\": \"ga:browser\",\n\n\"operator\": \"EXACT\",\n\n\"expressions\": [\n\n\"Safari\"\n\n]\n\n}\n\n}\n\n]\n\n}\n\n]\n\n}\n\n}\n\n]\n\n}\n\n}\n\n}\n\n]`\n\n\n For more detailed information about building segments, see\n\nhttps://developers.google.com/analyt...asics#segments\n\n.\n  |\n|\n Filters\n  |\n Select whether you want to use Filters in your data. Filters can be used to collect only data that matches specific criteria. You can filter specific metrics or dimensions. For example, you could limit the \"browser\" dimension to show only traffic from the Safari or Chrome browsers.\n\n\n For more information about utilizing Google Analytics filters, see\n\nhttps://developers.google.com/analyt...erence#filters\n\n.\n\n\n You can build Dimension Filters and Metrics Filters within Domo. You do this by inputting JSON code formatted as follows:\n\n\n`{\n\n\"metricFilterClauses\": [\n\n{\n\n\"filters\": [\n\n{\n\n\"metricName\": \"ga:pageviews\",\n\n\"operator\": \"GREATER_THAN\",\n\n\"comparisonValue\": \"2\"\n\n}\n\n]\n\n}\n\n]\n\n}`\n\n\n For more detailed information about building Filters, see\n\nhttps://developers.google.com/analyt...sics#filtering\n\n.\n  |\n|\n Advanced Settings > Allow Sampled Data\n  |\n Select whether you want to allow sampled data in your report. By default Domo will try to unsample the data by breaking up the requests into smaller date intervals until Google responds with unsampled data. By allowing sampled data, Domo will not break up the query into smaller date intervals and return the queried data as is. If you are querying user metrics without a date dimension, we recommend allowing sampled data.\n  |\n|\n Advanced Settings > Replace Schema\n  |\n\nSelect if you need to reset the schema.\n\n\n**Warning**\n : This can result in loss of data or change in data type if some fields are temporarily not returned by Google Analytics's API. While this switch is selected the dataset will reset the schema for each run.\n\n|\n|\n Test\n  |\n Click\n ********Run Test********\n to test your configuration.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the Google Analytics API does this connector use?\n\nThis connector uses version 4 of the Google Analytics API (\n\nhttps://developers.google.com/analytics/devguides/reporting/core/v4\n\n).\n\n###\n Why does it seem that my data is not accurate?\n\nGoogle's data processing latency is 24-48 hours. If your query is for yesterday's data, some data may not be displayed. Google may not have finished processing the most current data, so incomplete data may appear.\n\n\n Google 360 accounts have a much faster processing time. Enhanced data freshness normally takes 15-20 minutes depending on some factors. Enhanced data freshness is not applied to data that results from integration with other products (Example: AdWords or any of the DoubleClick products). Visit\n\nrestrictions on enhanced data freshness\n\nto view some other restrictions.\n\n\n The slowest possible data latency for 360 accounts is 24 hours.\n\n\n The fastest possible data latency for 360 accounts is 15-20 minutes.\n\n\n The chart on\n\nthis page\n\nbreaks down all the possible data latency periods based on the account and based on the query. Different queries have different data latency periods.\n\n###\n Where can I find help in building queries?\n\nUtilize Google's\n\nQuery Explorer\n\nto help test and build your queries. The Query Explorer may also give more insight on why the query isn't working.\n\n###\n I keep getting the error \"Selected dimensions and metrics cannot be queried together.\"\n\nRefer to the\n\nDimensions and Metrics Explorer\n\nto understand what dimensions/metrics can actually be queried together because not all combinations are valid.\n\n###\n What are my custom metrics and dimensions?\n\nCustom metrics and dimensions are defined at the web property level. We can only display your custom metrics/dimensions if you have one web property selected. Only views within the web property can use its custom metric/dimension. You can have as many views selected as you want as long as they belong to the same web property. The custom metrics and dimensions (if there are any) will be displayed under the \"Custom Variables or Columns\" section under the custom report.\n\n###\n How do segments work?\n\nA segment is a subset of your Analytics data. For example, of your entire set of users  one segment might be users from a particular country or city. Within Domo, when you select multiple segments, we query a report for each segment you have selected. You can use custom segments. Learn more about segments\n\nhere\n\n.\n\n###\n How does \"Include all views\" work?\n\nIf you select to include all views, the query is run for every view each time the connector runs. That way whenever you add or delete a view, you won't have to update the DataSet.\n\n###\n Why am I limited to 10 metrics and 7 dimensions?\n\nThis is a limitation given by the Google Analytics API. There is no way to add more than 10 metrics and 7 dimensions to a report.\n\n###\n My data is not aggregated in the way I expect. Why is that?\n\nGoogle returns sampled data when your data passes the threshold of 500k sessions at the property level for the date range you are using. (For more about sampled data and how Google handles it, see\n\nAbout Data Sampling\n\n\n .\n\nIf Google returns sampled data, and your connector configuration does not \"Allow Sampled Data\", then:\n\n Domo rejects the sampled data\n* Domo breaks up the request into smaller date intervals.\n* Google responds to these smaller requests with unsampled data. This data will be aggregated with the time dimension of the smaller date interval, not the time dimension of the overall report.\n\nFor example, you might have a custom report aggregated with a time dimension of Month of the year (ga:month). If your data passes the threshold of 500k sessions, Google will return sampled data. Domo will reject the sampled data and instead request data for January 1-15. Google will return unsampled data that is aggregated for January 1-15. The process will repeat for the data for January 16 -31.\n\n\n It is your responsibility to handle the non-aggregated data with an ETL.\n\n\n To avoid this, either configure the dataset to Allow Sampled Data, or aggregate the data with a time dimension of Date (ga:date) or smaller.\n\n\n Troubleshooting\n-----------------\n\n\n* Check user permission settings if you are having trouble gaining access to data.\n* Check to make sure you are using the correct set of credentials.\n* When validating data between the API data and the front end reporting tool, always check to see if the data was sampled or not.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929254\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003527\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Analytics Advanced Connector\n\n", "article_total_view_count": "\n\n\n 5,747\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_analytics_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}