{"file_path": "../../raw_kb_v2\\article\\360042931054\\index.html", "content": {"Title": "Weather Source Connector", "Article Body": "Intro\n                       \n\n                        Weather Source provides a continuum of past, present, and forecast hyper-local global weather data for business intelligence and analytics.  Use the Domo Weather Source connector to obtain access to hyper-local weather data for any point on any landmass in the world and up to 200 miles offshore.  All data is available in hourly or daily format and supports all major weather parameters, including temperature, humidity, precipitation, snowfall, wind, pressure, freezing rain, cloud cover, and more.  Climatology data (the statistics of weather over time) is also available.  To learn more about Weather Source and its products, please visit their website at\n                        \n                         www.weathersource.com\n                        \n                        . To learn more about the Weather Source API, visit their page (\n                        \n                         https://developer.Weather Source.com/documentation/\n                        \n                        ).\n                       \n\n                        You connect to your Weather Source account in the Data Center. This topic discusses the fields and menus that are specific to the Weather Source connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector is useful for obtaining industry leading past, present and forecast hyper-local global weather data for any point in the world or geographic areas such as ZIP or postal codes.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n                            N/A\n                           \n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n\n\n                                Any business unit within an organization that is looking to correlate weather data with business performance for meaningful business intelligence.\n                               \n\n\n\n\n\n\n\n                                Any individual or business requiring weather data that is tied to a specific location, region, or geographic area.\n                               \n\n\n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            ~10 minutes\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your Weather Source account and create a DataSet, you must have a Weather Source API key. A key is generated for you when you sign up for a Weather Source account.\n                       \n\n                        Connecting to Your Weather Source Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Weather Source Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Weather Source account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Weather Source API key. You receive an API key when you sign up for a Weather Source account.\n                          \n\n\n\n\n\n                         Once you have entered valid Weather Source credentials, you can use the same account any time you go to create a new Weather Source DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Weather Source report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Accounts\n                              \n\n                               Returns the authenticated user's account settings.\n                              \n\n\n\n                               Astronomy by Latitude & Longitude\n                              \n\n                               Returns the astronomy (such as sunrise and sunset times) for a specified latitude and longitude and time period.\n                              \n\n\n\n                               Astronomy by Postal Code\n                              \n\n                               Returns the astronomy (such as sunrise and sunset times) for a specified postal code and time period.\n                              \n\n\n\n                               Forecast by Latitude & Longitude\n                              \n\n                               Returns forecast data for a specified latitude and longitude.\n                              \n\n\n\n                               Forecast by Postal Code\n                              \n\n                               Returns forecast data for a specified postal code.\n                              \n\n\n\n                               History by Latitude & Longitude\n                              \n\n                               Returns the weather history for a specified latitude and longitude and time period. Available for 2013 onward.\n                              \n\n\n\n                               History by Postal Code\n                              \n\n                               Returns the weather history for a specified postal code and time period. Available for 2013 onward.\n                              \n\n\n\n\n\n\n\n                           Enter Latitude Location\n                          \n\n                           Enter the latitude for the location you want to see data for. This should be a decimal latitude value between 0 and 90. For example:\n                           \n                            32.7153\n                           \n\n\n\n\n                           Enter Longitude Location\n                          \n\n                           Enter the longitude for the location you want to see data for. This should be a decimal longitude value between -180 (West) and 180 (East). For example:\n                           \n                            -117.5134\n                           \n\n\n\n\n                           Period to Use\n                          \n\n                           Specify whether you want data in your report to be broken down by hour or day.\n                          \n\n\n\n                           Start Date\n                          \n\n                           Select the start date for the data you want to see in your report.\n                          \n\n\n\n                           End Date\n                          \n\n                           Select the end date for the data you want to see in your report.\n                          \n\n\n\n                           Select Country\n                          \n\n                           Select the country you want to return data for.\n                          \n\n\n\n                           Enter Zip Code\n                          \n\n                           Enter a comma-delimited list of the ZIP codes you would like to use. Partial US ZIP codes are allowed, which will be expanded to include all US ZIP codes beginning with that partial ZIP code.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042931054", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003361", "Archived Date": "", "Language": "English", "Primary Version": "Weather Source Connector", "Article Total View Count": "2,410", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Weather Source Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}