{"file_path": "../../raw_kb_v2\\article\\360043436133\\index.html", "content": {"title": "\n\n\n Microsoft Dynamics CRM Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Microsoft Dynamics CRM is a CRM business solution that drives sales productivity and marketing effectiveness through social insights, business intelligence and campaign management.\n\nThe Domo Microsoft Dynamics CRM Connector allows you to retrieve data on your defined entities within Microsoft Dynamics CRM. For more information about the Microsoft Dynamics CRM API, visit their website. (\n\nhttps://msdn.microsoft.com/en-us/lib.../bb928212.aspx\n\n)\n\n\n You connect to your Microsoft Dynamics CRM installation in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft Dynamics CRM connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is appropriate for:\n * Sales management\n* Marketing lead generation\n* Pipeline management\n |\n|\n**Primary Metrics**\n | * Leads generated\n* MQL\n* MQO\n* SAO\n* Won Deals\n* Open Opportunities\n* Win Rates\n* Average Deal Size\n |\n|\n**Primary Company Roles**\n |\n Salespeople, executives, etc.\n  |\n|\n**Average Implementation Time**\n |\n 30 hours\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 8\n  |\n\nBest Practices for Consulting/Support\n---------------------------------------\n\nThe Microsoft Dynamics CRM API returns ID numbers instead of names. Within the API itself, there is likely a lookup table of some sort that is used to provide the actual data; however, that lookup table data is not available to be pulled through the API. If the customer needs to get around this, you may need to build a lookup process in Domo. There may be some kind of API setting that returns sensitive data as GUIDs or something similar. It may also be something the client has control over; for example, in their their settings, they might have the option to \"mask\" those kind of values in API calls. You may want to look over the API docs or get on the phone with the client's Microsoft liaison to confirm.\n\n\n Prerequisites\n---------------\n\nTo connect to your Microsoft Dynamics CRM installation in order to retrieve information, you must have the following:\n\n The URL of your Dynamics CRM installation.\n* The username you use to log into the Dynamics CRM installation.\n* The password you use to log into the Dynamics CRM installation.\n\nConnecting to Your Microsoft Dynamics CRM Installation\n--------------------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Microsoft Dynamics CRM Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to a Microsoft Dynamics CRM installation. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n URL\n  |\n Enter the URL of your Dynamics CRM installation. For example:\n\nmycompany.crm.dynamics.com\n\n\n |\n|\n Username\n  |\n Enter the username you use to log into the Dynamics CRM installation URL.\n  |\n|\n Password\n  |\n Enter the password you use to log into the Dynamics CRM installation URL.\n  |\n\n\n Once you have entered valid Microsoft Dynamics CRM credentials, you can use the same account any time you go to create a new Microsoft Dynamics CRM DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains menus in which you can select a Microsoft Dynamics CRM entity and attributes for your report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Entity\n  |\n Select the entity for your report. This list includes every entity in the Dynamics CRM installation that the authenticated user has access to.\n  |\n|\n\nAttributes\n  |\n Select all attributes for the given entity you want to appear in your report. This menu is not populated until you select an entity in the Entity menu.\n  |\n\n##\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436133\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003895\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMicrosoft Dynamics CRM Connector\n\n", "article_total_view_count": "\n\n\n 4,804\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "microsoft_dynamics_crm_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}