{"file_path": "../../raw_kb_v2\\article\\360042933014\\index.html", "content": {"Title": "Publications Page Layout", "Article Body": "Intro\n                        \n\n\n\n\n\n                        In the Publications page, you can create and and manage slideshows of your cards. When you save a slideshow, the slideshow appears in the Publications page; you can access options for the slideshow (such as editing, deleting, etc.) by mousing over the slideshow.\n                       \n\n                        Access this page by clicking\n                        \n                         More\n                        \n                        in the toolbar at the top of the screen then selecting\n                        \n                         Publications\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           This topic discusses the general layout of the\n                           \n                            Publications\n                           \n                           page. For information about creating and managing slideshows, see\n                           \n                            Sharing Content Using Slideshows\n                           \n                           .\n                          \n\n\n\n\n                        Create New Slideshow dialog\n                       \n\n                        You can create a slideshow by clicking\n                        \n                         New Slideshow\n                        \n                        , which displays a dialog where you can add or remove slides.\n                       \n\n                        The following screenshot shows the most important parts of this dialog:\n                       \n\n\n\n\n                        You can learn more about these components in the following table:\n                       \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Slideshow title\n                           \n\n\n\n                            Contains the title of this slideshow. If you want, you can enter your own title; otherwise, the slideshow will be called \"Untitled.\"\n                           \n\n\n\n\n\n                            Slides\n                           \n\n\n\n                            Displays slides of cards added to this slideshow. You can remove a slide from the slideshow by mousing over a slide then clicking the \"x\" that appears.\n                           \n\n\n\n\n\n                            Add cards area\n                           \n\n\n\n                            Lets you search for cards by name that you can click to add slides.\n                           \n\n\n\n\n\n                            Save button\n                           \n\n\n\n                            Saves the selected cards as a slideshow.\n                           \n\n\n\n\n\n                        Publications page\n                       \n\n                        After you create a slideshow, the slideshow appears in the\n                        \n                         Publications\n                        \n                        page. Each slideshow displays its title, the number of cards it contains, and its publish status. The publish status of a slideshow may be any of the following:\n                       \n\n\n\n\n\n                            Publish status\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Not Published\n                           \n\n\n\n                            The slideshow has been published but is not being shared with others—no URL has been generated.\n                           \n\n\n\n\n\n                            Public\n                           \n\n\n\n                            The slideshow can be accessed on the Web using the URL.\n                           \n\n\n\n\n\n                            Private\n                           \n\n\n\n                            The slideshow can be accessed on the Web using the URL and the access code.\n                           \n\n\n\n\n\n                        In the wrench menu for a slideshow, you can access various options.\n                       \n\n\n\n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Play\n                           \n\n\n\n                            Plays the slideshow in the viewer in Domo. For more information about the slideshow viewer, see\n                            \n                             Using the Slideshow Viewer\n                            \n                            .\n                           \n\n\n\n\n\n                            Download\n                           \n\n\n\n                            Exports the slides in the slideshow as a Microsoft PowerPoint presentation. For more information, see\n                            \n                             Exporting Publications\n                            \n                            .\n                           \n\n\n\n\n\n                            Edit\n                           \n\n\n\n                            Opens a dialog where you can add or remove card slides, reorder slides, and rename the slideshow. Any changes you make are saved when you click\n                            \n                             Save\n                            \n                            .\n                           \n\n\n\n\n\n                            Publish\n                           \n\n\n\n                            Displays a dialog where you can set the options for sharing the slideshow.\n                           \n\n\n\n\n\n                            Delete\n                           \n\n\n\n                            Deletes the slideshow from Domo.\n                           \n\n\n\n\n\n                        Publish dialog\n                       \n\n                        You can publish a slideshow by mousing over a slideshow, then clicking\n                        \n                         Publish\n                        \n                        , which displays a dialog where you can set publish options.\n                        \n\n\n\n\n\n\n\n\n\n                            Publish Status\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Not Published\n                           \n\n\n\n                            The slideshow is not published. Others cannot view the slideshow on the Web.\n                           \n\n\n\n\n\n                            Public\n                           \n\n\n\n                            The slideshow can be viewed on the Web using its URL (without an access code).\n                           \n\n\n\n\n\n                            Private\n                           \n\n\n\n                            The slideshow can be viewed on the Web using its URL and an access code.\n                           \n\n\n\n\n\n                        When publishing a slideshow, you can also send an email, with the URL and access code, inviting others to view the slideshow.", "Preview Article": "Click here to preview", "URL Name": "360042933014", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004261", "Archived Date": "", "Language": "English", "Primary Version": "Publications Page Layout", "Article Total View Count": "4,947", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Publications Page Layout\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Publications (Slideshows)\n              \n", "url": "/s/topic/0TO5w000000Zao7GAC"}]}