{"file_path": "../../raw_kb_v2\\article\\360042933754\\index.html", "content": {"Title": "Inline Editing User Guide", "Article Body": "Intro\n                       \n\n                        Inline Editing is a premium app that allows you to modify DataSets in Domo directly from the card in Domo.\n                        \n                        You can find the app in the Domo Appstore.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           Due to an issue with our underlying persistence layer, you cannot have any periods or dots in your column names. Example:\n                           \n\n                             my.column.name\n                            \n\n                           . This prevents the DataSet from loading in the app.\n                          \n\n\n\n\n                        This article describes app configuration and how to perform tasks within the app in the following topics:\n                       \n\n\n\n                          Prerequisites\n                         \n\n\n\n                          Known limitations\n                         \n\n\n\n                          Upsert DataSets\n                         \n\n\n\n                          Page Filters setup\n                         \n\n\n\n                          Mapping DataSets to the app\n                         \n\n\n\n                          Configuring the app\n                         \n\n\n\n                          Tabs\n                         \n\n\n\n                          Tab settings\n                         \n\n\n\n                          Using the app\n                         \n\n\n\n                          Writing back changes\n                         \n\n\n\n                          Change log\n                         \n\n\n\n                          Migrating to the new version of Inline Editing\n                         \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        Only app admins can configure the app's internal settings. To add admins, create a Domo Group and name it _Inline_Edit_Owners, and then add admins to this Group. If the Group does not exist, the app runs but no users can make changes to it.\n                       \n\n                        To learn about Domo Groups, see\n                        \n                         Creating and Managing User Groups\n                        \n                        .\n                       \n\n\n\n                        Known Limitations\n                       \n\n                        The following are known limitations in the current version of the app:\n                       \n\n\n                         Standard DataSets are limited to 100,000 rows and/or 500 columns. If you need to use a larger DataSet, first convert it to an upsert DataSet. Learn how to do this in the\n                         \n                          Inline Editing Implementation Guide.\n                         \n\n\n                         If a mechanism external to the app is in place and modifies the data in the DataSet, such as a DataFlow, the changes written from the app are overwritten by the mechanism.\n                        \n\n                         The app checks for changes to the DataSet every few seconds. If multiple people are actively using the app, and one of them commits changes, the app warns the other users of the action and their changes must be dropped to continue using the app.\n                        \n\n\n\n\n                        Upsert DataSets\n                       \n\n                        You can configure Inline Editing to use any DataSet in Domo. However, when changes are written back to the DataSet, there are two ways of sending the changes, described below.\n                       \n\n\n                         In a standard, default DataSet, the app must download the entire DataSet (in sections), apply the changes to the target rows, and re-upload the modified DataSet. This process can potentially take a long time, depending on the size of the DataSet.\n                        \n\n                         In an upsert DataSet, changes are only sent for the rows that are being modified, added, or deleted, using the values in the key columns. Because of the shorter potential writeback time, you may consider converting your DataSets to upsert DataSets. To learn how, see the\n                         \n                          Inline Editing Implementation Guide\n                         \n                         .\n                        \n\n\n\n\n                        Page Filters Setup\n                       \n\n                        Inline Editing provides an in-app way to filter the data. However, the Filters applied to the Domo dashboard where the app card is placed can also be read and used by the app.\n                       \n\n                        In order for the columns used in the DataSets in the app to be available as Page Filters, these DataSets must be mapped properly. To learn how to do this, see\n                        \n                         Mapping DataSets to the App\n                        \n                        , below. The app allows for up to 30 DataSets (in 30 tabs) to exist at the same time.\n                       \n\n                        Whenever you add a tab, you must map the DataSet in that tab.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note the following:\n                            \n\n\n\n\n\n\n\n                               Each DataSet can only be linked to one tab. After it is linked, you cannot add a second tab pointing to the same DataSet.\n                              \n\n\n\n\n\n                               If you remove a tab, you do not necessarily need to remove the DataSet from the mapping. Doing so, however, cleans up the list of Filters and keeps a cleaner list of mapped DataSets.\n                              \n\n\n\n\n\n\n\n\n\n\n                        Mapping DataSets to the App\n                       \n\n                        Follow these steps to map DataSets to the app:\n                       \n\n\n\n\n                         Hover over the app to display\n                         \n\n                          Card options\n                         \n                         in the top right corner, and select it.\n                         \n                         The card options display.\n                        \n\n                         Select\n                         \n\n                          Edit Card.\n                         \n\n                         The card editor displays.\n                        \n\n                         (Optional) Check the box for\n                         \n                          Fullpage\n                         \n                         if you want to see the full page of the app as you edit.\n                         \n\n\n\n\n                         At the bottom of the card editor, the data\n                         \n                          Mapping\n                         \n                         area displays. There are two sections:\n                         \n\n                          DataSets\n                         \n                         and\n                         \n\n                          Collections\n                         \n                         .\n                         \n                         During the configuration process, if you see a red indicator like the one shown below for either tab, it means there is an issue with the mapping for that tab.\n                         \n\n\n\n\n                         Go to the\n                         \n\n                          DataSets\n                         \n                         section, if it is not already open.\n                        \n\n                         Select the DataSet list to expand it and view the 30 slots for mapped DataSets. If the slot has a placeholder DataSet, that means it is not being used.\n                         \n\n\n\n\n\n\n\n                         Select an unused slot. (The order in which you map the DataSets does not affect app functionality.) You can also replace a DataSet with another DataSet if needed.\n                        \n\n                         After you choose a slot, under\n                         \n                          Select DataSet\n                         \n                         , select the button to display the\n                         \n                          Select a DataSet\n                         \n                         modal.\n                         \n\n\n\n\n                         In the modal, search for and select your DataSet, and then select\n                         \n                          Choose DataSet\n                         \n                         to return to the card editor.\n                         \n\n\n\n                          You can select\n                          \n                           Clear Data Mapping\n                          \n                          to reset the DataSet's mapping.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             Sometimes when you switch a DataSet, the list of Page Filters for the dashboard where the app card displays does not update automatically. When this happens, the columns from the newly mapped DataSet are not included.\n                             \n                              A quick fix is to close the Page Filters bar on your dashboard, reload the page, and open the Page Filters bar again. If you do this and still can't see the correct Page Filters, please contact\n                              \n                               Domo Support\n                              \n                              .\n                             \n\n\n\n\n\n\n                         Repeat steps 6–8 to map as many DataSets as you need.\n                        \n\n                         When you finish mapping DataSets to the app, select\n                         \n                          Save & Finish\n                         \n                         at the top of the card editor to close it and keep your changes.\n                        \n\n\n\n\n\n\n\n\n\n\n                            Admin Note:\n                           \n                           By default, the app automatically uses the Page Filters that apply to the active tab to filter the data displayed in the table. However, as an admin, you can go to\n                           \n                            Settings\n                           \n                           >\n                           \n                            Filters\n                           \n                           for the app and configure whether and how the app uses Page Filters.\n                           \n\n\n\n\n\n\n\n\n\n                        Configuring the App\n                       \n\n                        App admins can configure app settings. To learn how to designate app admins, see\n                        \n                         Prerequisites\n                        \n                        , above.\n                       \n\n\n\n                        Tabs\n                       \n\n                        Tabs contain DataSets, allowing you to edit DataSets directly from the app. This is the main function of Inline Editing. Admins can add, delete, and configure tabs. These processes are described below.\n                       \n\n                        Adding a Tab\n                       \n\n\n                         At the bottom of the default screen, beside the tabs, admins seen the option to\n                         \n\n                          Add new tab.\n                         \n                         If you do not see this option, you are not part of the admin group.\n                         \n                         To learn how to add admins to the group, see\n                         \n                          Prerequisites\n                         \n                         , above.\n                        \n\n                         Select\n                         \n                          + Add new tab\n                         \n                         .\n                         \n                         The\n                         \n                          Add New Tab\n                         \n                         modal displays.\n                        \n\n                         On the left side of the modal, search for and select a DataSet you want to add to the app.\n                         \n                         The right side of the modal displays DataSet details and a preview of the DataSet.\n                        \n\n                         Press\n                         \n                          Select\n                         \n                         or\n                         \n                          Cancel\n                         \n                         .\n                         \n\n                           If you press\n                           \n                            Select\n                           \n                           , you are prompted to enter a\n                           \n                            Tab Name\n                           \n                           and can then select\n                           \n                            Create Tab\n                           \n                           .\n                          \n\n                           If you select Cancel, you return to the app—no new tab is created.\n                          \n\n\n\n\n                        Deleting a Tab\n                       \n\n\n                         Select the tab you want to remove at the bottom of the app.\n                         \n                         The selected tab turns blue and displays a\n                         \n                         kebab menu beside the tab name.\n                        \n\n                         Select the kebab menu to display the option to\n                         \n                          Delete Tab\n                         \n                         .\n                        \n\n                         Select\n                         \n                          Delete Tab\n                         \n                         .\n                         \n                         A dialog displays warning that the tab and all related settings and stored changes will be removed and that the action is not reversible.\n                         \n\n\n\n\n                         Select\n                         \n                          Confirm.\n                         \n\n\n\n\n\n                        Tab Settings\n                       \n\n                        Since settings are for an individual tab, admins must make changes to each tab if they want changes to apply to that tab.\n                       \n\n                        To modify the settings for an active tab, admins can select\n                        \n\n                         Tab\n                        \n\n                         Settings\n                        \n                        in the app toolbar.\n                        \n                        The\n                        \n                         DataSet Settings\n                        \n                        modal displays.\n                       \n\n                        There are four sections in\n                        \n                         DataSet Settings\n                        \n                        :\n                       \n\n\n\n\n                           Permissions\n                          \n\n\n\n\n\n                           Columns\n                          \n\n\n\n\n\n                           Filters\n                          \n\n\n\n\n\n                           Date Format\n                          \n\n\n\n\n                        Settings cannot be modified if a user has made changes to the table in the active tab and has not saved and written them back to the DataSet. You must discard any unsaved changes before attempting to modify the tab settings.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           After modifying any\n                           \n                            Tab Settings,\n                           \n                           select\n                           \n                            Apply\n                           \n                           to save your changes.\n                          \n\n\n\n\n                        The following describes each section of the settings.\n                       \n\n\n\n                        Permissions\n                       \n\n                        The\n                        \n                         Permissions\n                        \n                        settings allow admins to decide the types of changes that users can make in the app, described below. Check the boxes for the options you wish to enable.\n                        \n\n\n\n\n                          Edit cells —\n                         \n                         Allows users to make changes to existing values in the DataSet.\n                        \n\n\n                          Add rows —\n                         \n                         Allows users to create new rows.\n                        \n\n\n                          Delete rows —\n                         \n                         Allows users to mark rows for deletion the next time changes are written to the DataSet.\n                        \n\n\n                          Bulk edit —\n                         \n                         Allows users to view the\n                         \n                          Bulk Edit\n                         \n                         button and modify the values of all the cells under a selected column.\n                        \n\n\n\n\n                        Columns\n                       \n\n                        The\n                        \n                         Columns\n                        \n                        settings allow admins to control the column configurations and which columns are editable from the app.\n                       \n\n\n\n\n                        The modal displays a list of each column in the DataSet. except key columns (upsert DataSets). The only edit you can make to key columns is the column name, from the main screen of the app.\n                       \n\n                        If the DataSet/tab already has changes in any field, admins cannot change the column configuration—all changes must first be discarded.\n                        \n\n                        In the modal, each displayed column has the following controls beside the column name:\n                       \n\n\n\n\n                          Order —\n                         \n                         Use these handles to drag and drop the columns to rearrange their order.\n                        \n\n\n\n                          Hide/View —\n                         \n                         Toggle between making the columns visible or hiding them. When a column is hidden, the icon is grayed out.\n                        \n\n\n                        Next to the list of columns, at the top of the right side of the modal, the name of the active column displays along with three checkboxes, described below:\n                       \n\n\n\n                          editable —\n                         \n                         Check this box to make the column editable by app users. An\n                         \n\n                          Edit\n                         \n                         icon displays beside the column name in the column list.\n                        \n\n\n                          required —\n                         \n\n                          Check this box to make the column required - what does it mean?\n                         \n                         If the column is not marked as editable, you must mark it editable before being able to mark it required. If this option is enabled, then each cell in the column must have content. If there are empty cells n required columns, user experience the following errors:\n                         \n                         · Users cannot navigate away from the dashboard or DataSet.\n                         \n                         · Users cannot change the number of rows displayed per page.\n                         \n                         · Users cannot write to the DataSet.\n                         \n                         · Auto-save of temporary changes skips rows with required, empty cells (invalid cells).\n                        \n\n\n                          pinned —\n                         \n                         Check this box to pin the column to the top of the column list in the modal and to fix the column's position in the DataSet.\n                         \n                         In the modal, the\n                         \n\n                          Order\n                         \n                         option is not available for a pinned column.\n                         \n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             Pinned columns move to the first position on the left side of the table in the app. You cannot have pinned columns on the right side of the table view.\n                            \n\n\n\n\n\n\n\n\n                       The last area in the\n                       \n                        Columns\n                       \n                       settings is\n                       \n                        Column label\n                       \n                       . In this area, you can edit the column name that displays in the table. For some columns, you can also define an\n                       \n                        Input type\n                       \n                       —how users interact with the fields in that columns. Possible options include\n                       \n                        Manual input\n                       \n                       and\n                       \n                        Option list\n                       \n                       .\n                       \n\n\n                        Filters\n                       \n\n                        The\n                        \n                         Filters\n                        \n                        settings allow admins to define the way Page Filters and In-App Filters are used to filter the data displayed in the DataSet/table.\n                       \n\n\n\n                          Use Page Filters —\n                         \n                         When this box is checked, Filters defined in the dashboard where the app card displays are transferred to and used by the app.\n                        \n\n\n                          Disable In-App Filters —\n                         \n                         When this box is checked, In-App Filters are removed, and only Page Filters defined in the dashboard where the app card displays are used by the app. Checking the box also removes the\n                         \n                          Filter\n                         \n                         option from the app toolbar.\n                        \n\n\n                          Conflicting\n                         \n\n                          Filters —\n                         \n                         When a column has both a Page Filter and an In-App Filter, only one can be used. This setting allows admins to control which Filter type is used when there is a conflict.\n                        \n\n\n\n\n\n\n\n                        Date Format\n                       \n\n                        The\n                        \n                         Date Format\n                        \n                        setting allows admins to control the way that date fields display on the table view.\n                        \n                        Possible options include:\n                       \n\n\n\n                          Default —\n                         \n                         Date displays in this format: Jan 6, 2023\n                        \n\n\n                          Date shorthand —\n                         \n                         Date displays as MM/DD/YYYY\n                        \n\n\n                          Full date —\n                         \n                         Date displays in this format: January 6, 2023\n                        \n\n\n                          YYYY-MM-DD —\n                         \n                         Date displays in the given format.\n                        \n\n\n                          Custom —\n                         \n                         Admin can define a custom format from options available in the modal.\n                        \n\n\n\n\n                        Using the App\n                       \n\n                        This section describes some common tasks within the app.\n                       \n\n                        Edit Cells\n                       \n\n                        To edit a cell, select it. (The font inside editable cells is blue.) Select outside of the cell to exit edit mode.\n                        \n                        Editable columns have a blue background header.\n                       \n\n                        Add Rows\n                       \n\n                        To add a row, select\n                        \n\n                         Switch to ADD mode\n                        \n                        . A table in add mode displays.\n                        \n                        To add a new row, select\n                        \n\n                         Add new row\n                        \n                        . A new row displays at the bottom of the table.\n                       \n\n                        All fields in required columns and key columns are required in new rows. Temporary changes are not saved until all these fields have a value, or if the entire new row is empty.\n                       \n\n                        New rows always display at the bottom of the table on every page of the table.\n                       \n\n                        Delete Rows\n                       \n\n                        To mark a column for deletion the next time the DataSet is written back, select the\n                        \n                        kebab menu for the row. Select\n                        \n                         Mark for deletion\n                        \n                        .\n                       \n\n                        Reset Row\n                       \n\n                        If a row has changes in any field, you can reset the entire row by selecting the\n                        \n                        kebab menu for the row and then selecting\n                        \n                         Reset row changes.\n                        \n\n\n                        Toolbar\n                       \n\n                        The following table describes the toolbar options available on the default screen of the app (Edit mode).\n                       \n\n\n\n\n\n                            Icon\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n\n                            App Filters —\n                           \n                           Select this option to display the\n                           \n                            Filter Data\n                           \n                           modal. After applying a Filter, only the rows displayed are affected by manual or bulk edit changes. However, if changes have already been made before filtering the data, those changes are maintained and are applied when writing back to the DataSet.\n                          \n\n\n\n\n\n\n\n                            Discard changes\n                           \n\n                            —\n                           \n                           Resets all changes, from all pages, in the current DataSet.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Switch to ADD mode —\n                            \n                            Displays the table in add mode.\n                           \n\n                            In add mode, the following option displays in the toolbar:\n                           \n\n\n\n                             Add new row —\n                            \n                            Adds a new row to the bottom of the table.\n                           \n\n\n\n\n\n\n\n\n                            Bulk Edit —\n                           \n                           Allows users to edit all cells under a column at the same time.\n                           \n\n                           Follow these steps to perform a bulk edit:\n                           \n\n                             Select\n                             \n\n                              Bulk Edit\n                             \n                             in the toolbar. The window displays.\n                            \n\n                             Select the target column and new values for those columns.\n                            \n\n                             Select\n                             \n                              Apply\n                             \n                             . To apply the changes, the app must download the entire DataSet in sections and apply the changes to each section. Depending on the size of the DataSet, this can take quite some time. A progress view displays to the user while the changes are being applied. Applying a Bulk Edit does not submit the changes. You must still write back to the DataSet manually.\n                            \n\n\n\n\n\n\n\n\n\n                            Bulk Delete —\n                           \n                           Allows users to mark all cells under a column for deletion.\n                          \n\n\n\n\n\n\n\n\n                             Adjust font size —\n                            \n                            Increase or decrease the font size with the controls, or select the font size from the list.\n                           \n\n                            The last font size you select is stored locally.\n                           \n\n\n\n\n\n\n\n\n                            Wrap Text —\n                           \n                           Wraps the text in table cells.\n                          \n\n\n\n\n\n\n\n                            Save Layout —\n                           \n                           Saves the current table layout and displays it when the user returns to the app.\n                          \n\n\n\n\n\n\n\n                            Reset Layout —\n                           \n                           Resets the layout to the default configuration.\n                          \n\n\n\n\n                           /td>\n                          \n\n\n                            Enter fullscreen —\n                           \n                           Opens the app in fullscreen mode. Select the button again to exit fullscreen\n                          \n\n\n\n\n\n\n\n                            Tab Settings —\n                           \n                           Admins can use this option to access the\n                           \n                            DataSet Settings\n                           \n                           .\n                          \n\n\n\n\n\n\n\n                            Help —\n                           \n                           Opens the\n                           \n                            Help\n                           \n                           modal. Users can access this guide from inside the app.\n                          \n\n\n\n\n                        Sort Column\n                       \n\n                        Sort the columns by selecting\n                        \n\n                         Sort\n                        \n                        for that column.\n                       \n\n                        The first time you select\n                        \n\n                         Sort\n                        \n                        , the column sorts in ascending order. The second time, the column sorts in descending order. The third time resets the column.\n                        \n                        Because you can sort multiple columns, a number next to the sort icon indicates the sorting priority, shown here:\n                        \n\n\n\n\n                        Writing Back Changes\n                       \n\n                        When you are ready to submit all changes and write them back to the DataSet, select\n                        \n                         Write to Dataset\n                        \n                        .\n                        \n\n                        Selecting this button brings up a summary of the changes to be written back to the DataSet. From this view, select\n                        \n                         Confirm\n                        \n                        to begin the process. The app then sends and writes back the changes. This process can take some time.\n                        \n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           If you close the window, browser, or app during write back, the process is interrupted.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           To view a summary of the changes to that tab before selecting Write to DataSet, select\n                           \n\n                            Tab summary\n                           \n                           to view the total rows in the DataSet, rows changed, and rows added.\n                          \n\n\n\n\n                        If you do not have permission to write back to the DataSet, the app displays the following message: \"You have no WRITE permissions in this DataSet,\" and the ability to write to the DataSet is disabled.\n                       \n\n\n\n                        Change Log\n                       \n\n                        The app also creates a DataSet in Domo that acts as a change log for all the edits, added rows, and deleted rows submitted through the app.\n                       \n\n                        To access the change log, look for a DataSet in Domo with the name <dataset_id>_INLINE_CHANGE_LOG.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The DataSet name also has a hash (a string of characters and numbers) attached to it initially. After you access the DataSet, you can rename it. This doesn't affect change log functionality.\n                          \n\n\n\n\n\n\n                        Migrating to the New Version of Inline Editing\n                       \n\n                        If you are using an older version of Inline Editing and need to update your app, follow the instructions below.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Warning:\n                           \n                           Before you execute the steps below, make sure that you don’t have any unsaved changes in Inline Editing that have not been written back to the Domo DataSet, otherwise you’ll lose the changes.\n                          \n\n\n\n\n\n                         Hover over the app to display\n                         \n\n                          Card options\n                         \n                         in the top right corner, and select it.\n                         \n                         The card options display.\n                        \n\n                         Select\n                         \n\n                          Edit Card.\n                         \n\n                         The card editor displays.\n                        \n\n                         Select\n                         \n                          Save & Finish\n                         \n                         to create all collections necessary for app functionality.", "Preview Article": "Click here to preview", "URL Name": "360042933754", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004198", "Archived Date": "", "Language": "English", "Primary Version": "Inline Editing User Guide", "Article Total View Count": "5,344", "": "", "Article Created Date": "10/24/2022, 9:27 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Inline Editing User Guide\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}