{"file_path": "../../raw_kb_v2\\article\\360047411473\\index.html", "content": {"title": "\n\n\n Migrating to Workbench 4 from Previous Versions\n\n\n", "article_body": "\n\n\n**Important:**\n Support for Workbench 4 ended on\n **April 15, 2021**\n . Workbench may continue to run on installed machines, but it will no longer receive feature enhancements and security updates. When issues are encountered in Workbench 4, the recommended course of action from the Domo Support team will be to upgrade to the latest version of Workbench 5. To see this article for Workbench 5, click\n\n*here**\n\n.\n\nIntro\n---------\n\nThere are many reasons to migrate to the newest version of Workbench—bug fixes, performance enhancements and added features, to name a few. Domo Support will always be willing to troubleshoot issues with legacy versions, but we provide our best support when you’re running the latest version. Please consider regularly checking and upgrading to the latest version wherever possible. This will help you receive the best possible experience with Domo Workbench.\n\n\n Please note, before proceeding with any update or migration, that you must back up your jobs. Workbench 2 users can copy the locally-stored XML files. Workbench 3+ users must export each job individually. If there are any issues or errors, you may need backups. If possible, ask your IT department to take a full snapshot or backup of your VM, Server, or PC before doing any upgrade.\n\nFinding Your Current Version\n-------------------------------\n\nYou m\n\n\n ay be wondering whic\n\n\n h version you’re using now. You may also be asked by Domo Support to identify the version in order to provide customized support. There should be a blue icon in the system tray. If you hover over that icon, the version will be displayed.\n\nIf you don’t see the blue icon, try clicking this up arrow first\n\n. Alternatively, the version number will also be contained within the Workbench log files. (The default location for Workbench 4 log files is C:\\ProgramData\\Domo\\Workbench\\Logs.)\n\n*Note:**\n You may see multiple Workbench monitors in the system tray. You only need one monitor running and can close out all others.\n\n\n Turning Off Automatic Updates\n--------------------------------\n\nBy default, automatic updates are enabled and applicable to the latest major version, currently 4.x. If you are on Workbench 3, you will not automatically receive updates to Workbench 4. Likewise, if using v4.x, you will not be automatically upgraded to Workbench 5 when it becomes available.\n\n\n A\n\n\n utomatic updates include a restart of the Workbench service. Users who want change control and planned maintenance may be interested in turning the off the automatic update feature, as shown in the following screenshot:\n\nPlease plan for regular manual maintenance and updates to ensure the best performance from your Workbench application.\n\n\n Importing a Workbench 2 or 3 Job into Workbench 4\n---------------------------------------------------\n\nYou can install and simultaneously run Workbench 2.x and Workbench 4 on the same Windows machine. You cannot run Workbench 3 and 4 on the same machine.\n\n\n Upgrading from an older major version to a new one must be done manually. The latest version of Workbench, as well as some legacy versions, are available in Domo. For more information about downloading Workbench, please visit\n\nInstalling Workbench 4\n\n.\n **Please back up your jobs before proceeding with any upgrade.**\n\n\n**Workbench 2 Users**\n – You will be given the option to import your jobs from v2 into v4 upon running the installer. When moving from v2 to v3, all jobs must be moved manually because they are stored locally in v2.\n\n\n**Workbench 3 Users**\n – Workbench 4 will install over the top over version 3. Your jobs will automatically migrate for you.\n\n\n**Workbench 4 Users**\n\n\n – You will receive the latest release of Workbench through the automatic update system, if so enabled.\n\n\n In migrating from Workbench 2 or 3 to Workbench 4.x, note the following:\n\n You must now upload job files using a computer account, rather than a personal user or administrator account. Typically, a network administrator must grant you access rights to the computer so you can upload files.\n* Because Workbench runs as a service and cannot access the user space, only system DSNs work with Workbench, not user DSNs.\n* Job files are now imported into a central repository in Domo. If the file is not located on the local machine Workbench is running on, the user may need to set up impersonation for access rights.\n* Basic scheduling is no longer done using Windows Task Scheduler.  You now schedule basic jobs in Workbench by selecting a frequency (such as once per day, once per week, etc.). You cannot choose specific times in a day, specific days in a week, etc. However, advanced scheduling is available for groups of jobs using Windows Task Scheduler.\n* When Workbench 4 is first launched, an attempt is made to detect Workbench 2 jobs and perform an automatic migration. If the migration is successful, Workbench 2 jobs are disabled and backed up/archived if necessary. After this initial launch, if you import a Workbench 2 job into Workbench 4, you must manually disable the job in Workbench 2 so data is not updated from both versions.\n\n\n**Important:**\n\n\n Because Workbench jobs get encrypted at the time of job creation, it is best practice to keep an exported and unencrypted backup stored locally or on a network.  If the computer used to create the jobs becomes unavailable, you will always have a backup of the jobs that will easily import (re-encrypt) into a new Workbench on a different computer.\n\n\n**To import a Workbench 2 or 3 job into Workbench 4,**\n\n. In Workbench 4, click\n **Tools > Import**\n , then select the Workbench 2 or 3 job configuration file (XML) you want then click\n **Next**\n .\n2. (Conditional) If asked whether you want to overwrite an existing job, select\n **Yes**\n to overwrite or\n **No**\n and enter a new name if you do not want to overwrite the existing file.\n3. Click\n **Next**\n .\n4. Click\n **Next**\n again to confirm.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360047411473\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004794\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMigrating to Workbench 4 from Previous Versions\n\n", "article_total_view_count": "\n\n\n 4,695\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:30 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "migrating_to_workbench_4_from_previous_versions", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_4", "url": "/s/topic/0TO5w000000ZapSGAS"}]}