{"file_path": "../../raw_kb_v2\\article\\360042932014\\index.html", "content": {"title": "\n\n\n Google Drive Service Connector\n\n\n", "article_body": "\n\n\n********Important********\n********:********\n Due to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. To create new Google Drive DataSets, use this connector. All pre-existing Google Drive DataSets will continue to run normally.\n\nIntro\n-------\n\nGoogle Drive is a file storage and synchronization service developed by Google that allows users to store files in the cloud, synchronize files across devices, and share files. Use Domo's Google Drive Service connector to retrieve Excel and CSV files from a Google Drive account and output them as Domo DataSets. To learn more about the Google Drive API, visit their page (\n\nhttps://developers.google.com/drive/\n\n).\n\n\n You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Drive connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to a Google service account, you must have a Google service account JSON key.\n\n\n Before creating your service account JSON key, you need to first enable the\n\nGoogle Drive API for your project in Google Cloud Platform console.\n\n\n####\n Enabling the Google Drive API\n\n\n To enable the Google Drive API for your project, do the following:\n\n\n 1. Go to the\n\nGCP Console\n\n.\n\n\n 2. Click\n **Library**\n under\n **APIs and services**\n in the left pane.\n\n3. Search for the\n **Google Drive API**\n and click on it.\n\n\n 4. Towards the top of the screen you will see an\n **ENABLE**\n button.\n\n5. Click\n **Enable**\n .\n\n\n####\n To generate a service account JSON key, do the following:\n\n1. In the\n\nGCP Console\n\n, open the\n ****IAM & Admin****\n page.\n\n\n 2. Click\n ********Service accounts********\n in the left-hand navigation pane.\n\n3. Click\n ********Create Service Account********\n .\n\n\n 4. In the\n\n\n**Service account details**\n\n\n section, enter a name and description for the service account.\n\n\n 5. Click\n\n\n**Create and Continue**\n .\n\n\n 6. Now, in the\n\n\n**Grant this service account access to the project**\n\n\n section, click\n\n\n**Select a role**\n\n\n drop down.\n\n\n 7. Select\n\n\n**Project-> Owner**\n .\n\n8. Click\n\n\n**Continue**\n .\n\n\n 9. Click\n\n\n**Done**\n . An overview of your service account will appear.\n\n\n 10. In the\n\n\n**Actions**\n\n\n column, click the three dots to expand the menu. Click\n\n\n**Manage Keys**\n .\n\n11.\n\nClick\n\n*Add Key**\n\n. Select\n\n*Create new key**\n\n.\n\n\n 12.\n **Create private key**\n\n\n window will appear. Select private key type as\n\n\n**JSON**\n\n\n and click\n\n\n**Create**\n .\n\n\n 13. A private key will be saved to your computer.\n\n\n Connecting to Your Google Service Account\n-------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Drive Service Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to a Google service account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Service Account Key JSON\n  |\n Copy and paste the JSON for your Google service account key. For information about creating a key, see \"Prerequisites,\" above.\n  |\n\nOnce you have entered a valid key, you can use the same account any time you go to create a new Google Drive Service DataSet. You can manage connector accounts in the\n ********Accounts********\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nIn this pane, you can choose to import a list of files in your Google Drive account or specify a Google Drive file to import into Domo and set options for how you want the data to appear.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select whether you want to import a list of files (\"Files\") or download a specific files (\"FileDownload\").\n\n\n|  |  |\n| --- | --- |\n|\n Files\n  |\n Returns list of files in drive.\n  |\n|\n File Download\n  |\n Imports a file from google drive into Domo.\n  |\n|\n Fetch Data from Shared Drives\n  |\n Select\n **Yes**\n if you want the connector to fetch data from the Shared Drives.\n  |\n\n|\n|\n How Would You Like to Choose Your File?\n  |\n Select how you want to choose the file you intend to import into Domo. Select\n ****Enter File Name****\n or\n **Enter File ID**\n to enter the name or ID yourself. Select\n ****Files Discovery****\n to choose your file from a list of files.\n  |\n|\n How would you like to match the Sheet Name?\n  |\n If the user selects\n **Contains**\n , the connector will retrieve the most recently uploaded file.\n  |\n|\n File ID\n  |\n Enter the ID of the file you want to import. To see all IDs for files in your account, run the \"Files\" report.\n  |\n|\n File Name\n  |\n Enter the name of the file you want to import from Google Drive.\n  |\n|\n Files Discovery\n  |\n Select the file you want to import into Domo.\n\n*Note:**\n The File Discovery option is available only if the number of files in the Google Drive account is less than or equal to 100.\n\n|\n|\n MIME Type\n  |\n Select the MIME type of the file you want to import into Domo.\n  |\n|\n What File Type Would You Like to Import?\n  |\n\nSelect the file type that you would like to parse and import.\n\n|\n|\n\nSelect the delimiting character\n\n|\n\nSelect the delimiting character used in your file. If your delimiter is not listed select 'Other.'\n\n|\n|\n\nSpecify your delimiter\n\n|\n\nEnter the character used to delimit your character separated values (CSV) text.\n\n|\n|\n\nQuote Character\n\n|\n\nSelect the desired quote character for parsing CSV files. (Double quote is the default quote character for CSV standard).\n\n|\n|\n Custom Quote Character\n  |\n Enter the custom quote character you want to use to parse your CSV file.\n  |\n|\n Escape Character\n  |\n Select the escape character to use to parse your CSV file. To choose a custom escape character, select\n ****Other****\n , then enter your delimiter in the\n ****Custom Escape Character****\n field.\n  |\n|\n Custom Escape Character\n  |\n Enter the custom quote character you want to use to parse your CSV file.\n  |\n|\n\nDate Format\n\n|\n\nSelect the date format that is used in the selected file.\n\n|\n|\n Header Start Row\n  |\n Enter the header start row for your Excel file.\n  |\n|\n Data Start Row\n  |\n Enter the data start row for your Excel file.\n  |\n|\n Footer Rows to Skip\n  |\n Enter the number of rows to skip at the end of your Excel file, if any.\n  |\n|\n\nHow would you like to match the sheet name?\n\n|\n\nSelect whether you would like to match the sheet name with a sheet that contains the provided name or is exactly equivalent to the provided name.\n\n|\n|\n\nFile Password\n\n|\n\nIf your file is password protected please enter file password.\n\n|\n|\n\nSheet Name\n\n|\n\nEnter the sheet name you want to retrieve from the specified spreadsheet be sure to check sheet name for accidental spaces, first sheet of the workbook will be used if the field is left blank.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What do I do if my Google Drive file is not visible in the \"Files\" report?\n\nIf you are unable to locate the driver file, please share the file or directory with the service account email (client\\_email found in the JSON key). You can find the email in Service Accounts.\n\n###\n My DataSet is returning a '403 Forbidden' error. Why?\n\nYou need to enable the\n\nGoogle Drive API for your project in Google Cloud Platform console.\n\nFor more details, see the 'Enabling the Google Drive API' section under Prerequisites.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits I should be aware of?\n\nNo.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042932014\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003934\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Drive Service Connector\n\n", "article_total_view_count": "\n\n\n 5,061\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_drive_service_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}