{"file_path": "../../raw_kb_v2\\article\\360043440693\\index.html", "content": {"Title": "July 2019 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        DataSet Alerts\n                       \n\n                        With DataSet Alerts, you can build more flexible and powerful Alerts right on a DataSet. Alerts can be triggered based on new rows being added, deleted, or updated. Unlike traditional Alerts, DataSet Alerts can be built on multiple trigger rules. And the Alert message can include complex calculations and even data from other DataSets—making the custom message more customizable and more useful. For example, instead of simply having an Alert message announcing that you gained a new customer account, you can create a much more specific message that tells you the name of the new customer, the amount of the deal, and any other information found in the DataSet.\n                       \n\n                        Be aware that this functionality is currently only supported in \"Replace\" DataSets,\n                        \n                         not\n                        \n                        \"Append\" or \"Upsert\" DataSets.\n                       \n\n                        With DataSet Alerts, your data is more meaningful and more informative.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Creating an Alert for a DataSet\n                        \n                        .\n                       \n\n                        Mobile 3.0\n                       \n\n                        With this release, a number of significant interface changes are now available for both our iOS and Android applications.\n                       \n\n\n\n                          New navigation for iOS\n                         \n                         . We're excited to announce an all-new navigation experience for the iOS Domo mobile application. Our new persistent navigation bar allows you to more quickly navigate through the application to find what you're looking for.\n                         \n\n\n\n\n\n\n                          New Card details for Android and IOS\n                         \n                         . An all new Card Details view is now available for Android and IOS versions of the Domo app. Now, as soon as you arrive on a Card you can begin interacting with it without having to make any extra taps. The view has also had a facelift, making it the best experience yet. In addition to an improved experience, you will also benefit from our new drill views where you can maintain context of the full drillpath and skip between steps if desired.\n                         \n\n\n\n\n\n\n\n                           Updated Profile for Android and iOS.\n                          \n                          We are excited to present a new profile view that makes it easier than ever to get insights about people in your organization. Now you can visit individual profiles to see which cards are top-of-mind for your teams; initiate conversations via Buzz, email, phone call, text message, or video chat; and quickly view employees' departments and positions in the org chart. With more prominent\n                          \n                           Activity\n                          \n                          ,\n                          \n                           Contact\n                          \n                          ,\n                          \n                           Related\n                          \n                          ,\n                          \n                           Organization\n                          \n                          , and\n                          \n                           Stats\n                          \n                          tabs, you can also get business signal, insights, and answers in one quick glance on your phone.\n                          \n\n\n\n\n\n\n                        Dynamic Notebook Card\n                       \n\n                        Notebook Cards now incorporate dynamic Summary Numbers into your text, similar to those that appear in your visualizations. And because they constantly update, your Notebook Cards will never go stale.\n                       \n\n                        To add a Summary Number to a Notebook Card, edit the Notebook Card and choose the\n                        \n                         Summary Number\n                        \n                        option. Choose the DataSet with data you want to summarize, along with the column and the desired aggregation type. Once you have added a Summary Number to your Notebook Card, it will update automatically anytime the data updates.\n                       \n\n\n\n\n                        Please note that some Notebook Cards will not automatically have this functionality. Newly created Notebook Cards will have this option, but for older Notebook Cards, you may need to first do an update.\n                       \n\n                        For more information, see\n                        \n                         Adding a Notebook Card\n                        \n                        .\n                       \n\n                        Stories improvements\n                       \n\n                        Background images for Pages\n                       \n\n                        Create highly customized Dashboards that match your brand by setting an image as the background to your Domo Story. No need to spend extra time and effort creating custom apps as a way to show your colors; just upload an image and leverage the full power of Domo Stories to create curated and branded experiences for all your users.\n                       \n\n                        Mobile, PDF, and PPT exports will include your selected background image. Scheduled Reports will\n                        \n                         not\n                        \n                        show a background image. These will show the default background color instead.\n                       \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n                        Mobile preview for Stories\n                       \n\n                        You can now create dashboards specifically for mobile consumption by previewing how your Domo Stories pages will appear when viewed on smartphones. Due to varying screen sizes for the many different screen sizes of phones that can be used for Domo,\n                        \n                         this preview is intended only to be used as a close approximation\n                        \n                        . Visible content for some cards (particularly Notebook Cards or tables) may vary slightly between the preview and the actual device being used.\n                        \n\n\n\n\n\n\n                        For more information, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n                        New Story shortcut\n                       \n\n                        You can now create a blank Domo Story Page in seconds. To do this, you simply choose\n                        \n                         New Story\n                        \n                        from the\n                        \n                        menu at the top of the screen. Telling your organization's data story has never been so easy!\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n                        Updated Alert Center\n                       \n\n                        By combining our existing Alert Management and Alert Center pages in Domo, we have created an all-new experience that is both more powerful and more simple to understand. Our new Alert Center provides all of the following perks:\n                       \n\n\n\n                          Search for Alerts based on owner, subscriber, created date, or status (enabled for disabled).\n                         \n\n\n\n                          Use pre-built Quick Filters to help you quickly navigate to important Alerts. You can filter to show triggered, owned, subscribed, or suggested Alerts, or those that need attention.\n                         \n\n\n\n                          Change subscription settings for individual Alerts.\n                         \n\n\n\n                          Receive Notifications via phone call! (Not available in all regions.)\n                          \n\n\n\n\n\n\n\n                        And if you were a fan of the \"hyperspace\" page that used to appear when you clicked on\n                        \n                         Alerts\n                        \n                        , don't worry—it's still there. Just click the\n                        \n                        icon on the left side of the screen to open it.\n                       \n\n                        For more information, see\n                        \n                         Alert Center Layout\n                        \n                        .\n                       \n\n                        Improved search filters\n                       \n\n                        The Global Search page in Domo has been revamped to help you find exactly what you need, when you need it. Filters have been moved into a left-hand navigation pane and are now context-sensitive, meaning you get different filter options depending on the search category you have selected. For example, if you run a search then select the\n                        \n                         Buzz\n                        \n                        category, Buzz-specific filter options become available, such as the ability to filter by message sender, conversation type, attachment status, and so on.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Searching in Domo\n                        \n                        .\n                       \n\n                        DomoStats People App\n                       \n\n                        With the DomoStats People App, you get access to data about your people, their roles and departments, and all of their Domo activities, all in one place. This makes it easier to see who is in your Domo instance, how actively everyone is using Domo, and who is creating content, managing security preferences, and updating cards.\n                        \n\n\n\n\n\n\n\n                        Only Admin users can install the DomoStats People App, but they can easily share the App with others in their organization.\n                        \n\n                        For more information, see\n                        \n                         DomoStats - People\n                        \n                        .\n                       \n\n                        Announcements\n                       \n\n                        Deprecation of Labs Stories\n                       \n\n                        As of July 16, 2019, any existing Labs Stories (i.e. those with a URL that includes\n                        \n                         /storyboard\n                        \n                        ) will no longer be available. Any content from these Pages that is still needed must be recreated in a new Domo Stories Page. Any customers who are part of the Story Embed Alpha will\n                        \n                         not\n                        \n                        be affected. These customers will still be able to access any existing Labs Stories they have created and will be able to create new ones.\n                       \n\n                        Getting help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking by clicking\n                        \n                        in the top navigation bar .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n                          \n                           /support\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043440693", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004423", "Archived Date": "", "Language": "English", "Primary Version": "July 2019 Release Notes", "Article Total View Count": "4,686", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              July 2019 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}