{"file_path": "../../raw_kb_v2\\article\\360042929314\\index.html", "content": {"title": "\n\n\n Google Tag Manager Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGoogle Tag Manager is a tag management system that allows you to easily track tags and related code fragments on your website or mobile app. Use Domo's Google Tag Manager connector to view your tag data in Domo. To learn more about the Google Tag Manager API, visit their page (\n\nhttps://developers.google.com/tag-manager/api/v2\n\n).\n\n\n You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Tag Manager connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Google account and create a Google Tag Manager DataSet, you must have your Google credentials.\n\n\n Connecting to Your Google Account\n-----------------------------------\n\nThis section enumerates the options in the\n ****Credentials****\n and\n ****Details****\n panes in the Google Tag Manager Connector page. The components of the other panes in this page,\n ****Scheduling****\n and\n ****Name & Describe Your DataSet,****\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google Tag Manager connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n ****Connect****\n (or select\n ****Add Account****\n if you have existing Google accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Tag Manager DataSet. You can manage connector accounts in the\n ****Accounts****\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n ****Reports****\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Google Tag Manager report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Accounts\n  |\n Lists all Google Tag Manager accounts you have access to.\n  |\n|\n Built-In Variables\n  |\n Lists all the enabled Built-In Variables of a Google Tag Manager Container.\n  |\n|\n Containers\n  |\n Lists all containers that belong to a Google Tag Manager account.\n  |\n|\n Environments\n  |\n Lists all Google Tag Manager environments of a Google Tag Manager container.\n  |\n|\n Folders\n  |\n Lists all Google Tag Manager folders of a container.\n  |\n|\n Tags\n  |\n Lists all Google Tag Manager Tags of a Container.\n  |\n|\n Triggers\n  |\n Lists all Google Tag Manager Triggers of a Container.\n  |\n|\n User Permissions\n  |\n Lists all users with access to the account.\n  |\n|\n Variables\n  |\n Lists all Google Tag Manager Variables of a Container.\n  |\n|\n Version Headers\n  |\n Lists all container versions of a Google Tag Manager Container.\n  |\n|\n Workspaces\n  |\n Lists all workspaces that belong to a Google Tag Manager Container.\n  |\n\n|\n|\n Account\n  |\n Select account.\n  |\n|\n Container\n  |\n Select container.\n  |\n|\n Workspace\n  |\n Select workspace.\n  |\n|\n Details\n  |\n Select the details to include in the data (It is not recommended to select more than 2 at once).\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929314\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003526\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Tag Manager Connector\n\n", "article_total_view_count": "\n\n\n 4,662\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_tag_manager_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}