{"file_path": "../../raw_kb_v2\\article\\360042935294\\index.html", "content": {"Title": "Best Practices for Choosing Chart Types", "Article Body": "The type of chart you select for a KPI card depends on the specific information you want to convey to your audience. For instance, to show financial fluctuations over time, you would want to use a line graph; to compare values, your best choice would be a bar graph; and so on. Choosing the wrong graph type for your data could impair your audience's ability to receive the message, so it is important that you understand when to use the different graph types.\n                       \n\n                        For a list of chart types available in Domo, see\n                        \n                         Available Chart Types\n                        \n                        .\n                       \n\n                        Information Type Table\n                       \n\n                        There are different types of information represented in charts. The most common of these, along with the most appropriate chart types to use, are listed in the following table. You can click a thumbnail image to see a larger image.\n                       \n\n\n\n\n\n                            Information Type\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Chart Type to Use\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            Nominal\n                           \n\n\n\n                            Used to compare values that have no specific order.\n                           \n\n\n\n                            Vertical or horizontal bar graph.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Ranking\n                           \n\n\n\n                            Used to compare one measure to another, along with its quantitative order relationship.\n                           \n\n\n\n                            Vertical or horizontal bar graph sorted in\n                           \n\n\n\n                              descending order to emphasize high values, or\n                             \n\n\n\n                              ascending order to emphasize low values.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Part-to-Whole\n                           \n\n\n\n                            Used to measure a single value against a whole.\n                           \n\n\n\n                            Vertical or horizontal Percent of Total graph. Pie graphs may also be used but are generally less effective at presenting data.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Time Series\n                           \n\n\n\n                            Used to compare measurements taken over equal time periods.\n                           \n\n\n\n                            Use\n                           \n\n\n\n                              a vertical bar graph when emphasizing measures and comparisons or\n                             \n\n\n\n                              a line graph when emphasizing the overall pattern.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Correlation\n                           \n\n\n\n                            Compares two pared sets of measures to determine how they correlate (for example, if one set increases, does the other increase or decrease, and by how much?).\n                           \n\n\n\n                            A Scatter Plot graph that shows points and a linear regression line.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Deviation\n                           \n\n\n\n                            Used to measure the difference between a value and a reference value.\n                           \n\n\n\n                            Use\n                           \n\n\n\n                              a line graph to emphasize the overall pattern with the time series, or\n                             \n\n\n\n                              a vertical bar graph to emphasize measures.\n                             \n\n\n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               In all graphs that represent deviation, be sure to include a deviation reference line against which to compare the measures.\n                               \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Single Distribution\n                           \n\n\n\n                            Used to count items per subdivision on an interval scale.\n                           \n\n\n\n                            Use\n                           \n\n\n\n                              a vertical bar graph or histogram to emphasize values, or\n                             \n\n\n\n                              a line graph to emphasize the overall pattern (frequency polygon).\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Multiple Distribution\n                           \n\n\n\n                            Used to measure the distribution of values for multiple subdivisions.\n                           \n\n\n\n                            Use\n                           \n\n\n\n                              a vertical or horizontal Bar or Box Plot graph that shows the high value to the low value or some portion of the range, or\n                             \n\n\n\n                              a Line or Box Plot graph to encode measures of center such as the mean or median.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Chart Type Diagram\n                       \n\n                        You can also use the following diagram to figure out the best chart type for your information type. To download this PDF to your computer, click\n                        \n                         here\n                        \n                        .\n                       \n\n\n\n\n                        Video\n                       \n\n\n\n                          Choosing Chart Types\n                         \n\n\n\n\n\n\n\n\n\n                        Other Best Practices Topics\n                       \n\n                        For more Domo best practices, visit the following topics:\n                       \n\n\n\n\n                           Projects and Tasks Best Practices\n                          \n\n\n\n\n\n                           Best Practices for Managing DataSets\n                          \n\n\n\n\n\n                           Best Practices for Creating KPI Cards\n                          \n\n\n\n\n\n                           Top 10 Dashboard Design Best Practices\n                          \n\n\n\n\n\n                           Best Practices for Standardizing KPIs\n                          \n\n\n\n\n\n                           Best Practices for Designing KPIs\n                          \n\n\n\n\n                        Or, for a handy Domo best practices guide, you can download the following PDF:\n                       \n\n\n\n\n                           Best Practices for cards, collections, datasets job aid.revised.pdf", "Preview Article": "Click here to preview", "URL Name": "360042935294", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004486", "Archived Date": "", "Language": "English", "Primary Version": "Best Practices for Choosing Chart Types", "Article Total View Count": "13,234", "": "", "Article Created Date": "10/24/2022, 10:12 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Best Practices for Choosing Chart Types\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Training\n              \n", "url": "/s/topic/0TO5w000000ZamyGAC"}, {"text": "\n\n               Self-Service Training\n              \n", "url": "/s/topic/0TO5w000000ZaoCGAS"}, {"text": "\n\n               Best Practices Resources\n              \n", "url": "/s/topic/0TO5w000000ZaoXGAS"}]}