{"file_path": "../../raw_kb_v2\\article\\360043436333\\index.html", "content": {"title": "\n\n\n Airtable Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAirtable is a cloud collaboration service that produces a spreadsheet-database hybrid, with the features of a database but applied to a spreadsheet. To learn more about the Airtable API, visit their page (\n\nhttps://airtable.com/api\n\n).\n\n\n You connect to your Airtable account in the Data Center. This topic discusses the fields and menus that are specific to the Airtable connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Airtable account and create a DataSet, you must have an Airtable API key. For information about obtaining an API key, go here:\n\nhttps://support.airtable.com/hc/en-u...et-my-API-key-\n\nConnecting to Your Airtable Account\n-------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Airtable Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Airtable account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n API Key\n  |\n Enter your Airtable API key. For information about obtaining an API key, see \"Prerequisites,\" above.\n  |\n\n\n Once you have entered a valid Airtable API key, you can use the same account any time you go to create a new Airtable DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains two fields in which you enter information for pulling in data from Airtable.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n App ID\n  |\n Enter the App ID of the Airtable app you want to retrieve information from. This ID must be a 100% match, including case and spaces. You can find your App ID by going to\n\nhttps://airtable.com/api\n\n, signing into your account, then selecting the desired report. The App ID can then be found in the URL following\n\n\n airtable.com\n\n\n and will begin with the word\n\napp\n\n.\n  |\n|\n Field Selection Method\n  |\n\nSpecify whether you want to select all fields/columns or enter the fields/columns manually that you want to fetch data for.\n\n|\n|\n Flatten Sublists\n  |\n Check this box if you'd like us to flatten sublists.\n\nChecking this box might result in errors occurring due to too many columns.\n\nNot flattening might result in some boxes having the value List instead of the actual data sublist\n\n|\n|\n Table\n  |\n Enter the name of the table you want to pull into Domo. This name must be a 100% match, including case and spaces.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How often can the data be updated?\n\nAs often as needed.\n\n####\n Are there any API limits I should be aware of?\n\nThe API has a limit of 5 requests per second.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436333\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003307\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAirtable Connector\n\n", "article_total_view_count": "\n\n\n 2,504\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "airtable_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}