{"file_path": "../../raw_kb_v2\\article\\360043433253\\index.html", "content": {"Title": "Domo JSON Connector", "Article Body": "Intro\n                       \n\n                        Use the Domo JSON connector to retrieve JSON content definitions from a specified Domo instance.\n                       \n\n                        You connect to your Domo JSON account in the Data Center. This topic discusses the fields and menus that are specific to the Domo JSON connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Domo JSON account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The Domo URL you want to retrieve information from\n                         \n\n\n\n                          The username and password for the specified Domo instance\n                         \n\n\n\n                        Connecting to Your Domo JSON Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Domo JSON Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Domo JSON account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter the username of the Domo instance you want to pull data from.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter the password of the Domo instance you want to pull data from.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Domo JSON credentials, you can use the same account any time you go to create a new Domo JSON DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a single field in which you enter your Domo URL.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           URL\n                          \n\n                           Enter the URL of the Domo instance you want to pull information from. The username and password you entered in the\n                           \n                            Credentials\n                           \n                           pane must match this URL.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQs\n                       \n\n                        How frequently will my data update?\n                       \n\n                        As often as needed.\n                       \n\n                        Are there any API limits I should be aware of?\n                       \n\n                        No.\n                       \n\n                        Can I use the same Domo JSON account for multiple DataSets?\n                       \n\n                        Yes.", "Preview Article": "Click here to preview", "URL Name": "360043433253", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003588", "Archived Date": "", "Language": "English", "Primary Version": "Domo JSON Connector", "Article Total View Count": "4,824", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Domo JSON Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}