{"file_path": "../../raw_kb_v2\\article\\360043428753\\index.html", "content": {"Title": "Configuring Your Chart Summary Number", "Article Body": "Intro\n                       \n\n                        The\n                        \n                         Summary Number\n                        \n                        for a chart is the single value that represents the data in that chart. The Summary Number appears at the top of a KPI Card. For example, the Summary Number shows the maximum value in the following chart.\n                        \n\n\n\n\n\n\n                        The properties you can change for a chart Summary Number include the following:\n                       \n\n\n\n                          The DataSet column from which the Summary Number is derived.\n                         \n\n\n\n                          The type of aggregation applied to the Summary Number.\n                         \n\n\n\n                          The date field and sorting options when selecting\n                          \n                           Use Current\n                          \n                          to use the most current chart value as the Summary Number.\n                         \n\n\n\n                          The label used to describe the Summary Number.\n                         \n\n\n\n                          The format for the Summary Number.\n                         \n\n\n\n                        You can also turn off the Summary Number for the chart.\n                       \n\n\n\n                          Video - Configuring a Summary Number\n                         \n\n\n\n\n\n\n\n\n\n                        Setting Summary Number properties\n                       \n\n                        In the\n                        \n                         Summary Number\n                        \n                        dialog you can set various properties for your chart's Summary Number. Many of these properties are only available by clicking\n                        \n                         Show Formatting Options\n                        \n                        .\n                       \n\n\n\n\n                        For more information about the Analyzer layout, see\n                        \n                         Analyzer Layout\n                        \n                        .\n                       \n\n\n                         To open the Summary Number dialog,\n                        \n\n\n\n\n                          In Analyzer, click the dropdown arrow next to the Summary Number.\n                         \n\n\n\n                          (Conditional) If\n                          \n                           No Summary Number\n                          \n                          is selected, unselect the option.\n                         \n\n\n\n\n                         To set Summary number properties,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Turn off the Summary Number for this chart by clicking\n                            \n                             No Summary Number\n                            \n                            .\n                           \n\n\n\n                            If using a current value, click\n                            \n                             Use Current Value\n                            \n                            .\n                           \n\n\n\n                            If using all values, click\n                            \n                             Use All Values\n                            \n                            .\n                           \n\n\n\n\n\n                          (Conditional) If you are satisfied with your Summary Number settings, click\n                          \n                           Save\n                          \n                          . If you want to make changes to the default settings, click\n                          \n                           Show More Options\n                          \n                          , then continue with the following steps.\n                         \n\n\n\n                          Enter the label you want to appear in the chart with the Summary Number.\n                         \n\n\n\n                          In the top\n                          \n                           Field & Function\n                          \n                          menu, select the DataSet column you want to use for the Summary Number. Typically, this column is a value column, unless you want the Summary Number to show a count of categories in the chart.\n                         \n\n\n\n                          In the bottom\n                          \n                           Field & Function\n                          \n                          menu, select the aggregation option to apply to the DataSet column for the Summary Number.\n                         \n\n\n\n                          (Conditional) If\n                          \n                           Use Current\n                          \n                          is selected, in the\n                          \n                           Date Field\n                          \n                          menu select the desired date column to be used for grouping the data by a certain dimension (day, month, year, date, etc.).\n                         \n\n\n\n                          (Conditional) If\n                          \n                           Use Current\n                          \n                          is selected, select the desired sort option to order by the last or first group values to obtain a \"current\" value for the data, which is emphasized in the chart.\n                         \n\n\n\n                          Select the number format you want to use for the Summary Number in this chart.\n                         \n\n\n\n                        Summary Number properties\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Use Current Value\n                           \n\n\n\n                            This option is only available when your DataSet contains at least one date column. When this option is selected, by default all of the following apply:\n                           \n\n\n\n                              The Summary Number is the value for the most recent date in the chart.\n                             \n\n\n\n                              If the chart contains multiple series per date (such as in a Vertical Stacked Bar chart), those series are summed to yield a total value for the date. In the following example, the values in the \"2012-05-30\" category, when summed, equal 216,000, so this is the current value of the chart.\n                              \n\n\n\n\n\n\n                              If the DataSet contains more than one date column, the first column alphabetically is used for the Summary Number.\n                             \n\n\n\n                              The number format is set to \"1M.\" You can change all of this default functionality by clicking\n                              \n                               Show More Options\n                              \n                              and selecting the desired options.\n                             \n\n\n\n\n\n\n\n                            Use All Values\n                           \n\n\n\n                            When this option is selected, by default all of the following apply:\n                           \n\n\n\n                              The Summary Number is the combined values for the entire chart.\n                             \n\n\n\n                              The number format is set to \"1M.\" You can change all of this default functionality by clicking\n                              \n                               Show More Options\n                              \n                              and selecting the desired options.\n                             \n\n\n\n\n\n\n\n                            No Summary Number\n                           \n\n\n\n                            When this option is selected, no Summary Number is shown in the chart.\n                           \n\n\n\n\n\n                            Label\n                           \n\n\n\n                            Lets you customize the label that appears with the Summary Number in the chart. By default, the label reflects the summary type (such as \"Sum,\" \"Average,\" etc.), but you can customize this label to help the user understand the main focus of this chart. When\n                            \n                             Use Current Value\n                            \n                            is selected, the\n                            \n                             Label\n                            \n                            option only applies to linear (date-time) data.\n                           \n\n\n\n\n\n                            Field & Function\n                           \n\n\n\n\n\n                              The summary data column menu (that is, the top menu in this section) lets you select the data column from which the Summary Number for this chart is derived. Typically, this column is a value column, unless you want the Summary Number to show a specific count of categories in the chart.\n                             \n\n\n\n                              The aggregation menu (that is, the bottom menu in this section) lets you select the aggregation type to apply to the Summary Number in the chart. The aggregation does\n                              \n                               not\n                              \n                              affect the actual chart. For information about changing the aggregation for the chart, see\n                              \n                               Aggregating your data\n                              \n                              .\n                             \n\n\n\n\n\n\n\n                                Aggregation type\n                               \n\n\n\n                                Description\n                               \n\n\n\n\n\n\n\n                                Sum\n                               \n\n\n\n                                The Summary Number is the sum of all of the values in the selected DataSet column.\n                               \n\n\n\n\n\n                                Minimum\n                               \n\n\n\n                                The Summary Number is the lowest value in the selected DataSet column.\n                               \n\n\n\n\n\n                                Maximum\n                               \n\n\n\n                                The Summary Number is the highest value in the selected DataSet column.\n                               \n\n\n\n\n\n                                Average\n                               \n\n\n\n                                The Summary Number is the average of all values in the selected DataSet column.\n                               \n\n\n\n\n\n                                Count\n                               \n\n\n\n                                The Summary Number is the number of items in the selected DataSet column. If you select a non-value column in the top \"Definition\" menu, this is the only available summary type.\n                               \n\n\n\n\n\n                            You can also add aggregation types to this list by creating calculations in Beast Mode and selecting the\n                            \n                             Apply to Summary Number\n                            \n                            option. For this option to appear when you validate a calculation, the calculation must be an aggregating calculation—that is, it must aggregate rows of data in your DataSet. For more information about applying a Summary Number using a calculation in Beast Mode, see\n                            \n                             Applying a calculation to a Summary Number\n                            \n                            .\n                           \n\n\n\n\n\n                            Date column menu\n                           \n\n\n\n                            This menu is available when\n                            \n                             Use Current Value\n                            \n                            is selected. In this menu you can select a date column by which to aggregate the summary data column based on a grouping by a certain dimension (day, month, year, date, etc.). If the DataSet contains more than one date column, by default the first column alphabetically is used for the Summary Number.\n                           \n\n\n\n\n\n                            Sort options\n                           \n\n\n\n                            This section is available when\n                            \n                             Use Current Value\n                            \n                            is selected. Here you can choose to order either by the last or first category values to show as the \"current\" Summary Number.\n                           \n\n\n                             Note:\n                            \n                            The Summary Number may be affected when the date grain changes.\n                           \n\n\n\n\n\n                            Format menu\n                           \n\n\n\n                            Lets you select format of the Summary Number for the chart, base on preset items. You can choose to have thousands separators, decimals, dollar signs, percents, various combinations of the above, or no formatting at all.\n                           \n\n\n\n\n\n                        Summary Number best practices\n                       \n\n                        When setting Summary Numbers, the most important guideline is making sure your labels are clear and specific. If a label is vague, the chart will be harder for viewers to interpret. For example, if you had a Scatter Plot graph and you simply set the Summary Number label to \"Average,\" viewers would not know which of the two value columns in the graph you were referring to. A better label would be something like \"Average # of Employees,\" \"Average Salary,\" etc. The use of clear, specific labels is especially important when you set the size of your KPI Cards to small. In small Cards, the Summary Number is the only chart element that displays—users cannot see the actual charts. If users cannot grasp the meaning of the chart from the Summary Number in this case, then the KPI Card has failed. For more information about sizing Cards, see\n                        \n                         Changing the Size of Cards in a Page\n                        \n                        .\n                       \n\n                        Also, remember that certain aggregations are more appropriate for some chart types than others. If you use the wrong type of aggregation with a particular chart type, it could be detrimental to a user's comprehension of the chart. For example, the \"Current\" aggregation is most appropriate for chart types with a trendline. Using this aggregation with other chart types may not make much sense.\n                       \n\n                        Also, there are a number of chart types in which Summary Numbers actually detract from the effectiveness of the chart—in these, it is recommended that Summary Numbers be turned off.\n                       \n\n                        For more information on creating effective Summary Numbers, see\n                        \n                         Effective Summary Numbers\n                        \n                        .\n                       \n\n                        The following list provides general recommendations as to the most appropriate Summary Number aggregations for each chart type:\n                       \n\n\n\n\n\n                            Chart Type\n                           \n\n\n\n                            Recommended Summary Number Aggregation\n                           \n\n\n\n\n\n\n\n                            Single Bar\n                           \n\n\n\n                            Sum, Avg, Min, or Max. Current may be used if the chart includes date or date-time data; however, in this case it is usually recommended that a Line chart be used instead.\n                           \n\n\n\n\n\n                            Grouped Bar, Stacked Bar, Nested Bar, 100% Stacked Bar\n                           \n\n\n\n                            Sum of all bars in the chart (in which case, you must be specific in the label as to what \"Sum\" refers to), or turn off Summary Number.\n                           \n\n\n\n\n\n                            Grouped Bar with Line, Stacked Bar with Line, Grouped Bar with Symbol, Stacked Bar with Symbol\n                           \n\n\n\n                            Sum of all bars and lines in the chart (in which case, you must be specific in the label as to what \"Sum\" refers to), or turn off Summary Number. In some cases using the current value may also work.\n                           \n\n\n\n\n\n                            Percent of Total\n                           \n\n\n\n                            Sum of all values, or turn off Summary Number.\n                           \n\n\n\n\n\n                            Waterfall\n                           \n\n\n\n                            Current value, or turn off Summary Number.\n                           \n\n\n\n\n\n                            Grouped and Stacked, Grouped and Stacked with Line\n                           \n\n\n\n                            Sum of all values.\n                           \n\n\n\n\n\n                            Running Total Bar, Running Total Grouped Bar, Running Total Stacked Bar, Running Total Line, Pareto\n                           \n\n\n\n                            Sum of all values or current value.\n                           \n\n\n\n\n\n                            Single Line, Single Curved Line, Single Step Line, Single Symbol Line, Single Curved Symbol Line\n                           \n\n\n\n                            Current value, Avg, Min, or Max.\n                           \n\n\n\n\n\n                            Pie, Donut, Tree Map, Funnel, Folded Funnel, Funnel Bars, Maps\n                           \n\n\n\n                            Sum, Avg, Min, or Max.\n                           \n\n\n\n\n\n                            Bubble, Scatter Plot, Category Scatter\n                           \n\n\n\n                            Sum, Avg, Min, Max, or Count. In Bubble and Scatter Plot charts, you have a choice of several value columns you can calculate the Summary Number from. The value column you choose depends on what you want to show your audience.\n                           \n\n\n\n\n\n                            Heat Map\n                           \n\n\n\n                            Avg, Min, or Max.\n                           \n\n\n\n\n\n                            High Low, Candlestick\n                           \n\n\n\n                            Avg, Min, or Max. In these chart types, you have a choice of several value columns you can calculate the Summary Number from. The value column you choose depends on what you want to show your audience. For instance, if you wanted to show the highest all-time value, you would choose \"Max\" for the column that contains your \"High\" values. If you wanted to show an average, you could pick any column—however, in your label you would need to specify which column you were showing an average of (for example, \"Average Opening Price for January\").\n                           \n\n\n\n\n\n                            Multi-Line (including any Line graph with more than one line), Stacked Area, Radar, Calendar, Gantt, Gantt Percent Complete, Gauges\n                           \n\n\n\n                            Turn off Summary Number.\n                           \n\n\n\n\n\n                            Bullet\n                           \n\n\n\n                            Summary numbers not available.\n                           \n\n\n\n\n\n                        Expanding Summary Number functionality using Beast Mode\n                       \n\n                        You can use Beast Mode to expand the functionality of Summary Numbers, whether it be by customizing Summary Numbers, adding multiple Summary Numbers, etc. You can visit the following links for instructions and code samples:\n                       \n\n\n\n\n                           Changing the font size for a Summary Number\n                          \n\n\n\n\n\n                           Creating a custom Summary Number\n                          \n\n\n\n\n\n                           Creating multiple Summary Numbers\n                          \n\n\n\n\n\n                           Filtering data so the Summary Number matches the value displayed in the Card", "Preview Article": "Click here to preview", "URL Name": "360043428753", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004641", "Archived Date": "", "Language": "English", "Primary Version": "Configuring Your Chart Summary Number", "Article Total View Count": "13,118", "": "", "Article Created Date": "10/24/2022, 10:18 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Configuring Your Chart Summary Number\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Analyzer\n              \n", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}