{"file_path": "../../raw_kb_v2\\article\\4407032210199\\index.html", "content": {"title": "\n\n\n Understanding the Workbench 5.1 User Interface\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn the Workbench application, you can connect to your Domo server; configure settings for creating DataSet Jobs; import and export job files; preview, schedule, validate, and run jobs; etc.\n\n\n This topic discusses the user interface components of Workbench.\n\n\n Interface Overview\n--------------------\n\nThe user interface in Workbench 5.1 is quite simple. A vertical bar on the left side of the screen contains a number of different icons. Each icon provides access to a different tab for creating jobs, seeing job status, configuring security options, etc.\n\nSome of these tabs consist of only one pane, while others (such as the\n **More**\n tab shown in the preceding screenshot) contain an additional pane that allows you to navigate between subtabs. You can hide this additional pane for a tab by clicking the\n\nicon at the top of the icon bar.\n\n\n You can use the following table to find out more about the icons in the icon bar and their associated tabs:\n\n\n Icon\n  |\n Name\n  |\n Description\n  |\n| --- | --- | --- |\n|\n\n|\n Toggle Menu\n  |\n Hides/shows the additional navigation pane that appears for certain tabs (such as the\n **Accounts**\n and\n **More**\n tabs).\n  |\n|\n\n|\n Home\n  |\n Opens the\n **Home**\n tab, which shows you the status and success rates for executed jobs.\n  |\n|\n\n|\n Accounts\n  |\n Opens the\n **Accounts**\n tab, in which you can add new accounts, reauthorize or delete accounts, and specify additional account configuration options.\n  |\n|\n\n|\n Jobs\n  |\n Opens the\n **Jobs**\n tab, in which you can add and configure DataSet jobs as well as see information for jobs you have added.\n  |\n|\n\n|\n More\n  |\n Opens the\n **More**\n tab, which provides access to many additional options, such as security settings, a list of registered plugins, import and export options, a log viewer, etc.\n  |\n|\n\n|\n Preview Window\n  |\n Opens the\n **Preview Window**\n tab, which allows you to open previews for any job which you have already previewed from the\n **Jobs**\n tab. A numeral next to the icon indicates that this number of jobs have previews available.\n  |\n|\n\n|\n Help\n  |\n Opens the\n **Help**\n tab, from which you can access various Domo help resources, such as videos, Knowledge Base articles, etc.\n  |\n\nEach of these panes is described in greater detail in continuation.\n\n##\n Home Tab\n\nYou can access the\n **Home**\n tab by clicking\n\nin the icon bar. In this tab, you can view the status for all DataSet jobs you have executed. The tab shows the number of total executions, the number of total rows of data uploaded to Domo, the amount of data uploaded, and the average success rate.\n\n\n###\n Accounts Tab\n\nYou can access the\n **Accounts**\n tab by clicking\n\nin the icon bar.\n\nIn this tab, you can do all of the following:\n\n Add accounts for Domo instances to which you have access by clicking the + button above the accounts list and filling in the requested information.\n* View details for different accounts by clicking the desired account name in the list on the left-side pane.\n* Change the Job Check Interval for the account (i.e. the time in minutes in which Workbench checks to see if jobs are running).\n* Specify whether certificate errors for the account are ignored.\n* Reauthorize accounts for which your credentials may have changed.\n* Revert back to the previous account settings after you have reauthorized an account (by clicking the\n\nicon at the top of the screen—only available before you save changes).\n* Delete accounts you no longer need (by clicking the\n\nicon at the top of the screen).\n* View the agent ID. This is the ID of the Domo user and machine name combination stored in Domo. This is not changeable but may be required by support or engineering teams for troubleshooting.\n\nFor more information, see\n\nAdding an Account in Workbench 5.1\n\n.\n\n##\n Jobs Tab\n\nYou can access the\n **Jobs**\n tab by clicking\n\nin the icon bar.\n\n###\n Jobs List\n\nWhen you open the\n **Jobs**\n tab, a list of all DataSet jobs you have added appears in the pane on the left side of the window, whether they have been executed or not. Each job in the list has an icon that shows you the status of that job. Icons are as follows:\n\n\n Icon\n  |\n Description\n  |\n| --- | --- |\n|\n\n|\n Changes have been made to the job configuration that have not been saved.\n  |\n|\n\n|\n The job is saved, but no preview has been opened.\n  |\n|\n\n|\n The job is saved and a preview has been run.\n  |\n\nDetails for the currently selected job in the list appear in the right-side pane.\n\nFor any job, you can view all of the following information:\n\n The status of the job (\"Ready,\" \"Running,\" \"Disabled,\" or \"Error\").\n* The Domo domain (account) the job is associated with. When the job is executed, the resulting DataSet is sent to this Domo domain.\n* The name of the job. You can rename a job by double-clicking the row for the job then giving the job a new name in the\n **Overview**\n subtab.\n* The DataSet type. The type of DataSet that will be pushed to Domo when this job is executed (Excel, JIRA, etc.). You specify the DataSet type for a job when you create that job. Once you create the job, you\n *cannot*\n go back to change the DataSet type.\n* The date and time of the last execution of this job.\n* The successful/unsuccessful message from when you last executed the job.\n* The next scheduled run for the job (which appears blank if you have not set up scheduling for this job; for more information, see\n\nScheduling a Job in Workbench 5.1\n\n).\n\n\n####\n New Jobs Pane\n\nWhen you click the \"+\" button in the\n **DataSet Jobs**\n pane, a\n **New Jobs**\n pane appears.\n\nHere you can specify the details for your job, including the following:\n\n\n Field/Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Domo Domain\n  |\n The Domo instance you want the job to be associated with. When you execute the job, the resulting DataSet will appear in this domain. This menu is populated from accounts you add in the\n **Accounts**\n tab.\n  |\n|\n Job Name\n  |\n The name of this job as it appears in Workbench. (You specify the name of the resulting DataSet in Domo in the\n **DataSet Name**\n field.)\n  |\n|\n Transport Type\n  |\n The type of transport, which determines how this data source is brought into Workbench. Options are different for each transport type. Note that you do not specify additional options (e.g. local files, JIRA queries, etc.) until after you have created the job. Transport types are as follows:\n\n\n|\n Transport Type\n  |\n Description\n  |\n Applicable Data Sources\n  |\n| --- | --- | --- |\n|\n External Process File Provider\n  |\n Used when you are using a third-party application to pull data into Domo using a script. When you use this method, you select the executable file for your application, specify arguments, and enter a file path for the output. For CSV files, you can also set a\n **Direct Upload**\n option.\n  |\n Virtually any kind of executable file can be converted into an\n\nExcel\n\n,\n\nCSV\n\n,\n\nQuickBooks\n\n,\n\nJSON\n\n, or\n\nXML\n\ndata source in Workbench. For example, you could use this method to convert a MySQL database file to an Excel file. You could then specify options for the Excel file and send it to Domo.\n  |\n|\n FTP/SFTP File Provider\n  |\n Lets you retrieve files via FTP, SFTP (SSH-FTP) or FTPS (FTP-SSL).\n  |\n This method is used for transporting\n\nExcel\n\n,\n\nCSV\n\n,\n\nQuickBooks\n\n,\n\nJSON\n\n, or\n\nXML\n\ndata sources into Domo.\n  |\n|\n JIRA Connection Provider\n  |\n Used to send JIRA or JSON data to Domo.\n  |\n This method is used for transporting\n\nJIRA\n\nand\n\nJSON\n\ndata into Domo.\n  |\n|\n Local File Provider\n  |\n Lets you select a file from your machine or a network.\n  |\n This method is used for transporting\n\nExcel\n\n,\n\nCSV\n\n,\n\nQuickBooks\n\n,\n\nJSON\n\n, or\n\nXML\n\ndata sources into Domo.\n  |\n|\n ODBC Connection Provider\n  |\n Used to send data to Domo using an ODBC connection.\n  |\n Any data from a database\n  |\n|\n OLEDB Connection Provider\n  |\n Used to send data to Domo using an OLEDB (OLAP) connection.\n  |\n Any data from a database\n  |\n\n|\n|\n Reader Type\n  |\n Determines the reader (data source) type for the data you want to bring into Domo. Different configuration options are available depending on the reader type you select. Available reader types include the following:\n\n\n|\n Reader Type\n  |\n Description\n  |\n Available For...\n  |\n| --- | --- | --- |\n|\n CSV\n  |\n When CSV is the selected reader type, you can specify the delimiter and escape sequence characters and configure advanced settings.\n  |\n External Process File Provider, FTP/SFTP File Provider, Local File Provider\n  |\n|\n Excel\n  |\n When Excel is the selected reader type, you can specify the range of data you want to send to Domo. This can be a specific range of cells, a named range, or a dynamic range.\n  |\n External Process File Provider, FTP/SFTP File Provider, Local File Provider\n  |\n|\n QuickBooks\n  |\n When QuickBooks is the selected reader type, you can choose from any of a variety of different reports. You can also instruct Workbench to stop QuickBooks if connection errors are encountered.\n  |\n External Process File Provider, FTP/SFTP File Provider, Local File Provider\n  |\n|\n XML\n  |\n When XML is the selected reader type, you can specify the desired data node and also indicate nodes that should be ignored.\n  |\n External Process File Provider, FTP/SFTP File Provider, Local File Provider\n  |\n|\n JSON\n  |\n When JSON is the selected reader type, you can specify the desired data node, the delimiter, and flattening options.\n  |\n External Process File Provider, FTP/SFTP File Provider, Local File Provider, JIRA Connection Provider\n  |\n|\n JIRA\n  |\n When JIRA is the selected Data Source type, you can unselect attributes from the data source that you do not want to be included in the DataSet. You can also add new attributes.\n  |\n JIRA Connection Provider\n  |\n|\n Database Query\n  |\n When Database Query is the selected Data Source type, you can configure queries and replacement variables.\n  |\n ODBC Connection Provider, OLEDB Connection Provider\n  |\n\n|\n|\n DataSet Name\n  |\n The name of the DataSet after it is imported into Domo.\n  |\n|\n DataSet Type\n  |\n The connector that represents this data after it is imported into Domo.\n  |\n|\n DataSet Description (optional)\n  |\n The description that accompanies this DataSet after it is imported into Domo.\n  |\n\n\n####\n Job Configuration Pane\n\nIf you double-click a job in the Jobs List pane, a configuration appears with six subtabs:\n **Overview**\n ,\n **Configure**\n ,\n **Schedule**\n ,\n **Schema**\n ,\n **Notifications**\n , and\n **History**\n . These subtabs provider various options for configuring your data before sending it to Domo.\n\n\n In all subtabs, the following icons appear in the top right corner:\n\n opens a preview of the currently selected job. After you have opened a preview for a job, you can quickly see that preview again by clicking\n\nin the icon bar on left side of Workbench then selecting the desired job in the list in the left-hand pane.\n* saves the current configuration for the selected job.\n* reverts back to the previous configuration for the currently selected job.\n* executes the currently selected job (i.e. pushes the data to Domo).\n* deletes the currently selected job.\n\n\n#####\n Overview Subtab\n\nIn the\n **Overview**\n subtab for a DataSet job, you can see all of the following data:\n\n Statistics related to the last job execution, such as date and time, status, number of rows updated, etc.\n* Details specified for the job when it was initially created, such as the associated domain, job name, transport and reader type, DataSet description, etc. Of these specifications, the only ones you can change in this screen are the name of the job, the DataSet description, and the DataSet to which you are pushing data (as described in the next paragraph). If you want to change the domain, transport/reader type, or DataSet type, you must create a new job with these changes.\n\n\n Under \"DataSet Name,\" you can change the Domo DataSet to which data is being pushed. By default, Workbench pushes your data to a new DataSet with the name you specified when you created this job. However, if you want to push data to an existing DataSet, you can click\n **Browse**\n and then pick the desired DataSet from the\n **Select DataSet**\n dialog. This dialog lists all DataSets you have access to that have been pushed from Workbench. You can filter the DataSets in this list by type or owner and/or search for a given DataSet by name.\n\n\n#####\n Configuration Subtab\n\nIn the\n **Configuration**\n subtab for a DataSet job, you can configure various options for your job.\n\nYou can use the following table to learn more about each option:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Source\n  |\n Lets you configure the data source for the job. Options differ depending on the transport and reader type you selected when you created the job. For example, if you had specified a locally situated Excel file as your data source, you would select the desired file from your machine here. For more information about options for all transport and reader types, see\n\nSource and Processing Options\n\n.\n  |\n|\n Processing\n  |\n Lets you configure processing options for the job. Options differ depending on the transport and reader type you selected when you created the job. For example, for a CSV file, you can configure delimiters, specify how missing fields are handled, and so on. For more information about options for all transport and reader types, see\n\nSource and Processing Options\n\n.\n  |\n|\n Update Method\n  |\n Determines whether new data replaces the existing data in the DataSet or is appended to (added onto) the existing data when updating.\n  |\n|\n Add a Transform\n  |\n Lets you add transforms to your data source. Transforms allow you to modify your data locally before uploading it to Domo. A variety of transforms is available. You can add calculated fields to your data, join columns, set up encryption, and so on. For more information about transform types, see\n\nTransforms\n\n.\n  |\n|\n Requires Impersonation\n  |\n Lets you run this job as a specific Active Directory user. When this box is checked, Workbench requests non-default credentials for all DataSet Jobs (that is, the\n **Requires Impersonation**\n toggle for all Jobs is turned off and cannot be switched back on). This option is only available if you have administrator privileges.\n  |\n|\n Error Handling\n  |\n Determines what happens when errors are encountered in a DataSet Job. Options include the following:\n * **Replace invalid cells with NULL value**\n . When invalid cells are encountered, the values are replaced with a \"NULL\" value.\n* **Skip entire row if it contains invalid data.**\n When invalid cells are encountered, the rows in which they are found are skipped.\n* **Abort job on invalid data error**\n . When invalid cells are encountered, the entire DataSet job is aborted.\n |\n|\n When to Terminate Long-Running Jobs\n  |\n Lets you specify a time frame (in hours) in which a long-running job is to be terminated. Options include the following:\n * **Upload even if data hasn't changed**\n . Lets you upload data to Domo even though the data has not changed. Useful when you want the DataSet freshness in Domo to be updated.\n* **Clear DataSet in Domo Job returns zero rows**\n . Lets you clear the DataSet in Domo if zero rows are returned when a job runs. If disabled, Workbench does not send a command to Domo to clear out data in the DataSet. If you have a process where you want to upload data in a table after data in another table has been updated, you could disable this option and add some script in your query that looks at the \"status\" table, running the query if the data is ready.\n* **Allow schema changes**\n . Allows schema changes to be pushed to Domo when the job is left unattended.\n* **Wait for data preparation**\n . Determines whether a DataSet must finish indexing before the job is completed.\n* **Disable job**\n . Disables the job if the specified time limit is exceeded.\n |\n\n\n#####\n Scheduling Subtab\n\nIn the\n **Scheduling**\n subtab for a DataSet job, you can choose how frequently to run a job.\n\nAvailable options include the following:\n\n **Update manually**\n . The job does not execute on a schedule; you must run the job yourself from Workbench.\n* **Update when file is changed**\n . The DataSet job runs every time the file is updated. Not available for database data sources.\n* **Update on a schedule**\n . The job runs on a schedule you configure. Options range from\n **Every 15 Minutes**\n to\n **Every Month**\n .\n* **Only run during a specified window**\n . The job runs on your specified schedule but only during a certain timeframe within that schedule. For example, you could instruct the DataSet to run once an hour but only between the hours of 9:00 a.m. and 5:00 p.m.\n\nFor more information about updating a DataSet, see\n\nUpdating or Refreshing the DataSet for a Visualization Card\n\n.\n\n\n For more information about setting a schedule, see\n\nScheduling a Job in Workbench 5.1\n\n.\n\n####\n Schema Subtab\n\nIn the\n **Schema**\n subtab for a DataSet job, you can make changes to your schema configuration before uploading your data to Domo, such as changing column names and data types, including or excluding certain columns, etc.\n\nYou can use the following table to learn more about the components of the\n **Schema**\n interface:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Source Column\n  |\n The name of this column in the original data source. You cannot interact with a source column; any changes you make are applied to the\n *destination*\n column (i.e. the column in the Domo DataSet after you execute this DataSet job).\n  |\n|\n Destination Column\n  |\n The name of this column in the Domo DataSet. Any changes you make to a column are applied to this column, not the column from the original data source. You can rename a destination column by clicking in the name field and typing in the desired name.\n  |\n|\n Data Type\n  |\n Indicates the data type for the given column. You can change a data type by clicking in the field and selecting the new data type from the menu. The following data types are available:\n * LONG\n\nstores numbers as numeric values, including fractional and whole numbers.\n* DOUBLE\n\nstores double-precision floating point number values.\n* DECIMAL\n\nstores numbers as decimal values.\n* STRING\n\nstores alphanumeric characters as text.\n* DATETIME\n\nstores year, month, day, hour, minute, and second values.\n* DATE\n\nstores year, month, and day values.\n* TIME\n\nstores hour, minute, and second values.\n |\n|\n Include\n  |\n Determines whether data for this column appears in the DataSet in Domo. You can choose which columns of data are uploaded by checking or unchecking\n **Include**\n for each column heading.\n  |\n|\n Lock Data Type\n  |\n When this box is checked for a column, users cannot change the data type for that column in Domo.\n  |\n\n\n#####\n Notifications Subtab\n\nIn the\n **Notifications**\n subtab for a DataSet job, you can specify who in your Domo instance is notified when jobs are completed successfully and/or fail. For any user in your instance, you can specify whether he/she is notified upon job success, failure, or both. For more information about notifications, see\n\nSetting Notifications in Workbench 5.1\n\n.\n\n\n#####\n History Subtab\n\nIn the\n **History**\n subtab for a DataSet job, you can click\n **Open on the web**\n to view the\n **History**\n tab for the DataSet in the Domo instance associated with the job. For more information about this tab in Domo, see\n\nViewing DataFlow Details\n\n. You can also view local logs for this job by clicking\n **Open log viewer**\n .\n\n###\n More Tab\n\nYou can access the\n **More**\n tab by clicking\n\nin the icon bar. This tab is broken down into a number of subtabs, as follows:\n\n\n Subtab Name\n  |\n Description\n  |\n| --- | --- |\n|\n Proxy\n  |\n Lets you specify settings for more securely connecting to Domo using a proxy server.\n  |\n|\n Settings\n  |\n Lets you configure settings for managing who can run and edit jobs on this machine, optimizing system performance, and installing automatic updates.\n  |\n|\n Plugins\n  |\n Provides a list of registered plugins and also lets you register new plugins.\n  |\n|\n Import\n  |\n Lets you import DataSet jobs you previously exported.\n  |\n|\n Export\n  |\n Lets you back up and export DataSet jobs.\n  |\n|\n Log viewer\n  |\n Lets you open the Log Viewer so you can get more information about your job runs.\n  |\n|\n Legacy schedules\n  |\n Provides information about managing job schedules you created using older versions of Workbench.\n  |\n\nAll of these subtabs are described in more detail in continuation.\n\n####\n Proxy Subtab\n\nIn the\n **Proxy**\n subtab, you can specify settings for more securely connecting to Domo using a proxy server.\n\n*Note:**\n When you initially connect to Domo via Workbench, Workbench leverages your Windows system proxy settings; you cannot enter your proxy settings manually at this time. However, after you connect to Domo for the first time, you can manually configure the proxy settings in the\n **Proxy**\n tab.\n\n\n You can refer to the following table to find out more about the components in this tab:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n No Proxy Server\n  |\n Does\n *not*\n use a proxy server to connect.\n  |\n|\n Automatically Detect Proxy Settings\n  |\n Determines your proxy settings automatically.\n  |\n|\n Use System Proxy Settings\n  |\n Determines your proxy settings based on your system proxy settings.\n  |\n|\n Manual Proxy Configuration\n  |\n Lets you manually specify the proxy server information to use in connecting. You can do this only after initially connecting to Domo via Workbench. (The first time you connect, your system proxy settings are used.)\n\n\n You will need to enter the server address and port.\n\n\n If the proxy server requires credentials, set\n **Requires Authentication**\n to\n **On**\n , then specify the username and password.\n  |\n\nAfter you enter proxy credentials, you can test your connection by entering a test Domo URL and clicking\n **Test Proxy**\n . The color of the icon next to this button indicates whether the proxy settings have been validated.\n\n####\n Settings Subtab\n\nIn the\n **Settings**\n subtab, you can  configure settings for managing who can run and edit jobs on this machine, optimizing system performance, and installing automatic updates.\n\nYou can refer to the following table to find out more about the components in this tab:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Only run locally managed jobs\n  |\n If checked, Workbench runs only DataSet Jobs managed locally,\n *not*\n those on networks.\n  |\n|\n Require impersonation credentials for all jobs\n  |\n If checked, Workbench requests non-default credentials for all DataSet Jobs (that is, the\n **Requires Impersonation**\n toggle for all Jobs is turned off and cannot be switched back on). This option is only available if you have administrator privileges.\n  |\n|\n Run job process as Below Normal priority\n  |\n Sets this job to \"Below Normal\" priority in your Windows Task Manager, which may be helpful in improving your processing speed when many different processes are running at once.\n  |\n|\n Limit concurrent jobs\n  |\n Lets you limit the number of DataSet Jobs that may run at the same time.\n  |\n|\n Install updates automatically\n  |\n If checked, Workbench installs all updates automatically.\n  |\n\n\n#####\n Plugins Subtab\n\nIn the\n **Plugins**\n tab, you can view all of the plugins in Workbench 5.1, with their names, publishers, version numbers, descriptions, and assembly names. You can also add a plugin to your registered plugins list by entering a search path.\n\nFor more information about adding plugins to Workbench, see\n\nManaging Plugins in Workbench 5.1\n\n.\n\n####\n Import Subtab\n\nIn the\n **Import**\n tab, you can import jobs you previously exported from Workbench (in the\n **Export**\n tab). In the top menu, you select the Workbench account you want the imported jobs to be associated with. You can then locate the files on your machine that you want to import by clicking\n **Browse**\n and navigating to the files. Files that you select appear in the\n **Jobs to import**\n list at the bottom of the pane. Once your list is ready, click\n **Import**\n to pull the files into Workbench.\n\nFor more information about importing jobs, see\n\nBacking Up Workbench 5.1 Jobs\n\n.\n\n####\n Export Subtab\n\nIn the\n **Export**\n tab, you can export jobs in JSON format. You first choose the folder you want to save your jobs too. If you want a different save folder to be created for each account (Domo instance), you can indicate that here. You then check the boxes for all the jobs you want to export, then click\n **Export Jobs**\n .\n\nFor more information about exporting jobs, see\n\nBacking Up Workbench 5.1 Jobs\n\n.\n\n####\n Log Viewer Subtab\n\nIn the\n **Log Viewer**\n tab, you can open the logs for your DataSet jobs by clicking\n **Open log viewer**\n . Once in the log viewer, you can filter the logs by Domo domain, job ID, and start/end date. You can choose whether or not to include service logs by checking or unchecking the\n **Include Service Logs**\n box. You can also package logs as a zip file by clicking\n **Zip Logs**\n .\n\n\n#####\n Legacy Schedules Subtab\n\nBecause legacy schedules are not supported in Workbench 5.1, you'll need to manage scripts and schedules if you want to use them. You can do this using the Workbench CLI tool. The\n **Legacy Schedules**\n tab provides access to information about this tool.\n\n###\n Preview Window Tab\n\nYou can open the\n **Preview Window**\n tab by clicking\n\nin the icon bar. This tab allows you to open previews for any job which you have already previewed from the\n **Jobs**\n tab. A numeral next to the icon indicates that this number of jobs have previews available (for example, if the icon appeared as\n\n, this would indicate that previews had been opened for two different jobs in the\n **Jobs**\n tab).\n\n\n When you click on the\n\nicon, two panes appear. The listing pane on the left lets you choose the job you want to preview. The pane on the right is divided into two sections—an\n **Output**\n section that provides log data for the preview, and a\n **Data Preview**\n section that shows the columns for your data source.\n\n\n####\n Help Tab\n\nYou can open the\n **Help**\n tab by clicking\n\nin the icon bar. This opens the\n **Help**\n tab, from which you can access various Domo help resources, such as videos, Knowledge Base articles, etc.\n\nSource and Processing Options\n-------------------------------\n\nIn the\n **Configure**\n subtab for a DataSet job (which you access by double-clicking on a job in the listing in the\n **Jobs**\n tab), you configure the data source (i.e. where the file is coming from) and the processing options (i.e. properties for the selected data source).\n\n##\n Source Options\n\nConfigure the\n **Source**\n for a DataSet job to specify where the data for that job is coming from.\n\nAlthough you configure the source\n *type*\n for a job when you create that job (by selecting a\n **Transport Type**\n ), you indicate the actual data source in the\n **Configure**\n subtab for the job, as shown above. Options are different for each source/transport type.\n\n###\n Local File Provider\n\nUse the\n **Local File Provider**\n transport type to pull\n\nExcel\n\n,\n\nCSV\n\n,\n\nQuickBooks\n\n,\n\nJSON\n\n, and\n\nXML\n\ndata sources into Domo from a local or network location. When you select this option when creating a DataSet job, the\n **Source**\n dialog in the\n **Configure**\n subtab lets you choose the file path for the local file.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n File Path\n  |\n Specifies the file path for the local file you want to pull into Workbench.\n  |\n|\n File on an External Network\n  |\n Specifies whether the file is located on a network path (either a mapped drive or fully qualified path).\n  |\n|\n Network Username/Password (not shown in screenshot)\n  |\n Specifies the username and password for the network the file is located on, if any.\n  |\n\n\n####\n SFTP File Provider\n\nUse the\n **SFTP**\n transport type to pull\n\nExcel\n\n,\n\nCSV\n\n,\n\nQuickBooks\n\n,\n\nJSON\n\n, and\n\nXML\n\ndata sources into Domo via FTP, SFTP (SSH-SFTP), or FTPS (FTP-SSL). When you select this option as your transport type when creating a DataSet job, the\n **Source**\n dialog in the\n **Configure**\n subtab provides options for configuring the server and SSL Certificate settings.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Server\n  |\n Specifies the server URL for your FTP server.\n  |\n|\n Port\n  |\n Species the port number for your FTP server.\n  |\n|\n Username\n  |\n Specifies your username for connecting to the server.\n  |\n|\n Password\n  |\n Specifies your password for connecting to the server.\n  |\n|\n Protocol\n  |\n Determines whether you are retrieving data via FTP, SFTP, or FTPS.\n  |\n|\n Host Key Fingerprint (SSL Certificate Settings)\n  |\n Specifies the host key fingerprint for your SSL certificate, if one is required. Host fingerprints are used to ensure that the SFTP server is the same one you are expecting.\n  |\n|\n Allow untrusted server certificates\n  |\n Lets you upload SSL certificates that don't meet trust requirements. If you are using a self-signed certificate, you must check this box.\n  |\n|\n PKCS#8 File (SSL Certificate Settings)\n  |\n Specifies the PKCS#8 file for your SSL certificate. This is used alongside username and password credentials for more secure authentication.\n  |\n|\n Password (SSL Certificate Settings)\n  |\n Specifies the password for your SSL certificate.\n  |\n|\n Remote File\n  |\n Specifies the file path for the file you want to connect to.\n  |\n\n\n####\n External Process File Provider\n\nUse the\n **External Process File Provider**\n transport method when you are using a third-party application to pull\n\nExcel\n\n,\n\nCSV\n\n,\n\nQuickBooks\n\n,\n\nJSON\n\n, and\n\nXML\n\ndata into Domo using a script. When you select this option as your transport type when creating a DataSet job, the\n **Source**\n dialog in the\n **Configure**\n subtab lets you select the executable file for your application, specify arguments, and enter a file path for the output. For CSV files, you can also set a\n **Direct Upload**\n option. Virtually any kind of executable file can be converted into a data source in Workbench. For example, you could use this method to convert a MySQL database file to an Excel file. You could then specify options for the Excel file and send it to Domo.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Program Executable\n  |\n Lets you select the executable application file to use to pull data into Domo.\n  |\n|\n Arguments\n  |\n Specifies arguments for your script.\n  |\n|\n Output File Path\n  |\n Specifies the file path for the output. The file type should be the same as the data source type you selected in the\n **Workbench DataSet Job Creation Wizard**\n .\n  |\n|\n Direct Upload (CSV only) (not shown in screenshot)\n  |\n Lets you turn on Direct Upload for this job. For more information, see\n\nSetting Up Direct Upload in Workbench\n\n.\n  |\n\n\n####\n OLEDB Connection Provider\n\nUse the\n **OLEDB**\n**Connection Provider**\n transport method when you want to send data to Domo using an OLEDB (OLAP) connection. When you select this option as your transport type when creating a DataSet job, the\n **Source**\n dialog in the\n **Configure**\n subtab provides options to help you connect to an OLAP data source.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n OLAP Connection\n  |\n Opens the\n **Connection Builder**\n , where you specify all of the details of your OLAP connection.\n  |\n|\n Requires 32b Execution (not shown in screenshot)\n  |\n Determines whether this file transport requires 32b execution.\n  |\n|\n Data Source\n  |\n Specifies the server where the database is located.\n  |\n|\n Provider\n  |\n Select a provider, either MSOLAP or Essbase.\n  |\n|\n Catalog\n  |\n Specifies the Initial Catalog for your OLAP connection.\n  |\n|\n Username\n  |\n Specifies the username for this OLAP connection.\n  |\n|\n Password\n  |\n Specifies the password for this OLAP connection.\n  |\n\nFor more information about connecting to OLAP data, see\n\nConnecting to an OLAP Cube\n\n.\n\n###\n ODBC Connection Provider\n\nUse the\n **ODBC**\n**Connection Provider**\n transport method when you want to send data to Domo using an ODBC connection. When you select this option as your transport type when creating a DataSet job, the\n **Source**\n dialog in the\n **Configure**\n subtab provides options to help you connect to an ODBC data source.\n\n\n There are three different ways to connect to ODBC data. You can select a system DSN, enter details for your connection, or enter a single connection string. You choose the desired connection option in the\n **Connection Type**\n menu.\n\n####\n System DSN\n\nWith the\n **System DSN**\n option, you select the DSN to use for the desired DataSet from all of the DSNs available in your system. You can indicate whether credentials are required.\n\n\n**Note:**\n When uploading data from an ODBC DataSet, you must specify an existing Data Source Name (DSN). You can create a DSN using the Windows ODBC Data Source Administrator. (You can access the the Windows ODBC Data Source Administrator by entering \"ODBC\" in the Start Menu search, then selecting \"Data Sources (ODBC)\".) For more information about creating a DSN, refer to the Windows ODBC Help (by searching for \"ODBC\" in Windows Help and Support) or view the training video in\n\nWorkbench 5.1 FAQs\n\n.\n\n\n For information about defining DataSet names (DSNs) and using Open Database Connectivity (ODBC) to access data, refer to documentation for ODBC.\n\n\n The following screenshot shows the options available when\n **System DSN**\n is selected as the\n **Connection Type**\n :\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n System DSN\n  |\n Lets you select the DSN to use for the desired DataSet from all of the DSNs available in your system.\n  |\n|\n Requires Credentials\n  |\n Determines whether credentials are required for the specified DSN.\n  |\n|\n Username\n  |\n Specifies the username you use to connect to the database.\n  |\n|\n Password\n  |\n Specifies the password you use to connect to the database.\n  |\n\nFor more information, see\n\nConnecting to ODBC data\n\n.\n\n####\n Connection Builder\n\nWith the\n **Connection Builder**\n option, you enter the details for your ODBC connection, such as login credentials, driver, server URL, etc.\n\n\n The following screenshot shows the options available when\n **Connection Builder**\n is selected as the\n **Connection Type**\n :\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Driver\n  |\n Specifies the name of the driver used to access the database.\n  |\n|\n Server\n  |\n Specifies the server name or URL for the database.\n  |\n|\n Port\n  |\n Specifies the port number where the database is found. The default port is the MySQL port.\n  |\n|\n Database\n  |\n Specifies the name of the database to access.\n  |\n|\n Timeout\n  |\n Lets you select the desired timeout value in seconds (60=1 minute) that the connection is kept alive before it is refreshed from the DataSet.\n  |\n|\n Username\n  |\n Specifies the username you use to connect to the database.\n  |\n|\n Password\n  |\n Specifies the password you use to connect to the database.\n  |\n|\n Connection Parameters\n  |\n Lets you specify additional parameters for connecting to the DataSet.\n  |\n\nFor more information, see\n\nConnecting to ODBC data\n\n.\n\n####\n Connection String\n\nWith the\n **Connection String**\n option, you enter a single string for your ODBC connection.\n\n\n The following screenshot shows the options available when\n **Connection String**\n is selected as the\n **Connection Type**\n :\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Connection String\n  |\n Lets you enter a connection string to connect to the DataSet.\n  |\n|\n Requires 32-bit Execution\n  |\n Specifies whether this connection requires 32-bit execution.\n  |\n\nFor more information, see\n\nConnecting to ODBC data\n\n.\n\n###\n JIRA Connection Provider\n\nUse the\n **JIRA**\n**Connection Provider**\n transport method when you want to send JIRA or JSON data to Domo. When you select this option as your transport type when creating a DataSet job, the\n **Source**\n dialog in the\n **Configure**\n subtab provides options for entering your JIRA credentials as well as a JQL query.\n\n\n The following screenshot shows the options available when this method is selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Specifies the username used to connect to your JIRA instance.\n  |\n|\n Password\n  |\n Specifies the password used to connect to your JIRA instance.\n  |\n|\n Server URL\n  |\n Specifies the URL of your company's JIRA server.\n  |\n|\n JIRA Query\n  |\n Specifies the query for the JIRA data you want to send to Domo.\n  |\n\nFor more information, see\n\nConnecting to JSON Data in Workbench 5.1\n\n.\n\n##\n Processing Options\n\nConfigure the\n **Processing**\n options for a DataSet job to specify properties for your data source before it is sent to Domo.\n\nThe options that appear when you click\n **Edit**\n are dependent on the reader type you selected when you added the DataSet job. For example, if you selected\n **CSV**\n as the reader type, you are given options for configuring delimiters, specifying start and end rows, etc., whereas if you selected\n **OLAP**\n , options center around writing queries.\n\n###\n CSV\n\nWhen you select\n **CSV**\n as your reader type when creating a DataSet job, the\n **Processing**\n dialog in the\n **Configure**\n subtab provides options for specifying the delimiter and escape sequence characters and configuring advanced settings.\n\n*Notes:**\n\n\n* The name and description for a DataSet in Domo can be different than the name and description in Workbench if someone edits the name and description in Domo. (DataSets do not depend on the names and descriptions matching for data uploads to occur properly.)\n* A CSV file\n *must*\n\n+ be a text file\n\t+ have data delimited by a single character\n\nThe following screenshot shows the options available when this reader type has been selected:\n\nYou can use the following table to find out more about all of these components:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Field Delimiters\n  |\n Specifies the delimiter character to use in the specified CSV file.\n  |\n|\n Encapsulate Fields With\n  |\n Specifies the character to use for encapsulating fields.\n  |\n|\n Escape Sequence Character\n  |\n Specifies the character to use for escaping.\n  |\n|\n Comment Character\n  |\n Specifies the character to use for commenting.\n  |\n|\n Missing Fields Handling\n  |\n Determines whether to generate an error for missing field values or replace the fields with empty values.\n  |\n|\n First row contains column headers\n  |\n Indicates whether file defines column headers in the first row.\n\n\n If the file has column headers, they should be defined in the first row.\n  |\n|\n Ignore starting rows\n  |\n Specifies the number of rows to skip at the beginning of the data so you can start importing a specific row.\n\n\n The\n **Ignore starting rows**\n field does\n *not*\n include the header row containing the column names.\n  |\n|\n Ignore ending rows\n  |\n Specifies the number of rows to skip at the end of the data.\n  |\n|\n Text encoding\n  |\n Specifies the character encoding used in the CSV file.\n  |\n\nFor more information about connecting to CSV files, see\n\nConnecting to CSV data\n\n.\n\n###\n Excel\n\nWhen you select\n **Excel**\n as your reader type when creating a DataSet job, the\n **Processing**\n dialog in the\n **Configure**\n subtab provides options for specifying the range of data you want to send to Domo.\n\n*Note:**\n A Microsoft Excel spreadsheet file\n *must*\n be in a supported file format:\n\n.xlsx\n\n,\n\n.xls\n\n,\n\n.xlsm\n\n\n There are three different ways to indicate the desired data range from your chosen Excel file. You can choose a specific range of cells, a named range, or a dynamic range. You choose the desired connection option in the\n **Selection Range**\n menu.\n\n####\n Cell Range\n\nWhen\n **Cell Range**\n is selected in the\n **Selection Range**\n menu, you can specify the Excel sheet from which you want to pull data, along with the starting cell, ending row, and ending column.\n\n\n The following screenshot shows the options available when this has been selected:\n\nYou can use the following table to find out more about these components:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Excel File Password\n  |\n Lets you enter the password for this Excel file (if one has been specified).\n  |\n|\n Sheet Name\n  |\n Lets you select the Excel sheet from which you want to pull data.\n  |\n|\n Starting Cell\n  |\n Specifies the first cell in the Excel sheet from which data will be pulled.\n  |\n|\n Read to Row\n  |\n Specifies the ending row for the cell range you want to pull data for.\n  |\n|\n Read to Column\n  |\n Specifies the ending column for the cell range you want to pull data for.\n  |\n|\n First Row Contains Column Headers\n  |\n Determines whether the first row contains column headers. This is important when building cards in Domo because column headers are used to reference the data in those columns. For more information, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n|\n Add Filenames Column at the End\n  |\n Inserts a \"File Name\" column as the last column in your data source.\n  |\n\n\n#####\n Named Range\n\nWhen\n **Named Range**\n is selected in the\n **Selection Range**\n menu, you can select a named range from a list. If you have not created any named ranges for this file in Excel, no options appear in this menu.\n\n\n The following screenshot shows the options available when this has been selected:\n\nYou can use the following table to find out more about these components:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Excel File Password\n  |\n Lets you enter the password for this Excel file (if one has been specified).\n  |\n|\n Named Range\n  |\n Lets you pick a named range from a list.\n  |\n|\n Continue Until Empty Row\n  |\n When checked, Workbench processes the data in the Excel sheet until an empty row is encountered.\n  |\n|\n First Row Contains Column Headers\n  |\n Determines whether the first row contains column headers. This is important when building cards in Domo because column headers are used to reference the data in those columns. For more information, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n|\n Add Filenames Column at the End\n  |\n Inserts a \"File Name\" column as the last column in your data source.\n  |\n\n\n#####\n Dynamic Range\n\nWhen\n **Dynamic Range**\n is selected in the\n **Selection Range**\n menu, you can skip a specified number of lines at the end of the Excel sheet.\n\n\n The following screenshot shows the options available when this has been selected:\n\nYou can use the following table to find out more about these components:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Excel File Password\n  |\n Lets you enter the password for this Excel file (if one has been specified).\n  |\n|\n Sheet Name\n  |\n Lets you select the Excel sheet from which you want to pull data.\n  |\n|\n Starting Cell\n  |\n Specifies the first cell in the Excel sheet from which data will be pulled.\n  |\n|\n Ignore Ending Rows\n  |\n Specifies how many rows at the end of the sheet you want to ignore.\n  |\n|\n First Row Contains Column Headers\n  |\n Determines whether the first row contains column headers. This is important when building cards in Domo because column headers are used to reference the data in those columns. For more information, see\n\nApplying DataSet Columns to Your Chart\n\n.\n  |\n|\n Add Filenames Column at the End\n  |\n Inserts a \"File Name\" column as the last column in your data source.\n  |\n\nFor more information about connecting to Excel data, see\n\nConnecting to Excel data\n\n.\n\n###\n XML\n\nWhen you select\n **XML**\n as your reader type when creating a DataSet job, the\n **Processing**\n dialog in the\n **Configure**\n subtab provides options for specifying the desired data node and also indicate nodes that should be ignored.\n\n\n The following screenshot shows the options available when this has been selected:\n\nYou can use the following table to find out more about these components:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Data Node\n  |\n Specifies the data node you want to retrieve.\n  |\n|\n Schema Change Options\n  |\n Lets you specify how you want to handle schema changes in your XML. The following options are available:\n * **Only Add Columns**\n . This allows new columns to be added. It does not remove columns that already exist but were not found.\n* **Add and Remove Column**\n . The schema will always match the data in the file. Columns will be added and removed as necessary.\n* **Lock Schema**\n . No columns will be added or removed.\n |\n|\n Ignored Nodes\n  |\n Enter the nodes you want to ignore when the job is executed.\n  |\n\nFor more information about connecting to XML data, see\n\nConnecting to XML Data\n\n.\n\n###\n JSON\n\nWhen you select\n **JSON**\n as your reader type when creating a DataSet job, you can specify the desired data node, the delimiter, and flattening options.\n\n\n The following screenshot shows the options available when this has been selected:\n\nFor more information about connecting to JSON data, see\n\nConnecting to JSON Data in Workbench 5.1\n\n.\n\n###\n Database Query (OLAP and ODBC)\n\nWhen you select\n **Database Query**\n\nas your reader type when creating a DataSet job, the\n **Processing**\n dialog in the\n **Configure**\n subtab provides options for configuring queries and replacement variables.\n\n\n The following screenshot shows the options available when this has been selected:\n\nYou can use the following table to learn more about these options:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Query Execution Timeout\n  |\n Lets you specify the desired timeout value in seconds that the connection is kept alive before it is refreshed from the DataSet.\n  |\n|\n Query\n  |\n Lets you enter the query you want to get data.\n\n\n |\n|\n Replacement Variables/Global Replacement Variables\n  |\n Lets you define replacement and global replacement variables for use in your query.\n\n\n |\n\nFor more information about connecting to databases, see\n\nConnecting to ODBC Data\n\n.\n\n###\n QuickBooks\n\nWhen you select\n **QuickBooks**\n as your reader type when creating a DataSet job, the\n **Processing**\n dialog in the\n **Configure**\n subtab allows you to choose from any of a variety of different QuickBooks reports. You can also instruct Workbench to stop QuickBooks if connection errors are encountered.\n\n*Note:**\n In order to run QuickBooks jobs, you must authorize Workbench to connect to QuickBooks by clicking the\n **Authorize**\n button in the top right corner of the\n **Processing**\n dialog then selecting your company file.\n\n\n You can use the following table to find out more about all of these components.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Authorize\n  |\n Authorizes Workbench to connect to QuickBooks. You will need to select the company file you want to grant access to.\n  |\n|\n Allow Workbench to stop QuickBooks on connection errors\n  |\n If checked, QuickBooks shuts down if Workbench encounters errors while executing a DataSet job.\n  |\n|\n Report Type\n  |\n Lets you select a primary report type. All report types have a number of sub-reports you can choose from.\n\n\n Primary report types are as follows:\n\n\n|\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n General Detail Report\n  |\n Shows detailed information for any of a number of different report types, such as \"Income by Customer Detail,\" \"Check Detail,\" \"Pending Sales,\" etc. You can select the desired date range for your report by selecting the start and end dates using the\n **From**\n and\n **To**\n date pickers, respectively. If you want, you can manually select which columns appear in the report by selecting them in the\n **Columns**\n menu.\n  |\n|\n General Summary Report\n  |\n Shows summary information for any of a number of different report types, such as \"CustomerBalanceSummary,\" \"IncomeTaxSummary,\" \"PhysicalInventoryWorksheet,\" etc. You can select the desired date range for your report by selecting the start and end dates using the\n **From**\n and\n **To**\n date pickers, respectively. You can also select a date granularity for your report data (for example, you could summarize data by day, by month, etc.).\n  |\n|\n Budget Summary Report\n  |\n Shows balance sheet and profit and loss reports. You can select the desired fiscal year for your report.\n  |\n|\n List\n  |\n Shows any of a number of reports in list format, such as \"Employee\" (a list of company employees), \"Vendors\" (a list of your vendors), and so on. Because this information is not arranged by date, there are no options for setting a date range or choosing a fiscal year.\n  |\n\n\n |\n|\n Report Date Range (General Detail Report and General Summary Report)\n  |\n Lets you select the start and end date for this report from a date picker.\n  |\n|\n Maximum days to return in single result (General Detail Report only)\n  |\n Specifies the maximum number of days to return in your QuickBooks report.\n  |\n|\n Columns (General Detail Report only)\n  |\n Lets you select the columns that appear in your QuickBooks report.\n  |\n|\n Summarize Report Columns By (General Summary Report only)\n  |\n Lets you choose the date granularity for your QuickBooks report. For example, if you\n **Month**\n , report data is broken down by month.\n  |\n|\n Fiscal Year (Budget Summary Report only)\n  |\n Lets you select the fiscal year for the report.\n  |\n\nFor more information about connecting to QuickBooks data, see\n\nConnecting to QuickBooks Data\n\n.\n\n###\n JIRA\n\nWhen you select\n **QuickBooks**\n as your reader type when creating a DataSet job, the\n **Processing**\n dialog in the\n **Configure**\n subtab lets you unselect attributes from the data source that you do not want to be included in the DataSet. You can also add new attributes.\n\n\n The following screenshot shows the options available when this has been selected:\n\nFor more information about connecting to JIRA, see\n\nConnecting to JIRA Data\n\n.\n\n\n Transforms\n------------\n\nYou can add any of a number of transforms to a DataSet job in Workbench. Transforms let you modify your data locally in Workbench before you upload it to Domo. There are many different transforms available, including transforms for creating new columns based on calculations, joining columns, encrypting data, and more. You add transforms by clicking\n **Add a transform**\n in the\n **Configure**\n subtab for a DataSet job (which you access by double-clicking on a job in the listing in the\n **Jobs**\n tab) then specifying the necessary information.\n\nWhen you add transforms, they appear in the\n **Transforms**\n area of the\n **Configure**\n subtab in the order in which you add them. Also, once you have added at least one transform, several icons appear above the transform list. All of this is shown in the following screenshot:\n\nThe icons and their functions are as follows:\n\n lets you edit a selected transform.\n* moves the selected transform down in the list.\n* moves the selected transform up in the list.\n* deletes the selected transform.\n\nTransforms are applied in the same order in which they appear in the list. You can have as many transforms for a DataSet as you want.\n\n\n The remainder of this section discusses the basic components for each transform. For more detailed information about adding transforms, see the following topics:\n\n Creating Columns in Workbench 5.1 Using Calculations\n* Setting the Time Zone for a Workbench 5.1 Job\n* Encrypting and Decrypting Workbench 5.1 Data\n* Setting a Custom Date Format on a Column in Workbench 5.1\n* Filtering Columns in Workbench 5.1\n* Replacing a Column Value in Workbench 5.1\n* Combining DataSets in Workbench 5.1\n\n\n###\n Calculated Field Transform\n\nWith the\n **Calculated Field**\n transform, you can you specify a calculation to use to derive a value in a new column based on a value in another column. Open the Calculation Builder for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Calculated Field Transform**\n .  In the Calculation Builder, you can specify a name for the calculation then build your calculation by applying functions to columns in your data source as necessary. Two tabs appear in the Calculation Builder—\n **Available columns**\n , which lets you choose any column in your data source to base a calculation off of, and\n **Available functions**\n , which lets you choose functions from any of five different categories.\n\nFor more information about building calculations, see\n\nCreating Columns in Workbench 5.1 Using Calculations\n\n.\n\n##\n Custom Date Format\n\nYou can use the\n **Custom Date Format**\n transform to change the date format for a given column. Open the options dialog for this transform for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Custom Date Format Transform**\n .\n\nFor more information, see\n\nSetting a Custom Date Format on a Column in Workbench 5.1\n\n.\n\n##\n Filter\n\nYou can use the\n **Filter**\n transform to apply filters to a selected column. You can choose to have Workbench return matches or non-matches for the specified filter query. You can also include or exclude blank cells in your filtered data.\n\n\n Open the options dialog for this transform for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Filter Transform**\n .\n\nFor more information, see\n\nFiltering Columns in Workbench 5.1\n\n.\n\n##\n Lookup Table\n\nYou can combine data sources in Workbench by using Lookup Tables. A \"Lookup Table\" is a DataSet you combine with a primary DataSet. The Lookup Table DataSet and primary DataSet must both contain one column with unique matching values (\"key columns\"). Once you match key columns, a new DataSet is created by joining all columns from both DataSets. Combining DataSets in this way is equivalent to using a LEFT JOIN in SQL.\n\n\n Open the options dialog for this transform for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Lookup Table Transform**\n .\n\nFor more information, see\n\nCombining DataSets in Workbench 5.1\n\n.\n\n##\n Shift Date Timezone\n\nWith the\n **Shift Date Timezone**\n transform, you can set the time zone for the data in a data source by selecting your desired time zone from a menu. Open the options dialog for this transform for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Shift Date Timezone Transform**\n .\n\nFor more information, see\n\nSetting the Time Zone for a Workbench 5.1 Job\n\n.\n\n##\n Encrypt\n\nYou can use the\n **Encrypt**\n transform to encrypt one or more columns of data in your data source. After the DataSet has been pulled into Domo, it can only be decrypted in a Sumo table, by users who have been given special access in the\n **User Access**\n listing for the DataSet job in Workbench. For more information about Sumo, see\n\nUnderstanding Sumo Cards\n\n.\n\n\n Open the options dialog for this transform for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Encrypt Transform**\n .\n\nFor more information about encryption and decryption, see\n\nEncrypting, Decrypting, and Hashing Workbench 5.1 Data\n\n.\n\n##\n Search & Replace\n\nYou can use the\n **Search & Replace**\n transform to replace a specified value in a column with another value. You can also specify a default value to appear in cells in which your search value does not appear. For search and replace values you can open a regular expression builder that includes a number of categories of regular expression constructs.\n\n\n Open the options dialog for this transform for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Search/Replace Transform**\n .\n\nFor more information, see\n\nReplacing a Column Value in Workbench 5.1\n\n.\n\n##\n Hash Value\n\nYou can use the\n **Hash Value**\n transform to encrypt data in a column using hash values. You can choose from any of four different hash algorithms. Open the options dialog for this transform for a DataSet by clicking\n **Add a transform**\n in the\n **Configuration**\n subtab and selecting\n **Hash Value Transform**\n .\n\nFor more information, see\n\nEncrypting, Decrypting, and Hashing Workbench 5.1 Data\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4407032210199\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004845\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUnderstanding the Workbench 5.1 User Interface\n\n", "article_total_view_count": "\n\n\n 5,277\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:32 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "understanding_the_workbench_51_user_interface", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_51", "url": "/s/topic/0TO5w000000ZapUGAS"}]}