{"file_path": "../../raw_kb_v2\\article\\360043428253\\index.html", "content": {"Title": "Managing Pages", "Article Body": "Intro\n                       \n\n                        You can customize Domo by adding, renaming, reordering, and hiding Pages, as well as adding Subpages to parent Pages. All of these options are available in the\n                        \n                         Manage Pages\n                        \n                        dialog, which you can open by clicking\n                        \n                         Manage Pages\n                        \n                        under the\n                        \n                         Dashboards\n                        \n                        navigation pane on the left side of the screen. If this pane is not open, you can open it by mousing over the\n                        \n                        icon in the upper left area of the screen then clicking\n                        \n                        .\n                       \n\n\n\n\n                        For information about personalizing the layout of Cards in Pages, see\n                        \n                         Visualize\n                        \n                        .\n                       \n\n                        The following screenshot shows the most important components of the\n                        \n                         Manage Pages\n                        \n                        dialog:\n                       \n\n\n\n\n                        You can expand or collapse the Subpages for a Page by clicking\n                        \n                        or\n                        \n                        next to the parent Page.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n\n                               System Pages, such as Overview, Shared, Favorites, and Business in a Box, do not appear in the\n                               \n                                Manage Pages\n                               \n                               dialog.\n                              \n\n\n\n\n\n                               Pages that have been locked in the\n                               \n                                Company Settings\n                               \n                               tab in Admin Settings do\n                               \n                                not\n                               \n                               appear in\n                               \n                                Manage Pages\n                               \n                               . However, Pages that have been locked by clicking the\n                               \n                               icon\n                               \n                                do\n                               \n                               appear in\n                               \n                                Manage Pages\n                               \n                               . For more information about locking Pages in the Admin Settings, see\n                               \n                                Locking or Unlocking Page Content\n                               \n                               .\n                              \n\n\n\n\n\n                               Certain user-created Pages in Domo may also not appear, indicating that you do not have sufficient access rights based on your security role to rename, move, or hide those Pages. For more information about access rights, see\n                               \n                                Admin\n                               \n                               .\n                              \n\n\n\n\n\n                               You can also manage Pages in the\n                               \n                                Pages\n                               \n                               tab in Admin Settings by clicking\n                               \n                                More\n                               \n\n                                > Admin > Pages\n                               \n                               . In the\n                               \n                                Pages\n                               \n                               tab, you can manage user and group access for Pages, add or remove Cards on Pages, and delete Pages. This feature is only available for users with an \"Admin\" security role or a custom role with \"Manage All Cards and Pages\" enabled. For more information about default security roles, see\n                               \n                                Managing Roles\n                               \n                               .\n                              \n\n\n\n\n                              You can only create Subpages three layers deep.\n                             \n\n\n\n\n\n\n\n                        You can also change the owner of a Page if you have an \"Admin\" security role or a custom role with \"Manage All Cards and Pages\" enabled or are already the Page owner. You do this by clicking the\n                        \n                         Change\n                        \n                        link next to the Page owner profile picture then selecting a new owner from the menu.\n                       \n\n                        For information about sharing access to a Page, see\n                        \n                         Sharing Access to Cards and Pages\n                        \n                        .\n                       \n\n                        For more information about Pages, see\n                        \n                         Understanding Pages\n                        \n                        .\n                       \n\n                        For information about locking Cards on a Page so that only the Page owner and users with an \"Admin\" security role can reposition and resize them, see\n                        \n                         Locking or Unlocking Page Content\n                        \n                        .\n                       \n\n\n\n                          Video - Managing Pages\n                         \n\n\n\n\n\n\n\n\n\n                        Adding Pages\n                       \n\n                        When you add a Page or Subpage, it is unshared or \"private\" by default. Only Page owners and users with an \"Admin\" default security role or custom role with \"Manage All Cards and Pages\" enabled are able to view a private Page. You can share access to the Page with other users. For more information about sharing access to content, see\n                        \n                         Managing Roles\n                        \n                        .\n                       \n\n\n                         To add a Page,\n                        \n\n\n\n\n                          Click\n                          \n                           Manage Pages\n                          \n                          , which is found under the left-hand\n                          \n                           Dashboards\n                          \n                          pane.\n                         \n\n                          The\n                          \n                           Manage Pages\n                          \n                          dialog opens.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Page\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Click\n                          \n                           Add a Page\n                          \n                          .\n                         \n\n\n\n                          Enter a name for the new Page.\n                          \n                          Page names can contain up to 25 characters.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                          (Optional) Move the new Page to the desired position in Domo by dragging the handle to the left of it.\n                         \n\n\n\n                          Click\n                          \n                           Done\n                          \n                          .\n                         \n\n\n\n                        Adding Subpages\n                       \n\n                        You can add Subpages to any top-level Page in Domo.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n\n                               You\n                               \n                                cannot\n                               \n                               have a private parent Page with a shared Subpage.\n                              \n\n\n\n                               If you share a Subpage, Domo shares its parent Page with the same users and groups as the shared Subpage.\n                              \n\n\n\n\n\n                               You can have a shared parent Page with private and shared Subpages.\n                              \n\n\n\n\n                              You can only create Subpages three layers deep.\n                             \n\n\n\n\n\n\n\n\n                         To add a Subpage,\n                        \n\n\n\n\n                          Click\n                          \n                           Manage Pages\n                          \n                          , which is found under the left-hand\n                          \n                           Dashboards\n                          \n                          pane.\n                         \n\n                          The\n                          \n                           Manage Pages\n                          \n                          dialog opens.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Page\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Click\n                          \n                          next to the top-level Page you want to add a Subpage to.\n                         \n\n                          The Page expands to reveal any existing Subpages, and the\n                          \n                           Add a Subpage\n                          \n                          button appears.\n                         \n\n\n\n                          Click\n                          \n                           Add a Subpage\n                          \n                          .\n                         \n\n\n\n                          Enter a name for the new Subpage.\n                          \n                          Page names can contain up to 25 characters.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        Renaming Pages and Subpages\n                       \n\n                        You can rename any Page or Subpage in Domo for which you have access.\n                       \n\n                        You can rename a Page or Subpage while on the Page or Subpage, or you can rename a Page or Subpage in the\n                        \n                         Manage Pages\n                        \n                        dialog.\n                       \n\n\n                         To rename a Page or Subpage,\n                        \n\n\n\n\n                          Do either of the following:\n                         \n\n\n\n                            On a Page or Subpage, click the name of the Page or Subpage, then change the name as desired.\n                           \n\n\n\n                            Click\n                            \n                             Manage Pages\n                            \n                            , which is found under the left-hand\n                            \n                             Dashboards\n                            \n                            pane.\n                           \n                           The\n                           \n                            Manage Pages\n                           \n                           dialog opens.\n                           \n\n\n\n\n\n\n\n\n\n\n                                 Tip\n                                \n                                : You can also open this dialog from anywhere in Domo by selecting\n                               \n\n\n                                in the app toolbar and selecting\n                                \n                                 Page\n                                \n                                .\n                               \n\n\n\n\n\n\n\n                              Click the Page or Subpage name you want to change.\n                             \n\n\n\n                              Replace the current name with the new name.\n                              \n                              Page names can contain up to 25 characters.\n                             \n\n\n\n                              Click\n                              \n                               Save\n                              \n                              .\n                             \n\n\n\n                              Click\n                              \n                               Done\n                              \n                              .\n                             \n\n\n\n\n\n\n\n                        Reordering Pages and Subpages\n                       \n\n                        In the\n                        \n                         Manage Pages\n                        \n                        dialog you can change the order of Pages and Subpages in your tab rows by dragging the handles to the left of the names. You can move a Subpage above or below other Subpages under the same top-level Page, but you cannot move it elsewhere in the hierarchy. You\n                        \n                         can\n                        \n                        change the hierarchical level of Pages in the Admin Settings if you have an \"Admin\" security profile. For more information, see the next section.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Users with a default security role of \"Participant\" cannot reorder Subpages; they can only change the order of top-level Pages. For more information about user access, see\n                            \n                             Default Security Role Reference\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Tip:\n                           \n                           You can reorder Subpages of a locked Page in\n                           \n                            Company Settings\n                           \n                           . For more information, see\n                           \n                            Managing Pages\n                           \n                           .\n                          \n\n\n\n\n\n                         To move a Page or Subpage elsewhere in Domo,\n                        \n\n\n\n\n                          Click\n                          \n                           Manage Pages\n                          \n                          , which is found under the left-hand\n                          \n                           Dashboards\n                          \n                          pane.\n                         \n\n                          The\n                          \n                           Manage Pages\n                          \n                          dialog opens.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Page\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Mouse over the horizontal bars to the left of the name.\n                         \n\n                          The cursor changes to indicate that the Page or Subpage is movable.\n                         \n\n\n\n                          Drag the Page up or down to the desired position in Domo.\n                         \n\n\n\n                          Click\n                          \n                           Done\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             You can only create Subpages three layers deep.\n                            \n\n\n\n\n\n\n                        Moving Pages in the hierarchy\n                       \n\n                        In the Admin Settings, you can change the position of Pages in the hierarchy. For example, you could demote a top-level Page to a second-level Page by moving it under another top-level Page. You can move Pages one by one, or you can move multiple Pages at once. You must have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled to do this.\n                        \n                         For more information about default security roles in Domo, see\n                         \n                          Managing Roles\n                         \n                         .\n                        \n\n\n                        When you move Pages, you are given the option to assign them as top-level Pages or Subpages. When you choose to assign Pages as Subpages, you are asked to select their new parent Pages. You can select any top-level or second-level Page as a parent Page.\n                       \n\n                        When you move Pages, a number of options are available for setting permissions on those Pages, as follows:\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Use permissions for this Page\n                           \n\n\n\n                            Permissions for moved Pages remain the same. Only users with access to the Pages before they were moved will have access to the Pages in the new destination.\n                           \n\n\n\n\n\n                            Inherit permissions from top Page\n                           \n\n\n\n                            Only users with permissions to the parent Page the Pages are moved under will have access after the move. Available only when you choose the\n                            \n                             Make Subpage\n                            \n                            option.\n                           \n\n\n\n\n\n                            Merge permissions\n                           \n\n\n\n                            All users with access to the Pages before the move and all users with access to the parent Page they are moved under will have access to the Page after the move. Available only when you choose the\n                            \n                             Make Subpage\n                            \n                            option.\n                           \n\n\n\n\n\n                            Remove permissions\n                           \n\n\n\n                            All permissions from the Pages are removed.\n                           \n\n\n\n\n\n\n\n                         To move Pages in the hierarchy,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n\n                            Admin\n                           \n\n                          .\n                         \n\n\n                         Click\n                         \n                          Content\n                         \n                         in the left-hand pane.\n                        \n\n\n                          Click the\n                          \n                           Pages\n                          \n                          sub-tab.\n                          \n                          A list of all Pages in the instance appears.\n                         \n\n\n\n                          Check the boxes for all Pages you want to promote or demote.\n                          \n                          You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Move\n                          \n                          .\n                         \n\n\n\n                          Under\n                          \n                           Choose Location\n                          \n                          , select\n                          \n                           Top Level Page\n                          \n                          if you want the moved Pages to be top-level Pages, or select\n                          \n                           Make Subpage\n                          \n                          if you want the Pages to be Subpages of a specific parent.\n                         \n\n\n\n                          (Conditional) If you chose\n                          \n                           Make Subpage\n                          \n                          in the previous step, enter the name of the desired parent Page in the\n                          \n                           Select Pages\n                          \n                          field.\n                          \n                          The top results of your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n                         \n\n\n\n                          Under\n                          \n                           Permissions\n                          \n                          , select the desired permissions option for these Pages.\n                          \n                          For more information about the permissions options, see the table above.\n                         \n\n\n\n                          Click\n                          \n                           Move Pages\n                          \n                          .\n                          \n                          The Pages are moved to the location you specified, and the permissions are updated.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             You can only create Subpages three layers deep.\n                            \n\n\n\n\n\n\n                        Hiding and showing Pages and Subpages\n                       \n\n                        You can hide Pages or Subpages that you do not want to appear when\n                        \n                         you\n                        \n                        view and navigate Domo. (Others with access to the Pages can see and navigate to them.) You\n                        \n                         cannot\n                        \n                        hide a locked Page. Hiding a Page does not delete the Page. You can \"unhide\" hidden Pages.\n                       \n\n\n                         To hide a Page or Subpage,\n                        \n\n\n\n\n                          Click\n                          \n                           Manage Pages\n                          \n                          , which is found under the left-hand\n                          \n                           Dashboards\n                          \n                          pane.\n                         \n\n                          The\n                          \n                           Manage Pages\n                          \n                          dialog opens.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Page\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Click\n                          \n                           Hide\n                          \n                          for the Page or Subpage you want to hide.\n                         \n\n\n\n\n                         To \"unhide\" a hidden Page,\n                        \n\n\n\n\n                          Click\n                          \n                           Manage Pages\n                          \n                          , which is found under the left-hand\n                          \n                           Dashboards\n                          \n                          pane.\n                         \n\n                          The\n                          \n                           Manage Pages\n                          \n                          dialog opens.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Page\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Click\n                          \n                           Unhide\n                          \n                          for the Page or Subpage you want to unhide.\n                         \n\n\n                           Sharing\n                          \n                          or not sharing (keeping \"private\") a Page or Subpage has to do with controlling access for others to Pages and Subpages you manage.\n                          \n\n                           Hiding\n                          \n                          and\n                          \n                           unhiding\n                          \n                          a Page or Subpage has to do with personalizing Domo for yourself.\n                         \n\n\n\n\n\n                              If you want to...\n                             \n\n\n\n                              do this...\n                             \n\n\n\n\n\n\n\n                              Let others access a Page\n                             \n\n\n\n                              Share the Page with them or with a group they are a member of\n                             \n\n\n\n\n\n                              Prohibit others from accessing a Page\n                             \n\n\n\n                              Do not share the Page with them\n                             \n\n\n\n\n\n                              Prohibit anyone from accessing a Page\n                             \n\n\n\n                              Do not share the Page with anyone and it is \"private\"\n                             \n\n\n\n\n\n                              Personalize\n                              \n                               your\n                              \n                              view and navigation of Pages in Domo\n                             \n\n\n\n                              Hide or unhide a Page or Subpage\n                             \n\n\n\n\n\n                          For information about sharing access to a Page, see\n                          \n                           Sharing Access to Cards and Pages\n                          \n                          .\n                         \n\n\n\n                        Deleting Pages or Subpages\n                       \n\n                        Depending on your security role, you can delete Pages from Domo.\n                       \n\n\n\n                          If you have a \"Privileged\" or \"Editor\" security role or a custom role with \"Edit Pages\" enabled, you can delete Pages you own.\n                         \n\n\n\n                          If you have an \"Admin\" security role or a custom role with \"Manage All Cards and Pages\" enabled, you can delete any Pages in your Domo.\n                         \n\n\n\n\n                         For more information about default security roles in Domo, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n                        If you delete a Page,\n                       \n\n\n\n                          if the Page has any Subpages, the Subpages are deleted\n                         \n\n\n\n                          the Cards on the Page are\n                          \n                           not\n                          \n                          deleted from Domo\n                         \n\n\n\n\n                         To delete a Page,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n\n                            Admin\n                           \n\n                          .\n                         \n\n                          The\n                          \n                           Admin Settings\n                          \n                          appears.\n                         \n\n\n                         Click\n                         \n                          Content\n                         \n                         in the side menu.\n                        \n\n\n                          Click the\n                          \n                           Page\n                          \n                          sub-tab.\n                         \n\n\n\n                          Select the Page you want to delete.\n                         \n\n\n\n                          Click\n                          \n                           Edit >\n                          \n\n                           Delete Page\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Delete Pages\n                          \n                          to confirm deleting the Page and any Subpages.\n                         \n\n\n\n                        Changing the Page owner\n                       \n\n                        You can change the owner of a Page if you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled or you are already assigned as the Page owner. You can change Page owners one Page at a time, or you can change the owner of multiple Pages at once in the\n                        \n                         Admin Settings\n                        \n                        . You can only take bulk actions on Pages if you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled.\n                        \n                         For more information about default security roles in Domo, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n\n                         To change the owner of a single Page,\n                        \n\n\n\n                         Click the\n                         \n                          Change\n                         \n                         link located next to the profile picture of the current Page owner at the top of the screen.\n                         \n\n\n\n\n                         The\n                         \n                          Manage Ownership\n                         \n                         menu opens.\n                        \n\n                         Search for a user or a group in the Add Owners field.\n                         \n\n\n\n\n\n                         (Optional) Write a message to the new owner(s) in the message box.\n                        \n\n                         Click\n                         \n                          Add\n                         \n                         .\n                        \n\n\n                        Ownership of the Page is transferred to the user or group you selected.\n                       \n\n\n                         To change the owner of multiple Pages at once,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n\n                            Admin\n                           \n\n                          .\n                         \n\n\n\n                          Click the\n                          \n                           Content\n                          \n                          tab, then select the\n                          \n                           Pages\n                          \n                          sub-tab in the left-hand pane.\n                          \n                          A list of all Pages in the instance appears.\n                         \n\n\n\n                          Check the boxes for all Pages you want to change the owner of.\n                          \n                          You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Add page owners\n                          \n                          .\n                         \n\n\n\n                          In the dialog, enter the name of the new owner(s) or group(s) in the\n                          \n                           Search Users\n                          \n                          field.\n                          \n                          The top results of your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n                         \n\n\n\n                          Select a user or group from the list.\n                          \n                          The name of the user or group is added to the field.\n                          \n\n\n\n\n\n\n\n\n                          Click\n                          \n\n                            Add Owner\n                           \n\n                          .\n                         \n\n\n\n                        Ownership of all of the Pages you selected is transferred to the new user(s) or group(s).\n                       \n\n                        Locating the Page ID\n                       \n\n\n                         To find a Page ID follow these steps,\n                        \n\n\n\n\n                          Navigate to a Page.\n                         \n\n\n\n                          Locate the URL.\n                          \n\n                          The Page ID is the string of numbers in the URL. (e.g.\n                          \n\n                            https://mycompany.domo.com/Page/\n                           \n\n                            123456789\n                           \n\n                          )", "Preview Article": "Click here to preview", "URL Name": "360043428253", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004101", "Archived Date": "", "Language": "English", "Primary Version": "Managing Pages", "Article Total View Count": "8,557", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Managing Pages\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Card And Dashboard Management\n              \n", "url": "/s/topic/0TO5w000000ZanDGAS"}]}