{"file_path": "../../raw_kb_v2\\article\\360042929774\\index.html", "content": {"title": "\n\n\n Instagram Connector (Deprecated)\n\n\n", "article_body": "\n\n*Important:**\n This Connector has been deprecated. In order to create new DataSets, you must use the\n\nInstagram Business Connector\n\n.\n\n\n Intro\n-------\n\nInstagram is a free photo and video sharing app. The Domo Instagram connector integrates Domo with Instagram to extract data from the Instagram API. Use the connector to retrieve data about your feed, account, follows, liked media, and recent media. To learn more about the Instagram API, visit their site (\n\nhttp://instagram.com/developer\n\n).\n\n\n The Instagram connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Instagram account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the Instagram connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Use this connector to pull Instagram follower counts, other users the company is following, influence of followers, user demographics, user topics of interest, liked posts, and comments on postings.\n  |\n|\n**Primary Metrics**\n | * Number of followers\n* Number of liked posts\n |\n|\n**Primary Company Roles**\n | * Social media manager\n* CMO\n |\n|\n**Average Implementation Time**\n |\n Can probably be implemented in a few minutes\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\nBest Practices\n----------------\n\nNote that many reports return only the previous day's results. So to capture results over time, those reports should be set to\n **Append**\n . For example, to get a trend of followers over time, the \"User's Information\" report needs to run every day in Append mode to build that DataSet snapshot.\n\n\n Prerequisites\n---------------\n\nTo connect to your Instagram account and create a DataSet, you must have an Instagram username and password.\n\n\n Connecting to Your Instagram Account\n--------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Instagram Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Instagram connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Instagram accounts in Domo)\n\n\n to open the Instagram OAuth screen where you can enter your Instagram username and password. Once you have entered valid Instagram credentials, you can use the same account any time you go to create a new Instagram DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Instagram when you connect in Domo, you are authenticated automatically when you click Add account. If you want to connect to an account that is different from the one you are logged into, you must first log out of Instagram.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu, along with a\n **Data to Collect**\n menu that appears for specific report types.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select an Instagram report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n User's Information\n  |\n Returns information about the authenticated user, such as username, bio, website, profile picture URL, etc.\n  |\n|\n User's Recent Media\n  |\n Returns information about recent posts created by the authenticated user.\n  |\n\n|\n|\n Data to Collect\n  |\n Select the type of data to collect for each item in the report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector.\n\nFAQs\n------\n\n\n####\n Why can't I access more Instagram information through this connector?\n\nInstagram deprecated its previous Instagram API platform and the ability to read public media on a user's behalf in early 2018. The ability to read a user's own profile info and media will be deprecated in early 2020. For more information, see\n\nhttps://www.instagram.com/developer/.\n\nInstagram has a powerful new API that can be accessed with Domo's Instagram Business connector. For more information about this connector, see the\n\nInstagram Business Connector Knowledge Base article.\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the email address and password associated with your Instagram account.\n\n###\n How do I know my Instagram credentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n Why are some of my comments missing from the DataSet?\n\nDue to API limitations, we can pull only up to 120 likes or 150 comments.\n\n###\n Can I pull information about my Instagram Story?\n\nUnfortunately, this API does not allow us to pull data about Instagram Stories. However, Instagram has a powerful new API that is able to pull data about Instagram Stories and can be accessed with Domo's Instagram Business connector. For more information about this connector see the\n\nInstagram Business Connector Knowledge Base article\n\n.\n\n###\n How often can the data be updated?\n\nMost information about pages is updated every 24 hours. Select \"insight\" metrics are updated roughly every 15 minutes. We recommend configuring the DataSets to run every 24 hours.\n\n###\n Are there any API limits that I need to be aware of?\n\nInstagram allows up to 5000 API requests for a user per hour. Note that a single DataSet run may be required to make multiple requests.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929774\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003469\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nInstagram Connector (Deprecated)\n\n", "article_total_view_count": "\n\n\n 4,698\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "instagram_connector_deprecated", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}