{"file_path": "../../raw_kb_v2\\article\\360043434953\\index.html", "content": {"Title": "Google Calendar Connector", "Article Body": "Intro\n                       \n\n                        Google Calendar is a time-management and scheduling calendar service that allows users to create and edit events.  To learn more about the Google Calendar API, visit their page (\n                        \n                         https://developers.google.com/google-apps/calendar/v3/reference\n                        \n                        ).\n                        \n\n\n\n                        You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Calendar connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to Google and create a Google Calendar DataSet, you must have a Google username and password.\n                       \n\n                        Connecting to Your Google Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Google Calendar Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Google Calendar connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Google Calendar accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Calendar DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains two menus—one in which you select the calendar to import events from and another in which you select a report type.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Calendar\n                          \n\n                           Select the Google calendar you want to import events from.\n                          \n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Google Calendar report you want to run. The following reports are available:\n                           \n\n\n\n\n                               ACL Feeds\n                              \n\n                               Returns the rules in the access control list for the calendar.\n                              \n\n\n\n                               Calendar Event Entries\n                              \n\n                               Returns events from the selected calendar.\n                              \n\n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQs\n                       \n\n                        What kind of credentials do I need to power up the Google BigQuery connector?\n                       \n\n                        You need Google account credentials.\n                       \n\n                        How do I know my Google account credentials are secure?\n                       \n\n                        Domo's Google Calendar connector uses OAuth, which authenticates the account with Google, without Domo ever having access to your Google account credentials.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        DataSets should be set to update no more than once every 15 minutes.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        While Google may enforce rate call limits, you should not have to worry about them.", "Preview Article": "Click here to preview", "URL Name": "360043434953", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003424", "Archived Date": "", "Language": "English", "Primary Version": "Google Calendar Connector", "Article Total View Count": "4,688", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Google Calendar Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}