{"file_path": "../../raw_kb_v2\\article\\5299662679447\\index.html", "content": {"Title": "Domo Enterprise Toolkit", "Article Body": "Intro\n                       \n\n                        Every day, data becomes a larger, more important part of how you do business. This means processing more data faster for more people. As these needs grow, you need solutions that help maintain and process all that data, without sacrificing the agility and control required to achieve your most audacious goals. Domo Enterprise Toolkit is a collection of tools and features to help you maintain control, security, and consistency within your Domo environment as the depth and breadth of your data solutions expand.\n                       \n\n\n\n                        Toolkit Elements\n                       \n\n                        There are three main elements within the Domo Enterprise Toolkit:\n                       \n\n\n                         Sandbox\n                        \n\n                         Governance Toolkit\n                        \n\n                         Brand Kit\n                        \n\n\n\n                         Sandbox: Encourage Innovation While Maintaining Control\n                        \n\n\n                        End users rely on everything running perfectly, without the hiccups or downtime that can happen when changing or testing a new visualization. Domo’s Sandbox allows analysts to build and test in a separate environment, promoting content only when it’s ready for broad use.\n                       \n\n\n\n\n                        For more information about Sandbox, see\n                        \n                         Domo Sandbox.\n                        \n\n\n\n\n\n                         Governance Toolkit: Streamline Enterprise Governance\n                        \n\n\n                        In an enterprise organization, data security and management demands even more attention and resources. Domo’s easy-to-use Governance Toolkit helps you manage your data efficiently and securely by simplifying dataset management and upkeep, automating data permission policies, and even helping with external data storage.\n                       \n\n\n\n\n                        For more information on the tools and features that make up the Governance Toolkit, see the following:\n                       \n\n\n\n                          Governance Toolkit: PDP Automation\n                         \n\n\n\n                          Governance Toolkit: DataSet Tagging\n                         \n\n\n\n                          Governance Toolkit: DataSet Sharing\n                         \n\n\n\n                          Governance Toolkit: Group Management\n                         \n\n\n\n                          Governance Toolkit: DataSet Backup\n                         \n\n\n                           Note: DataSet Backup is not included in the standard Enterprise Toolkit offering, but can be added for an additional cost.\n                          \n\n\n\n\n\n\n\n                         Brand Kit: Maintain Consistency and Trust\n                        \n\n\n                        As you scale, more and more people will need access to their data in more places and formats, both inside and outside your organization. With Brand Kit, you can build trust and adoption with a look and feel consistent with your brand, including fonts, colors, logos, and more.\n                       \n\n\n\n\n\n\n\n\n                        For more information on Brand Kit, see\n                        \n                         Brand Kit\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "5299662679447", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003031", "Archived Date": "", "Language": "English", "Primary Version": "Domo Enterprise Toolkit", "Article Total View Count": "5,177", "": "", "Article Created Date": "10/24/2022, 9:04 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Domo Enterprise Toolkit\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Governance Tools\n              \n", "url": "/s/topic/0TO5w000000ZannGAC"}]}