{"file_path": "../../raw_kb_v2\\article\\360043436473\\index.html", "content": {"title": "\n\n\n Box Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nUse this connector to pull data files from your Box account into Domo. You can retrieve data files in any of the following file types: CSV, JSON, XLS, XLSX, XML, ZIP, and GZIP. To learn more about the Box API, visit their website. (\n\nhttps://developers.box.com/\n\n)\n\n\n This connector is especially useful when you need to glean data from Excel and CSV reports sent via email. You can upload the reports to a Box folder via email and then use Domo's Box connector to pull the desired reports from the folder.\n\n\n You connect to your Box account in the Data Center. This topic discusses the fields and menus that are specific to the Box Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n The Domo Box Advanced connector is great for parsing complicated files with more than one header or footer row. This connector is helpful if you use European date formats, custom delimiters such as a pipe or a hat, or other custom settings in your data files.\n  |\n|\n**Primary Metrics**\n |\n N/A\n  |\n|\n**Primary Company Roles**\n |\n N/A\n  |\n|\n**Average Implementation Time**\n |\n 10-20 minutes depending on configuration settings.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 4\n  |\n\nBest Practices\n----------------\n\nBest practice for using the Box Advanced connector starts with your data. Make sure your files are named well and organized into appropriate folders. Additionally, you'll want to examine your data files in order to accurately set up the advanced settings. What row does the header start on? Where does the data start? Do you know the format of your date column?\n\n\n Prerequisites\n---------------\n\nTo connect to your Box account and create a DataSet, you must have email address and password you use to log into Box.\n\n\n Connecting to Your Box Account\n--------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Box Advanced Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\nThe Domo Box connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Box accounts in Domo) to open the Box OAuth screen where you can enter the email address and password associated with your Box account.\n\nOnce you have entered valid Box credentials, you can use the same account any time you go to create a new Box DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane includes the following fields and menus:\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n File Name\n  |\n Enter the name (or a portion of the name) of the Box file to retrieve.\n\n\n The connector returns the most recently created or modified file matching the name, based on what you have selected in the\n **Date Field**\n menu.\n  |\n|\n Match Type\n  |\n Specify whether the retrieve file starts with or contains the name you have entered in\n **File Name**\n .\n  |\n|\n File Type\n  |\n Select the file type for the data file you want to retrieve.\n  |\n|\n Date Field\n  |\n Specify whether to retrieve a file based on its creation or last modified date.\n\nThis is useful when there are multiple files containing the name you have entered in\n **File Name**\n .\n  |\n|\n Folder Name or ID\n  |\n Enter a complete folder name (not case-sensitive) or a Box Folder ID to limit the file search to a specific folder’s root contents.\n\n\n Subfolders are ignored. If you leave this blank, the search includes all files in all folders for which you have access.\n  |\n|\n Is the provided input a folder id?\n  |\n Select\n **Yes**\n if you have the entered folder ID.\n  |\n|\n Sheet Name\n  |\n Enter the sheet name you want to retrieve from the specified spreadsheet.\n  |\n|\n Generate the column names\n  |\n This should be selected as 'yes' if the data in Box doesn't have column names. When 'yes', generic column names will automatically be added to the data. By default, the value is set to\n **NO**\n |\n\n\n###\n Advanced Pane\n\nThis pane includes the following fields and menus:\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Header Start\n  |\n Enter the number for the header row in the DataSet.\n  |\n|\n Data Start Row\n  |\n Enter the number for the first data row in the DataSet.\n  |\n|\n Footer\n  |\n Enter the number of rows at the end of the DataSet to skip. For example, to skip the last two rows you would enter\n\n2\n\n.\n  |\n|\n Empty Column Headers\n  |\n Specify what should happen if empty column headers are encountered.\n\nIf you choose\n **Add blank columns**\n , column names are automatically generated for the new columns.\n  |\n|\n Data Format\n  |\n Select the date format that should be used when converting date columns.\n  |\n|\n Delimiter\n  |\n Select the desired delimiter for parsing CSV files.\n  |\n|\n Quote Character\n  |\n Select the desired quote character for parsing CSV files. (A double quote is the CSV standard.)\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Validate that the file was not corrupted when uploaded to Box by downloading from Box and opening in Excel or the proper application for the file type.\n* Box is a worldwide application, and after you upload a file, the servers sync those changes globally. Therefore the file may be available immediately, or it may take up to 30 minutes for Domo to be able to download the file. For best results, give your file 20-40 minutes before you attempt to retrieve it via the connector.\n* Rate limiting may be enforced by Box. The Domo Box connector is aware of this situation and will attempt to recover from any rate limiting situations, but if there are too many DataSets that run at the same time, the connector may not be able to recover and will fail. In that case, stagger the DataSets to run at different times.\n* Other common issues: credential issues (password change), selecting from the wrong folder, entering an incorrect file name (forgetting .xslx for example).\n\nFAQ\n-----\n\n\n#####\n What do I do if I just uploaded a file to\n\nbox.com\n\n, but the Box connector says the file does not exist when I try to pull in the file?\n\nMake sure all your connector settings match your file and free of typos. Files may not be available via the Box API up to 30 minutes after the file was uploaded. Ensure the file has been in Box for at least 30 minutes, and then attempt to run the DataSet again.\n\n####\n What do I do if I can’t connect to\n\nbox.com\n\nwith valid credentials?\n\nThis problem might stem from an issue with your option settings in Box. Domo is an unpublished application in\n\nbox.com\n\nterminology, and one of the options Box gives to its users is to disable unpublished applications by default. Therefore, if a customer is using this option, Domo users may not be able to authenticate or connect to Box to import data from Box to Domo.\n\n\n Box gives customers the option to allow any unpublished application to use a customer's Box instance, which appears to be what most customers have enabled in their Box account settings.  Some customers do not want to enable all unpublished applications but would like to enable Domo to use Box. In this case, there is also an option Box provides to allow exceptions. To enable an exception for Domo, Domo's public API key for Box needs to be added to the exception list.\n\n\n The public API key for Domo at Box is: wmiawbgvombfafa0jj4dgvmvq5ivq83m​\n\n####\n What is the difference between the Box connector and the Box Advanced connector?\n\nThe Box connector allows you to specify the name and type of the file to pull the data from. The Box Advanced connector offers an additional advanced section to specify the data formatting details, along with the name and type of the file.\n\n####\n Can I use the same Box account for multiple DataSets?\n\nYes.\n\n####\n How frequently will my data update?\n\nAs often as required.\n\n####\n Are there any API limits that I need to be aware of?\n\nNo.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436473\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003955\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nBox Advanced Connector\n\n", "article_total_view_count": "\n\n\n 5,087\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "box_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}