{"file_path": "../../raw_kb_v2\\article\\4402638182935\\index.html", "content": {"title": "\n\n\n Snowflake OAuth High Bandwidth With Advanced Partitions Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSnowflake is a cloud-based analytic data warehouse system. Use Domo's Snowflake Internal Unload Advanced Partition connector to unload data from your Snowflake database into internal Amazon S3. The files are then downloaded from internal S3 into Domo. This connector should be preferred over the other Snowflake connectors if you are executing very large queries. It allows you to chose whether or not you want to partition your data. Unlike other partition connectors, it allows you to use partitioning on non date columns. To learn more about the Snowflake API, visit their page (\n\nhttps://docs.snowflake.net/manuals\n\n).\n\n\n You connect to your Snowflake account in the Data Center. This topic discusses the fields and menus that are specific to the Snowflake Internal Unload Advanced Partition connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Best Practices\n----------------\n\n\n**Important:**\n Snowflake asserts your need to manually re-connect your Domo account every time the account expires. The Snowflake integration controls how often the account will expire. If it is set to expire the refresh tokens every 90 days, then you will need to reconnect the account every 90 days. If you would like to increase the refresh timeout to more than 90 days, then you will need to contact the\n **Snowflake Support**\n , and they can increase the maximum timeout from 90 days to 1 year.\n\nPrerequisites\n---------------\n\nTo connect to your Snowflake account and create a DataSet, you must have the following:\n\n The full name of your account (provided by Snowflake). For US West Region\n **account\\_name**\n , and All other regions\n **account\\_name.region\\_id**\n . This is the portion of your Snowflake URL immediately following https://.\n\n\n Note that your full account name may include additional segments that identify the region and cloud platform where your account is hosted. The following table provides account name examples by cloud platform/region. For each row, it assumes your account name is \"xy12345.\"\n* The client ID and client secret\n\nprovided by Snowflake when the client is registered\n\n.\n\nConnecting to Your\n\nSnowflake\n\nAccount\n--------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the\n\nSnowflake Internal Unload Advanced Partition\n\n\n Connector\n\npage. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your\n\nSnowflake\n\naccount. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Account Name\n  |\n Enter your Snowflake account name. For more information, see Prerequisites.\n  |\n|\n Client ID\n  |\n Enter your Client ID (provided by Snowflake when the client is registered.)\n  |\n|\n Client Secret\n  |\n Enter your Client secret (provided by Snowflake when the client is registered.)\n  |\n|\n Role\n  |\n Enter your role.\n  |\n\n\n Once you have entered valid Snowflake credentials, you can use the same account any time you go to create a new\n\n\n Snowflake Internal Unload Advanced Partition\n\n\n DataSet.\n\nYou can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n\nSelect the Query Type. The following query types are available:\n\n  |  |\n| --- | --- |\n|\n Custom Query\n  |\n Enter the SQL query to execute.\n  |\n|\n Query Builder\n  |\n Select a table and fields to auto generate your query.\n  |\n\n|\n|\n Warehouses\n  |\n Select the warehouse containing the data you want to retrieve. The list populates with all of the warehouses you have access to based on your credentials.\n  |\n|\n Databases\n  |\n Select the database containing the data you want to retrieve. The list populates with all of the databases you have access to based on your credentials.\n  |\n|\n Schemas\n  |\n Select the database schema containing the data you want to retrieve. The list populates with all of the schemas you have access to based on your credentials.\n  |\n|\n Database Objects\n  |\n Select the database object.\n  |\n|\n Tables\n  |\n Select the database table you want to retrieve. The list populates with all of the tables you have access to based on your credentials. If you do not select a database table, the connector retrieves your entire database schema.\n  |\n|\n Table Columns\n  |\n Select the table columns you want to retrieve. The list populates with all of the columns you have access to based on your credentials. If you do not select a table column, the connector retrieves your entire selected database table.\n  |\n|\n Table Query Helper\n  |\n This field shows the query that is generated based on the selected fields.\n  |\n|\n Views\n  |\n Select the view.\n  |\n|\n View Columns\n  |\n Select the view columns that you would like to include in your report.\n  |\n|\n View Query Helper\n  |\n This field shows the query that is generated based on the selected fields.\n  |\n|\n Query\n  |\n Enter the SQL query to use to retrieve your data. You can use the\n ********Query Helper********\n parameter to help you write a usable SQL query. To use the\n ********Query Helper********\n , do the following:\n 1. Select your desired warehouse, database, database schema, database table, and table columns in each menu.\n2. Copy the SQL statement that appears in the\n ********Query Helper********\n field.\n3. Paste the copied SQL statement into the\n ********Query********\n field.\n |\n|\n Partition Support\n  |\n Select 'Yes' if you want to partition your data; otherwise, select 'No.'\n  |\n|\n Partition Criteria\n  |\n Select whether you want to partition the data using the date keys, non date keys, or meta query.\n  |\n|\n Partition Query to determine partition tags\n  |\n Enter the partition meta query to determine the distinct partition tags (or keys). The column containing the\n\n\n**Date**\n data is your partition column.\n\n\n Example: SELECT DISTINCT(DATE\\_COLUMN\\_NAME) FROM TABLENAME\n  |\n|\n Partition Support Format\n  |\n Select the partition support format.\n  |\n|\n Partition Column Name\n  |\n Select the partition column name.\n  |\n|\n Past Year\n  |\n Enter the number of past years that you want to get data for. Value can be X, where X is a positive integer. For example: 5.\n  |\n|\n Future Years\n  |\n Enter the number of future years that you want to get data for. Value can be X, where X is a positive integer. For example:5.\n  |\n|\n Past Months\n  |\n Enter the number of past months that you want to get data for. Value can be X, where X is a positive integer. For example:5\n  |\n|\n Future Months\n  |\n Enter the number of future months that you want to get data for. Value can be X, where X is a positive integer. For example:5.\n  |\n|\n Past Days\n  |\n Enter the number of past days that you want to get data for. Value can be X, where X is a positive integer. For example: 30.\n  |\n|\n Date Format\n  |\n Select the required date format. By default\n ****yyyy-MM-dd****\n will be used.\n  |\n|\n Custom Date Format\n  |\n Enter the custom date format.\n  |\n|\n Partition Non Date Key Column Name\n  |\n Select the partition column name.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n I am receiving an error saying, \"OAuth access token expired.\" Why?\n\nTo avoid this error, you need to refresh the token. Snowflake asserts your need to manually re-connect your Domo account every time the account expires. The Snowflake integration controls how often the account will expire. If it is set to expire the refresh tokens every 90 days, then you will need to reconnect the account every 90 days. If you would like to increase the refresh timeout to more than 90 days, then you will need to contact the <b>Snowflake Support</b>, and they can increase the maximum timeout from 90 days to 1 year.\n\n\n####\n\nWhat kind of credentials do I need to power up this connector?\n\nYou need the full name of your Snowflake account, and the client ID and Client secret\n\nprovided by Snowflake when the client is registered\n\n. You may also provide your role.\n\n###\n\nAre there any API limits that I need to be aware of?\n\nLimits depend on your server configuration.\n\n###\n\nHow frequently will my data update?\n\nDatasets can run as often as every 15 minutes. However, depending on the runtime of the query, datasets may need to run less frequently.\n\n###\n\nWhat do I need to be aware of while writing a query?\n\nMake sure that all the words, table names and field names are correctly spelled. Refer to the Query Helper field for query help.\n\n###\n\nWhy can't I connect to my Snowflake database? Do I need to whitelist any IP addresses?\n\nBefore you can connect to a Snowflake database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses\n\n.\n\n###\n\nWhat's the difference between the Snowflake Internal Unload Advanced Partition and Snowflake Managed Unload connectors?\n\nBoth connectors support partitioning, but the Snowflake Internal Unload Advanced Partition connector allows to select whether or not you want to use partitioning for your data. Also, unlike the other partition connectors, the Snowflake Internal Unload Advanced Partition connector allows you to use partitioning on non date columns.\n\nTroubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4402638182935\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003958\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSnowflake OAuth High Bandwidth With Advanced Partitions Connector\n\n", "article_total_view_count": "\n\n\n 4,698\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "snowflake_oauth_high_bandwidth_with_advanced_partitions_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "partition_connectors", "url": "/s/topic/0TO5w000000ZapAGAS"}]}