{"file_path": "../../raw_kb_v2\\article\\360042925814\\index.html", "content": {"Title": "Configuring Notification and Alert Settings", "Article Body": "Intro\n                       \n\n                        You can specify how you are notified about certain events when they occur in Domo. You can be notified about the following kinds of events:\n                       \n\n\n\n                          Triggered Alerts on Visualization Cards and DataSets. You can configure Alerts to be sent instantly or in daily or weekly summary emails (emails listing all triggered Alerts within the specified time frame). For more information about configuring Alerts, see\n                          \n                           Creating an Alert for a DataSet\n                          \n                          .\n                         \n\n\n\n                          Non-Alert events such as someone @-mentioning you in Buzz, sharing a Card or Page with you, assigning a task to you, etc. Messages sent to you for these kinds of events are called\n                          \n                           Notifications\n                          \n                          and are sent immediately. You can configure these to be sent via email, SMS, Domo Mobile, and/or pop-up messages on your computer. For more information about Notifications, see\n                          \n                           Receiving and Viewing Notifications\n                          \n                          .\n                         \n\n\n\n                        You can configure Notification and Alert settings in the Settings screen. The screen contains tabs for General settings, Notifications, Instant Alerts, Daily Alerts, and Weekly Alerts, and the options are different for each tab. For example, you configure Buzz Notification settings in the\n                        \n                         Notifications\n                        \n                        tab.\n                       \n\n\n\n                          Video - Managing Alerts and Notifications\n                         \n\n\n\n\n\n\n\n\n\n                        General\n                       \n\n                        In the\n                        \n                         General\n                        \n                        tab you can configure a number of general settings for your Domo instance, including:\n                       \n\n\n\n\n                           Changing your password\n                          \n\n\n\n\n\n                           Enabling multi-factor verification\n                          \n\n\n\n\n\n                           Changing your time zone\n                          \n\n\n\n\n                          General Buzz settings, as follows:\n                         \n\n\n\n\n                             Disabling conversation auto-switching when you navigate\n                            \n                            . By default, when you navigate to different items in Domo, the open Buzz conversation automatically updates to reflect the newly selected item. For example, if you were on the \"Marketing\" Page, a conversation specific to that Page would be open in Buzz. If you then clicked on the \"Marketing Reach\" Card, the conversation for \"Marketing Reach\" would open instead. If you check this box, new conversations do not appear when you navigate.\n                           \n\n\n\n\n                             Include thread conversations in the Buzz menu\n                            \n                            . If you select this option, the Buzz menu shows dropdown arrows for all conversation threads. You can click an arrow to see the thread names. You can then click a thread name to open the thread in Buzz.\n                            \n\n\n\n\n\n\n\n                             Send emails even if you are logged in and active\n                            \n                            . By default Domo does not send you Notification emails if you are logged in; however, you can check this box if you want to receive emails anyway.\n                           \n\n\n\n\n                             Automatically remove conversations from your Buzz menu\n                            \n                            . Here you can choose how long inactive conversations remain in your Inbox before being removed. If you choose\n                            \n                             Never\n                            \n                            , conversations are never removed due to inactivity. Note that when conversations are removed, they are\n                            \n                             not\n                            \n                            permanently removed from Domo; they are simply removed from your Inbox view.\n                            \n\n                            For more information about Buzz, see\n                            \n                             Buzz\n                            \n                            .\n                           \n\n\n\n\n\n\n                         To configure general settings,\n                        \n\n\n\n\n                          Click your user profile photo\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          Your user Settings page opens, with the\n                          \n                           General\n                          \n                          tab selected by default.\n                         \n\n\n\n                          Configure your settings as desired.\n                         \n\n\n\n                        Notifications\n                       \n\n                        You can set delivery options for all of the following kinds of Notifications in the\n                        \n                         Notifications\n                        \n                        tab in the Settings screen:\n                       \n\n\n\n                          Someone @-mentioning you in a Buzz conversation.\n                         \n\n\n\n                          Any activity occurring in a Buzz conversation you're a member of.\n                         \n\n\n\n                          Someone sharing a Card or Page with you.\n                         \n\n\n\n                          Someone assigning a Task to you or updating a Task assigned to you.\n                         \n\n\n\n                          Updating of a Doc Card you have added as a Favorite.\n                         \n\n\n\n                          Automatic weekly activity report (\"What's Happening in Domo?\") emails.\n                         \n\n\n\n                        For all of these Notification types, you can choose whether the Notifications are sent via pop-up messages\n                        \n                        , email\n                        \n                        , SMS\n                        \n                        , Domo Mobile\n                        \n                        , or any combination of these.\n                       \n\n\n                         To set Notifications,\n                        \n\n\n\n\n                          Click your user profile photo\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Notifications\n                          \n                          tab, enable or disable Notification settings for each Notification type or event.\n                         \n\n\n\n                        In the following example, the user is notified via pop-up messages on his screen when any activity occurs in a Buzz conversation he is following; by Domo Mobile and email when he is @-mentioned in a conversation; by email alone when a task is updated; and so on.\n                       \n\n\n\n\n                        In the\n                        \n                         Notifications\n                        \n                        tab, you can also configure settings for Domo product updates and education subscriptions. You can choose to receive emails with educational information, product feedback, best practices, and so on.\n                       \n\n\n                         To configure Domo email subscriptions,\n                        \n\n\n\n\n                          Mouse over your user menu\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Notifications\n                          \n                          tab, click\n                          \n                           Manage\n                          \n                          next to\n                          \n                           Product Updates and Education\n                          \n                          near the bottom of the screen.\n                          \n                          You are taken into a new window where you can configure email subscriptions.\n                         \n\n\n\n                          Check or uncheck the boxes as necessary to turn subscriptions on or off.\n                         \n\n\n\n                          Click\n                          \n                           Update\n                          \n                          .\n                         \n\n\n\n                        Alerts\n                       \n\n                        There are three Alerts tabs in the Manage Notifications & Alerts screen:\n                        \n                         Instant Alerts\n                        \n                        ,\n                        \n                         Daily Alerts\n                        \n                        , and\n                        \n                         Weekly Alerts\n                        \n                        . Instant Alert Notifications are sent instantly to email, SMS, or Domo Mobile when those Alerts are triggered. Daily and weekly Alert Notifications are sent to your email as summaries of Alerts that were triggered during a given day or week, respectively. For daily Alert Notifications, you can set the time when the summary email is sent each day; for weekly Alert Notifications, you can set both the day and time when the email is sent.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Tip\n                            \n                            : You can also configure Alert settings in the\n                            \n                             Settings\n                            \n                            screen in the Alert Center. The options in this screen are same as those of the\n                           \n\n                            Instant Alerts\n                           \n                           ,\n                           \n                            Daily Alerts\n                           \n                           , and\n                           \n                            Weekly Alerts\n                           \n                           tabs in the Manage Notifications & Alerts screen.\n                           \n\n\n\n\n\n\n                        When you create or follow an Alert, you are prompted to select whether you want to receive immediate, daily, or weekly Notifications, or any combination of these. In the Manage Notifications & Alerts screen, Alerts appear in the tabs corresponding to the options you've selected. For example, if you create an Alert then select\n                        \n                         Daily\n                        \n                        as the Notification option, the Alert appears in the\n                        \n                         Daily Alerts\n                        \n                        tab. You can change these settings in the Manage Notifications & Alerts screen by clicking\n                        \n                         Following\n                        \n                        for the Alert you want to change and selecting the desired options. If you uncheck all of the options in this screen, the Alert disappears from the Manage Notifications & Alerts screen. To restore the Alert to the screen, you must locate it in the Alert Center, click\n                        \n                         Following\n                        \n                        , and check the desired boxes.\n                       \n\n                        For more information about creating Alerts, see\n                        \n                         Creating a Custom Alert for a KPI Card\n                        \n                        . For information about following Alerts and using the Alert Center, see\n                        \n                         Managing Custom Alerts\n                        \n                        .\n                       \n\n                        Instant Alerts\n                       \n\n                        In the\n                        \n                         Instant Alerts\n                        \n                        tab, you can configure whether you want to be notified about triggered Alerts via email, SMS, or Domo Mobile, or any combination of these. These Alert Notifications are sent instantly using all of the delivery options you've selected. For more information about creating Alerts, see\n                        \n                         Creating an Alert for a Visualization Card\n                        \n                        .\n                       \n\n\n                         To set delivery options for instant Alerts,\n                        \n\n\n\n\n                          Mouse over your user menu\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Instant Alerts\n                          \n                          .\n                         \n\n\n\n                          Under\n                          \n                           Delivery Options\n                          \n                          , enable or disable Notification settings as necessary.\n                         \n\n\n\n                        Daily Alerts\n                       \n\n                        In the\n                        \n                         Daily Alerts\n                        \n                        tab, you can set the time at which daily summary emails (lists of Alerts) are sent to you. You can also specify whether updates to \"Favorited\" cards are included in the email. Only \"Favorited\" cards that include Summary Numbers appear in the email. For more information about Summary Numbers, see\n                        \n                         Adding Cards as Favorites\n                        \n                        .\n                       \n\n\n                         To set the time for your daily Alerts,\n                        \n\n\n\n\n                          Mouse over your user menu\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Daily Alerts\n                          \n                          .\n                         \n\n\n\n                          Select a time from the\n                          \n                           Select Time\n                          \n                          menu.\n                         \n\n\n\n                          (Optional) To include \"Favorited\" cards in the Daily Alerts email, check the box reading \"Include updates about your favorite cards.\"\n                         \n\n\n\n                        There is no \"master switch\" that turns off Daily Alerts. If you want to unsubscribe from Daily Alerts, you must do so for each individual Alert. When you are unsubscribed from all Alerts, emails will no longer be sent. Because your subscribed Alerts appear in the\n                        \n                         Daily Alerts\n                        \n                        pane, it is easy to unsubscribe from them.\n                       \n\n\n                         To unsubscribe from daily Alerts,\n                        \n\n\n\n\n                          Mouse over your user menu\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Daily Alerts\n                          \n                          .\n                         \n\n\n\n                          For each Alert appearing in the right-hand pane, click\n                          \n                           Subscribed\n                          \n                          , then uncheck the\n                          \n                           Daily\n                          \n                          box.\n                         \n\n\n\n                        Weekly Alerts\n                       \n\n                        In the\n                        \n                         Weekly Alerts\n                        \n                        tab, you can set the day of the week and time when weekly summary emails are sent to you.\n                       \n\n\n                         To specify weekly Notifications\n                        \n\n\n\n\n                          Mouse over your user menu\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Weekly Alerts\n                          \n                          .\n                         \n\n\n\n                          Select the letter corresponding to the desired day.\n                         \n\n\n\n                          Select the time of day in the\n                          \n                           Select Time\n                          \n                          menu.\n                         \n\n\n\n                        As with Daily Alerts, if you want to unsubscribe from Weekly Alerts, you must do so for each individual Alert. When you are unsubscribed from all Alerts, emails will no longer be sent. Because your subscribed Alerts appear in the\n                        \n\n                          Weekly Alerts\n                         \n\n                        pane, it is easy to unsubscribe from them.\n                       \n\n\n\n                          To unsubscribe from daily Alerts,\n                         \n\n\n\n\n\n                          Mouse over your user menu\n                          \n                          , then click\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Weekl\n                           \n                            y Alerts\n                           \n\n                          .\n                         \n\n\n\n                          For each Alert appearing in the right-hand pane, click\n                          \n\n                            Subscribed\n                           \n\n                          , then uncheck the\n                          \n\n                            Weekly\n                           \n\n                          box.", "Preview Article": "Click here to preview", "URL Name": "360042925814", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004354", "Archived Date": "", "Language": "English", "Primary Version": "Configuring Notification and Alert Settings", "Article Total View Count": "6,268", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Configuring Notification and Alert Settings\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Notifications And Alerts\n              \n", "url": "/s/topic/0TO5w000000ZanxGAC"}]}