{"file_path": "../../raw_kb_v2\\article\\360042929094\\index.html", "content": {"title": "\n\n\n ServiceNow Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nServiceNow is a software platform that supports IT service management and automates common business practices. Use Domo's ServiceNow connector to retrieve a data table from a list or provide a custom table name. For more information about the ServiceNow API, visit their website. (\n\nhttp://wiki.servicenow.com/index.php...\\_API#gsc.tab=0\n\n)\n\n\n The ServiceNow connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n In addition to the standard ServiceNow connector, Domo also provides a \"ServiceNow Upsert\" connector. This connector is exactly the same as the standard ServiceNow connector except that it also offers \"Upsert\" as an update option alongside \"Append\" and \"Replace.\" This option is discussed in this article under Other Panes.\n\n\n You connect to your ServiceNow account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the ServiceNow connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n | * Monitor trends for incidents and find ways to reduce incident counts.\n* Track change request volume and remove bottlenecks in the change request process.\n* Track problem submissions and look for relationships to incident counts.\n |\n|\n**Primary Metrics**\n | * Open high priority incidents\n* Incident trends\n* Incident Mean Time To Resolve (MTTR)\n* Incident volume by severity, priority, impact and urgency\n* Change volume trend\n* Open emergency changes\n* Problem volume trend\n |\n|\n**Primary Company Roles**\n |\n IT service desk manager\n  |\n|\n**Average Implementation Time**\n |\n 3 hours\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 5\n  |\n\nBest Practices\n----------------\n\nSchedule reports at frequent intervals to maintain an accurate and current picture of the status of incidents, problems and change requests.\n\n\n Prerequisites\n---------------\n\nTo connect to your ServiceNow account and create a DataSet, you must have a ServiceNow username and password. You will also need to provide the URL for your ServiceNow server. Usually this will be in the format\n\nhttps://mycompany.servicenow.com\n\n\n .\n\nConnecting to Your ServiceNow Account\n---------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the ServiceNow Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your ServiceNow account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Host URL\n  |\n Enter the URL for your ServiceNow server, e.g.\n\nhttps://mycompany.servicenow.com\n\n\n .\n  |\n|\n Username\n  |\n\nEnter your ServiceNow username. User needs to have their timezone set to GMT time for accurate dates.\n\n|\n|\n Password\n  |\n Enter your ServiceNow password.\n  |\n\nOnce you have entered valid ServiceNow credentials, you can use the same account any time you go to create a new ServiceNow DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n**Note:**\n The user account for the connected ServiceNow credentials\n *must*\n be set to Greenwich Mean Time (GMT); otherwise problems will occur. To edit your profile's time zone, do the following:\n\n. While logged into ServiceNow, navigate to\n **Self Service > My Profile**\n .\n2. Locate the property called\n **Time Zone**\n .\n3. Select\n **GMT**\n as the time zone.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu in which you select the type of table you want to pull. Depending on the table type you select, other options may appear.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select a ServiceNow report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Custom Query\n  |\n Create a custom query. Includes the ability to select which fields are returned to the DataSet.\n  |\n|\n Custom Table\n  |\n Provide a custom table name to retrieve data from.\n  |\n|\n Standard Table\n  |\n\nSelect from a list of standard tables from Service Now.\n\n|\n\n|\n|\n Table\n  |\n Select the ServiceNow table you want to retrieve data for. The following tables are available:\n\n\n|  |  |\n| --- | --- |\n|\n Incident\n  |\n Retrieve data about incidents for a given date range, including impact, urgency level, description, close notes, etc.\n  |\n|\n Change Request\n  |\n Retrieve change requests for a given date range.\n  |\n|\n Problem\n  |\n Retrieve data about problems for a given date range.\n  |\n|\n User Groups\n  |\n Retrieve data about user groups for a given date range.\n  |\n|\n Users\n  |\n Retrieve data about users for a given date range.\n  |\n\n|\n|\n Table Name\n  |\n Enter the name of the table you want to retrieve data for.\n  |\n|\n Custom Query\n  |\n\n\n Enter a custom query. Include only query values directly related to\n\nsysparm\\_query\n\n. The fields\n\nsysparm\\_limit\n\nand\n\nsysparm\\_offset\n\nshould not be included. If the field\n\nsys\\_created\\_on\n\nis included, the value should be in the following format:\n\nyyyy-MM-dd HH:mm:ss\n\nFor example:\n\nORDERBYDESCsys\\_created\\_on^sys\\_created\\_on>2016-09-25+00:00:00^sys\\_created\\_on<2016-09-27+23:59:59\n\nFor more information about query building, visit\n\nhttp://wiki.servicenow.com/index.php...le\\_API#Methods\n\n.\n\n\n**Important:**\n\nWhen creating custom queries, only include query values directly related to\n\nsysparm\\_query\n\n. The fields\n\nsysparm\\_limit\n\nand\n\nsysparm\\_offset\n\nshould not be included. If the field\n\nsys\\_created\\_on\n\nis included, the value should be in the following format:\n\nyyyy-MM-dd HH:mm:ss\n\n.\n\n|\n|\n Fields\n  |\n Enter a comma-separated list of fields to return in your DataSet.\n\n\n For example:\n\n\n`parent,sys_updated_on,number`\n |\n|\n Data Date Format\n  |\n\nSelect the format you expect the ServiceNow API will return date fields. If you select String, Domo will not process the date at all, and return the literal string returned from the ServiceNow API.\n\n|\n|\n Upsert/Merge Key\n  |\n\nEnter the upsert/merge key. By default sys\\_id will be used as upsert/merge key.\n\n|\n|\n Select Date Type for Query\n  |\n\n  |  |\n| --- | --- |\n| **Update Method**  | **Description**  |\n|\n Append\n  |\n\n  |  |\n| --- | --- |\n| **First run**  |\n Create Query with the selected Date Type for the selected DURATION.\n  |\n| **Consecutive run**  |\n Create Query with\n\n*sys\\_updated\\_on**\n\nfrom the last successful run date to Today, and Append to the existing data.\n  |\n\n|\n|\n Merge\n  |\n\n  |  |\n| --- | --- |\n| **First run**  |\n Create Query with the selected Date Type for the selected DURATION.\n  |\n| **Consecutive run**  |\n Create Query with\n\n*sys\\_updated\\_on**\n\nfrom the last successful run date to Today, and Merge to the existing data.\n  |\n\n|\n\n\n |\n|\n Duration\n  |\n Select the duration for the report (a Single Date, or a Date Range)\n  |\n|\n Report Date\n  |\n Specify whether the data is for a specific or relative date. Choose\n **Relative**\n if you always want the report to retrieve data for a given number of days back (which you specify in\n **Days Back**\n ) from the current date. For example, if you enter\n\n5\n\nfor\n **Days Back**\n and set the DataSet to update daily, each new day the report will update to show information for the date 5 days in the past.\n  |\n|\n Select Specific Date\n  |\n Select the date you want to retrieve data for.\n  |\n|\n Days Back\n  |\n Enter the number of days back from the current date that will be presented in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. Choose\n **Relative**\n if you always want the report to retrieve data for a given number of days back (which you specify in\n **Days Back to Start From**\n ) from the current date. If you choose\n **Relative**\n here, you should also choose\n **Relative**\n for\n **End Date**\n and specify a value for\n **Days Back to End At**\n .\n\n\n For example, if you enter\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n End Date\n  |\n Specify whether the last date in your date range is a specific or relative date. Choose\n **Relative**\n if you always want the report to retrieve data for a given number of days back (which you specify in\n **Days Back to End At**\n ) from the current date. If you choose\n **Relative**\n here, you should also choose\n **Relative**\n for\n **Start Date**\n and specify a value for\n **Days Back to Start From**\n .\n\n\n For example, if you enter\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n and you set the DataSet to update daily, each new day the report will update to show information for 5 to 10 days in the past.\n  |\n|\n Select Specific End Date\n  |\n Select the last date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of days before the current date to use as the start date.\n\n\n For example, if you enter\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n and you set the DataSet to update daily, each day the report updates to show information for a 5-day range, starting 10 days ago and ending 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of days before the current date to use as the end date.\n\n\n For example, if you enter\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n and you set the DataSet to update daily, each day the report updates to show information for a 5-day range, starting 10 days ago and ending 5 days ago.\n  |\n\n\n###\n Other Panes\n\nThe \"Upsert\" version of this connector includes\n **Upsert**\n as an update option, alongside the standard \"Replace\" and \"Append.\" When you select this option, you are asked to provide an upsert key that the system uses to match old data. If there are any existing rows of data that use that key, they will be replaced with the new data instead of being added to the DataSet as new rows.\n\n\n The following points explain the preservation of a schema with varying column numbers and different column datatypes to avoid any confusion:\n\n Domo preserves old schemas to avoid anyone making a mistake and thereby returning a different schema from the initial one, which can break all assets using the old schema.\n* If a query does not return a previously populated field, then the field in the dataset will be blank but not deleted..\n* Domo tries to infer the data type of a column when it ingests it. We could tell the connector to not change datatypes but in the case of a custom query where we don’t have insight into the fields before they come over, it would not be advisable. E.g., suppose the connector initially infers that column is a numeric because that’s what coming in during the first run. If on the next run, the query returns something with a character and a numeric, then the connector will fail because it will recognize the column as String instead of numeric.\n* The connector will ingest the fields the API sends over. So if the API does not send over a field, the connector cannot ingest it.\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n FAQ\n\n\n#####\n Does this connector require whitelisting or allowlisting?\n\nYou need to add the connector to the network's whitelist to power up.\n\n\n You also must allow Domo's connector to talk to your ServiceNow instance by working with your IT team to Refer to the\n\nadd Domo's IPs to your network's allowlist\n\n\n#####\n What version of the ServiceNow API does this connector use?\n\nThis connector uses version 1 of the ServiceNow API (\n\nhttps://{\n\nhostName}/api/now/v1.)\n\n####\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL\n  |\n| --- | --- |\n|\n Custom Query\n  |\n /table/{tableName}\n  |\n|\n Custom Table\n  |\n /table/{tableName}\n  |\n|\n Standard Table\n  |\n /table/{tableName}\n  |\n\n\n#####\n What kind of credentials do I need to power up this connector?\n\nYou need a host URL (ex:\n\nhttps://mycompany.service-now.com\n\n), and the username and password used to log into your ServiceNow instance.\n\n####\n Do I need a certain kind of account with the data service to set up the connector?\n\nYour account needs to have the appropriate roles, and the table you are trying to access must have web services enabled.\n\n####\n What else do I need to do to power up my connector?\n\nYou have the option to choose one of the default tables we have included, however, if you need to pull from a custom table, you will need the table name. You also have the option of performing a custom ServiceNow query by providing a sysparmquery. Information on the structure of such a query can be found in the ServiceNow Table API documentation.\n\n####\n How do I know if my query is right?\n\nYou can test queries inside ServiceNow if you have the proper access.\n\n####\n I keep running into failed datasets. How do I fix that?\n\nIf the returned dates are incorrect, you need to verify if your ServiceNow instance is set to GMT or UTC format so that when we receive the data, we can properly translate it into your Domo timezone. If you are unable to change this for the entire company, you could create an individual user with their Timezone set to GMT or UTC specifically for the use inside DOMO.\n\n####\n What's the difference between the ServiceNow connector and ServiceNow Upsert connector?\n\nThe ServiceNow Upsert connector supports the upsert mode along with the append and replace modes, for scheduling the datasets.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929094\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003559\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nServiceNow Connector\n\n", "article_total_view_count": "\n\n\n 4,949\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "servicenow_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}