{"file_path": "../../raw_kb_v2\\article\\360042934934\\index.html", "content": {"Title": "September 2016 Release Notes", "Article Body": "Note:\n                           \n                           Depending on the product version you are using, the documentation may include information about features that may not be available or may have changed.\n                          \n\n\n\n\n\n                         New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Drill Path Reorder Capability\n                       \n\n                        Previously when you set a drill path on a card, if you inadvertently added the drill levels in the wrong order, you had no choice but to delete all of the levels and start again from scratch—an extremely frustrating scenario. With our new drill reorder capability, that frustration is now a thing of the past. In the updated drill edit screen, drill path levels are represented as movable tiles. If you add a level in the wrong sequence, worry not—you can simply click and drag it almost anywhere in the drill sequence (except for to the top or bottom of the drill path, since those spots are reserved for your top level view and table view, respectively), automatically adjusting your card's drill path. You can also edit or delete any movable path in the sequence.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Adding Drill Path to Your Chart\n                        \n                        .\n                       \n\n                        Workbench 4.5\n                       \n\n                        Workbench 4.5 is being released. In addition to bug fixes, this release provides the following improvements designed to make your Workbench experience easier:\n                       \n\n\n\n                          You no longer have to be an Admin in Windows to run Workbench. Non-Admin users can now access Workbench as long as they are assigned to the \"Domo Workbench Users Group.\" All members of this group are allowed to configure and use Domo Workbench to upload data to Domo.\n                          \n\n\n\n\n\n\n                          Previously all data readers would do impersonation. We now launch the Data Collector Process as an impersonated user, which should especially help plugin writers.\n                         \n\n\n\n                          A new security option under\n                          \n                           Settings\n                          \n                          allows you to require impersonation credentials for all DataSet Jobs. This option can only be modified by an Admin user.\n                         \n\n\n\n                          A new option under\n                          \n                           Additional Settings\n                          \n                          for a DataSet Job lets you specify whether the Job waits for Adrenaline indexing before completing.\n                         \n\n\n\n                          If you change the impersonation credentials on a DataSet Job, Workbench now asks you if you want to change the credentials for all jobs that use those credentials.\n                          \n\n\n\n\n                          Likewise, if you change the impersonation credentials for a provider, you are asked if you want to change credentials on all Jobs that use that provider.\n                          \n\n\n\n\n\n\n                          In the Job Scheduler, if a DataSet Job is from a local file provider, you can now select\n                          \n                           Watch File\n                          \n                          for the Job. The Job will then run every time the local file is updated.\n                         \n\n\n\n                          A new plugin platform allows for backwards compatibility with older plugins.\n                         \n\n\n\n                          Password-protected Excel files are now supported.\n                         \n\n\n\n                          You can now change the name of a Workbench-imported DataSet in Domo.\n                         \n\n\n\n                          Improved migration between Workbench 2 and Workbench 4.5.\n                         \n\n\n\n                        New Publication Groups UI\n                       \n\n                        The Publication Groups interface has been enhanced to provide a more intuitive user experience. The interface now guides users through the process of adding pages, setting DataSet filters, and configuring access groups.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Setting Up Publication Groups\n                        \n                        .\n                       \n\n\n                         2-Factor Authentication\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n\n\n                             This feature is available\n                             \n\n\n                              on demand.\n                             \n\n\n\n\n\n                             To request that this feature be enabled,\n                            \n                            reach out to your Domo Customer Success Manager or Technical Consultant.\n                           \n\n\n                             Depending on the feature, you may be required to complete training before you can use the feature.\n                            \n\n\n\n\n\n\n\n                         You can now enable multi-factor authentication for your company.\n                        \n\n                         In\n                         \n\n\n\n                         Admin Settings > Security > Authentication\n                        \n\n                         , you have access to the following multi-factor authentication options:\n                        \n\n\n\n\n\n                           You can set a requirement that users redo their multi-factor authentication after a given number of days.\n                          \n\n\n\n\n\n                           You can set a requirement that codes expire after a given number of failed attempts.\n                          \n\n\n\n\n                          You can see a list of all users who have not entered their mobile number into their\n                          \n                           Profile\n                          \n                          pages. You can also send these users a Buzz message reminding them to provide their numbers.\n                         \n\n\n\n                        Users will\n                        \n                         not\n                        \n                        be able to log into Domo if you enable multi-factor authentication before they have a chance to enter their mobile numbers in their\n                        \n                         Profile\n                        \n                        pages. Make sure all of the employees in your company have entered their numbers before activating this feature.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Turning On Multi-Factor Authentication\n                        \n                        .\n                       \n\n                        Activity Logs\n                       \n\n                        With the new Activity Logs tool in the Admin Settings, you can get greater visibility of what’s changing and who’s changing it. View activity logs for all users in your Domo instance. Quickly filter the logs using any of four commonly used \"quick filters.\" Or, if you want to dig deeper into the logs to single out a specific log or pinpoint a small range of logs, create customized combinations of filters. You can also refresh the logs appearing in the tab or export the logs as a CSV file. Activity Logs provide data for the last 6 months.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Viewing Activity Logs\n                        \n                        .\n                       \n\n                        License Management\n                       \n\n                        The\n                        \n                         User Licenses\n                        \n                        tab in the Admin Settings shows you the number of licenses in use and lets you add new licenses. (If you have exceeded your number of licenses, this number appears red.) It also shows a history of license requests, with the date of request, the name of the requestor, and the number of requests for each individual transactions.\n                       \n\n\n\n\n                        When you choose to add licenses and confirm the transaction, an email is sent to your AE, who then follows up with you, sends an invoice, etc.  The License Manager does\n                        \n                         not\n                        \n                        impede your ability to add new users on the fly.\n                       \n\n                        For more information, see\n                        \n                         Adding User Licenses in Domo\n                        \n                        .\n                       \n\n                        Design Studio improvements\n                       \n\n                        This update provides a new method for transitioning widgets to the artboard. Previously, a representation of the widget was placed on the artboard. This representation was in SVG format and could cause some confusion on what could be directly edited on the artboard versus within the configuration options for that widget. It also prevented exact representations for some widgets, such as the Table and YouTube Player from being shown accurately. The new HTML screenshot method gives a significant performance boost and more accurately represents how the widget will look once on the design. Whatever configurations are chosen for the widget, the artboard will replicate that. In addition, it will allow elements such as Legends to be moved more accurately on the design.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           Some widgets are HTML based and require this upgrade to be available in the Add Widgets menu. This includes the Table, YouTube Player, some Maps, and Filter control widgets.  If you do not see these widgets on your list, you will need to upgrade to 2.0.6.  Any designs that were created in an older version of Design Studio will function normally.\n                           \n\n\n\n\n\n\n\n\n                        This release also includes\n                       \n\n\n\n                          Additional support for SSO authentication\n                         \n\n\n\n                          Updated Table widget instructional text\n                         \n\n\n\n                          Various bug fixes\n                         \n\n\n\n                        Page Search in More menu\n                       \n\n                        In the\n                        \n                         More\n                        \n                        menu in the card page navigation bar, you can filter to show the desired page(s) or subpage(s) with their owners. By default, only top-level pages appear in the\n                        \n                         More\n                        \n                        menu. However, when you enter a search term, both top-level pages\n                        \n                         and\n                        \n                        subpages appear in the menu as search results.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Searching in Domo\n                        \n                        .\n                       \n\n                        App search\n                       \n\n                        Domo's global search now includes Appstore Apps matching your keyword in addition to Buzz messages, cards, and so on.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Searching in Domo\n                        \n                        .\n                       \n\n                        New Maps\n                       \n\n                        Country maps are now available for India, Panama, and Peru. In addition, a region-level map that includes countries in the United Kingdom is now available.\n                       \n\n\n\n\n\n\n                          India\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                          Panama\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                          Peru\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                          UK Country\n                         \n\n\n\n\n                        For information about the India, Panama, and Peru maps, see\n                        \n                         Continental/Regional Map\n                        \n                        .\n                       \n\n                        Full Page Domo Apps\n                       \n\n                        You can now view Domo Apps in full-screen mode by clicking\n                        \n                        in the Details view for the App.\n                       \n\n\n\n\n                        For more information about the Details view user interface, see\n                        \n                         Card Details View Layout\n                        \n                        .\n                       \n\n                        PDP and Group API\n                       \n\n                        You can now utilize our APIs to onboard users and assign them to the correct Domo groups as well as set PDP permissions.\n                       \n\n                        For more information about APIs in Domo, visit\n                        \n                         https://developer.domo.com/manage-domo\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           dojo.domo.com\n                          \n\n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042934934", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004448", "Archived Date": "", "Language": "English", "Primary Version": "September 2016 Release Notes", "Article Total View Count": "2,398", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              September 2016 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}