{"file_path": "../../raw_kb_v2\\article\\360042928574\\index.html", "content": {"Title": "ArcSight Connector", "Article Body": "Intro\n                       \n\n                        HP ArcSight is a cyber security company that provides big data security analytics and intelligence software for security information and event management (SIEM) and log management solutions. You can use Domo’s ArcSight connector to pull Report Service and Query Viewer service reports. To learn more about ArcSight, visit their page (\n                        \n                         https://h41382.www4.hpe.com/gfs-shared/downloads-273.pdf\n                        \n                        ).\n                        \n\n\n\n                        You connect to your ArcSight account in the Data Center. This topic discusses the fields and menus that are specific to the ArcSight connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your ArcSight account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The username and password for your ArcSight account\n                         \n\n\n\n                          The hostname and port number for your ArcSight server\n                         \n\n\n\n                          The report ID if you are retrieving a Report Service report, or the query ID if you are retrieving a Query Viewer Service report\n                         \n\n\n\n                        Connecting to Your ArcSight Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the ArcSight Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your ArcSight account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Username\n                          \n\n                           Enter the username you use to log into your ArcSight account.\n                          \n\n\n\n                           Password\n                          \n\n                           Enter the password you use to log into your ArcSight account.\n                          \n\n\n\n                           Host Name\n                          \n\n                           Enter the hostname of the server where ArcSight is located.\n                          \n\n\n\n                           Port Number\n                          \n\n                           Enter the port number of the server where ArcSight is located.\n                          \n\n\n\n\n\n                         Once you have entered valid ArcSight credentials, you can use the same account any time you go to create a new ArcSight DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the ArcSight report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Report Service\n                              \n\n                               Returns the report associated with the specified\n                               \n                                Report ID\n                               \n                               .\n                              \n\n\n\n                               Query Viewer Service\n                              \n\n                               Runs the query indicated in the\n                               \n                                Query ID\n                               \n                               field.\n                              \n\n\n\n\n\n\n\n                           Report ID\n                          \n\n                           Enter the ID of the Report Service report you want to retrieve.\n                          \n\n\n\n                           Query ID\n                          \n\n                           Enter the ID of the Query Viewer Service query you want to run.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042928574", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003590", "Archived Date": "", "Language": "English", "Primary Version": "ArcSight Connector", "Article Total View Count": "2,376", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              ArcSight Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}