{"file_path": "../../raw_kb_v2\\article\\360042924654\\index.html", "content": {"title": "\n\n\n Latitude-Longitude Route Map\n\n\n", "article_body": "\n\nIntro\n-------\n\nA latitude-longitude route map is a\n\nlatitude-longitude map\n\nin which coordinate points are connected using lines. Two value columns are required. The values in one of these columns is applied to the start points of all given connection lines, and the values in the other are applied to the end points. In the map, differences in the values of start and end points are represented by the thickness of the lines. For example, if a line started out small at the start point of a line and became bigger, this would indicate that the value became larger. If the opposite scenario were true, this would indicate that the value shrank. If the start and end points were the same, the line would have the same thickness throughout.\n\n\n In other respects, a latitude-longitude route map is the same as a latitude-longitude map. The provided coordinates and applied filters determine the \"zoom\" level of the map. For more information about filters, see\n\nAdding Filters to Your Chart\n\n. You can also have multiple distinct routes by uploading an optional series column.\n\n\n For information about world maps, see\n\nU.S. County Map\n\n.\n\n\n For information about troubleshooting when an area in your map does not show data but there is data, see\n\nTroubleshooting\n\n.\n\n\n Understanding latitude-longitude route maps\n---------------------------------------------\n\nLatitude-longitude route maps require seven data columns or rows from your DataSet, and you can add an optional eighth column for series data if you want. The required columns or rows are as follows:\n\n A column or row containing the names of each route line (for example, \"Denver-Omaha\").\n* A column or row containing the source latitude for each route line (that is, the latitude for the starting point in a route line).\n* A column or row containing the source longitude for each route line.\n* A column or row containing the destination latitude for each route line.\n* A column or row containing the destination longitude for each route line.\n* A column or row containing the values for each route line's starting point.\n* A column or row containing the values for each route line's ending point.\n\nValues are represented in your map by varying point sizes, each size of which corresponds to a specific range. Ranges are determined automatically based on the distribution of values in your DataSet and are represented by a legend, which is automatically included beside the map. Differences in the values of start and end point pairs are represented by the thickness of the line connecting them. If you only want to show routes between points, without worrying about values, you can do so by ensuring that all of the values in your DataSet are set to 0.\n\n\n You can break down route lines into color categories by adding an optional eighth column that contains series data. Series data is represented in the map by varying colors of groupings. For example, if the routes in your DataSet were broken down into two different classes, \"Group A\" and \"Group B,\" the lines and points for Group A would appear orange by default, and the lines and points for Group B would appear blue. The sums for each series are shown in the map legend. If a user clicks on a point in a latitude-longitude route map with series data, the drill table that appears shows all items for that series in the map. For more information about drilling into a chart, see\n\nDrilling into Data\n\n.\n\n\n For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n Latitudes and longitudes are recognizable by Domo in any of a number of different formats. For a list of accepted formats, see\n\nFormats for latitudes and longitudes\n\n.\n\n\n Powering latitude-longitude route maps\n----------------------------------------\n\nIn the Analyzer, you choose the columns containing the data for your map. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nKPI Card Building Part 2: The Analyzer\n\n.\n\n##\n Example\n\nThe following graphic shows you how data from a typical column-based spreadsheet is converted into a latitude-longitude route map:\n\n\n###\n Formats for latitudes and longitudes\n\nDomo recognizes latitudes and longitudes written in any of the following formats:\n\n\n Format Name\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Signed degrees\n  |\n Uses the format \"\n `DDD.dddd`\n .\" In this format, South latitudes and West longitudes are preceded by a minus sign. Latitudes range from -90 to 90, and longitudes range from -180 to 80.\n  |\n`41.25, -120.9762`\n |\n|\n Degrees minutes seconds\n  |\n Uses the format \"\n `DDD MM SS`\n + compass direction (\n `N`\n ,\n `S`\n ,\n `E`\n , or\n `W`\n ).\" Latitudes range from 0 to 90 and longitudes range from 0 to 180. The last degree, minute, or second or a latitude or longitude may contain a decimal portion.\n  |\n`41 25 01N, 120 58 57W`\n\n\n`41º25'01\"N, 120º58'57\"W`\n\n\n`S17 33 08.352, W69 01 29.74`\n |\n|\n Degrees minutes\n  |\n Uses the format \"\n `DDD MM`\n + compass direction (\n `N`\n ,\n `S`\n ,\n `E`\n , or\n `W`\n ).\" Latitudes range from 0 to 90 and longitudes range from 0 to 180. The last degree or minute of a latitude or longitude may contain a decimal portion.\n  |\n`41 25N, 120 58W`\n\n\n`41º25'N, 120º58'W`\n\n\n`N41 25.117, W120 58.292`\n |\n|\n Degrees only\n  |\n Uses the format \"\n `DDD`\n + compass direction (\n `N`\n ,\n `S`\n ,\n `E`\n , or\n `W`\n ).\" Latitudes may range from 0 to 90 and longitudes range from 0 to 180. The last degree of a latitude or longitude may contain a decimal portion.\n  |\n`41N, 120W`\n\n\n`41 N, 120 W`\n\n\n`41ºN, 120ºW`\n\n\n`N41.092, W120.8362`\n |\n\nCustomizing latitude-longitude route maps\n-------------------------------------------\n\nYou can customize the appearance of a latitude-longitude route map by editing its\n **Chart Properties**\n . Properties for all chart types are listed and described in\n\nChart Properties\n\n. Unique properties of latitude-longitude route maps include the following. You can click a thumbnail image to see a larger image.\n\n\n Property\n  |\n Description\n  |\n Examples\n  |\n| --- | --- | --- |\n|\n Routes > Symbol Color\n  |\n Allows you to set the color for map points and connection lines. The default is orange. If your map contains a series column, colors are determined automatically—setting this property in this case has no effect.\n  |\n —\n  |\n|\n Routes > Straight Routes\n  |\n When checked, route lines appear straight instead of curved (which is the default). In the first example at right, route lines appear curved; in the second example they appear straight.\n  |\n\n\n |\n|\n Routes > Symbol Transparency\n  |\n Determines the transparency for connection lines. You can select any value from \"none\" (totally opaque) to 80% (almost transparent). The default is \"none.\" In the first example at right, the transparency has been set to \"none\"; in the second example, it has been set to 80%.\n  |\n\n\n |\n|\n Scale > Use Log Scale\n  |\n Allows you to convert your map scale to a logarithmic scale.\n  |\n —\n  |\n|\n Background > Color\n  |\n Lets you choose the lightness of the background. The default is\n **Very Light**\n . The example shows a map in which the background lightness has been set to\n **Medium**\n .\n  |\n\n|\n\nAggregating rows\n------------------\n\nYou can aggregate like rows in a latitude-longitude route map, and the map points reflect the aggregated values. In the following example, the user uploads a DataSet with two rows for \"Berlin-Paris.\"\n\nIn the map, the individual \"Route 2\" values for \"Berlin-Paris\" are aggregated, and the corresponding map point (located near \"Paris\") is sized larger accordingly.\n\nDrilling from map to map\n--------------------------\n\nAs with state maps and standard latitude-longitude maps that represent U.S. cities, you enable \"zoomability\" on routes in a latitude-longitude route map by adding the same map as a drill layer. For example, if you had a route connecting San Antonio and Dallas, you could create a drill layer. A user clicking on the route would then be taken to a zoomed-in view of the route within the state of Texas. This works\n *only*\n for routes located entirely inside of the United States.\n\n\n For more information about adding drill layers to a chart, see\n\nAdding Drill Path to Your Chart\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924654\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004704\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nLatitude-Longitude Route Map\n\n", "article_total_view_count": "\n\n\n 4,949\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:25 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "latitudelongitude_route_map", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}