{"file_path": "../../raw_kb_v2\\article\\4546378883863\\index.html", "content": {"Title": "Multi Radial Progress Gauge", "Article Body": "Intro\n                        \n\n\n\n                        Gauges are simple charts that indicate progress towards meeting a target. A Multi Radial Progress Gauge is similar to a thermometer that \"fills in\" to show how close the current value is to the goal. This gauge type does not include ranges. A Multi Radial Progress Gauge is similar to a\n                        \n                         progress bar gauge\n                        \n                        except that it is circular and shows an exact value rather than a percentage. Other gauge types in Domo include\n                        \n                         single value gauges\n                        \n                        ,\n                        \n                         radial gauges\n                        \n                        ,\n                        \n                         face gauges\n                        \n                        , and\n                        \n                         comparative fill gauges\n                        \n                        .\n                       \n\n                        Powering Multi Radial Progress Gauges\n                       \n\n                        A Multi Radial Progress Gauge requires two columns from your DataSet—Item Names that contains the items that will be shown on the chart and the Gauge Value that contains current values. You can also add a third column as the Optional Max Value that you intend for your data to achieve. For information about value, category, and series data, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        If multiple rows are present in your DataSet, the values in all of the rows are aggregated. Be aware that this aggregates the values for the target value column as well. For example, if your spreadsheet included two rows for \"Team A\" that both had a target value of 100, these would be aggregated in your chart to yield a new target value of 200. Selecting\n                        \n                         No Aggregation\n                        \n                        for either the current value or maximum does\n                        \n                         not\n                        \n                        currently work.\n                       \n\n                        Unless you add a column to the Optional Max Value, the maximum value of a Multi Radial Progress Gauge is automatically determined based on the current value. For example, if your current value was 80, the maximum value would be set to 100. If the current value was 155, the maximum value would be set to 200.\n                       \n\n                        In the Analyzer, you choose the columns containing the data for your Multi Radial Progress Gauge. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         Analyzer Overview\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from the category and value columns in a typical column-based spreadsheet is converted into a Multi Radial Progress Gauge:\n                       \n\n\n\n\n                        Customizing Multi Radial Progress Gauges\n                       \n\n                        You can customize the appearance of a Multi Radial Progress Gauge by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Setting Options for Gauges\n                        \n                        .\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           General > Percent of Total\n                          \n\n                           When selected, all values will be displayed as a percentage of the total of all values.\n                          \n\n\n\n                           General > Target Value\n                          \n\n                           When set, all rings will show as a percentage of the target value, even if \"Percent of Total\" is selected.\n                          \n\n\n\n                           General > Rounded Ends\n                          \n\n                           When set, the ends of the progress chart will be rounded.\n                          \n\n\n\n                           General > Gaps Between Items\n                          \n\n                           When selected, there will be a gap between the progress rings.\n                          \n\n\n\n                           General > Gap Percent\n                          \n\n                           Sets the size of the gap between items as a percentage of the ring width.\n                          \n\n\n\n                           General > Allow Over 100%\n                          \n\n                           When set, the gauge will not limit values to being 100% or less.\n                          \n\n\n\n                           General > Background Ring Style\n                          \n\n                           Sets the style for the background ring of the chart. The options are\n                           \n                            None\n                           \n                           ,\n                           \n                            Thin Center\n                           \n                           ,\n                           \n                            Outside\n                           \n                           , or\n                           \n                            Full\n                           \n                           . The default is None.\n                          \n\n\n\n                           General > Background Ring Color\n                          \n\n                           Sets the color for the background ring if being displayed.\n                          \n\n\n\n                           General > Inner Diameter Percent\n                          \n\n                           Sets the diameter of the center empty space as a percentage of the overall width. (Between 20-80.) The default is 30.\n                          \n\n\n\n                           Data Label Settings > Text\n                          \n\n                           The text used for the data labels.\n                          \n\n\n\n                           Data Label Settings > Text Color\n                          \n\n                           Sets the color for the data label text. The default color will be the color of the rings.\n                          \n\n\n\n                           Hover Text Settings > Hover Text\n                          \n\n                           The text to be displayed when you hover on the chart.\n                          \n\n\n\n                           Hover Text Settings > Center Value Text Color\n                          \n\n                           Sets the color for the text displaying the percentage value in the center of the gauge on hover.\n                          \n\n\n\n                           Full Size Settings\n                          \n\n                           Lets you specify the width and height to use when \"full\" size is selected on a page of cards. For reference, a medium card is 1x1 and a large card is 2x2.", "Preview Article": "Click here to preview", "URL Name": "4546378883863", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004655", "Archived Date": "", "Language": "English", "Primary Version": "Multi Radial Progress Gauge", "Article Total View Count": "4,876", "": "", "Article Created Date": "10/24/2022, 10:18 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Multi Radial Progress Gauge\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}