{"file_path": "../../raw_kb_v2\\article\\360044258533\\index.html", "content": {"Title": "Writing Formulas in Magic ETL", "Article Body": "Intro\n                       \n\n                        The Add Formula action is a row-by-row expression evaluator that brings advanced transformation processes to Magic ETL. Supporting functions such as case statements, time-value-money functions, and statistical utility functions, the Add Formula action gives users enhanced functionality to leverage your Magic ETL DataFlows in new ways.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            There are significant behavioral differences in Magic ETL. Read the\n                            \n\n                              Behavior Changes and Feature Updates in Magic ETL\n                             \n\n                            article before converting mission-critical Magic ETL DataFlows.\n                            \n                             Failure to do so may risk an unintended change to your DataFlow’s behavior.\n                            \n\n\n\n\n\n\n                        Parts of the Add Formula Action\n                       \n\n                        The following screenshot shows how the Add Formula Action looks:\n                       \n\n\n\n\n                        You can learn about the user interface components of the Add Formula dialog in the following table:\n                       \n\n\n\n\n\n\n                             Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Output Column Name\n                           \n\n\n\n                            Add a column name to create a new calculated column and write a formula. To overwrite an existing column, use the\n                            \n                            dropdown to view and select an existing column or type the name of that column exactly to overwrite existing column. When the table icon\n                            \n                            appears in the textbox, an existing column will be overwritten by the entered formulas result.\n                           \n\n\n\n\n\n                            Formula\n                           \n\n\n\n                            Formulas are calculated columns that use SQL-style syntax like Beast Modes. This action evaluates each row individually with the functions provided. Due to the nature of this tile’s output data,\n                            \n                             aggregate functions are not supported\n                            \n                            . For aggregations use the Group By action.\n                           \n\n\n\n\n\n                            Expand Editor Button\n                           \n\n\n\n\n                            Opens the formula editor expanded view (see screenshot below.)\n                           \n\n\n\n\n\n                            Validate Formula Button\n                           \n\n\n\n\n                            Quickly validates the formula’s syntax and checks for errors without running a preview of the entire DataFlow.\n                           \n\n\n\n\n\n                            Preview\n                           \n\n\n\n                            Using the Ctrl + Enter hotkey while the Add Formula Configuration tab is open will run a one row test of your formula and return the result. If a Run Preview of the entire DataFlow has yet to run, this hotkey will kick off a DataFlow preview. After the DataFlow preview’s successful completion, Ctrl + Enter will run a one row test and return the result including any updates made to the formula’s syntax.\n                           \n\n\n\n\n\n\n                         Parts of the Formula Editor (Expanded View)\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n                             Name\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Column Name\n                           \n\n\n\n                            Enter the column name here. If the entered column name exactly matches an existing column, the existing column will be overwritten with results of the formula.\n                           \n\n\n\n\n\n                            Formula\n                           \n\n\n\n                            The field for entering any functions or transformations you want in your evaluation. You can add column names or functions by double-clicking items in the\n                            \n                             Columns\n                            \n                            and\n                            \n                             Functions\n                            \n                            lists.\n                           \n\n\n\n\n\n                            Validate Formula\n                           \n\n\n\n                            The validate formula button will quickly validate the formula’s syntax and check for errors without running a preview of the entire DataFlow.\n                           \n\n\n\n\n\n                            Columns\n                           \n\n\n\n                            Lists categories and values that you can double-click to add to your formula. Formulas that are already validated can be referenced by subsequent formulas and will display in the Columns tab. You can search for items in the list or filter by type.\n                           \n\n\n\n\n\n                            Functions\n                           \n\n\n\n                            Lists all supported functions that you can double-click to add to your formula. You can search for items in the list or filter by type.\n                           \n\n\n\n\n\n                            Function Description\n                           \n\n\n\n                            Displays syntax and usage information for the function currently highlighted in the functions list.\n                           \n\n\n\n\n\n                            Help Icon\n                           \n\n\n\n                            Tooltip that links to the Add Formula Knowledge Base article.\n                           \n\n\n\n\n\n                        Calculation usage notes\n                       \n\n\n                         Most calculations use one of the following general formats:\n                        \n\n\n\n\n\n\n\n                             Format\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            FUNCTIONNAME(`Column Name`)\n                           \n\n\n\n                            Used when some single, specific change is applied to all of the cells in a column. Examples of functions used in this kind of calculation include AVG, MONTHNAME, and CEILING.\n                           \n\n\n\n\n\n                            FUNCTIONNAME(`Column Name1`,`Column Name2`,...)\n                           \n\n\n\n                            Used when a calculation is applied across two or more columns. One example of a function used in this kind of calculation is CONCAT, which combines strings from different columns.\n                           \n\n\n\n\n\n                            FUNCTIONNAME(`Column Name`,\n                            \n                             somevalue\n                            \n                            )\n                           \n\n\n\n                            Used when a calculation involving a specified value is applied to a column. An example of a function used in this kind of calculation is POWER. When using this calculation, you specify the power you want all the cells in a column to be raised to.\n                           \n\n\n\n\n\n                            FUNCTIONNAME(`Column Name`, '\n                            \n                             string\n                            \n                            ')\n                           \n\n\n\n                            Used when a calculation involving a specified string is applied to a column. An example of a function used in this kind of calculation is DATE_FORMAT. When using this calculation, you specify specifier characters to use in formatting the date value. For more information, see\n                            \n                             Date Format Specifier Characters in Beast Mode\n                            \n                            .\n                           \n\n\n\n\n\n\n                         Column names are\n                         \n                          not\n                         \n                         case sensitive.\n                        \n\n                         Supported functions are\n                         \n                          not\n                         \n                         case sensitive.\n                        \n\n                         Use backticks (aka\n                         \n                          backquotes\n                         \n                         ) (`) or double quotes (\") for column names: `Customers` or \"Customers\"\n                         \n                         Wrap column names of two or more words with backticks (`) or double quotes (\"). If you use any column name that matches the name of a function (such as DATE), then use backticks or double quotes (\") to wrap the column name.\n                        \n\n                         Use single quotes (') for strings: 'mystring'\n                        \n\n                         You can escape a quote using two single quotes: 'O''Neal'\n                        \n\n                         You can insert a space in a calculation using single quotes: ' '\n                         \n                         This is useful with functions like CONCAT when you need to combine strings.\n                        \n\n                         You can use most standard arithmetic operators in your custom calculations, such as + (addition), - (subtraction), * (multiplication), / (division), and so on.\n                        \n\n                         You\n                         \n                          can\n                         \n                         refer to a specific new column by name that was created from a formula in a separate calculated formula, as long as the new column being referenced is higher than the formula referencing it.\n                        \n\n                         Calculations can be completed automatically as you enter them.\n                        \n\n\n\n                         As you enter functions, a list of functions appears, which you can select from.\n                        \n\n                         If you enter a backtick ('), a list of column names appears, which you can select from.\n                        \n\n                         While you can combine some functions in a calculation, you\n                         \n                          cannot\n                         \n                         stack numerical functions. For example, SUM(MIN()) is invalid.\n                        \n\n                         Do\n                         \n                          not\n                         \n                         mix data types of values you put in a transformed column.\n                         \n                         For example, in a CASE function, do not store \"Yes\" (string) and \"0\" (number) in the same column.", "Preview Article": "Click here to preview", "URL Name": "360044258533", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004580", "Archived Date": "", "Language": "English", "Primary Version": "Writing Formulas in Magic ETL", "Article Total View Count": "6,741", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Writing Formulas in Magic ETL\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}