{"file_path": "../../raw_kb_v2\\article\\360042925734\\index.html", "content": {"Title": "Configuring Notifications for a Buzz Conversation", "Article Body": "You can configure notifications for a Buzz conversation in the Details pane for that conversation. You can configure notification settings for email, Domo Mobile, SMS, and/or pop-up notifications on your computer. For each of these you indicate whether notifications are sent when you are @ mentioned in the conversation, when any activity occurs in the conversation, or not at all.\n                       \n\n                        In the following example, the user has set computer pop-up notifications\n                        \n                        to \"All activity\" (meaning he will be notified via pop-up notifications when ANY activity occurs in the conversation); Domo Mobile\n                        \n                        and email\n                        \n                        to \"Mentions\" (meaning he will be notified via Domo Mobile and email when he is @ mentioned in the conversation); and SMS to \"None\" (meaning he will not receive ANY notifications for this conversation via SMS).\n                       \n\n\n\n\n                        Conversation notification settings are inherited from your global notification settings you set in the\n                        \n                         Configuring Notifications for a Buzz Conversation\n                        \n                        screen. So, for example, if you indicated in that screen you did not want to receive any notifications via SMS, by default that setting would persist for this and all other Buzz conversations. But you could make an exception for a given conversation by changing the SMS setting just for that conversation.\n                       \n\n\n                         To configure notifications for a Buzz conversation\n                        \n                        ,\n                       \n\n\n\n                          Locate and open the Buzz conversation you want to configure notifications for.\n                          \n                          For information about finding conversations, see\n                          \n                           Chatting in Buzz\n                          \n                          .\n                         \n\n\n\n                          Click the ellipsis icon (...)  in the conversation pane to open the Details pane.\n                         \n\n\n\n                          Click\n                          \n                           Notifications\n                          \n                          to expand that tab.\n                         \n\n\n\n                          Click the radio buttons for the desired notification settings.\n                         \n\n\n\n\n\n                          Video - Notifications and Settings in Buzz", "Preview Article": "Click here to preview", "URL Name": "360042925734", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004319", "Archived Date": "", "Language": "English", "Primary Version": "Configuring Notifications for a Buzz Conversation", "Article Total View Count": "4,691", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Configuring Notifications for a Buzz Conversation\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Buzz\n              \n", "url": "/s/topic/0TO5w000000ZanCGAS"}]}