{"file_path": "../../raw_kb_v2\\article\\000005171\\index.html", "content": {"Title": "Forms", "Article Body": "Intro\n                       \n\n                        Domo Forms allows you to create and manage reusable forms that can be integrated into Domo systems. This is an essential part of the User Task system in\n                        \n                         Workflows\n                        \n                        , which powers the task management system in\n                        \n                         Queues\n                        \n                        . You can also use Forms as a standalone feature by integrating Forms with App Studio.\n                       \n\n                        This article describes how to access, configure, and manage Forms in the following topics:\n                       \n\n\n\n                          Required grants\n                         \n\n\n\n                          Navigation\n                         \n\n\n\n                          Form permissions\n                         \n\n\n\n                          Home page\n                         \n\n\n\n                          Create a new form\n                         \n\n\n\n                          Form editor\n                         \n\n\n\n                          Header\n                         \n\n\n\n                          Canvas\n                         \n\n\n\n                          Validation\n                         \n\n\n\n\n\n                        Required Grants\n                       \n\n                        There are two grants that give user-specific rights to forms in your Domo environment:\n                       \n\n\n\n                          Manage Forms\n                         \n                         — Allows you to perform any action on any form in the instance. This should be granted to superusers, admins, or anyone who helps manage forms.\n                        \n\n\n                          Create Forms\n                         \n                         — Allows you to create a net new form. This should be granted to any user who needs the ability to create and add new forms to the form repository in the instance.\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Contact your Customer Success Manager (CSM) or Account Executive (AE) to receive either of these grants for your instance. For information about the available permissions for non-instance admin users, see the\n                           \n                            Form Permissions\n                           \n                           section of this article.\n                          \n\n\n\n\n\n\n                        Navigation\n                       \n\n                        Follow these steps to access Forms:\n                       \n\n\n                         From the navigation header, select\n                         \n                          More\n                         \n                         >\n                         \n                          Workflows\n                         \n                         .\n                         \n                         The Workflows landing page displays.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If\n                             \n\n                              Workflows\n                             \n                             does not display in the\n                             \n                              More\n                             \n                             menu, it needs to be enabled in your Domo instance. Contact\n                             \n                              Domo Support\n                             \n                             or your CSM/AE for assistance.\n                            \n\n\n\n\n\n                         In the left sidebar, select\n                         \n                         Forms.\n                         \n                         The Forms home page displays.\n                         \n\n\n\n\n\n\n\n\n\n\n                        Form Permissions\n                       \n\n                        You can grant permissions inside Forms for other users or groups to perform specific actions for a specific form. To grant permissions, follow the steps below.\n                       \n\n\n                         Select the\n                         \n                         action menu for the form in the Forms Repository List on the Forms home page.\n                         \n                         The action menu displays.\n                        \n\n                         Select\n                         \n                          Manage Permissions.\n                         \n\n                         The permissions modal displays. The title of the modal is\n                         \n                          Share access with the Form\n                         \n                         .\n                         \n\n\n                          The permissions modal contains a search bar, a list of\n                          \n                           People With Access\n                          \n                          to the form, and a list of\n                          \n                           People Without Access\n                          \n                          to the form. By default, the owner of the form always has Admin permission to the form.\n                         \n\n\n\n\n\n                         In the search bar, enter the name of a person or group.\n                         \n                         If the user or group is found in the instance, they display at the top of the list of\n                         \n                          People Without Access\n                         \n                         . A menu displays next to the user or group name. This menu determines the permissions for the user or group; the default permission is No Access.\n                        \n\n                         Select the menu for the user or group and select the permission you want to grant them. The following list describes the level of access to the form each permission determines:\n                         \n\n\n\n\n\n                            Admin\n                           \n                           — Allows the user/group to perform any action for\n                           \n\n                           the form.\n                          \n\n\n                            Delete\n                           \n                           — Allows the user/group to delete the form.\n                          \n\n\n                            Read\n                           \n                           — Allows the user/group to view the form.\n                          \n\n\n                            Write\n                           \n                           — Allows the user/group to edit the form.\n                          \n\n\n                            Share\n                           \n                           — Allows the user/group to share the form with others, but they can only grant permissions that they themselves have.\n                          \n\n\n\n\n\n\n                        Home Page\n                       \n\n                        The Forms home page displays all available forms based on your permissions, options for creating new forms, a menu of actions for existing forms, and more. The home page components are described below.\n                       \n\n\n\n\n\n                        Forms Repository List\n                       \n\n                        The Forms Repository List is the main feature of the home page. Each row in the list represents an individual form. This list of column headers describes the information contained in each column:\n                       \n\n\n\n                          Title\n                         \n                         — Displays the title of the form.\n                        \n\n\n                          Last Modified\n                         \n                         — Provides the date when the form was last updated.\n                        \n\n\n                          Last Published\n                         \n                         — Provides the date when the form was last published. If the form has not yet been published, a dash (–) displays.\n                        \n\n\n                          Created By\n                         \n                         — Displays the name of the person who created the form.\n                        \n\n\n                        Action Menu\n                       \n\n                        Each row in the Forms Repository List includes an\n                        \n                        action menu after the\n                        \n                         Created By\n                        \n                        column that contains available actions for that form. The following actions display in the menu:\n                       \n\n\n\n                          Manage Permissions\n                         \n                         — Opens the permissions modal. To learn about permissions, see the\n                         \n                          Form Permissions\n                         \n                         heading.\n                        \n\n\n                          Duplicate\n                         \n                         — Creates a duplicate form that immediately displays at the top of the Repository List.\n                        \n\n\n                          View version list\n                         \n                         — Opens a page that displays the form's version list. You can view historically published versions of the form and select an older version to make it the latest version.\n                        \n\n\n                          View inputs/outputs\n                         \n                         — Opens a modal that describes the form's contract. The contract is the definition of which fields accept input, which provide output, which are optional, and which are read only.\n                        \n\n\n\n\n                        Create a New Form\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You must have the Create Forms grant to create a new form. See the\n                           \n                            Required Grants\n                           \n                           section of this article for more information.\n                          \n\n\n\n\n                        To create a new form, select\n                        \n                         +\n                        \n\n                         New Form\n                        \n                        on the home page. If this option is disabled, contact your Domo admin or CSM/AE.\n                       \n\n\n\n\n\n\n\n                       The form editor opens. See the next section for information about the form editor.\n                       \n\n\n                        Form Editor\n                       \n\n                        The form editor is where you build and configure forms with fields, labels, and parameters. You can add as many fields and sections to a form as you want. There are two areas in the editor: the header and the canvas. These sections are described below.\n                       \n\n\n\n\n\n\n                        Header\n                       \n\n\n\n\n                        The header at the top of the editor contains the following items:\n                       \n\n\n\n                          Name and Description fields\n                         \n                         — Select\n                         \n\n                          Edit\n                         \n                         by either field to add a name for the form or an optional description. After you add either a name or description, you can edit it\n                         \n\n                         by selecting the name or description until the field displays as editable.\n                        \n\n\n                          Form Owner and sharing\n                         \n                         — The form owner's name and avatar display beside the\n                         \n\n                          Share\n                         \n                         option. Select\n                         \n\n                          Share\n                         \n                         to open the permissions modal. See\n                         \n                          Form Permissions\n                         \n                         for information about this modal.\n                        \n\n\n                          Preview Mode\n                         \n                         — The\n                         \n                          Preview Mode\n                         \n                         toggle lets you see how the form looks and behaves at runtime. While previewing, you can enter data into the form and try out the different field options you have configured. Enabling the mode displays\n                         \n\n                         a preview of the form in the canvas area of the editor.\n                         \n\n\n\n\n\n                          Form Settings\n                         \n                         — In\n                         \n                          Form Settings\n                         \n                         , you can control the labels and descriptions for your form. You can also choose to hide the name of the form.\n                        \n\n\n\n\n                          View inputs/outputs\n                         \n                         — Selecting\n                         \n\n                          View inputs/outputs\n                         \n                         opens the\n                         \n                          Inputs/Outputs Catalo\n                         \n\n                          g\n                         \n                         modal, which displays the form contract. The contract of a form is its designated inputs and outputs. The modal has two tabs:\n                         \n                          Inputs/Outputs\n                         \n                         and\n                         \n                          Uncatalogued\n                         \n                         .\n                         \n                          The\n                          \n                           Inputs/Outputs\n                          \n                          tab renders each field in the form as a single line item. The field name and alias display on the left side. The alias name displays as a parameter for the entity that integrates with the form (the entity is either a workflow or a Domo app).\n                         \n\n\n\n\n                          The input/output contract displays on the right side of the tab.\n                          \n                          means that the field is a parameter in the form contract, while\n                          \n                          means that the field is not a parameter in the form contract. You can change a field's designation by selecting either of these icons.\n                          \n\n\n                          An input field requires the integrating system to pass a mapping or value to the form. This is so that the field pre-populates with the mapping or value data when it renders to an end user.\n                         \n\n                          An output field passes the data in the field to the integrating system for use. When you create a form, you must determine what data the form requires as input and what data the form provides as output.\n                         \n\n\n\n\n\n\n                           View version list\n                          \n                          — Selecting\n                          \n\n                           View version list\n                          \n                          ​​​​​lets you access the version history of a form.\n                         \n\n                          You can save a form as many times as you want before publishing it. The first version of a form has a Draft status until you publish it, at which point the form has a Published status.\n                         \n\n                          You cannot change a form's contract after the form has been published. This prevents breaking integrations with other products that use the form. However, after you publish a form, you can change\n                          \n                           its\n                          \n                          labels, descriptions, and the order of fields and sections.\n                         \n\n                          When you save a form after publishing it, a new version is created with a Draft status. If you make changes to this version, the changes do not take effect at runtime until you publish it. You can create as many versions as you want, but note that you cannot change the contract from the original published form.\n                         \n\n                          You can view a previous version of the form, or make a previous version the current version of the form, using the\n                          \n                          action menu\n                          \n\n                          in each version row. ,\n                         \n\n\n\n\n\n\n\n                           Save menu\n                          \n                          — The save menu has three options:\n                          \n                           Save Draft\n                          \n                          ,\n                          \n                           Safe Draft As\n                          \n                          , and\n                          \n                           Save & Publish\n                          \n                          .\n                         \n\n\n\n\n                          You can save your form as many times as you want before you publish it. To save a form, select\n                          \n                           Save Draft\n                          \n                          in the page header. The save menu options are as follows:\n                         \n\n\n\n                            Save Draft\n                           \n                           — Saves the form in a draft state.\n                          \n\n\n                            Save Draft As\n                           \n                           — Creates a copy of the form as a new form in the repository. This works in the same way as the Duplicate\n                           \n\n                           option on the Forms home page.\n                          \n\n\n                            Save & Publish\n                           \n                           — Saves the form in a published state. This allows you to select the form\n                           \n\n                           for integration\n                           \n\n                           with other Domo products.\n                           \n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               After publishing\n                               \n\n                               a\n                               \n\n                               form, you cannot\n                               \n\n                               change its contract (inputs and outputs). See\n                               \n                                View version list\n                               \n                               for more information about publishing.\n                              \n\n\n\n\n\n\n\n\n\n\n                        Canvas\n                       \n\n                        The canvas area of the editor contains the sections of the form. Each section is a different page in the form and can contain multiple fields. The following paragraphs describe the components\n                        \n\n                        of each section.\n                       \n\n                        Each section displays a section count: the number of the section over the total number of sections in the form. In this example, the section is the first of one section.\n                       \n\n\n\n                        You can minimize or maximize a section of the form by selecting\n                        \n\n                         Collapse\n                        \n                        or\n                        \n\n                         Expand\n                        \n                        . If you try to collapse a section without completing\n                        \n\n                        all the fields in the section, the form errors and you receive an alert that the\n                        \n                         Add Name\n                        \n                        field must have a value.\n                       \n\n                        Select the\n                        \n                        action menu to view the possible actions for the section:\n                        \n                         Duplicate section\n                        \n                        ,\n                        \n                         Move section\n                        \n                        , and\n                        \n                         Delete section\n                        \n                        . You cannot move or delete a section if there is only one section in the form, because a form must have at least one section. This list describes each possible action:\n                       \n\n\n\n                          Duplicate Section\n                         \n                         — Copies the section and places it directly below itself.\n                        \n\n\n                          Move Section\n                         \n                         — Allows you to move the section using drag-and-drop functionality.\n                        \n\n\n                          Delete Section\n                         \n                         — Removes the section from the form.\n                        \n\n\n\n                        Fill in the\n                        \n                         Add Name\n                        \n                        field and enter an optional description of the form in the\n                        \n                         Description\n                        \n                        field by selecting\n                        \n\n                         Edit\n                        \n                        by either field.\n                       \n\n                        Select\n                        \n                         + Add Section\n                        \n                        to create a new section of the form. Each section represents a different page of the form when the form renders at runtime, so if you want one page, you only need one section.\n                        \n\n\n\n\n                        For each item in a section, there are\n                        \n                         Label\n                        \n                        ,\n                        \n                         Field Type\n                        \n                        , and\n                        \n                         Data Type\n                        \n                        fields.\n                       \n\n                        Field Label and Description\n                       \n\n                        Enter text in the\n                        \n                         Label\n                        \n                        field to identify the name of the\n                        \n\n                        field that displays in the published form. In this example, the name of the field is InputOrderNum.\n                       \n\n\n\n\n\n                        To add an optional description for the field, select\n                        \n                         + Description (Optional)\n                        \n                        .\n                       \n\n                        Field Type\n                       \n\n                        For each item, you must specify the field type. Each type changes how the field displays in the system it's integrated with and how the form user populates the field. For example,\n                        \n                         Short Answer\n                        \n                        provides a simple text field, while\n                        \n                         Date/Time\n                        \n                        provides a calendar and time picker.\n                       \n\n                        The possible field types are listed below:\n                       \n\n\n                         Multiple Choice\n                        \n\n                         Single Choice\n                        \n\n                         Short Answer\n                        \n\n                         Date/Time\n                        \n\n                         Duration\n                        \n\n                         Attachment\n                        \n\n                         Photo\n                        \n\n                         Title/Description\n                        \n\n                         List Response\n                        \n\n                         Paragraph\n                        \n\n\n\n\n\n                        Data Type\n                       \n\n                        For each item, you must specify the data type. It's important to note that different types of fields contain different data. The\n                        \n                         Data Type\n                        \n                        menu filters the accepted data types for your selected\n                        \n                         Field Type\n                        \n                        , as described in the previous section.\n                       \n\n                        The possible data types are listed below:\n                       \n\n\n                         Text\n                        \n\n                         Date\n                        \n\n                         Time\n                        \n\n                         Date/Time\n                        \n\n                         Number\n                        \n\n                         Decimal\n                        \n\n                         Duration\n                        \n\n\n\n\n\n                        Optional Toggle\n                       \n\n                        The\n                        \n                         Optional\n                        \n                        toggle allows you to make an item required or optional for users of the form. By default, this toggle is off, making the item required. Required fields force users to enter a value before submitting the form.\n                        \n\n\n\n\n                        Duplicate a Field\n                       \n\n                        Selecting\n                        \n\n                         Duplicate\n                        \n                        copies the item and places the copy directly below the original item in the same section. This is useful if you want to create an item with similar configurations to an existing item.\n                        \n\n\n\n\n                        Item Action Menu\n                       \n\n                        Each item has an\n                        \n                        action menu with different configuration options. When you select this menu, the following options display:\n                       \n\n\n\n                          Accepts Default Input\n                         \n                         — Makes the item an input parameter of the form. The integrating system must provide a data value or values to populate the field when it renders. This method of marking a field as input is in addition to the method described in the explanation of\n                         \n                          View inputs/outputs\n                         \n                         .\n                        \n\n\n                          Provides Output\n                         \n                         — Makes the item an output parameter of the form. The integrating system receives the data value or values that are entered into the field after it is submitted. This method of marking a field as output is in addition to the method described in the explanation of\n                         \n                          View inputs/outputs\n                         \n                         .\n                        \n\n\n                          Read Only\n                         \n                         — Disables the item from accepting data entered by the form user. You should use this option if you do not want a data value displayed in the field to change.\n                        \n\n\n                          Move Field\n                         \n                         — Allows you to reorder the field using drag-and-drop functionality.\n                        \n\n\n                          Delete\n                         \n                         — Removes the field from the form.\n                        \n\n\n\n\n\n\n\n\n                        Add Item\n                       \n\n                        Select\n                        \n                         Add Item\n                        \n                        to create a new item in the section/page. You can add as many items to a section/page as you want.\n                       \n\n\n\n\n                        Use External Values\n                       \n\n                        Single-choice and multiple-choice field types allow second input mapping. When you select one of these field types, the\n                        \n                         Use External Values\n                        \n                        checkbox displays.\n                       \n\n\n\n\n                        By default, this is deselected, requiring the form user to enter values in the field. Selecting this checkbox indicates that you are mapping the options from an external source.\n                        \n\n\n\n\n\n\n\n                        If you select this checkbox, the contract modal also displays external values as an additional parameter for the field. For information about this modal, see the explanation of\n                        \n                         View inputs/outputs\n                        \n                        .\n                        \n\n\n\n\n                        When you enable\n                        \n                         Accept Default Input\n                        \n                        for these field types, a mapping is required to have one or more values (depending on the field type) pre-selected when the form renders to an end user.\n                       \n\n                        You can also preview how the field behaves at runtime.\n                       \n\n\n\n                        Validation\n                       \n\n                        As you create forms, required configurations are highlighted in red to help you identify missing details. You cannot publish a form until you have completed all required configurations.", "Preview Article": "Click here to preview", "URL Name": "000005171", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005171", "Archived Date": "", "Language": "English", "Primary Version": "Forms", "Article Total View Count": "777", "": "", "Article Created Date": "3/29/2023, 5:22 AM", "First Published Date": "3/29/2023, 5:22 AM"}, "title": "\n              Forms\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Workflows\n              \n", "url": "/s/topic/0TO5w000000ZkAMGA0"}]}