{"file_path": "../../raw_kb_v2\\article\\4418999855639\\index.html", "content": {"title": "\n\n\n Filter Options for the Embedded View Experience\n\n\n", "article_body": "\n\nIntro\n-------\n\nThere are several different filter options that are used in the embedded view experience. They are classified into the following groups:\n\n Secure Filters\n\t+ Personalized Data Permissions (PDP)\n\t+ Server-side Programmatic Filters\n* Client-Side Filters\n\t+ JS API Filters\n\t+ Pfilter URL parameters\n* Interface Filters\n\t+ Page Filters\n\t+ Interaction Filters across Cards\n\nAll of these filter types are layered in this sequence:\n\n\n Secure Filters\n----------------\n\n\n1. **Personalized Data Permissions (PDP)**\n\n\n Documentation:\n\nSSO and PDP\n\nDefinition: Older SSO integration was reliant upon cookies for individual accounts for each viewer.\n\n\n Use case: Forced row-level security defined in the Domo interface that cannot be seen nor edited by viewers.\n\n\n**Important:**\n Browsers are expanding their 3rd party cookie blocks. The best practice is to use Programmatic Filters to stay future-proof.\n\n\n**Note:**\n If this older method must absolutely be used for personalization, protect yourself from embed viewers tracing the iframe back to the instance and seeing extra Cards and Pages beyond the embedded content. This is done by creating a dedicated instance for external use cases, applying the Whitelabel V1 template of feature switches, and embedding from there instead of your main internal instance.\n2. **Server-side Programmatic Filters**\n\n\n Documentation:\n\nProgrammatic Filtering\n\nDefinition: Newer SSO integration with cookie-less auth through a single service account for all viewers.\n\n\n Use case: Forced row-level security defined in server-side code that cannot be seen nor edited by viewers.\n\n\n**Important:**\n This will shift contracts from user/viewer pricing to impression/view pricing since a single service account acts as a proxy for all viewers.\n\n\n**Note:**\n No dedicated external instance is required for this approach since the viewers will not have access to the client ID and secret of the service account. Therefore they cannot trace the iframe and gain access to the Domo instance.\n\nClient-Side Filters\n---------------------\n3. **JS API Filters**\n\n\n Documentation:\n\nJS Sample Code Repo-JS API Filters\n\nDefinition: Client-side approach here contrasts from the server-side approach above because these are meant to be visible and editable for viewers. The filters applied via the embed API through event ports and listeners. Changes applied to multiple pieces of embedded content without forcing iframe refresh. Also supports bi-directional context passing (where click events on the embedded content can also be passed back to the home page for cross-iframe or cross-Page drills, links, and interactions.)\n\n\n Use case: A newer approach to applying external filter controls from the host page (like drop-down menus outside of the iframe.)\n\n\n**Important:**\n Pfilters and the JS API are not a secure replacement for Programmatic Filters because the client-side parameters can be seen and changed by viewers by either glancing at the URL or inspecting the content. These should only be used for filters that aid exploration.\n4. **Pfilter URL parameters**\n\n\n Documentation:\n\nUsing Pfilters to Apply Filters from URL Query Parameters to Embedded Dashboards\n\nDefinition: Simpler setup in URL params instead of client-side code like JS API filters. However, pfilters are slightly slower because they force an iframe refresh to apply the filter logic. They use the same filter pattern (column, operand, value) as client-side JS API and server-side Programmatic Filters.\n\n\n Use Case: An older approach to applying external filter controls.\n\n\n**Important:**\n Pfilters and the JS API are not a secure replacement for Programmatic Filters because the client-side parameters can be seen and changed by viewers by either glancing at the URL or inspecting the content. These should only be used for filters that aid exploration.\n\nInterface Filters\n-------------------\n5. **Page Filters**\n\n\n Documentation:\n\nApplying Page-Level Filters with Filter Views\n\nDefinition: Top filter bar of embedded Cards and Dashboards similar to what is available in the full Domo instance.\n\n\n Use Case: Ad hoc filter creation by the user when the creator does not know all the slices the viewer might want to explore.\n\n\n**Important:**\n Page filters are available in Dashboard embed, but saved Filter Views are still in Beta so they are not targeted for support in Dashboard embed until later in 2021.\n\n\n**Note:**\n As emphasized in the layer sequence above, these lower priority filters can only return results within the subset of rows made available by PDP or Programmatic Filters.\n6. **Interaction Filters across Cards**\n\n\n Documentation:\n\nApplying Card-to-Card Filters\n\nDefinition: Slicer Cards similar to the cross-Card interactions available in the full Domo instance.\n\n\n Use Case: These are the simplest filter interaction for viewers. They are ideal when the content creator already knows the filters users will want.\n\n\n**Note:**\n As emphasized in the layer sequence above, these lower priority filters can only return results within the subset of rows made available by PDP or Programmatic Filters.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4418999855639\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004244\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFilter Options for the Embedded View Experience\n\n", "article_total_view_count": "\n\n\n 4,988\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:35 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "filter_options_for_the_embedded_view_experience", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "distributing_domo_content", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "domo_everywhere", "url": "/s/topic/0TO5w000000ZanbGAC"}]}