{"file_path": "../../raw_kb_v2\\article\\360043437793\\index.html", "content": {"Title": "Sharing Content Using Slideshows", "Article Body": "Intro\n                       \n\n                        Slideshows are an excellent way to showcase your company data. You may find them useful in any of the following situations:\n                       \n\n\n\n                          Wallboards\n                          \n                          You can view vital data about the progress of your team on a wallboard or large monitor.\n                         \n\n\n\n                          Business presentations\n                          \n                          As the presenter, you can pause the Slideshow on slides you want to discuss in more detail, then continue the presentation when you are ready.\n                         \n\n\n\n                          Company kiosks\n                          \n                          You can play a Slideshow on a monitor to showcase what your company is doing.\n                         \n\n\n\n                          Departmental monitors\n                          \n                          You can play a Slideshow of Cards that pertain to a department. For example, your sales team could view a Slideshow of Cards for the number of sales made the last week, quarter, etc.\n                         \n\n\n\n                        Slideshows in Domo come in two varieties:\n                       \n\n\n\n                          Domo Publications\n                          \n                          Publications place your content into a Slideshow that can either be exported to other formats, or securely published to the web.\n                         \n\n\n\n                          One-time Page Slideshows\n                          \n                          These are simple Slideshows of all of the Cards in a Page. They are unsaved—you simply select the\n                          \n                           View Page as Slideshow\n                          \n                          option for a Page and the Slideshow plays.\n                         \n\n\n\n                        You can view your Slideshow in \"kiosk\" mode on a wallboard, TV, or large monitor in a Web browser by signing in to Domo and playing the Slideshow.\n                       \n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            If you cannot see labels on Cards in your Slideshows, this may be because of resolution limitations when sizing the window. If you run into this problem, try resizing your windows to fit the labels then refreshing your screen.\n                           \n\n\n\n\n\n\n\n                          Video - Creating a Slideshow\n                         \n\n\n\n\n\n\n\n\n\n\n                         Creating and Managing Publications\n                        \n\n\n                        In the Publications Page you can create and manage \"Publications\"—Slideshows of Cards in Domo.\n                       \n\n                        Publications let others view the slides outside of Domo. When you publish a Publication, Domo creates a URL for accessing the Publication on the Web. You can send an email containing the URL link to others, inviting them to view the Publication. You can require an access code for viewing a Publication by publishing the Publication privately.\n                       \n\n\n\n                          You can also schedule reports to be sent at specified intervals to users and groups in your organization.\n                         \n\n\n\n\n\n\n\n\n\n                            Note\n                           \n                           : Domo Publications stay synced to the Cards they contain—that is, when data in a Card changes, that Card is instantly updated in the Slideshow to reflect the changes. If you would prefer to have a one-time, unchanging snapshot of Card data in your Slideshow, you can export a Publication as a Microsoft PowerPoint presentation. For more information, see\n                           \n                            Exporting KPI Cards\n                           \n                           .\n                          \n\n\n\n\n                        For information about the layout of the Publications Page, see\n                        \n                         Publications Page Layout\n                        \n                        .\n                       \n\n                        Creating a Publication\n                       \n\n                        There are two ways to create Publications in Domo:\n                       \n\n\n\n                          Selecting the\n                          \n                           Create New Slideshow\n                          \n                          option in the Publications Page then adding each Card you want in the Slideshow one by one.\n                         \n\n\n\n                          Selecting the\n                          \n                           Publish as Slideshow\n                          \n                          option in a Card Page. This creates a Slideshow from all of the Cards in this Page. You can then add Cards from other Pages if you want to.\n                         \n\n\n\n\n                         To create a Publication by adding individual Cards,\n                        \n\n\n\n\n                          Select\n                          \n                           More > Publications\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Create New Slideshow\n                          \n                          .\n                         \n\n\n\n                          In the dialog, add Cards you want as slides in the Slideshow.\n                          \n                          You can search for a Card by name, then hover over it, then click the + to add the Card as a slide.\n                          \n                          Cards in your Slideshow appear in the same order as the Cards in this dialog.\n                         \n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              If you add Cards with Analyzer-filtered data to a Slideshow, the filtered version is the one that appears in the Slideshow. Likewise, if you add a Card to a Slideshow in which the data is filtered due to PDP policies, the filtered version appears in the Slideshow. This is the version\n                              \n                               all\n                              \n                              users see when they view the published Slideshow, regardless of their permissions.\n                             \n                             For more information about Analyzer, see\n                             \n                              Analyzer Layout\n                             \n                             .\n                            \n\n\n\n\n\n\n                          (Optional) To reorder slides in a Slideshow, reposition the Cards as necessary by dragging and dropping them into the desired location.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                          (Optional) Do any of the following:\n                         \n\n\n\n                            Share the Slideshow with others by clicking\n                            \n                             Change\n                            \n                            and selecting the Publish option you want.\n                           \n\n\n\n                            View the Slideshow by clicking\n                            \n                             Play Now\n                            \n                            .\n                           \n\n\n\n                            Export the Slideshow as a Microsoft PowerPoint presentation by clicking\n                            \n                             Download as PowerPoint\n                            \n                            .\n                           \n\n\n\n\n\n                          Click\n                          \n                           Done\n                          \n                          .\n                         \n\n\n\n\n                         To create a Publication from all the Cards in a Page,\n                        \n\n\n\n\n                          Navigate to the Page with Cards you want to add to a Slideshow.\n                         \n\n\n\n                          Click\n                          \n                          in the upper right area of the Page.\n                         \n\n\n\n                          Select\n                          \n                           Publish as Slideshow\n                          \n                          .\n                          \n                          Domo adds the Cards on the Page as slides in a Slideshow that you can save.\n                         \n\n\n\n                          (Optional) Edit the name of the Slideshow.\n                         \n\n\n\n                          (Optional) Add additional Cards to your Slideshow by specifying Cards by name.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          to add the selected Cards as slides in your Slideshow.\n                          \n                          By default, your Slideshow is not published.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n\n\n                          Publish the Slideshow by clicking\n                          \n                           Change\n                          \n                          , selecting the Publish option you want, then clicking\n                          \n                           Done\n                          \n                          .\n                         \n\n\n\n                          Play the Slideshow by clicking\n                          \n                           Play Now\n                          \n                          .\n                         \n\n\n\n                          Export the Slideshow as a Microsoft PowerPoint presentation by clicking\n                          \n                           Download as PowerPoint\n                          \n                          .\n                         \n\n\n\n                        Publication options\n                       \n\n                        The following table describes the available options when publishing a Publication:\n                       \n\n\n\n\n\n                            Publication Status\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Not Published\n                           \n\n\n\n\n\n                            The Slideshow is viewable from Domo but is\n                            \n                             not\n                            \n                            published to the Web.\n                           \n\n\n\n\n\n                            Public\n                           \n\n\n\n                            The Slideshow is available publicly on the Web using the URL. You can email the URL link to others.\n                           \n\n\n\n\n\n                            Private\n                           \n\n\n\n                            The Slideshow is available privately on the Web using the URL and the access code. You can email the URL link and access code to others.\n                           \n\n\n\n\n\n                        Adding Cards to a Publication\n                       \n\n                        You can add Cards to a saved Publication in the Publication Page.\n                       \n\n\n\n                          You can add an individual Card on a Page to an existing report by selecting\n                          \n                          > Schedule Report then choosing the Add to Report option. You can then choose the report you want to add the Card to.\n                         \n\n\n\n\n                         To add Cards to a Publication,\n                        \n\n\n\n\n                          Select\n                          \n                           More > Publications\n                          \n                          .\n                         \n\n\n\n                          For the Slideshow you want to add Cards to, select\n                          \n\n                           > Edit\n                          \n                          .\n                         \n\n\n\n                          Enter the name of the Card you want to add in the\n                          \n                           Search for additional Cards to add\n                          \n                          field.\n                          \n                          The top results for your search appear automatically in a list as you enter characters and filter accordingly as you add or remove characters.\n                         \n\n\n\n                          Select the Card you want to add in the list.\n                          \n                          The name of the Card is added to the field.\n                         \n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              If you add Cards with Analyzer-filtered data to a Slideshow, the filtered version is the one that appears in the Slideshow. Likewise, if you add a Card to a Slideshow in which the data is filtered by PDP policies, the Slideshow is filtered based on your access, as defined by PDP. All users will see data based on the access of the user that creates the Publication.\n                             \n                             For more information about Analyzer, see\n                             \n                              Analyzer Layout\n                             \n                             .\n                            \n\n\n\n\n\n\n                          (Optional) Add additional Cards to this Slideshow by repeating the previous two steps.\n                         \n\n\n\n                          (Optional) Remove a Card from the field by clicking the \"x\" to the right of the Card name.\n                         \n\n\n\n                          Click\n                          \n                           Add\n                          \n                          to add all Cards whose names appear in the field into the Slideshow.\n                         \n\n\n\n                        Slides for the Cards you added appear in this Publication. The order of Cards in the Slideshow is determined by the order of Cards in this dialog. You can rearrange Cards in the dialog by clicking and dragging as necessary.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           The order of Cards in a Slideshow is set when the Slideshow is generated—that is, changing the order of Cards in the source Page does\n                           \n                            not\n                           \n                           affect the Slideshow.\n                          \n\n\n\n\n                        Sharing a Publication\n                       \n\n                        With any Publication, you can choose whether you want to share it with selected individuals or not. When you publish a Publication, you can publish it publicly (URL) or privately (URL and access code). Also, you can send an email to let others know how to access the Publication.\n                       \n\n\n                         To share a Publication,\n                        \n\n\n\n\n                          In the Publications Page, mouse over the Slideshow you want, then select\n                          \n                           Publish\n                          \n                          .\n                         \n\n\n\n                          Select the publish option you want.\n                         \n\n\n\n                          (Optional) If you publish the Slideshow publicly or privately, you can send an email by clicking\n                          \n                           Email web link\n                          \n                          , then completing the email message.\n                         \n\n\n\n                          Click\n                          \n                           Done\n                          \n                          .\n                          \n                          The publish status appears on the Slideshow on the Publications Page.\n                         \n\n\n\n                        Managing Publications\n                       \n\n                        You can manage Publications in the Publications Page, which displays Slideshows you have created or which others have shared with you. When you mouse over a Slideshow, the Slideshow object flips over to reveal a number of options. You can learn more about these options in the following table:\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Play\n                           \n\n\n\n                            Plays the Slideshow in the viewer in Domo. For more information about the Slideshow viewer, see\n                            \n                             Using the Slideshow viewer\n                            \n                            .\n                           \n\n\n\n\n\n                            Edit\n                           \n\n\n\n                            Opens a dialog where you can add or remove Card slides, reorder slides, and rename the Slideshow. Any changes you make are saved when you click\n                            \n                             Save\n                            \n                            .\n                           \n\n\n\n\n\n                            Publish\n                           \n\n\n\n                            Displays a dialog where you can set the options for sharing the Slideshow.\n                           \n\n\n\n\n\n                            Download\n                           \n\n\n\n                            Exports the slides in the Slideshow as a Microsoft PowerPoint presentation. For more information, see\n                            \n                             Exporting Publications\n                            \n                            .\n                           \n\n\n\n\n\n                            Delete\n                           \n\n\n\n                            Deletes the Slideshow from Domo.\n                           \n\n\n\n\n\n\n\n\n\n                          Add the following rows:\n                         \n\n\n\n\n\n\n\n\n\n                              Send Report Now\n                             \n\n\n\n\n\n\n\n                              Lets you email this report to selected individuals and/or groups in your organization.\n                             \n\n\n\n\n\n\n\n\n\n                              Schedule Report\n                             \n\n\n\n\n\n\n\n                              Lets you set up a schedule to send this report to selected individuals and/or groups in your organization.\n                             \n\n\n\n\n\n\n\n\n\n                          You can also add Cards from a Card Page or\n                          \n                           Details\n                          \n                          view to a report. You do this by selecting\n                          \n\n                           > Schedule Report\n                          \n                          for the Card you want to add then clicking the\n                          \n                           Add to Report\n                          \n                          option. You can then select all of the existing reports you want to add this Card to.\n                         \n\n\n\n                        Exporting Publications\n                       \n\n                        You can export slides of KPI Cards from a Publication as a Microsoft PowerPoint presentation. Exporting may be useful when you want to present a\n                        \n                         snapshot\n                        \n                        of your data (as opposed to a dynamic Slideshow that updates when Card data is updated).\n                       \n\n                        The following table lists the major similarities and differences between exported Publications and those viewed in Domo:\n                       \n\n\n\n\n\n                            In PowerPoint...\n                           \n\n\n\n                            In Domo\n                           \n\n\n\n\n\n\n\n\n\n                              Each Card appears as a slide\n                             \n\n\n\n                              Cards are\n                              \n                               static\n                              \n                              ; Cards are\n                              \n                               not\n                              \n                              automatically updated when the data they represent changes; useful when you want to present a\n                              \n                               snapshot\n                              \n                              of your data\n                             \n\n\n\n                              Exported Slideshows are viewed in Microsoft PowerPoint\n                             \n\n\n\n\n\n\n\n                              Each Card appears as a slide\n                             \n\n\n\n                              Cards are\n                              \n                               dynamic\n                              \n                              ; Cards are automatically updated when the data they represent changes\n                             \n\n\n\n                              Slideshows appear in a Web browser\n                             \n\n\n\n\n\n\n\n                        You can also download one or all of the Cards in a Page to PowerPoint without first creating a Slideshow in Domo. For more information, see\n                        \n                         Exporting KPI Cards\n                        \n                        .\n                       \n\n\n                         To export a Publication to Microsoft PowerPoint,\n                        \n\n\n\n                         In the Publications Page, locate the Slideshow you want to export.\n                        \n\n                         Select\n                         \n\n                          > Download\n                         \n                         .\n                         \n\n\n\n\n\n\n                        You can also export a Slideshow after editing a Slideshow by clicking\n                        \n                         Save\n                        \n                        , then clicking\n                        \n                         Download as PowerPoint\n                        \n                        .\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           Of the various types of Cards (KPI, image, notebook, document, poll, etc.), you can\n                           \n                            only\n                           \n                           export KPI Cards to a Microsoft PowerPoint presentation.\n                          \n\n\n\n\n                        You can view the exported presentation in Microsoft PowerPoint.\n                       \n\n                        Administering Publications\n                       \n\n                        You can administer Publications in the Admin Settings. Administrative options include removing Web access to a Publication, removing individual Cards from the Publication, or deleting a Publication entirely.\n                       \n\n                        For information about the Admin Settings interface, see our\n                        \n                         Admin Settings Overview\n                        \n                        .\n                       \n\n\n                         To administer Publications,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n\n                           > Admin\n                          \n                          .\n                          \n                          The Admin Settings appears.\n                         \n\n\n\n                          Under\n                          \n                           Content\n                          \n                          , click\n                          \n                           Publications\n                          \n                          .\n                          \n                          A list of Slideshows and details of the selected Slideshow appear.\n                         \n\n\n\n                          Select the Slideshow you want to administer.\n                         \n\n\n\n                          Perform any of the following actions:\n                         \n\n\n\n\n\n                              Action\n                             \n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n                              Stop sharing the Slideshow\n                             \n\n\n\n                              Click\n                              \n                               Stop Publishing\n                              \n                              to remove Web access to the Slideshow.\n                             \n\n\n\n\n\n                              Remove a Card from the Slideshow\n                             \n\n\n\n                              Click\n                              \n                               Remove\n                              \n                              next to the slide you want to remove from the Slideshow. When prompted, click\n                              \n                               Delete\n                              \n                              to confirm deleting the Card from the Slideshow.\n                             \n\n\n\n\n\n                              Delete the Slideshow\n                             \n\n\n\n                              Click\n                              \n                               Delete\n                              \n                              to delete the selected Slideshow from Domo. When prompted, click\n                              \n                               Delete\n                              \n                              to confirm deleting the Slideshow.\n                             \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             When you perform an administrative action on a Slideshow, a notification is sent to the Slideshow owner.\n                            \n\n\n\n\n\n\n                        Viewing a one-time Slideshow of Cards on a Page\n                       \n\n                        You can view Cards on a Page as a one-time (i.e. unsaved) Slideshow.\n                       \n\n                        Because Page Slideshows show all Cards on a Page, you may want to create Pages designed specifically for Slideshows. For example, each project team in your Development department might have its own Page, and you want to showcase the progress made by each team in resolving software bugs. You could create a new Page containing those Cards from each Page that show this data, then play a Slideshow for the new Page.\n                       \n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n\n                               Playing a Slideshow of Cards on a Page is a quick way to review Cards on a Page but the Slideshow is\n                               \n                                not\n                               \n                               saved.\n                               \n                               If you want to create and save a Slideshow of Cards on a Page that others can view at their convenience, the following options are available:\n                              \n\n\n\n\n\n                                 You can create a dynamic Slideshow by clicking\n                                \n\n\n                                 in the upper right area of the Page, selecting\n                                 \n                                  Publish as Slideshow\n                                 \n                                 , then clicking\n                                 \n                                  Save\n                                 \n                                 . This saves the Slideshow to your Domo instance. From here, you can download, play, publish, edit, or delete the Slideshow. For more information, see\n                                 \n                                  Creating and Managing Publications\n                                 \n                                 .\n                                \n\n\n\n\n\n                                 You can export a Page of Cards directly to PowerPoint by selecting\n                                 \n                                  Export to PowerPoint\n                                 \n                                 from the Page\n                                \n\n\n                                 menu. In this case, no Slideshow is saved to Domo, and the data does not update dynamically. However, this is an excellent way to create a shareable snapshot of data quickly. For more information, see\n                                 \n                                  Exporting KPI Cards\n                                 \n                                 .\n                                \n\n\n\n\n\n\n\n                               From the Launcher Page, you can view Cards powered by a specific connector or data provider as a Slideshow. For more information, see\n                               \n                                Viewing Cards for Data Providers\n                               \n                               .\n                              \n\n\n\n\n\n                               Notebook Cards are not currently supported using this Slideshow method.\n                              \n\n\n\n\n\n\n\n\n\n                         To play a Slideshow of all of the Cards on a Page,\n                        \n\n\n\n\n                          Navigate to the Page with Cards you want to show.\n                         \n\n\n\n                          Click\n                          \n                          located in the upper right area of the Page.\n                         \n\n\n\n                          Select\n                          \n                           View Page as Slideshow\n                          \n                          .\n                         \n\n\n\n                        For information about the controls in the Slideshow viewer, see the next section.\n                       \n\n                        Using the Slideshow viewer\n                       \n\n                        Domo contains a built-in Slideshow viewer that is used for presenting Cards one by one in full-screen mode. In the viewer, you have access to basic controls, including the ability to pause the Slideshow, skip to the next slide or backtrack to a previous slide, or specify the amount of time that slides remain on the screen.\n                       \n\n                        The main controls in the Slideshow interface appear temporarily in the top right corner of the screen when you move the mouse. There are also other controls that appear in other parts of the screen when you hover in those areas. All of these are described in continuation.\n                       \n\n                        Main controls\n                       \n\n                        The Slideshow feature in Domo has a main set of controls you can use to navigate through the slides, pause and play, specify the time between slides, and open a full-screen view. The controls appear in the top right corner of the screen when you start the Slideshow. These disappear after a few seconds but you can make them reappear by moving the mouse. These controls include the following:\n                       \n\n\n\n\n\n                            Control\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Backtracks to the previous Card in the Page.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Pauses the Slideshow. You can also use the space bar to pause.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Plays the Slideshow after it has been paused. You can also use the space bar to play.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Skips to the next Card in the Page.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Allows you to select the amount of time that elapses before the next Card appears.\n                            \n                             10 Seconds\n                            \n                            is the default interval.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Opens a full-screen version of the Slideshow.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Exits the full-screen version of the Slideshow.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Shows the\n                            \n                             Slideshow Hints\n                            \n                            panel.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Ends the Slideshow, returning you to the Card Page. You can also press\n                            \n                             Esc\n                            \n                            to end the Slideshow.\n                           \n\n\n\n\n\n                        Previous/next arrows\n                       \n\n                        When you hover near the left or right side of the screen, large arrows appear that take you to the previous or next slide when clicked. These arrows are similar to the arrows in the main set of controls. You may find these arrows more useful in navigating through slides.\n                       \n\n                        Card carousel\n                       \n\n                        When you hover near the bottom of the screen, a row of Cards pops up—click a Card to jump to that Card in the Slideshow. If there are more than eight Cards in the Page, you can use the\n                        \n                        and\n                        \n                        arrows to \"slide\" the Card carousel left or right to show more Cards. If the arrows are dimmed, there are no more Cards on the Page in the direction indicated.", "Preview Article": "Click here to preview", "URL Name": "360043437793", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004262", "Archived Date": "", "Language": "English", "Primary Version": "Sharing Content Using Slideshows", "Article Total View Count": "12,152", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Sharing Content Using Slideshows\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Publications (Slideshows)\n              \n", "url": "/s/topic/0TO5w000000Zao7GAC"}]}