{"file_path": "../../raw_kb_v2\\article\\360043432033\\index.html", "content": {"title": "\n\n\n Sysomos Heartbeat Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSysomos Heartbeat is a service that tracks social media accounts (Twitter, Facebook, blogs, etc) and records information about posts, usage, followers, etc. Use Domo's Sysomos Heartbeat connector to gain insights into how the posts in those services are used, seen or shared. To learn more about the Sysomos Heartbeat API, visit their page (\n\nhttps://sysomos.com/services/api/\n\n).\n\n\n You connect to your Sysomos Heartbeat account in the Data Center. This topic discusses the fields and menus that are specific to the Sysomos Heartbeat connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\na DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Sysomos Heartbeat account and create a DataSet, you must have a Sysomos API key. To obtain an API key, reach out to your Sysomos account representative.\n\n\n Connecting to Your Sysomos Heartbeat Account\n----------------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Sysomos Heartbeat Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Sysomos Heartbeat account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n API Key\n  |\n Enter your Sysomos API key.\n  |\n\n\n Once you have entered valid Sysomos Heartbeat credentials, you can use the same account any time you go to create a new Sysomos Heartbeat DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Sysomos Heartbeat report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Buzz Graph\n  |\n Returns a list pairs of words that are commonly associated with each other in the heartbeat's accounts.\n  |\n|\n Facebook Fan Page Metrics\n  |\n Returns information about a particular fan page tracked by the heartbeat.\n  |\n|\n Influencers\n  |\n Returns a list of the top influencers in the heartbeat's accounts.\n  |\n|\n Measure\n  |\n Returns the raw numbers and counts shown in the Measure Tab of the heartbeat's online portal.\n  |\n|\n RSS Content\n  |\n Returns information about all of the posts tracked by the heartbeat.\n  |\n|\n Twitter Handle Metrics\n  |\n Returns information about a particular Twitter handle tracked by the heartbeat.\n  |\n|\n YouTube Channel Metrics\n  |\n Returns information about a particular YouTube Channel tracked by the heartbeat.\n  |\n\n|\n|\n Heartbeat ID\n  |\n Enter the ID of the heartbeat you want to retrieve data for.\n  |\n|\n Filters (Optional)\n  |\n Enter a comma-separated list of filters you want to apply.\n  |\n|\n Tags (Optional)\n  |\n Enter a comma-separated list of tags to be included in the output.\n  |\n|\n Start Days\n  |\n Enter the number of past days for which you want to start your report. Use\n\n0\n\nfor yesterday,\n\n1\n\nfor today, and so on. Pair with\n **End Days**\n to create a range of days. For example, if you entered\n\n14\n\nfor\n **Start Days**\n and\n\n7\n\nfor\n **End Days**\n , the report would pull data from 14 days ago until 7 days ago each time it ran.\n  |\n|\n End Days\n  |\n Enter the number of past days for which you want to end your report. Use\n\n0\n\nfor yesterday,\n\n1\n\nfor today, and so on. Pair with\n **Start Days**\n to create a range of days. For example, if you entered\n\n14\n\nfor\n **Start Days**\n and\n\n7\n\nfor\n **End Days**\n , the report would pull data from 14 days ago until 7 days ago each time it ran.\n  |\n|\n Word Pairs\n  |\n Enter the number of word pairs to retrieve data for in a \"Buzz Graph\" report.\n  |\n|\n Maximum Influencers\n  |\n Enter the maximum number of influencers you want to retrieve data for in an \"Influencers\" report.\n  |\n|\n Maximum Mentions\n  |\n Enter the maximum number of mentions per influencers you want to retrieve data for in an \"Influencers\" report.\n  |\n|\n Channel Name\n  |\n Enter the name of the YouTube channel you want to retrieve data for in a \"YouTube Channel Metrics\" report.\n  |\n|\n Twitter Handle\n  |\n Enter the Twitter handle you want to retrieve data for in a \"Twitter Handle Metrics\" report.\n  |\n|\n Facebook Page ID\n  |\n Enter the Facebook page ID you want to retrieve data for in a \"Facebook Fan Page Metrics\" report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043432033\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003699\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSysomos Heartbeat Connector\n\n", "article_total_view_count": "\n\n\n 2,350\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "sysomos_heartbeat_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}