{"file_path": "../../raw_kb_v2\\article\\8657306040855\\index.html", "content": {"title": "\n\n\n Dataset Copy Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can use Domo's DataSet Copy Advanced connector to copy data from one Domo instance to another. You do this in the Data Center.\n\n\n The DataSet Copy DataSet connector is a \"File\" connector, meaning it retrieves files and outputs them to Domo. In the Data Center, you can access the connector page for this and other File connectors by clicking\n\n\n**File**\n\n\n in the toolbar at the top of the window.\n\n\n There are two versions of this connector, a regular and an advanced version. The only difference between these is that the advanced version asks you for the username and password for the Domo instance you are copying from. Because of this, we do not provide separate documentation for the advanced version.\n\n\n This topic discusses the fields and menus that are specific to the DataSet Copy connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nFor creating the credentials you can refer following steps:\n\n\n To obtain your Domo Client ID and Client Secret:\n\n Log into the\n\nDomo developer account\n\n.\n* In the top right corner under My Account click New Client.\n* Enter the application name and description.\n* Provide the application scope by selecting the checkboxes for Data and User.\n* Click Create. Once you have created a client, you can manage the client by clicking on Manage Client.\n* Your Value will appear in the Manage Client section.\n\nThe DataSource ID of the data you want to copy. You can find the DataSource ID by opening the Details view for the DataSet in the Data Center. The ID is the number in the URL following \"/datasources/\".\n\nConfiguring the Connector\n---------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the DataSet Copy Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to create a DataSet Copy account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Domo Client ID\n  |\n Enter the Client ID for the Domo instance you are copying from.\n  |\n|\n Domo Client Secret\n  |\n Enter the Client Secret for the Domo instance you are copying from.\n  |\n\nFor more information about obtaining the above credentials, see \"Prerequisites,\" above.\n\n\n Once you have entered valid credentials, you can use the same account any time you go to create a new DataSet Copy DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nIn this pane you enter details about the DataSet you want to copy.\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the report you want to run.\n  |\n|\n\nDataSource ID\n\n|\n The DataSource ID of the data you want to copy. You can find the DataSource ID by opening the Details view for the DataSet in the Data Center.\n  |\n|\n Only Updated Data\n  |\n\nChoose 'Yes' to retrieve data only if the dataset has run after the latest run of this copy dataset. This helps prevent stale data.\n\n|\n|\n\nDataSet's Schema\n\n|\n Choose 'Yes' to use the schema from the inputted dataset for every run.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the username, password, and access token of an account that has access to the original dataset.\n\n###\n I am not able to connect with my access token. Why?\n\nAccess tokens are associated with specific user accounts and have the same access as the user. If the user's permissions change, the access token reflects that.\n\n###\n Why do I need the access token?\n\nAccess tokens are used to import data in or export data from Domo.\n\n###\n How can I get the access token?\n\nYou need to have an \"Admin\" security role in generating an access token; otherwise, you need to request an access token from your Domo Admin. Visit\n\nManaging Access Tokens\n\nfor more details.\n\n###\n What else do I need to do to power up my connector?\n\nYou need to provide the Domo instance containing the dataset and the dataset id of the data you want to copy.\n\n###\n How can I find the Domo instance and dataset id?\n\nIf your Domo URL is \"\n\nhttps://abc123.domo.com\"\n\n\", the instance would be \"abc123\".\n\n\n You can find the dataset id in the Details view for the dataset in the Data Center. The id is the number in the URL following \"/datasources/\".\n\n###\n How often can the data be updated?\n\nDatasets should be set to update once every 15 minutes.\n\n###\n Are there any API limits that I need to be aware of?\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 8657306040855\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003827\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDataset Copy Advanced Connector\n\n", "article_total_view_count": "\n\n\n 2,426\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "dataset_copy_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}