{"file_path": "../../raw_kb_v2\\article\\360042928554\\index.html", "content": {"Title": "AppNexus Log-Level Connector", "Article Body": "Intro\n                       \n\n                        The AppNexus Log-Level data service (formerly known as the Data Siphon Service) allows users to retrieve and track feeds of log-level event data that include dimensions not available in the AppNexus Console or via the API Report Service.  To learn more about the AppNexus Log-Level API, visit their page (\n                        \n                         https://wiki.appnexus.com/display/api/\n                        \n                        ).\n                       \n\n                        You connect to your AppNexus Log-Level account in the Data Center. This topic discusses the fields and menus that are specific to the AppNexus Log-Level connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your AppNexus Log-Level account and create a DataSet, you must have the username and password you use to log into\n                        \n                         console.appnexus.com\n                        \n                        .\n                       \n\n                        Connecting to Your AppNexus Log-Level Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the AppNexus Log-Level Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your AppNexus Log-Level account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter the username you use to log into\n                            \n                             console.appnexus.com\n                            \n                            .\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter the password you use to log into\n                            \n                             console.appnexus.com\n                            \n                            .\n                           \n\n\n\n\n\n\n                         Once you have entered valid AppNexus Log-Level credentials, you can use the same account any time you go to create a new AppNexus Log-Level DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus for configuring your report.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the AppNexus Log-Level report you want to run. Currently only a single report type is available.\n                           \n\n\n\n\n\n                                Feeds Report\n                               \n\n\n\n                                Returns a feed of log-level event data that include dimensions not available in the AppNexus Console or via the API.\n                               \n\n\n\n\n\n\n\n\n\n                            Siphon Name\n                           \n\n\n\n                            Select the siphon you want to retrieve data for.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select the duration type for the report. If you select\n                            \n                             Single Date and Hour\n                            \n                            , you are asked to select the specific date and hour for the log data you want to see. If you select\n                            \n                             Since Last Successful Run\n                            \n                            , the report pulls in all new data since the report was last successfully run.\n                           \n\n\n\n\n\n                            Date\n                           \n\n\n\n                            Select the date you want to pull log data for. This date should be within the last 10 days.\n                           \n\n\n\n\n\n                            Hour\n                           \n\n\n\n                            Select the hour of the selected date you want to pull log data for.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042928554", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003594", "Archived Date": "", "Language": "English", "Primary Version": "AppNexus Log-Level Connector", "Article Total View Count": "2,361", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              AppNexus Log-Level Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}