{"file_path": "../../raw_kb_v2\\article\\360043438253\\index.html", "content": {"Title": "Asset Manager", "Article Body": "The Asset Manager app allows you to manage and configure your ad campaign images in one convenient location. You can add, delete, and include descriptions and tags for each managed image. Like the Asset Viewer app, you can take a step forward and configure the app’s viewing settings to fit your business use case. Images can also be filtered according to description type or associated tags & they can also be searched for using the search bar option in the tool bar menu. All images placed in the Asset Manager app are placed into App DB and have their own associated dataset in Domo for you to access for other use cases.\n                       \n\n\n\n\n                        Parts of the Asset Manager App\n                       \n\n\n\n                        Default View\n                       \n\n                        The default view in the Image Manager app is configurable using the Configuration gear menu. The three view options are Single Item View, Grid View, and List View.\n                       \n\n\n\n                        Single Item View\n                       \n\n                        The Single Item View displays one image at a time using a slideshow effect.\n                       \n\n\n\n\n                        Grid View\n                       \n\n                        The Grid View displays images in a grid view, line by line\n                       \n\n\n\n\n                        List View\n                       \n\n                        The List View displays images in rows formation vertically through the app\n                       \n\n\n\n\n                        Search\n                       \n\n                        The Search option allows you to search for images by their description\n                       \n\n\n\n\n\n\n                        Filter\n                       \n\n                        The Filter option allows you to filter the images by description and tags or sort by upload date.\n                       \n\n\n\n\n\n\n                        Add Image\n                       \n\n                        The Add Image button is where you're able to add new images to your Image Manager app. Upload a new file either by dragging and dropping it into the field or searching for and selecting one from your machine. Include a description and tags to make your images easy to search for and identify.\n                       \n\n\n\n\n                        Configuration\n                       \n\n                        The Configuration button is where you'll go to configure your viewing setting in the app. Here you can configure your default view to one of the three viewing options: Single Item, Grid, or List. You're also able to configure the content types that will be added to each image such as the name as description or tag OR type as text, decimal, or number.\n                       \n\n\n\n\n\n\n                        How Do I Get This?\n                       \n\n\n                         To begin using the Asset Manager App, have an Admin contact your Customer Success Manager.\n                        \n\n\n\n\n                        FAQ\n                       \n\n                        Why is this important?\n                       \n\n\n                         Document repository in Domo with an associated dataset with document metadata makes your image managing process simpler.\n                        \n\n\n                        How do I use it/demo it?\n                       \n\n                        Create a meta data schema for each document and start uploading them from the repo in Domo.", "Preview Article": "Click here to preview", "URL Name": "360043438253", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005000", "Archived Date": "", "Language": "English", "Primary Version": "Asset Manager", "Article Total View Count": "2,477", "": "", "Article Created Date": "11/2/2022, 8:16 PM", "First Published Date": "11/2/2022, 8:37 PM"}, "title": "\n              Asset Manager\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}