{"file_path": "../../raw_kb_v2\\article\\360042923914\\index.html", "content": {"title": "\n\n\n Applying Page-Level Filters with Filter Views\n\n\n", "article_body": "\n\n\n**Note:**\n**Dashboard**\n is the term for the section of the Domo interface where you can organize and view your cards. It replaces the term\n **Page**\n .\n\nIntro\n-------\n\nYou can use Page Filters to apply data filters that affect all of the KPI, Sumo, and Domo App Cards powered by a specified DataSet on a dashboard. All such cards with applied filters are marked with a\n\nicon. In this way, you can quickly spot all cards on the dashboard for which you have applied filters. For example, you could set a filter for all cards powered by a specified DataSet to show values falling under a specified threshold. All cards powered by that DataSet would then be filtered to show only the specified information.\n\n\n If PDP (Personalized Data Permissions) is enabled for the selected DataSet, your filter options are limited to what is available to you based on your policy. For example, if you are a member of a policy that can view content only for western states, you can filter only on content that is available to you. Likewise, if you have access to all rows in a policy, you can choose whether to filter on all data or select specific policies. For more information about PDP, see\n\nCreating and Deleting PDP Policies\n\n.\n\n\n The Page Filters applied to a dashboard are\n\n somewhat personal customizations. When a Page Filter is saved, the values selected affect your view only and others do\n *not*\n see the Page Filter values you add.  You can save specific filter configurations as \"Filter Views\" and then choose your desired Filter View when you navigate to the dashboard. Only you see your saved Filter Views. The only exceptions to this are when Filter Views are saved as the \"default\" or are shared with everyone, in which case all visitors to the page see them.\n* \"sticky\" customizations that remain until you remove them.\n* inherited by a card using the filtered DataSet when viewing or drilling to the card in the Details view.\n* *not*\n applied to a card when viewing the card directly, either through a link or a search.\n\nYou can apply or edit Card Filters in the Details view of a card. For information about applying Filters to KPI Cards, see\n\nAdding Filters to Your Chart\n\n.\n\n\n When adding date Filters, you can choose to apply Filters to a range of dates or to individual time units (which may be days, weeks, months, etc., based on the date grain of the data).\n\n*Important:**\n When adding subsequent cards to a dashboard (that is, all cards after the first), you must use the\n **Existing Data**\n option and select your original DataSet. If you re-add the same DataSet using the\n **Excel**\n or\n **Google**\n options, filtering does not work.\n\n\n---\n\n\n**Note:**\n If you have a Participant default security role, you cannot share filter views or set default filter views for the page, but you can add and save filter views for personal use. Participants can also select a filter shared with them, make changes to the filter and save it as a new filter view. The original shared filter view will not be affected. If you have an Admin, Privileged, or Editor default security role, you can create, share, and edit existing shared views, or set a shared filter view as the default. You can also do this if you have a custom role with Edit Pages enabled. For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n\n*Video - Filtering Pages with Filter Views**\n\n\n Controlling How Page Filters Affect Your Dashboard\n----------------------------------------------------\n\nDashboard owners, users with an Admin default security role, and users with a custom role with the Manage pages grant enabled can control whether Page Filters are available on a dashboard, allow users to add new filters, and hide the filter icon on their cards.\n\n\n**To access Filter options,**\n\n\n 1. Navigate to the dashboard in Domo that you want to filter.\n\n\n 2. Select\n\n*Dashboard Options**\n .\n\n\n The dashboard options menu displays.\n\n\n 3. Select\n **Filter options**\n from the menu.\n\n4. To disable the adding of Filters to your Page, deselect the toggle for\n **Show filter bar**\n .\n\n*Note:**\n Hiding the filter bar will clear all filters. Any saved Filter Views are still saved but are not accessible when hidden.\n\n5. (Conditional) If Show filter bar is enabled, you can select:\n\n\n Allow adding of new filters\n\n\n Allow global date filters\n\n\n Allow segments\n\n\n These settings are enabled by default.\n\n6. To disable the filter icons on your cards, deselect the toggle for Show filter icons.\n\nApplying Page Filters\n------------------------\n\nUse the following instructions to apply Page Filters to cards on a dashboard.\n\n\n 1. Navigate to the dashboard in Domo that you want to filter.\n\n\n 2. Select\n\n*Show Page filters.**\n (Some system dashboards, such as the\n **Shared**\n dashboard, do not include this option.)\n\n\n A ribbon displays with the\n **Filter Views**\n menu, a\n\nbutton, a date picker, and the\n **Save Filters**\n button. If PDP policies are enabled on DataSets used in any Cards in the Page,\n *and*\n you have access to all the rows, a button reading\n **All Rows**\n\nappears.\n\n\n 3. (Conditional) If you want to filter on all rows in PDP-enabled DataSets used on the dashboard, leave the PDP options set to\n **All Rows**\n . If you want to filter on a specific policy, do the following:\n\n Click the dropdown arrow next to\n **All Rows**\n .\n* Click\n **Select Policies**\n .\n* Check the boxes for all policies you want to Filter on.\n* Click\n **Apply**\n .\n\nFor more information about PDP, see\n\nCreating and Deleting PDP Policies\n\n.\n\n4. Select\n\n*Add Filter**\n .\n\n\n A list of all column names used in DataSets in cards on this dashboard appears. If a column name is used in more than one DataSet, an arrow appears to the right of the name so you can filter down to the desired DataSet.\n\n\n 5. Select the name of the column you want to filter.\n\n\n Alternatively, if the column name is used in more than one DataSet and you want to filter to show just the rows in a specific DataSet, you can click the arrow next to the column name to bring up a dialog with the names of all the applicable DataSets. Here you can check the boxes for all the DataSets you want to show rows for (or simply select all DataSets by checking the\n **Select all**\n box).\n\n\n If you select a column that appears in more than one DataSet without filtering down to a specific DataSet, the columns from the DataSet powering the most cards on the dashboard will be used for the Filter.\n\n\n After you select a column or DataSets, a\n **Filter**\n button appears in the ribbon and a modal appears in which you can select your Filters. The interface components of the modal differ depending on whether the column or row you selected contains series, amount, or date data.\n\n\n 6. Do one of the following:\n\n (Conditional) If the selected column contains string data,\n\na. Select the checkboxes for each series you want to show in the cards on this dashboard.\n\n\n You can choose all of the checkboxes by selecting\n **All**\n\nor deselect all of the checkboxes by selecting\n\n*None**\n\n.\n\nYou can filter the series that appear in the list by entering a keyword or a string of characters found in a keyword in the\n **Filter by**\n\nfield.\n\n\n**NOTE**\n\nFinally, if you want to load values from a specific DataSet, you can select\n\n\n XXXNAME then choose the desired DataSet. This loads the unique values on that DataSet but applies to all DataSets with that same column name.\n\nb. Specify whether the items you have checked appear or do not appear in your chart by selecting\n **In**\n\nor\n\n*Not In**\n\nfrom the menu in the top right.\n\nc. Select\n **Apply**\n\n.\n* (Conditional) If the selected column contains amount data, do one of the following.\n\n- If you want to filter amounts based on a range, follow these steps:\n\n\n a. Leave the menu in the upper right corner set to\n **Range**\n\n.XXXX\n\n\n IMAGEXXX\n\nb. Select a condition statement from the menu.\n\n\n One or more fields may display, depending on the condition statement.\n\n\n c. (Conditional) If one or more fields display when you select a condition statement, enter the desired amounts in the fields.\n\n\n For example, if you wanted your Cards to show information for amounts between 200,000 and 300,000, you would select\n **is between**\n\nfrom the menu, enter \"200,000\" in the first field, and enter \"300,000\" in the second field.\n\n- If you want to filter amounts based on specific values from your DataSet, follow these steps:\n\n\n a. Select\n **Selection**\n\nin the menu in the XXX\n\nb. Check the boxes for all of the values you want to filter on.\n\n\n You can select all of the checkboxes by clicking\n **All**\n\nor deselect all of the checkboxes by clicking\n\n*None.**\n\nOr you can filter the values that appear in the list by entering a string of numbers in the\n\n*Filter by**\n\nfield.\n\nIf you want to load values from a specific DataSet, you can click\n\n\n COPY FROM ABOVE then choose the desired DataSet. This will load the unique values on that DataSet but apply to all DataSets with that same column name.\n\nc. Finally, you can specify whether the items you have checked appear or do not appear in your chart by selecting\n **In**\n\nor\n\n*Not In**\n\nfrom the menu in the top right.\n\nd. Select\n **Apply**\n\n.\n\n(Conditional) If the selected column contains date data,\n\n\n1. 1. 1. Do one of the following:\n\n\t\t* If you want to filter dates based on a range...\n\n\t\t\t1. Leave the dropdown menu in the upper right corner set to\n\t\t\t\t **Range**\n\t\t\t\t .\n\t\t\t\t2. Select a condition statement from the menu.\n\n\n\t\t\t\t One or more fields may appear, depending on the condition statement.\n\t\t\t\t3. Enter the desired dates in the fields as necessary.\n\n\n\t\t\t\t For example, if you wanted your Cards to show information for dates between 1-31-2014 and 4-30-2015, you would select\n\t\t\t\t **is between**\n\t\t\t\t from the menu, select January 1, 2014 in the first field, and select April 30, 2015 in the second field.\n\t\t\t* If you want to filter dates based on specific dates from your DataSet...\n\n\t\t\t1. Select\n\t\t\t\t **Selection**\n\t\t\t\t in the dropdown menu in the upper right corner.\n\t\t\t\t2. Check the boxes for all of the dates you want to filter on.\n\n\n\t\t\t\t You can select all of the checkboxes by clicking\n\t\t\t\t **All**\n\t\t\t\t or deselect all of the checkboxes by clicking\n\t\t\t\t **None.**\n\t\t\t\t Or you can filter the dates that appear in the list by entering a filter string in the\n\t\t\t\t **Filter by**\n\t\t\t\t field. (For example, if you wanted to filter down to dates from 2010, you would enter \"2010\" into this field.)\n\n\n\t\t\t\t If you want to load values from a specific DataSet, you can click\n\n\t\t\t then choose the desired DataSet. This will load the unique values on that DataSet but apply to all DataSets with that same column name.\n\n\n\t\t\t\t Finally, you can specify whether the dates you have checked appear or do not appear in your chart by selecting\n\t\t\t\t **In**\n\t\t\t\t or\n\t\t\t\t **Not In**\n\t\t\t\t from the menu in the top right.\n\t\t2. Click\n\t\t **Apply**\n\t\t .\n\nThe affected Cards in the Page update to reflect the Filters you have selected. In addition, a\n\nicon appears on each affected Card.\n\n*Note:**\n You can also use Aggregated Filters to filter a Dashboard. For more information, see\n\nAggregated Filters\n\n.\n\n*To edit a Filter,**\n\n. Click the button for the Filter in the gray bar at the top of the Page.\n\n\n The dialog for the Filter appears.\n2. Edit the Filter settings as desired.\n3. Click\n **Apply**\n .\n\nYour changes are applied to the Filter.\n\n\n**To remove a Filter,**\n\n. Click the button for the Filter in the gray bar at the top of the Page.\n2. The dialog for the Filter appears.\n3. Click\n\n.\n4. Click\n **Continue**\n to confirm the removal.\n\nThis Filter is removed, and all of the Cards that used the Filter are updated accordingly.\n\n\n**To hide Page Filters,**\n\n. Click\n\n, which is located in the upper right area of the Page.\n\nYour Page Filters are hidden and all of the affected Cards are updated. Hiding Filters in this way does\n *not*\n deactivate them completely. If you want to deactivate Filters, you must remove them using the steps above.\n\n\n You can reapply your hidden Filters by clicking\n\n.\n\n*Note:**\n Turning off Page Filters does\n *not*\n remove the Filter for all users. The only way to make a Filter on a Card apply to all users is to apply a Filter while editing a Card. Consequently, you cannot persist a Page Filter to multiple Cards for all users.\n\nUsing Filter Views\n--------------------\n\nFilter views allow you to customize a dashboard to meet the needs of all audiences. Using Filter views, you can do all of the following:\n\n Create and save your own Filters without affecting anyone else's view.\n* Curate and share important views to create alignment on a specific perspective.\n* Provide any number of personalized data stories for any person in any role.\n* Designate which saved Filter view is the \"default\" for first-time visitors to a dashboard.\n\nAny user with a default security role of Participant or higher can add Filter views as well as rename, copy, and delete their own Filter views. To share Filter views with all dashboard visitors or set them as the default view for a LOCKED Page, you must either be the dashboard owner or have a role with the Manage Cards and Pages or Edit Pages grant enabled. For UNLOCKED Pages, any user with a default security role of Editor or higher can share Filter views and set default views. For more information about custom roles, see\n\nLocking or Unlocking Page Content\n\n.\n\n###\n Saving a Filter View\n\nOnce you save a Filter view, it is added to your\n **Filter Views**\n menu on the left side of the gray filter bar. XXXX From here, you can choose it anytime you visit this page to quickly apply the Filter.\n\nYou are the only one who sees Filters you have created,\n *unless*\n a Filter has been designated as the \"Default\" Filter for the dashboard or is shared with everyone, in which case all users are able to select it. However, just because a default Filter has been set, this does not mean users are required to use it. They are still able to create and set their own Filter views as desired.\n\n\n When a default Filter view is configured, those Filters will load anytime somebody visits the dashboard for the first time. For each subsequent visit, the Filters that user had configured the last time they were on the dashboard will load again, starting them where they left off.\n\n\n Do the following to create and save a Filter view:\n\n\n 1. Create the Filter as explained in\n\nApplying Page Filters\n\n, above.\n\n\n 2. Select\n **Save Filters**\n in the ribbon.\n\n\n RESULT??XXXX\n\n3. Select\n **Create New Filter View**\n .\n\n\n 4. Enter a descriptive name for the new Filter.\n\n\n 5. (Optional) If you want this to be the default Filter for the dashboard, (in which case, this Filter configuration will be the first thing users see when they open the dashboard,) check the\n **Set as default**\n for everyone box. Be aware that if a default Filter already exists for this dashboard, the new Filter will replace it as the default.\n\n\n 6. Select\n **Save**\n .\n\n\n The new view is added to your\n **Filters view**\n menu.\n\n###\n Updating a Filter View\n\nIf you make a change to a Filter, that change is not applied automatically to any Filter views that include it. If you want the Filter views to update, you must do this manually.\n\n\n Do the following to update a filter view.\n\n\n 1. Select\n **Save Filters**\n in the ribbon.\n\n2. Select\n **Update Existing Filter View**\n .\n\n\n 3. Select the Filter view to update.\n\n\n 4. Select\n **Update**\n .\n\n\n The selected Filter view is now updated.\n\n##\n Renaming a Filter View\n\nYou can rename any Filter view you have created, as long as you meet the following criteria:\n\n You are the dashboard owner\n* You have a role with the Manage Cards and Pages or Edit Pages grant enabled\n* The dashboard is unlocked and you have a default security role of Editor or higher\n\nFor more information about custom roles, see\n\nManaging Custom Roles\n\n.\n\n\n Follow these steps to rename a Filter view:\n\n\n 1. Select the\n **Filter views**\n menu in the ribbon.\n\nMouse over the Filter View you want to rename and click the\n\nicon that appears.\n\n\n Select\n **Rename**\n .\n\n\n Enter the desired new name for the Filter view.\n\n\n Click\n **Save**\n .\n\n##\n Copying a Filter view\n\nYou can copy any Filter view in a Page, even those you haven't created that are set to default. This is a good way to make small changes to an existing configuration without having to rebuild it from scratch.\n\n\n**To copy a Filter view,**\n\n. Click into the\n **Filter views**\n menu on the left side of the gray filter bar.\n2. Mouse over the Filter View you want to copy and click the\n\nicon that appears.\n3. Select\n **Copy**\n .\n4. (Optional) Enter a new descriptive name for the Filter View.\n5. Click\n **Save**\n .\n\n\n###\n Deleting a Filter view\n\nYou can delete any Filter view you have created. You can only delete a default Filter view if...\n\n you are the Page owner,\n* you have a role with the \"Manage Cards and Pages\" or \"Edit Pages\" grant enabled, or\n* the page is unlocked and you have a default security role of \"Editor\" or higher.\n\nFor more information about custom roles, see\n\nManaging Custom Roles\n\n.\n\n\n**To delete a Filter view,**\n\n. Click into the\n **Filter views**\n menu on the left side of the gray filter bar.\n2. Mouse over the Filter view you want to delete and click the\n\nicon that appears.\n3. Select\n **Delete**\n .\n4. Click\n **Delete**\n to confirm.\n\n\n###\n Sharing a Filter view\n\nIf you want a Filter view to be available to all visitors to a Page without necessarily being the default view, you can do so by toggling on the\n **Share with everyone**\n option for that Filter View. You can only do this if...\n\n you are the Page owner,\n* you have a role with the \"Manage Cards and Pages\" or \"Edit Pages\" grant enabled, or\n* the page is unlocked and you have a default security role of \"Editor\" or higher.\n\nFor more information about custom roles, see\n\nManaging Custom Roles\n\n.\n\n\n**To delete a Filter view,**\n\n. Click into the\n **Filter Views**\n menu on the left side of the gray filter bar.\n2. Mouse over the Filter View you want to share and click the\n\nicon that appears.\n3. Turn on the\n **Share with everyone**\n option.\n\nApplying dynamic date range Filters\n-------------------------------------\n\nYou can use dynamic date range Filters to adjust the date range window for all the Cards on a Page. These Filters can be saved and used as the default for all users in a Page. They can also be saved to different Filter Views (described in the previous section). Dynamic date range Filters can be a huge time-saver, since users do not need to manually apply filters to see data for a given date or time range. Also, with dynamic date range Filters, the date range data for your Cards automatically \"rolls over\" when the current period ends.\n\n*Note:**\n Dynamic date range filters only apply to Visualization Cards and Sumo Cards. They do NOT work on Doc Cards, Poll Cards, Notebook Cards, and Custom Apps.\n\n\n**Important:**\n Dynamic date rang filters will not work on a Card if, inside of Analyzer, the Graph By of the Card has been set to None.\n\nYou choose dynamic date range Filters in the\n **Choose Date**\n menu in the gray filter bar at the top of a Page.\n\nThe Filters you choose here are applied to all Cards in the Page that have had a\n\ndate column applied in Analyzer\n\n. Filters are applied to each Card's unique date column and take into account date filters that have already been set on the Card. So for example, if a Page contained a Card that was powered by the \"Sales Dates\" column and the dates were filtered in Analyzer to show March through June, if dynamic date range Filters were set on the Page, the Filters would be applied to the \"Sales Dates\" column and would only work within the March-June time period. If the dynamic Filters were set outside that time period, the Card would display \"No data in filtered range.\"\n\n\n You are able to choose Cards that will not be affected by the dynamic date, by deselecting the\n **Allow global date**\n feature. More information can be found in the\n\nControlling how Page Filters affect your Page\n\nsection above. If you have chosen the\n **Hide Date on Card Details**\n option for a Card, the dynamic date will also not be applied to the Card.\n\n\n Most of the options for dynamic date range Filters are the same as those for filtering dates in the Analyzer. In essence, these options are as follows:\n\n ****Date Range****\n . This lets you choose the range of data shown for all Cards in the Page being powered by date columns. By default this is set to\n ****Default****\n , meaning that all Cards use their own date ranges. A wide variety of other options is available, including the current date period, period-to-date options such as\n **Week to Date**\n , and so on.\n* ****Graph By****\n . This lets you choose the date grain for all Cards in the Page being powered by date columns. The date grain determines whether the data is shown by week, by month, etc. This menu is described in more detail in\n\nChanging the unit of time used to represent data\n\n. By default no date grain is selected, meaning the Cards use the same date grain used in their powering DataSets. (For example, if data for a Card was broken down by week in the DataSet, it would be automatically broken down by week in the Card).\n\n\n**Note:**\n The Date Graph By does not impact Single Value charts. This is to ensure best data practices as Graph By will impact which row is returned in the chart query.\n\nApplying Card-to-Card Filters\n-------------------------------\n\nWhen you apply Card-to-Card Filters in a Page, you can mouse over a specific chart element in a Card, and that same element will be highlighted in all other Cards in the Page that share it. This allows you to make quick correlations between your Cards that might otherwise take hours.\n\n\n For example, let's say user Tanya is a manager in her company's retail department. She has access to a Domo Page called \"Retail\" that includes a number of Cards related to profits and spending for her company, as shown here:\n\nAll of these Cards show disparate but related data for roughly the same time period—early 2013 to early 2015—with a monthly date grain. As it is now, Tanya can go into each Card one at a time and see data for a given month. This is useful, but what Tanya really wants to do is compare data for all of the different Cards across the same month. Specifically, she wants to correlate the data for \"RT: Gross Profit and Margin,\" \"RT: Gross Margin by Product Line,\" and \"RT: Cost per Conversion\" for January 2014. Before Card-to-Card Filters, she probably would have had to look at each Card one at a time, write down the values for January 2014, and finally compare them. But now, all she has to do is mouse over the bar for January 2014 in any of the Cards, and the same bar highlights in all of the others:\n\n*Tip:**\n\nCard-to-Card\n\nFilters work best when the Card size is set to \"Large\" or \"Full.\" For more information about Card sizing, see\n\nChanging the Size of Cards in a Page\n\n.\n\n\n With Card-to-Card Filters, you can also click on a chart element to apply a Filter for that element to all Cards in the Page. For example, if you clicked on the bar for \"2014-Jan,\" all Cards would be filtered to that month. This also works for rows in tables. You can turn off this Filter by clicking the element again.\n\n\n Card-to-Card Filters are automatically enabled in\n\nStorytelling Dashboards\n\n. In standard Pages, they can be toggled on or off by Page owners, users with an \"Admin\" default security role, or users with a custom role with the \"Manage pages\" grant enabled. They do this by toggling the\n **Interaction filters**\n option, which is located in the wrench menu on the right side of the filter bar.\n\nWhen this option is enabled on a Page, all users (\"Participants\" included) can mouse over Cards to see Card-to-Card Filters in action. When the option is disabled, \"Participant\"-level users cannot apply Card-to-Card Filters.\n\n\n Using Filter Cards to filter Card content\n-------------------------------------------\n\nYou can use\n\nDate Selector\n\nCards to apply Filters to all of the Cards on a Page. You build these Cards in Analyzer just like any other chart types.\n\n\n Filter Cards only work when Card-to-Card Filters are turned on (see the preceding section for more information). If Card-to-Card Filters are not turned on, clicking a Filter opens the Details view for the Card instead of applying the Filter.\n\n##\n Slicer, Checkbox, and Radio Button Cards\n\nSlicer, Checkbox, and Radio Button Cards contains Filters from a DataSet column. Once you have added one of these Cards to a Page, you can click any of the Filters in the Card to apply that Filter to all of the Cards in the Page. With Slicer and Checkbox Cards, you can apply as many Filters as you want. With Radio Button Cards, you can apply only one Filter at a time.\n\n\n You can deactivate a Filter by clicking on it a second time.\n\n\n The following animated GIF shows an example of this. Here, marketing manager Scott wants to view Eloqua campaign data for email and social media channels. Instead of having to configure Page Filters, all Scott has to do is click all of these Filters in the Slicer Cards. He clicks \"Email\" and \"Social Media\" in the \"Eloqua: RT Marketing\" slicer Card. All of the other Cards in the Page are then Filtered accordingly.\n\n  |  |\n| --- | --- |\n|  |  |\n\n(If you would like to download a full-size version of this GIF, just click on it.)\n\n\n For information about building Slicer, Checkbox, and Radio Button Cards, see\n\nSlicer, Checkbox, and Radio Button Cards\n\n.\n\n##\n Range Selector Cards\n\nRange Selector Cards let users filter all Cards on a Page to reflect a selected range of values or dates. A slider appears with a minimum and maximum value. When a user changes these minimum and maximum values, all Cards update to show data within the new range. In the following animated GIF, the user sets the minimum value (which was originally set to 2,000 by the Card creator) to 3,011, and the maximum value (originally 4,998) to 3786. All of the other Cards in the Page update to reflect the new range.\n\n  |  |\n| --- | --- |\n|  |  |\n\n(If you would like to download a full-size version of this GIF, just click on it.)\n\n\n For information about building Range Selector Cards, see\n\nRange Selector Card\n\n.\n\n##\n Date Selector Cards\n\nBy default, a Date Selector Card displays a series of dates in calendar format, either in a yearly or monthly view (depending on settings you have applied in Chart Properties). You can click and drag over a range of dates to filter all other Cards in the Page to show data for those dates. In the following animated GIF, the user highlights all dates from April 1st to August 31st in the \"Street Metrics Date Selector\" Card. The four other Cards in the dashboard reflect this selected range.\n\n  |  |\n| --- | --- |\n|  |  |\n\n(If you would like to download a full-size version of this GIF, just click on it.)\n\n\n Alternately, you can click the\n **Presets**\n link on the Card to display a number of premade date Filters, such as \"This week,\" \"Last year,\" etc.\n\n\n You can show different premade Filters by clicking the blue links over the buttons (\"Weeks,\" \"Months,\" etc.).\n\n*Note:**\n Using the Presets filters will act as a Global Date filter on the Page just like using the dynamic date range filter and will filter all Cards on the Page, not just the Cards that contain the same date column as your Filter Card.\n\nYou can clear date Filters from a Date Selector Card by clicking the\n **Clear**\n link or by mousing over the Card and clicking\n\n.\n\n\n For more information about building Date Selector Cards, see\n\nDate Selector Card\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042923914\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004056\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nApplying Page-Level Filters with Filter Views\n\n", "article_total_view_count": "\n\n\n 9,626\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "applying_pagelevel_filters_with_filter_views", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "consuming_data_in_domo", "url": "/s/topic/0TO5w000000ZamnGAC"}, {"text": "interacting_with_cards_and_dashboards", "url": "/s/topic/0TO5w000000ZansGAC"}]}