{"file_path": "../../raw_kb_v2\\article\\5063710836247\\index.html", "content": {"title": "\n\n\n QuickBooks Multi Account Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nQuickBooks is an accounting software used to help small businesses accept payments, pay bills, and complete payroll. With Domo you can combine multiple QuickBooks accounts through a one-click authentication process, providing you with consolidated reporting across multiple metrics. Using Domo and QuickBooks together gives you customizable dashboards that you can create by integrating your QuickBooks data with essential marketing, sales, or operational data.\n\n\n Once your data is in Domo, you can give stakeholders financial transparency with powerful and flexible charts, visualizing things like balance sheets, profit and loss, vendor balances, and more. And you can access all your data in real time, from any device. Easily see all your QuickBooks accounts in one dashboard, with real-time updates, so you can make better decisions for your business.\n\nTo learn more about the QuickBooks API, go to\n\n\n https://developer.intuit.com/docs/0050\\_quickbooks\\_api\n\n\n .\n\nThis topic discusses the fields and menus that are specific to the\n\nQuickBooks\n\nMulti Account connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\n\n No credentials required. You can add multiple QuickBooks accounts that you want to fetch the reports for in the Details section.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Account Selection\n  |\n Select how would you like to choose your accounts.\n  |\n|\n Accounts Discovery\n  |\n Select the Accounts.\n\n|\n|\n Report\n  |\n Select the report you want to run. The following reports are available:\n\n\n|\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Accounts\n  |\n Retrieves a list of accounts.\n  |\n|\n Account List\n  |\n Shows the name, type, and balance for each account.\n  |\n|\n Accounts Payable Aging Detail\n  |\n Shows detailed information about unpaid bills in accounts payable.\n  |\n|\n Accounts Payable Aging Summary\n  |\n Summarizes the status of unpaid bills in accounts payable.\n  |\n|\n Accounts Receivable Aging Detail\n  |\n Shows detailed information about outstanding amounts in accounts receivable.\n  |\n|\n Accounts Receivable Aging Summary\n  |\n Shows accounts receivable, along with the amount of time the amounts have been outstanding.\n  |\n|\n Balance Sheet\n  |\n Summarizes assets, liabilities, and shareholders' equities\n  |\n|\n Budget\n  |\n Retrieves a list of budgets.\n  |\n|\n Expenses by Vendor\n  |\n Shows expenses by vendor.\n  |\n|\n Profit and Loss Summary\n  |\n Summarizes income and expenses.\n  |\n|\n Profit and Loss Detail\n  |\n Shows detailed information about income and expenses.\n  |\n\n|\n|\n Date Filter By\n  |\n Select the date filter method.\n  |\n|\n Created Date Duration\n  |\n Select the created date duration for the report.\n  |\n|\n Account Status\n  |\n Select account status.\n  |\n|\n Transaction Date\n  |\n Select the start date for the report.\n  |\n|\n Report Date\n  |\n Select whether the data in the report is for a specific date or for a relative number of days.\n\n\n Relative meaning the relative number of days back that you would like to get data from.\n\n\n To get the data starting from a specific date, select the date using the date selector.\n  |\n|\n Date Offset\n  |\n Enter the number of days back that will be used to offset your relative date. This adjusts the current date with the given number of days into the past. Example: 0 for today, 1 for yesterday.\n  |\n|\n Select Specific Date\n  |\n Select the report date using the date picker, this option is only available when Report Date is set to 'Specific'.\n  |\n|\n Aging Method\n  |\n Select the aging method.\n  |\n|\n Days Per Aging Period\n  |\n Enter the number of days per aging period.\n  |\n|\n Number of Periods\n  |\n Enter the number of aging periods to be shown in the report.\n  |\n|\n Due Date Duration\n  |\n Select the due date duration for the report.\n  |\n|\n Transaction Date Duration\n  |\n Select the transaction date range for the report.\n  |\n|\n Accounting Method\n  |\n Select the desired accounting method.\n  |\n|\n Summarize Column By\n  |\n Select how you want your report data to be broken down.\n  |\n|\n Select Columns (Checkbox)\n  |\n\nCheck this to be given an option, otherwise a default selection will be given. Schema will always be maintained, even if selections are changed.\n\n\n**Note**\n - This is for advanced users as QuickBooks may return errors based on column selection.\n\n|\n|\n Select Columns\n  |\n Select the columns desired. A single selection may result in multiple columns.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n###\n What version of the Quickbooks API does this connector use?\n\nThis connector uses version 3 of the Quickbooks API (\n\nhttps://quickbooks.api.intuit.com/v3/company/\n\n).\n\n###\n What kind of credentials do I need to power up this connector?\n\nNo credentials required. You can add multiple QuickBooks accounts that you want to fetch the reports for in the Details section.\n\n###\n How frequently will my data update?\n\nMost information about the summary is updated every 24 hours. It is recommended to configure the datasets to run every 24 hours.\n\n###\n Can this connector pull custom fields?\n\nNo. Reports and columns are predefined by QuickBooks.\n\n###\n Are there any API limits that I need to know?\n\nNo\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 5063710836247\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003187\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nQuickBooks Multi Account Connector\n\n", "article_total_view_count": "\n\n\n 4,691\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "quickbooks_multi_account_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}