{"file_path": "../../raw_kb_v2\\article\\360060508773\\index.html", "content": {"title": "\n\n\n Zendesk Upsert Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nZendesk provides a cloud-based customer service program that includes ticketing, self-service options, and customer support features. It enhances productivity, processes, and pipelines for your sales teams. Use Domo’s Zendesk Upsert Connector to compile reports about tickets, users, and more. To learn more about the Zendesk API, visit their page (\n\nhttps://developer.zendesk.com/rest\\_api/docs/core/introduction\n\n).\n\n\n The Zendesk Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n ****Cloud App****\n in the toolbar at the top of the window.\n\n\n You connect to your Zendesk account in the Data Center. This topic discusses the fields and menus that are specific to the Zendesk Upsert Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Zendesk account and create a DataSet, you must have the following:\n\n The username for your Zendesk account\n* The API token OR password for your Zendesk account\n* The Zendesk URL for your company\n\nTo use a password, enable API authentication using an agent's email address and password. This may already be enabled for sign-in to the Zendesk Support mobile apps.\n\n\n Zendesk recommends that you use API tokens to keep your agents' passwords safe. API tokens are managed in the Zendesk Support Admin interface at\n ****Admin > Channels > API****\n . The page lets you view, add, or delete tokens. More than one token can be active at the same time. Deleting a token deactivates it permanently.\n\n\n Connecting to Your Zendesk Account\n------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the\n\nZendesk Upsert\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your\n\nZendesk\n\naccount. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter the username you use to log into your Zendesk account.\n  |\n|\n Authenticated By\n  |\n Specify whether you want to use your Zendesk API token or password to authenticate.\n  |\n|\n API Token or Password\n  |\n Enter your Zendesk API token or password. This\n **must**\n match what you have selected in the\n ****Authenticate By****\n menu. For example, if you selected\n ****API Token****\n for\n ****Authenticate By****\n , you must enter your API token in this field, not your password.\n  |\n|\n Zendesk URL\n  |\n Enter the URL for your company's Zendesk instance.\n  |\n\n\n Once you have entered valid\n\nZendesk\n\ncredentials, you can use the same account any time you go to create a new\n\nZendesk Upsert\n\nDataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Zendesk report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Organizations\n  |\n Retrieves information about the organizations in your Zendesk instance.\n  |\n|\n Specify Query\n  |\n Allows you to build a customized report by entering your own Zendesk search query. You can also select from two premade queries—\n **Open Tickets**\n and\n **Closed Tickets**\n . You can use these to return the number of open and closed tickets for your Zendesk instance.\n\nFor more information about entering Zendesk queries, see\n\nZendesk Support search reference\n\n.\n  |\n|\n Tickets\n  |\n Retrieves information about the created and updated tickets.\n  |\n|\n Ticket Audits\n  |\n Retrieve the list of ticket audits.\n  |\n|\n Ticket Fields\n  |\n Retrieve tickets fields in your Zendesk instance.\n  |\n|\n Ticket Forms - Agent Conditions\n  |\n Retrieve ticket forms in your Zendesk instance and displays the condition sets for agent workplace.\n  |\n|\n Ticket Forms - End User Conditions\n  |\n Retrieve ticket forms in your Zendesk instance and displays the condition sets for end user products.\n  |\n|\n Ticket Comments\n  |\n Retrieves the comments on the tickets.\n  |\n|\n Ticket Metric Events\n  |\n Retrieves the ticket metric events.\n  |\n|\n Users\n  |\n Retrieves the information about the users in your Zendesk instance.\n  |\n\n|\n|\n Associated Data\n  |\n Select the associated data you want loaded along with the tickets.\n  |\n|\n Include Attachments\n  |\n Specify whether you would like to include the attachments in the results.\n  |\n|\n Select the date to start retrieving data on the first run. Subsequent runs will automatically retrieve newly created and updated tickets, users or organizations\n  |\n Select the date to start retrieving data on the first run. Subsequent runs will automatically retrieve newly created and updated items. If you modify the date after the first run, this date will be used for the next run and the existing data will be replaced.\n  |\n|\n Date Selection\n  |\n Select the Date to start retrieving data on the first run. Subsequent runs will automatically retrieve newly created and updated tickets, users, or organizations.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n ****Days Back****\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Legacy Schema Selection\n  |\n Select this check box to use legacy schema for backward compatibility with the Zendesk Connector.\n  |\n|\n Exclude Deleted Records\n  |\n Select this check box to exclude the deleted records from the data.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What endpoint is the base URL for this connector?\n\nThe base URL for the Zendesk Upsert connector is\n\nhttps://{subdomain}.zendesk.com/api/v2\n\n.\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Enpoint URL\n  |\n| --- | --- |\n|\n Organizations\n  |\n /incremental/organizations.json\n  |\n|\n Tickets\n  |\n /incremental/tickets.json\n  |\n|\n Ticket Audits\n  |\n /ticket\\_audits.json\n  |\n|\n Ticket Fields\n  |\n /ticket\\_fields.json\n  |\n|\n Ticket Forms - Agent Conditions\n  |\n /ticket\\_forms.json\n  |\n|\n Ticket Forms - End User Conditions\n  |\n /ticket\\_forms.json\n  |\n|\n Ticket Comments\n  |\n /tickets/{currentTicketId}/comments.json\n  |\n|\n Ticket Metric Events\n  |\n /incremental/ticket\\_metric\\_events.json\n  |\n|\n Users\n  |\n /incremental/users.json\n  |\n\n\n####\n What kind of credentials do I need to power up the this connector?\n\nYou need the Zendesk username, password or API token, and the Zendesk instance URL. The Zendesk user account used for this connector must be an Admin within Zendesk.\n\n###\n How frequently will my data update?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n###\n Can I use the same Zendesk account to create multiple datasets?\n\nYes\n\n###\n What's the difference between the Zendesk and Zendesk Upsert connectors?\n\nThe Zendesk Upsert connector supports a Merge mode along with the Append and Replace modes to update your dataset. The Merge mode replaces all updated rows, while any new rows are appended. Thus, it avoids duplicate entries.\n\n\n The Zendesk connector supports the Append and Replace modes to update your datasets.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360060508773\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003270\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nZendesk Upsert Connector\n\n", "article_total_view_count": "\n\n\n 2,438\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "zendesk_upsert_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}