{"file_path": "../../raw_kb_v2\\article\\360043430053\\index.html", "content": {"Title": "Beast Mode FAQs", "Article Body": "Intro\n                       \n\n                        Get answers to frequently asked questions about Beast Mode.\n                       \n\n\n\n                        How do I get started with Beast Mode?\n                       \n\n                        For detailed information about adding calculations using Beast Mode, see\n                        \n                         Beast Mode Functions Reference Guide\n                        \n                        .\n                       \n\n\n\n                        Why am I getting an \"Invalid Query\" error when I try to save my Beast Mode calculation?\n                       \n\n                        Here are some common reasons why you might have received an Invalid Query error as a result of improper practices in setting up a Beast Mode:\n                       \n\n\n\n                          Column names need to be surrounded by back tics:\n                          \n                           `column`\n                          \n                          . Users commonly use single quote marks instead of the back tic, and this creates the error.\n                         \n\n\n\n                          A string value needs to be surrounded by single quotes:\n                          \n                           ‘text’\n                          \n                          .\n                         \n\n\n\n                          A case statement always needs to have a\n                          \n                           CASE\n                          \n                          ,\n                          \n                           WHEN\n                          \n                          ,\n                          \n                           THEN\n                          \n                          , and an\n                          \n                           END.\n                          \n                          Here is an example of a basic case statement:\n                          \n\n\n                           CASE WHEN `column1` = ‘good’ THEN ‘Yes’ ELSE ‘No’\n                          \n\n                           END\n                          \n\n\n                          The\n                          \n                           ELSE\n                          \n                          portion is optional; if there is no\n                          \n                           ELSE\n                          \n                          then the value will be\n                          \n                           NULL\n                          \n                          if it doesn’t match the first portion.\n                         \n\n\n\n\n\n                          If you have additional questions about how to implement functions properly in Beast Mode, review this article:\n                         \n\n\n                         Beast Mode Functions Reference Guide\n                        \n\n\n\n\n                        Can I use \"AND\" operators in Beast Mode?\n                       \n\n                        Yes. For example, you could do the following within a CASE function:\n                       \n\n\n                         case when `Name` like 'Ca%' AND `id` < 10 then 0 else 1 end\n                        \n\n\n\n\n                        Can I create custom or multiple summary numbers using Beast Mode?\n                       \n\n                        Yes. For information and examples, see\n                        \n                         Sample Beast Mode Calculations -- Creating a custom summary number\n                        \n                        .\n                       \n\n\n\n                        Can I do \"value summing\" within Beast Mode?\n                       \n\n                        Yes, this is possible. For example:\n                       \n\n\n                         CASE WHEN `Status` in ('New Sales','Renewed') THEN SUM(`Revenue`)\n                        \n\n\n\n                         ELSE 0\n                        \n\n\n\n                         END\n                        \n\n\n                        Be aware, however, that you will probably not get the summed value you want, since the SUM takes place within the cell instead of the column. If this doesn't work for you, consider using a Summary Number instead of Beast Mode.\n                       \n\n\n\n                        Can I do numerical comparisons using Beast Mode? For example, could I create a CASE statement to tell if a string is between a range of numbers?\n                       \n\n                        No. So the following Beast Mode CASE statement would fail:\n                       \n\n\n                         case when\n                        \n\n\n\n                         postcode > 0 then 1\n                        \n\n\n\n                         else 0\n                        \n\n\n\n                         end\n                        \n\n\n\n\n                        How do I filter on multiple columns and conditions?\n                       \n\n                        Say you want to see how many client upsell opportunities closed (won or paused), but with the native Domo filter, you can't apply multiple conditions to a row-level filter. To filter on multiple non-inclusive columns and conditions, you can create a logical Beast Mode calculation.\n                       \n\n                        For this situation, the Best Mode would look like this:\n                       \n\n\n\n                          CASE\n                         \n\n\n\n\n\n                          WHEN `opportunity_type` = ‘upsell’ AND `opportunity_won` = ‘true’ THEN ‘Yes’\n                         \n\n\n\n\n\n                          WHEN `opportunity_type` = ‘upsell’ AND `opportunity_paused` = ‘true’ THEN ‘Yes’\n                         \n\n\n\n\n\n                          ELSE ‘No’\n                         \n\n\n\n\n\n                          END\n                         \n\n\n\n\n\n                        How do I filter out certain dates?\n                       \n\n                        Say you want to see how many closed opportunities were won by day in a bar chart, but you want to filter out outliers, such as opportunities that were won within 10 days. To do this, you will want to create a Beast Mode calculation to use in the\n                        \n                         Filter\n                        \n                        field that will calculate the time from opportunity open to closed and then categorize them as “Yes” or “No” based on whether or not they closed within 10 days.\n                       \n\n                        The Beast Mode you would create to this could be named “Opty Closed within 10 Days?” and look like this:\n                       \n\n\n\n                          CASE\n                         \n\n\n\n\n\n                          WHEN DATEDIFF(`Opportunity_Closed_Date`,`Opportunity_Open_Date`) <= 10 THEN ‘Yes’\n                         \n\n\n\n\n\n                          WHEN DATEDIFF(`Opportunity_Closed_Date`,`Opportunity_Open_Date`) > 10 THEN ‘No’\n                         \n\n\n\n\n\n                          ELSE ‘Outlier’\n                         \n\n\n\n\n\n                          END\n                         \n\n\n\n\n\n                        How do I find the difference between two date columns without including weekends?\n                       \n\n                        Use a\n                        \n                         DATEDIFF\n                        \n                        function then subtract 2 for every week.\n                       \n\n                        How do I filter data so the summary number matches the value displayed in the card?\n                       \n\n                        Say you have a map card of the United States that calculates the sales amount broken out by state, and the summary number shows the total sales amount. However, the total sales amount in the card legend for the United States is lower than the summary number amount. The reason the sales amount in the Summary Number is larger is because the summary number takes into account all sales amounts regardless of country, and the card legend only shows the sales amounts for the United States. For this scenario, you will need to create a Beast Mode calculation that filters out the non-United States sales amounts.\n                       \n\n                        The Beast Mode to do this would look like this:\n                       \n\n\n\n                          CASE\n                         \n\n\n\n\n\n                          WHEN `Country` = ‘United States’ THEN ‘Yes’\n                         \n\n\n\n\n\n                          ELSE ‘No’\n                         \n\n\n\n\n\n                          END\n                         \n\n\n\n                        For more information about summary numbers, see\n                        \n                         Configuring Your Chart Summary Number\n                        \n                        .\n                       \n\n\n\n                        Can I do \"percent of total\" functions in Beast Mode?\n                       \n\n                        No, but you can insert a data label into your chart that contains the percent of total value by doing the following:\n                       \n\n\n\n                          In Analyzer, open\n                          \n                           Chart Properties\n                          \n                          .\n                         \n\n\n\n                          In\n                          \n                           Data Label Settings\n                          \n                          , enter\n                          \n                           %_PERCENT_OF_TOTAL\n                          \n                          in the\n                          \n                           Text\n                          \n                          field.\n                         \n\n\n\n\n\n                        Why can't I put Beast Mode calculations in the Filter field?\n                       \n\n\n                         The filter in the Analyzer is based on row-level filtering on the DataSet level, so it doesn’t filter on aggregates. To fix this, you can use the Magic ETL or SQL DataFlow tools to group and aggregate the columns for card and filtering usage. For more information about these tools, see\n                         \n                          Prepare\n                         \n                         .\n                        \n\n\n\n\n\n                         Can I create a rolling average calculation using Beast Mode?\n                        \n\n\n                        You cannot create a rolling average calculation using Beast Mode, but you can create a card that displays a quarterly average. Or you can create a DataFlow that will calculate this.\n                       \n\n\n                         Why Beast Mode Can’t Do This:\n                        \n\n\n                        A Beast Mode function is calculated on either a single record or group of records, depending on how the data on the card is being grouped. Because of that, the calculation doesn't have a way of referencing other records. For example, if you’re looking for an average for April, you can't create a calculation that looks back at other records that come before April and have it sum these for you.\n                       \n\n\n\n                          Alternative 1: Show a quarterly average on a card.\n                         \n\n\n\n\n\n                          Follow these steps to show a quarterly average on a card.\n                         \n\n\n\n\n\n\n                         To show a quarterly average on a card,\n                        \n\n\n\n\n                          Set your date grain to \"by Quarter\" at the top of the card.\n                          \n                          For more information, see\n                          \n                           Adding Filters to Your Chart\n                          \n                          .\n                         \n\n\n\n                          Add your date and value columns to the x- and y-axis, respectively.\n                          \n                          For more information, see\n                          \n                           Applying DataSet Columns to Your Chart\n                          \n                          .\n                         \n\n\n\n                          Set your aggregation option for your value column to\n                          \n                           AVG\n                          \n                          .\n                         \n\n\n\n\n\n                          Alternative 2: Create a DataFlow calculation\n                         \n\n\n\n                        You can create this calculation in a DataFlow. The transform would look something like this:\n                       \n\n\n                         SELECT\n                        \n\n\n\n                         `DateField`\n                        \n\n\n\n                         ,`ValueField`\n                        \n\n\n\n                         ,(SELECT\n                        \n\n\n\n                         SUM(`ValueField`) / COUNT(*)\n                        \n\n\n\n                         FROM\n                        \n\n\n\n                         TABLE t2\n                        \n\n\n\n                         WHERE\n                        \n\n\n\n                         t2.`DateField` > LAST_DAY(DATE_SUB(t1.`DateField`, INTERVAL 3 MONTH))\n                        \n\n\n\n                         AND t2.`DateField` < LAST_DAY(t1.`DateField`) ) AS `Rolling_Average`\n                        \n\n\n\n                         FROM\n                        \n\n\n\n                         TABLE t1\n                        \n\n\n                        This transform assumes that the date field contains a date representing the month, e.g. \"2015-01-01\" for January.\n                       \n\n                        In the above calculation, you’re doing the following:\n                       \n\n\n\n                          Using a subquery to retrieve the sum of the last 3 months’ worth of values,\n                         \n\n\n\n                          Dividing them by the number of records it found in that range, and\n                         \n\n\n\n                          Calling the field the \"Rolling_Average\" field.\n                         \n\n\n\n                        You would also need to rename your field names for \"DateField\" and \"ValueField\" (and add any others you want in the resulting DataSet) and replace “TABLE” with the DataSet table you're using as your input.\n                       \n\n\n                         For more information about\n                        \n\n                         DataFlows\n                        \n\n                         , see\n                        \n\n                         Prepare\n                        \n\n                         .\n                        \n\n\n\n\n\n                         How do I create Conditional Summing using Beast Mode?\n                        \n\n\n\n                         When using a\n                         \n                          CASE\n                         \n                         statement to create a calculation, you may want to aggregate the results of this\n                         \n                          CASE\n                         \n                         statement. Unfortunately, many users make the mistake of using a SUM function inside of the CASE statement:\n                        \n\n\n\n                         CASE\n                        \n\n\n\n\n                          WHEN `Column_1` = 'Value_1’\n                         \n\n\n\n\n\n                          THEN SUM(`Column_1`)\n                         \n\n\n\n\n\n                          END\n                         \n\n\n\n\n                         Instead, you need to “wrap” the entire statement in a SUM function for it to execute properly:\n                        \n\n\n\n                         SUM(CASE\n                        \n\n\n\n\n                          WHEN `Column_1` = 'Value_1’\n                         \n\n\n\n\n\n                          THEN SUM(`Column_1`)\n                         \n\n\n\n\n\n\n                           END)\n                          \n\n\n\n\n\n\n\n                         How can I aggregate a Beast Mode calculation to make it available as my Summary Number?\n                        \n\n\n\n                         Users commonly attempt to use a Beast Mode calculation containing a\n                         \n                          CASE\n                         \n                         statement as a Summary Number. For a value to be used as a Summary Number, that value must have a\n                         \n                          numeric\n                         \n                         data type. So if a calculation contains\n                         \n                          only\n                         \n                         a\n                         \n                          CASE\n                         \n                         statement, it will be seen by Domo as a\n                         \n                          string\n                         \n                         data type rather than a numeric data type.\n                        \n\n\n\n                         The solution to adjusting a common CASE statement calculation into a field with a numeric data type is identical to our solution for conditional summing. Simply “wrap” the entire statement in an aggregation function, such as SUM or COUNT, like so:\n                        \n\n\n\n                         SUM(CASE\n                        \n\n\n\n\n                          WHEN `Column_1` = 'Value_1’\n                         \n\n\n\n\n\n                          THEN SUM(`Column_1`)\n                         \n\n\n\n\n\n                          END)\n                         \n\n\n\n                        For more information about summary numbers, see\n                        \n                         Configuring Your Chart Summary Number\n                        \n                        .\n                       \n\n\n\n                        How do I aggregate an existing column using Beast Mode?\n                       \n\n                        Sometimes users think that the only way to aggregate a column of data is by using a Beast Mode calculation. A better way is to use tools within Domo’s Analyzer to create aggregations of a value being used on the x-axis, y-axis, or series of the card in question. For more information, see\n                        \n                         Aggregating your data\n                        \n                        .\n                       \n\n\n\n                        How do I sort month names chronologically on the x-axis?\n                       \n\n\n                         Say you want to display full month names on the x-axis of a card instead of the Domo default view of “Year – Abbreviated Month” (for example, 2015 – Jan), but when you apply the month name field to the card, the months are out of order and won’t sort. The month names sort alphabetically instead of chronologically because the month name column is a \"string\" data type. You can fix this by assigning a numeric value to each month name and then using that as the sort.\n                        \n\n\n\n                         The Beast Mode to do this would look like this:\n                        \n\n\n\n\n                          CASE\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘January’ THEN 1\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘February’ THEN 2\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘March’ THEN 3\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘April’ THEN 4\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘May’ THEN 5\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘June’ THEN 6\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘July’ THEN 7\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘August’ THEN 8\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘September’ THEN 9\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘October’ THEN 10\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘November’ THEN 11\n                         \n\n\n\n\n\n                          WHEN `MonthName` = ‘December’ THEN 12\n                         \n\n\n\n\n\n                          END\n                         \n\n\n\n                        For more information about sorting data in a chart, see\n                        \n                         Sorting the Data in Your Chart\n                        \n                        .\n                       \n\n\n\n                        How do I format dates on the x-axis for year-over-year comparisons?\n                       \n\n\n                         Say you want to do a Year-over-Year comparison in a card, but you aren’t sure where to begin. Perhaps the x-axis is showing multiple years instead of one, so a comparison is not possible. Or perhaps you are getting the error “No Data Exists” when applying the year-over-year comparison series.\n                        \n\n\n\n                         To do a year-over-year comparison, you’ll need to create the three following Beast Mode calculations:\n                        \n\n\n\n\n                          A calculation named \"Months\" that formats the dates on the x-axis so it shows just the month and not the year:\n                          \n\n\n                           DATE_FORMAT(`DateColumn`,'%M')\n                           \n\n\n\n\n\n                          A calculation named \"Year over Year\" that creates a series in which values are broken out by year:\n                         \n\n\n\n\n                           YEAR(`DateColumn`)\n                          \n\n\n\n\n\n\n                          A calculation named \"Month Sort\" that sorts the months on the x-axis:\n                         \n\n\n\n\n                           MONTH(`DateColumn`)\n                          \n\n\n\n\n\n\n                        How do I change a date column from a \"string\" data type to a \"date\" data type?\n                       \n\n\n                         Say you want to use dates in your card, but the date column you want to use is being read as a “string” data type, which is causing the date values in the column to be non-sorted and non-sortable in the card. You can change the data type of a column containing dates from a string value to a date value using a Beast Mode calculation, as follows:\n                        \n\n\n\n\n                          STR_TO_DATE(`DateColumn`,’%d/%m/%Y’)\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Be sure only date values, such as 1/1/2016, are used as values in the column. Otherwise, the calculation won’t work.\n                          \n\n\n\n\n                        For more information about data types, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n\n\n                        How do I format date values on the x-axis?\n                       \n\n\n                         Say you want to view the date values in a specific format instead of the standard card format. For example, your card is visualizing the current month by day, so the date values on the x-axis are showing the year, month, and day (for example, 2016-01-15). However, you may only want to see the day and month values (01-15).\n                        \n\n\n\n                         You can change the display of date values so you only see the day and month, using the DATE_FORMAT() function to reformat the date values:\n                        \n\n\n\n\n                          DATE_FORMAT(`DateColumn`,’%d-%m’)\n                         \n\n\n\n                        You can also format dates in using\n                        \n                         Chart Properties\n                        \n                        . For more information, see\n                        \n                         Changing the Date Format in Your Chart\n                        \n                        .\n                       \n\n\n\n\n                         How do I change the date column to represent a different time zone?\n                        \n\n\n\n                         You can adjust your company time zone in the Admin Settings, as described here:\n                         \n                          Setting Your Company Time Zone\n                         \n                         .\n                        \n\n\n\n                         Sometimes, though, you’ll need to use a Beast Mode when time zones don’t match up between DataSets.\n                        \n\n\n\n                         Say the dates in the date column in a card are based on EST, but your company is based on PST, and you want to see the data based on PST instead of EST. You can shift the dates values to another time zone by adding or subtracting time from the date values depending on what time zone you are switching it to. The functions that add and subtract time are\n                         \n                          DATE_ADD()\n                         \n                         and\n                         \n                          DATE_SUB()\n                         \n                         . For example, switching the date values from EST to PST would require you to subtract 3 hours, and can be done with the Beast Mode calculation like the one below:\n                        \n\n\n\n\n                          DATE_SUB(`DateColumn`, interval 3 HOUR)\n                         \n\n\n\n\n\n                        How can I use Beast Mode to calculate percent (%) change from the previous year to the current year?\n                       \n\n                        This topic is discussed here:\n                        \n                         Sample Beast Mode Calculations - Calculating Percent Change from the Previous Year to the Current Year\n                        \n\n                         .\n                        \n\n\n\n\n                        How do I create a period-over-period graph using Beast Mode?\n                       \n\n                        This topic is discussed here:\n                        \n                         Sample Beast Mode Calculations - Creating a Period-over-Period Graph\n                        \n\n                         .\n                        \n\n\n\n\n                        How do I divide by NULL or zero?\n                       \n\n                        You can divide by NULL or zero by using the following case statement:\n                       \n\n\n                         CASE\n                        \n\n\n\n                         WHEN iFNULL(`value2`,0) = 0 THEN 0\n                        \n\n\n\n                         ELSE `value1` / `value2`\n                        \n\n\n\n                         END\n                        \n\n\n\n\n                        How do I create conditional summing?\n                       \n\n                        When using a CASE statement to create a calculation, you may want to aggregate the results of this CASE statement. Unfortunately, many users make the mistake of using a SUM function inside of the CASE statement, like the following:\n                       \n\n\n                         CASE WHEN `Column_1` = 'Value_1’ THEN SUM(`Column_1`) END\n                        \n\n\n                        Instead, you need to “wrap” the entire statement in a SUM function for it to execute properly:\n                       \n\n\n                         SUM(CASE WHEN `Column_1` = 'Value_1’ THEN SUM(`Column_1`) END)\n                        \n\n\n\n\n                        I've added a shared calculation but it only seems to show up in new cards. Is there a way to use it in existing cards?\n                       \n\n                        When you share a Beast Mode calculation, it is stored on the data source powering the card. The shared calculation is available in other cards that are powered up by that same data source.\n                       \n\n\n\n\n\n                          What do I do if my Beast Mode “disappears” after saving?\n                         \n\n\n\n\n\n                          This issue is most commonly caused by multiple users editing the same card at the same time and overwriting each others' changes. If the Beast Mode is shared on the DataSet, it can also be caused by users editing different cards on the DataSet overwriting each others' changes to the shared Beast Modes on that DataSet.\n                         \n\n\n\n                        This problem can most easily be solved by e\n                        \n\n                          ither coordinating with other users to make sure you’re not overwriting each others' changes, or by editing at a time when others are not as likely to also be making edits.\n                         \n\n\n\n                        This issue also occurs when you attempt to create Beast Mode calculations on a card in a drill path. Because drill path cards are not actual cards, Beast Mode calculations created in a drill path will not be saved. In order to ensure the calculations are saved, they must be created in the top layer of the card and have the\n                        \n                         Share Calculation on DataSet\n                        \n                        checkbox checked. For more information about drill path, see\n                        \n                         Adding Drill Path to Your Chart\n                        \n\n\n                          .\n                         \n\n\n\n\n\n                        How do I deal with NULL values when adding columns?\n                       \n\n                        If you are trying to SUM the values in a column with NULL values, you need to convert those NULL values to zero using the IFNULL function.\n                       \n\n                        For example,\n                       \n\n\n                         IFNULL(`col`,0)\n                        \n\n\n                        So let's say you had a \"Category\" column with values \"A,\" \"B,\" and \"C,\" and an \"Amount\" column with values \"20,\" \"10\" and an empty cell (which is NULL). When you SUM the Amount column, the IFNULL calculation converts the NULL value to 0 and then applies the SUM as normal.\n                       \n\n\n\n                        Can I use links to local file URLs in Beast Mode calculations?\n                       \n\n                        Not at this time.\n                       \n\n\n\n                        How does the WEEKDAY function work in Beast Mode?\n                       \n\n                        The WEEKDAY function is not supported in Beast Mode. If WEEKDAY is used, it is replaced with the functionality of DAYOFWEEK.\n                       \n\n\n\n                        Why can't I delete a Beast Mode calculation from a card?\n                       \n\n                        When a Beast Mode calculation is shared on a DataSet, it can be used on multiple cards. If the calculation is being used in any of those cards (filter, series, sort, date column, etc.), it can't be deleted until the calculation is no longer being used by any cards. If you try to remove that calculation, you will get an error message listing all of the cards using the calculation. You should also check the drill paths on each card, as they may be hiding calculations that you aren't aware are being used.\n                       \n\n\n\n                        Why does multiplying two large positive numbers result in a negative number?\n                       \n\n                        Numeric columns are either 64 bit LONG, 64 bit FIXED DECIMAL , or FLOAT (DECIMAL vs DOUBLE) datatypes. When a mathematical function results in a numerical value larger than maximum for the datatype, then it will overflow to a negative number.", "Preview Article": "Click here to preview", "URL Name": "360043430053", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004085", "Archived Date": "", "Language": "English", "Primary Version": "Beast Mode FAQs", "Article Total View Count": "15,875", "": "", "Article Created Date": "10/24/2022, 9:20 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Beast Mode FAQs\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Beast Mode\n              \n", "url": "/s/topic/0TO5w000000ZanAGAS"}]}