{"file_path": "../../raw_kb_v2\\article\\360042923814\\index.html", "content": {"Title": "Locking or Unlocking Page Content", "Article Body": "Intro\n                       \n\n                        By default, any user can copy, move, remove, and resize Cards within a Page, regardless of his or her\n                        \n                         custom role\n                        \n                        with the \"Manage All Cards and Pages\" privilege enabled. You can do this Page by Page, or you can lock multiple Pages at once. To bulk-lock Pages, you must have a default security role of \"Admin\" or a custom role with the \"Manage All Cards and Pages\" privilege enabled.\n                       \n\n                        You can also lock individual Cards in a Page. When a Card is locked, only the Card owner and \"Admin\" users can perform actions such as editing the Card, creating a drill path, and connecting/updating data. You can do this Card by Card, or you can lock multiple Cards at once. To bulk-lock Cards, you must have a default security role of \"Admin\" or a custom role with the \"Manage All Cards and Pages\" privilege enabled.\n                       \n\n                        Locked Pages also cannot be shared by users if they are not the owner or do not have an \"Admin\" default security role or a custom role with the \"Manage All Cards and Pages\" privilege enabled.\n                       \n\n                        Locking Pages\n                       \n\n                        You can lock single Pages by clicking the lock icon\n                        \n                        next to the Page name. If you are not the Page owner and do not have an \"Admin\" default security role or a custom role with the \"Manage All Cards and Pages\" privilege enabled., this icon does not appear.\n                       \n\n                        You can unlock a locked Page by clicking the lock icon a second time.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you have an \"Admin\" security role or a custom role with the \"Manage All Cards and Pages\" privilege enabled., you can also lock Pages by setting them as company Pages in the\n                           \n                            Company Settings\n                           \n                           tab in the Admin Settings. This locks not only the content, but also the order of the Pages as they appear in the navigation bar, together with the order of any sub-Pages of those Pages. This advanced method of locking Pages is recommended for administrators setting up Pages for their employees. For non-administrator employees who want to lock personal Pages, the method described in this topic is simpler and more appropriate. For more information about locking company Pages in the Admin Settings, see\n                           \n                            Adding Company Pages\n                           \n                           .\n                          \n\n\n\n\n                        For information about moving Cards within a Page, see\n                        \n                         Removing Cards from a Page\n                        \n                        .\n                       \n\n\n                         To lock Cards in a single Page,\n                        \n\n\n\n\n                          Navigate to the Page you want to lock.\n                         \n\n\n\n                          Click\n                          \n                          .\n                          \n                          If you are not the Page owner and do not have an \"Admin\" default security role or a custom role with the \"Manage All Cards and Pages\" privilege enabled, this icon does not appear.\n                         \n\n\n\n                        The Cards in the Page are now locked, and they can be repositioned and resized only by you, by users with an \"Admin\" default security role, and by users with a custom role in which the \"Manage All Cards and Pages\" privilege has been enabled.\n                       \n\n\n                         To unlock Cards in a single Page,\n                        \n\n\n\n                         Navigate to the Page you want to unlock.\n                        \n\n                         Click\n                         \n                         .\n                         \n                         If you are not the Page owner and do not have an \"Admin\" security role, this icon does not appear.\n                        \n\n\n                        The Cards in the Page are now unlocked, and anyone can reposition and resize them.\n                       \n\n                        You can lock multiple Pages at once in the Admin Settings. You must have an \"Admin\" default security role or a custom role in which the \"Manage All Cards and Pages\" privilege has been enabled to do this. For information about security roles, see\n                        \n                         Security Role Reference\n                        \n                        .\n                       \n\n\n                         To lock multiple Pages at once,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n                           Admin\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Pages\n                          \n                          .\n                         \n\n\n\n                          Check the boxes for all Pages you want to lock.\n                          \n                          You can use the column filters to filter the Pages in the list. You can also select or deselect all Pages passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Lock Page\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Lock Pages\n                          \n                          .\n                         \n\n\n\n\n                         To unlock multiple Pages at once,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n                           Admin\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Pages\n                          \n                          .\n                         \n\n\n\n                          Check the boxes for all Pages you want to lock.\n                          \n                          You can use the column filters to filter the Pages in the list. You can also select or deselect all Pages passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Unlock Page\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Unlock Pages\n                          \n                          .\n                         \n\n\n\n                        Locking Cards\n                       \n\n                        You can lock Cards so only the Card owners, \"Admin\" users, and users with custom roles in which the \"Manage All Cards and Pages\" privilege has been enabled can perform actions such as editing the Card, creating a drill path, and connecting/updating data. You can lock single Cards by clicking the lock next to the Card Owner on the Card Details view. You can also lock Cards in bulk in the Cards tab of the Admin Settings.\n                       \n\n\n                         To lock Cards,\n                        \n\n\n\n\n                          Navigate to the Card Details view of the Card you want to lock.\n                         \n\n\n\n                          Click\n                          \n                          next to the Card Owner in the bottom left-hand corner.\n                          \n                          If you are not the Card Owner and do not have an \"Admin\" default security role or a custom role with the \"Manage All Cards and Pages\" privilege enabled, this icon does not appear.\n                         \n\n\n\n                        The Card is now locked, and can only be edited by you, by users with an \"Admin\" default security role, and by users with a custom role in which the \"Manage All Cards and Pages\" privilege has been enabled.\n                       \n\n\n                         To unlock Cards in a single Page,\n                        \n\n\n\n                         Navigate to the Card Details view of the Card you want to unlock.\n                        \n\n                         Click\n                         \n                         next to the Card Owner in the bottom left-hand corner.\n                         \n                         If you are not the Card owner and do not have an \"Admin\" security role, this icon does not appear.\n                        \n\n\n                        The Cards in the Page are now unlocked, and anyone can reposition and resize them.\n                       \n\n                        You can lock multiple Cards at once in the Admin Settings. You must have an \"Admin\" default security role or a custom role in which the \"Manage All Cards and Pages\" privilege has been enabled to do this. For information about security roles, see\n                        \n                         Security Role Reference\n                        \n                        .\n                       \n\n\n                         To lock multiple Cards at once,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n                           Admin\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Cards\n                          \n                          .\n                         \n\n\n\n                          Check the boxes for all Cards you want to lock.\n                          \n                          You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Lock Card\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Lock Cards\n                          \n                          .\n                         \n\n\n\n\n                         To unlock multiple Cards at once,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n                           Admin\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Cards\n                          \n                          .\n                         \n\n\n\n                          Check the boxes for all Cards you want to lock.\n                          \n                          You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Unlock Card\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Unlock Cards\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360042923814", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004092", "Archived Date": "", "Language": "English", "Primary Version": "Locking or Unlocking Page Content", "Article Total View Count": "5,322", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Locking or Unlocking Page Content\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Card And Dashboard Management\n              \n", "url": "/s/topic/0TO5w000000ZanDGAS"}]}