{"file_path": "../../raw_kb_v2\\article\\1500000215322\\index.html", "content": {"title": "\n\n\n Twitter Multi Account Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nUse Domo's Twitter Multi Account Connector to understand which content is most effective, then create content that drives engagement and revenue with your Twitter data integrated into Domo for multiple accounts. Once your Twitter data is in Domo, you can use your data to measure your social media ROI with visualizations in intuitive dashboards and apps. Get the most out of your marketing budget by measuring your social media engagement during different time periods, detect cross-platform engagement trends, and better understand your target audience. You can also track your top posts across social media platforms, rate and filter your top posts, and identify other patterns to help you create engaging content.\n\n\n The Domo Twitter Multi Account Connector integrates Domo with Twitter to extract data from the Twitter API. It provides access to read Twitter data including followers, timelines, re-tweets and many other Twitter entities. It returns data for multiple accounts in a single dataset. To learn more about the Twitter API, visit their site (\n\nhttps://dev.twitter.com/rest/reference\n\n).\n\n\n You connect to your Twitter accounts in the Data Center. This topic discusses the fields and menus that are specific to the Twitter Multi Account connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Best Practices\n----------------\n\nMost reports work best when you set them to \"Append\" rather than \"Replace.\" This way you can pull in recent data and not make unnecessary API calls. You can also use the\n ****Retrieve all available data****\n option to pull all data since the DataSet was last updated.\n\n\n Prerequisites\n---------------\n\nTo connect to your Twitter accounts and create a DataSet, you must have the Twitter accounts added in Domo that you want to pull data from.\n\n###\n Adding Twitter multi accounts\n\nYou need to add your Twitter accounts through API calls. When creating an account, you must specify the Account Type properties. See\n\nCreate an Account\n\ndocumentation for more details. The Account Type properties are different, depending on the type of Account you are trying to create.\n\n\n Use the following POST body to make an API call for adding a new Twitter account. Note that you need to provide your own credentials values for YOUR\\_ACCESS\\_TOKEN, YOUR\\_TWITTER\\_NAME, YOUR\\_OAUTH\\_TOKEN, YOUR\\_OAUTH\\_TOKEN\\_SECRET, YOUR\\_CONSUMER\\_KEY, YOUR\\_CONSUMER\\_SECRET, YOUR\\_TWITTER\\_ID, and YOUR\\_TWITTER\\_SCREEN\\_NAME.\n\n\n`curl --location --request POST '\n\nhttps://api.domo.com/v1/accounts\n\n' \\`\n\n\n`--header 'Authorization: Bearer YOUR_ACCESS_TOKEN' \\`\n\n\n`--header 'Accept: application/json' \\`\n\n\n`--header 'Content-Type: application/json' \\`\n\n\n`--data-raw '{`\n\n\n`\"name\": \"YOUR_TWITTER_NAME\",`\n\n\n`\"type\": {`\n\n\n`\"id\": \"twittermultiaccount\",`\n\n\n`\"properties\": {`\n\n\n`\"oauth_token\": \"YOUR_OAUTH_TOKEN\",`\n\n\n`\"oauth_token_secret\": \"YOUR_OAUTH_TOKEN_SECRET\",`\n\n\n`\"oauth_consumer_key\": \"YOUR_CONSUMER_KEY\",`\n\n\n`\"oauth_consumer_secret\": \"YOUR_CONSUMER_SECRET\",`\n\n\n`\"user_id\": \"YOUR_TWITTER_ID\",`\n\n\n`\"screen_name\": \"YOUR_TWITTER_SCREEN_NAME\"`\n\n\n`}`\n\n\n`}`\n\n\n`}'`\n\n\n You can use POSTMAN or any other tool to make the API call.\n\n##\n Details Pane\n\nThis pane contains the options for account selection and the primary\n\nReports\n\nmenu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Account Selection\n  |\n Choose whether you want to pull data for all Twitter accounts, or you wish to discover and select specific Twitter accounts.\n  |\n|\n Accounts Discovery\n  |\n Select the Twitter accounts you want to pull data for.\n  |\n|\n Skip Account Errors\n  |\n Select Yes if you want to skip the account if it fails; otherwise, in case of an account error, the connector will stop.\n  |\n|\n Report\n  |\n Select the report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account\n  |\n Returns information about the authenticated user, such as time zone, screen name, language, etc.\n  |\n|\n Favorites\n  |\n Returns the 20 most recent Tweets marked as Favorites by the authenticated user.\n  |\n|\n Followers\n  |\n Returns a list of all the users who are following the authenticated user.\n  |\n|\n Friends\n  |\n Returns a list of users the authenticated user is following.\n  |\n|\n Home Timeline\n  |\n Returns the list of Tweets from the authenticated user’s main timeline screen at twitter.com.\n  |\n|\n Mentions Timeline\n  |\n Returns a list of Tweets in which the authenticated user is mentioned (referred to by\n\n“@username”).\n  |\n|\n Retweeters\n  |\n Returns a list of users who have retweeted posts from the authenticated user.\n  |\n|\n Retweets\n  |\n Returns a list of the 100 most recent retweets of the tweet specified in the Tweet ID field.\n  |\n|\n Retweets of Me\n  |\n Returns a list of the most recent tweets authored by the authenticated user that have been retweeted by others.\n  |\n|\n Search Tweets\n  |\n Returns a collection of relevant Tweets matching or related to the specific text (which you specify in the\n ****Search Text****\n field). Twitter's search service is not meant to be an exhaustive source of Tweets. Not all Tweets will be indexed or made available via the search interface.\n  |\n|\n Search Users\n  |\n Provides a simple, relevance-based search interface to public user accounts on Twitter. You can search for user names by entering a comma-separated list of names into the\n ****Screen Name****\n field, or you can search for text by entering that text into the\n ****Search Text****\n field. If the search text is specified, then the list of names will be ignored, and a list of users related to the search text will be returned. If there is no search text, the report will return information about the specified user names. User names are case-sensitive.\n  |\n|\n User Info\n  |\n Returns basic information about the authenticated user.\n  |\n|\n User Timeline\n  |\n Returns a collection of the most recent Tweets posted by the users indicated in the\n ****Screen Name****\n field.\n  |\n|\n Direct Messages\n  |\n Returns all Direct Message events (both sent and received) within the last 30 days.\n  |\n\n|\n|\n Allow New Columns\n  |\n Select\n ****Yes****\n to allow new columns to be added to the DataSet. If you are going to use this DataSet in a DataFlow then this should be set to\n ****No****\n .\n  |\n|\n Break out entities into individual rows?\n  |\n Select\n ****Yes****\n to display one entity of the Tweet (hashtag, user mention, URL, or symbol) per row.\n\n\n Select\n ****No****\n to display a comma-separated list of entities of each Tweet on a single row.\n  |\n|\n Allow New Columns\n  |\n Select\n ****Yes****\n to allow new columns to be added to the DataSet. If you are going to use this DataSet in a DataFlow then this should be set to\n ****No****\n .\n  |\n|\n Retrieve all available data?\n  |\n Select\n ****Yes****\n to retrieve all available data.\n\n\n Select\n ****No****\n to retrieve new data since the last update.\n\n\n For the\n ****Followers****\n report, if this is set to No, the most recent 200 followers will be retrieved. If it is set to Yes then all of the user's followers will be retrieved. This can take a long time and is not recommended for users with more than 5000 followers.\n  |\n|\n Start Date\n  |\n Enter the earliest date you want to retrieve information for. This can be a fixed date\n\n\n (\n\nMM-DD-YYYY\n\n)\n\n\n or a relative date\n\n(\n\ntoday-7\n\n,\n\nyesterday-30\n\n)\n\n.\n\n\n**Note:**\n If you want to create backfill for a new DataSet, do the following:\n\n. Enter the backfill date in the\n **Start Date**\n field.\n2. Select\n **No**\n in the\n **Retrieve all available data?**\n menu.\n3. In the\n **Scheduling**\n pane, make sure\n **Append**\n is selected.\n\nFor an existing date source, if you want to create backfill OR if you want to wipe\n\nall data and do a fresh data pull, do the following:\n\n. Enter the backfill date in the\n **Start Date**\n field.\n2. Select\n **Yes**\n in the\n **Retrieve all available data?**\n menu.\n3. In the\n **Scheduling**\n pane, make sure\n **Replace All**\n is selected.\n4. After the connector starts running...\n\t1. Change\n\t **Retrieve all available data?**\n\t to\n\t **No**\n\t .\n\t2. In the\n\t **Scheduling Pane**\n\t , select\n\t **Append**\n\t .\n\nBackfill may not be completed during the first run of the DataSet. It might take a few hours to a few days to complete the backfill, based on the amount of data you are trying to pull and the backfill date you have entered.\n\n\n |\n|\n Tweet ID\n  |\n Enter the ID for the tweet you want to retrieve information for.\n\n\n**Note:**\n\nYou can find the ID for a tweet in Twitter by doing the following:\n 1. Click the\n **Tweets**\n link under your username.\n2. Locate the Tweet you want to find the ID for.\n3. Click the Tweet's timestamp.\n\nA page opens for this tweet. The tweet ID is the long number at the end of the\n\nURL (for example,\n\n223432830066241537\n\nin\n\n\n https://twitter.com/hal\\_bunders\n\n\n on/status/223432830066241537\n\n)\n\n\n |\n|\n Use short column names\n  |\n Select the option for column names length. If you select\n ****No****\n , the long & default column names will be displayed. If you select\n ****Yes****\n , the short column names will be displayed in the report.\n\nIf you are going to use this Data Source in a dataflow then this should be set to\n ****Yes****\n .\n  |\n|\n Search Text\n  |\n Enter the search text for the report. The report will include search results related to this text.\n  |\n|\n Screen Name\n  |\n Enter a comma-separated list of names for the report. Names must be capitalized correctly. If no names are entered, the authenticated user's screen name is used.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Frequently Asked Questions\n----------------------------\n\n\n####\n How frequently will my data update?\n\nMost of the information is available immediately. It is recommended to configure the datasets to run every 24 hours.\n\n###\n What else do I need to do to use this connector?\n\nTweet ID, Search Text, Screen Name, and Start Date can be provided optionally for certain reports.\n\n###\n Why didn't my dataset return any new rows when it ran?\n\nThis generally happens if there is no data for the connector to return. Most frequently this happens if there is no activity (new tweets, retweets, etc.) on the account after the Start Date. This can also happen if the \"Retrieve All Available Data\" is set to \"No\" and you run the dataset too frequently. With this value set, the connector will return the data that is new since the last time the dataset ran successfully. If there were no new tweets, retweets, etc., the dataset will return no rows.\n\n###\n Why is the report taking so long to run? Is this normal?\n\nSome of the reports can take a very long time to run. They have to read through several levels of data, making multiple calls to Twitter at each step. This can take a long time. The time increases even more if the Start Date is far in the past and the \"Retrieve All Available Data\" is set to \"Yes\".\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500000215322\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003266\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nTwitter Multi Account Connector\n\n", "article_total_view_count": "\n\n\n 4,642\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "twitter_multi_account_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}