{"file_path": "../../raw_kb_v2\\article\\4406661839895\\index.html", "content": {"Title": "AirNow Connector", "Article Body": "Intro\n                       \n\n\n                         AirNow receives real-time air quality observations from over 2,000 monitoring stations and collects forecasts for more than 300 cities around North America. Use Domo's AirNow Connector to access these air quality observations and forecasts through Domo.\n                        \n\n\n\n                         You create an AirNow DataSet in the Data Center.\n                        \n\n\n                        The\n                        \n                         AirNow\n                        \n                        Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n                        \n                         Cloud App\n                        \n                        in the toolbar at the top of the window.\n                       \n\n                        You connect to your\n                        \n                         AirNow a\n                        \n                        ccount in the Data Center. This topic discusses the fields and menus that are specific to the\n                        \n                         AirNow\n                        \n                        Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n                            Primary Use Cases\n                           \n\n\n                           This Connector lets you retrieve the real-time data about the\n                           \n                            air quality observations.\n                           \n\n\n\n\n\n                            Primary Metrics\n                           \n\n\n\n\n                             Observations and forecasts by longitude/latitude\n                            \n\n                             Observations and forecasts by zip code\n                            \n\n                             Historical observations\n                            \n\n\n                              Monitoring site by geographical bounding box\n                             \n\n\n\n\n\n\n\n                            Primary Company Roles\n                           \n\n\n\n\n                             Disaster management department\n                            \n\n                             Weather control department\n                            \n\n\n\n\n                                Any business unit within an organization looking to correlate weather data with business performance for meaningful business intelligence\n                               \n\n\n\n\n\n\n\n                                Any individual or business requiring weather data that is tied to a specific location, region, or geographic area\n                               \n\n\n\n\n\n\n\n\n\n                            Average Implementation Time\n                           \n\n\n                           Less than 10 mins\n                          \n\n\n\n\n                            Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                           \n\n\n                           2\n                          \n\n\n\n\n                        Prerequisites\n                       \n\n                        To connect to your AirNow account and create a DataSet, you must have your AirNow API key.\n                       \n\n\n                         You can request your API Key at\n                         \n                          https://docs.airnowapi.org/account/request/\n                         \n\n\n\n                        Connecting to Your AirNow Account\n                       \n\n                        This section enumerates the options in the Credentials and Details panes in the AirNow Connector page. The components of the other panes in this page,\n                        \n                         Scheduling\n                        \n                        and\n                        \n                         Name & Describe Your DataSet\n                        \n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your AirNow account. The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           API Key\n                          \n\n\n                            Enter your AirNow Api key. You can request your API Key at\n                            \n                             https://docs.airnowapi.org/account/request/\n                            \n\n\n\n\n\n\n                        Once you have entered valid AirNow credentials, you can use the same account any time you go to create a new AirNow DataSet. You can manage Connector accounts in the\n                        \n                         Accounts\n                        \n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n                         Reports\n                        \n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the AirNow\n                            \n\n                            report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Current Observations by Reporting Area by Latitude/Longitude\n                              \n\n                               Takes a latitude, longitude, and distance (optional) and returns the current air quality observations.\n                              \n\n\n\n                               Current Observations by Reporting Area by Zip code\n                              \n\n                               Takes a Zip code and distance (optional) and returns the current air quality observations.\n                              \n\n\n\n                               Forecasts by Latitude/Longitude\n                              \n\n                               Takes a latitude, longitude, date (optional), and distance (optional) and returns the air quality forecast.\n                              \n\n\n\n                               Forecasts by Zip code\n                              \n\n                               Takes a Zip code, date (optional), and distance (optional) and returns the air quality forecast.\n                              \n\n\n\n                               Historical Observations by Reporting Area by Latitude/Longitude\n                              \n\n                               Takes a latitude, longitude, date, and distance (optional) and returns the peak air quality observation for that date.\n                              \n\n\n\n                               Historical Observations by Reporting Area by Zip code\n                              \n\n                               Takes a Zip code, date, and distance (optional) and returns the peak air quality observation for that date.\n                              \n\n\n\n                               Observations by Monitoring Site by Geographical bounding box\n                              \n\n                               Takes a geographic bounding box, start and end date/times (optional), list of parameters, data type (AQI or concentration), and returns observational data by monitoring site\n                              \n\n\n\n\n\n\n\n\n                            Zip Code\n                           \n\n\n                           Enter the zip code.\n                          \n\n\n\n                           Distance\n                          \n\n                           Enter the distance.\n                          \n\n\n\n\n                            Latitude\n                           \n\n\n                           Enter the latitude value.\n                          \n\n\n\n\n                            Longitude\n                           \n\n\n\n\n\n                           Enter the longitude value.\n                          \n\n\n\n\n                            UTC for Start Date\n                           \n\n\n\n\n\n                           Enter the UTC time for start date.\n                          \n\n\n\n\n                            UTC for End Date\n                           \n\n\n\n\n\n                           Enter the UTC time for end date.\n                          \n\n\n\n\n                            Northern Border\n                           \n\n\n\n\n\n                           Enter the value for northern border. Max value is 180 and min value is -180.\n                          \n\n\n\n\n                            Western Border\n                           \n\n\n\n\n\n                           Enter the value for western border. Max value is 90 and min value is -90.\n                          \n\n\n\n\n                            Eastern Border\n                           \n\n\n\n\n\n                           Enter the value for eastern border. Max value is 90 and min value is -90.\n                          \n\n\n\n\n                            Southern Border\n                           \n\n\n\n\n\n                           Enter the value for southern border. Max value is 180 and min value is -180.\n                          \n\n\n\n\n                            Parameters\n                           \n\n\n\n\n\n                           Enter the parameters.\n                          \n\n\n\n\n                            Monitor Type\n                           \n\n\n\n\n\n                           Select whether you want the permanent monitors, mobile monitors, or all monitor types.\n                          \n\n\n\n\n                            Data Type\n                           \n\n\n\n\n\n                           Select the data type (AQI, Concentrations, or both.)\n                          \n\n\n\n\n                            Verbose\n                           \n\n\n\n\n\n                           Specify whether you want to use verbose.\n                          \n\n\n\n\n                            Include Raw Concentration\n                           \n\n\n\n\n\n                           Specify whether you want to include raw concentration.\n                          \n\n\n\n                           Date Selection\n                          \n\n                           Select the date format for your data.\n                          \n\n\n\n                           Single Date\n                          \n\n                           Select whether the report data is for a specific date or for a relative number of days back from today.\n                          \n\n\n\n                           Specific Date\n                          \n\n                           Select the specific date using the date selector.\n                          \n\n\n\n                           Relative Date\n                          \n\n                           Enter the number of days back that you would like to get data for in the\n                           \n\n\n                            Days Back\n                           \n\n\n                           field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n                          \n\n\n\n                           Date Range\n                          \n\n                           Select the specific or relative date range.\n                          \n\n\n\n                           Start Date - Specific\n                          \n\n                           Select the first date in your date range using the date selector.\n                          \n\n\n\n                           End Date - Specific\n                          \n\n                           Select the last date in your date range using the date selector.\n                          \n\n\n\n                           Start Date - Relative\n                          \n\n\n                            Enter the number of days back that you would like to get data from (start day). Combine with\n                            \n\n\n\n                                End Date\n                               \n\n\n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n\n\n                                Start Date\n                               \n\n\n\n                            and 5 for\n                            \n\n\n\n                                End Date\n                               \n\n\n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n                           End Date - Relative\n                          \n\n\n                            Enter the number of days back that you would like to get data to (end day). Combine with\n                            \n\n\n\n                                Start Date\n                               \n\n\n\n                            to create a range of represented days.\n                           \n\n                            For example, if you entered 10 for\n                            \n\n\n\n                                Start Date\n                               \n\n\n\n                            and 5 for\n                            \n\n\n\n                                End Date\n                               \n\n\n\n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "4406661839895", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003222", "Archived Date": "", "Language": "English", "Primary Version": "AirNow Connector", "Article Total View Count": "2,354", "": "", "Article Created Date": "10/24/2022, 9:11 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              AirNow Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}