{"file_path": "../../raw_kb_v2\\article\\360043438493\\index.html", "content": {"title": "\n\n\n CourseBuilder FAQs\n\n\n", "article_body": "\n\nCourseBuilder FAQs\n--------------------\n\nHave a quick question about CourseBuilder? Browse the list below to see if we have a quick answer for you.\n\n##\n What is CourseBuilder?\n\nIt’s an e-learning authoring tool that publishes training modules as apps to Domo. The best part is that it’s available for download in the Domo Appstore—for free.\n\n##\n I’m struggling with the download/launch process…\n\nWe're sorry about that. Following the steps outlined in\n\nthis article\n\nwill help you get it up and running in moments.\n\n##\n Can I use your training content, videos, and documentation in my trainings?\n\nYes, as long as you follow the stipulations of the Domo Services Agreement, which essentially requires that you only use our training assets for internal onboarding or training efforts and that these not be used for a for-profit venture outside of your licensed organization.\n\n##\n How do I use Domo University videos in my apps?\n\nYou’ll need to add video IDs to the appropriate field in CourseBuilder. Here’s how to find those video IDs and make them work in your app:\n\n. Go to\n\nhttps://www.domo.com/help-center/videos\n\n.\n2. Search for and open the video that you want to include in your app.\n3. In the URL for that page, copy the last part of it. For example, you would copy the orange portion of the following URL:\n\nhttps://university.domo.com/videos/watch/\n\n\n cxaGNjODE6kFqCR61d-4E69XUwdn1h6U\n4. Next, in a video page/template that you've created for your app in CourseBuilder, set the Cloud Video Provider to YouTube.\n5. Then, paste the copied videoID into the appropriate field.\n\n\n###\n What cloud video services are available?\n\nYouTube, Vimeo, Amazon Web Services (AWS), Ooyala, Vidyard, and Verizon Digital Media Services.\n\n##\n Can I upload my own MP4 videos into apps?\n\nYes. In the Files view/tab in CourseBuilder, select\n **Add**\n**File**\n and then go find and add the video file you want to import into your app. (\n **Note**\n : The video file should be 50 MB or less in size. If it exceeds that size, it will likely make it so you can't publish your app to Domo.) Once you've imported the video file, create a video page or template, and in the Video Source dropdown menu, simply select Video File. Then, if you’ve already uploaded the video, you will be able to select that video from a dropdown list and add it to your page template.\n\n##\n Can I link to resources outside the Domo SSO (Single Sign On), such as Box?\n\nTypically, yes. However, some customer administrators have preemptively limited which outside domains can be linked to from within their Domo instance. An admin for your instance may need to whitelist certain Domains before users can access links to those domains from a CourseBuilder app.\n\n##\n Are there any browser restrictions associated with CourseBuilder apps?\n\nYes. CourseBuilder is optimized specifically for Chrome. CourseBuilder apps also typically work well in Safari and, for the most part, Mozilla Firefox. However, CourseBuilder is\n **not**\n optimized for Internet Explorer browsers. If users access CourseBuilder apps via Internet Explorer, elements in the app UI and page functions may break down. For this reason, we strongly recommend users access CourseBuilder apps through Chrome and that they specifically avoid the use of Internet Explorer.\n\n##\n Are there any other possible restrictions I should know about?\n\nIf the user is logged into their company network via a proxy server or VPN, CourseBuilder may not allow the users to publish an app to a Domo instance. The user would need to log off of the VPN or proxy server and, instead, login to their instance on a standard network and publish the app to their instance from there.\n\n##\n Can I make CourseBuilder apps go full screen within Domo?\n\n\n This capability is not available at this time.\n\n\n###\n I just imported an app into CourseBuilder, but it isn’t working. Why?\n\nThere are a number of possible reasons. First, make sure the app you’re trying to import was exported from CourseBuilder as an editable app. Second, ensure you selected the parent app folder and didn’t double-click into that folder. For example, if I were importing an editable app named “Workbench Training” into CourseBuilder, I would need to select Import, find the app project folder named “Workbench Training, select the project folder by clicking it once with the cursor, then select the\n **Import**\n button in the dialog box. If you double-click the app project folder, this will not initiate the upload. Rather, it will take you into the app project folder itself. If a user gets to this point, they might accidentally import only parts of the editable app but not the entire app project.\n\n##\n Why can't I add punctuation or other symbols in the name of my apps?\n\nCurrently, the name you give the app when you first create it is the name applied to the label for the folder housing app assets and files. Adding punctuation and symbols to this name causes errors in the import, export, and publishing process. While we're working on a solution, users will need to use names that do not include any punctuation or symbols until it is ready.\n\n##\n What is the difference between an editable export of an app, exporting the app, or publishing the app?\n\nThe editable app that has been exported can be re-imported into CourseBuilder and allow the user to edit that app. Exporting the app (Option 3) exports a version of the app that can be edited by a developer and then published to Domo via a CLI (Command Line Interface). A published app is published to whatever instance you have credentials to access, and it places the app in your Asset Library within Domo.\n\n##\n My videos aren't working or showing up in the designated frame, or my MP4 videos aren't importing into my app.\n\nIf you are using a cloud video service provider, ensure that you have copied the correct video ID in to the appropriate field and that you have  chosen the correct cloud service provider. If you are trying to add a MP4 video, make sure the video file has \".mp4\" in the suffix and not something like \".mov\" or \".screenflow\". It is also possible that the size of your video is too big and that you need to resize the aspect ratio for the video, split up the video into two or more parts, or compress that video. Here are some recommendations on reducing the file size of your video.\n\n\n Before you import video files into CourseBuilder, ensure the file size of the video is 50 MB (50,000 KB) or less. If the file size for your video exceeds this this limitation, it will likely be too large to import into CourseBuilder. That said, there are a few steps you can take to reduce the video file size and bring it below the 50 MB maximum:\n\n **Decrease your resolution:**\n The best way to reduce the MP4 video size is to ensure the resolution/aspect ration for your video is no higher than 1280x720 (a.k.a 720p).\n* **Decrease the video length:**\n You’ll generally want to restrict your videos to 5 minutes or less in length. Optimal video length is 3 min or less. If your video exceeds these time recommendations, consider splitting the video into multiple videos.\n* **Compress your video file:**\n You can also reduce video file size, without sacrificing quality, by compressing your video using video compression software. However, this option generally requires the use of specific software tools for compressing video, and the process may require the help of someone experienced in performing this sort of task. There are various resources online to help you accomplish this task successfully.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043438493\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004499\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCourseBuilder FAQs\n\n", "article_total_view_count": "\n\n\n 4,800\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "coursebuilder_faqs", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "training", "url": "/s/topic/0TO5w000000ZamyGAC"}, {"text": "selfservice_training", "url": "/s/topic/0TO5w000000ZaoCGAS"}, {"text": "coursebuilder_14", "url": "/s/topic/0TO5w000000ZaogGAC"}]}