{"file_path": "../../raw_kb_v2\\article\\360043439533\\index.html", "content": {"Title": "Viewing a User's Conversation Activity", "Article Body": "In a user's\n                        \n                         Profile\n                        \n                        page, in the\n                        \n\n                          Conversations\n                         \n\n                        tab you can see all of the people that user has been conversing with in Buzz, along with a live feed of the actual conversations.\n                       \n\n\n\n\n\n                         To open the Conversations tab for a user,\n                        \n\n\n\n\n                          Open the user's\n                          \n                           Profile\n                          \n                          page by clicking his or her profile picture anywhere that it appears.\n                         \n\n\n\n                          Click\n                          \n\n                            Conversations\n                           \n\n                          in the tab row under the row of hyperlinks.\n                         \n\n\n\n                        The tab is divided into two panels. The panel on the left shows bubbles for all of the users this user has been talking to. Bubble size is determined by the number of conversations a user has been involved in. The panel on the right contains a miniature version of Buzz that updates to reflect new conversations this user is engaging in. The name over this right panel is the name of the user whose bubble is selected in the left-hand panel. By default the owner of this\n                        \n                         Profile\n                        \n                        page is the selected user. However, you can click on any other user's bubble to filter the right-hand feed to show only conversations in which that user was involved. When you do this, the new selected user's bubble moves to the center of the panel to indicate that it is selected. In the previous screenshot, user \"Hal Bunderson\"'s bubble has been selected, so the feed updates to show only conversations in which Hal was involved.", "Preview Article": "Click here to preview", "URL Name": "360043439533", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004387", "Archived Date": "", "Language": "English", "Primary Version": "Viewing a User's Conversation Activity", "Article Total View Count": "4,653", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Viewing a User's Conversation Activity\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}