{"file_path": "../../raw_kb_v2\\article\\360043427413\\index.html", "content": {"Title": "Legal Notices", "Article Body": "Copyright © 2012-2016 Domo, Inc. All rights reserved.\n                       \n\n                        Patents\n                       \n\n\n                         ﻿\n                        \n                        Domo products are protected by United States Patents #6,972,763 and #7,769,895. Additional patents pending.\n                       \n\n\n                         ﻿\n                        \n                        Domo Trademarks\n                       \n\n                        Corda and CenterView are registered trademarks and Domo, Domo Data On-ramp, Domo Apps, Domo Cards, Domo Profile, Domo Alert, Domo Workbench, the Domo logo, Domo Advanced Builder, Domo Advanced Server, Domo Mobile, Corda Builder, Corda Server, Datafunnel, OptiMap, and PopChart are trademarks of Domo, Inc., in the United States and other countries.\n                       \n\n                        Third-Party Trademarks\n                       \n\n                        Adobe, Acrobat, and Acrobat Reader are registered trademarks of Adobe Systems Incorporated in the United States and other countries.\n                       \n\n                        iPod touch and iTunes are registered trademarks and iPhone, iPad, Mac OS, and Macintosh are trademarks of Apple Inc., registered in the United States and other countries.\n                       \n\n                        Microsoft, Active Directory, Excel, Internet Explorer, PowerPoint, and Windows are registered trademarks of Microsoft Corporation in the United States and other countries. Screenshots reprinted by permission from Microsoft Corporation.\n                       \n\n                        Oracle and Java are registered trademarks of Oracle and/or its affiliates. Other names may be trademarks of their respective owners.\n                       \n\n                        Sun and JavaScript are registered trademarks of Sun Microsystems, Inc., in the United States and other countries.\n                       \n\n                        SVG is a trademark of the World Wide Web Consortium.\n                       \n\n\n                         All other third-party brand names and product names referenced in this documentation are trade names, service marks, trademarks, or registered trademarks of their respective owners.", "Preview Article": "Click here to preview", "URL Name": "360043427413", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004345", "Archived Date": "", "Language": "English", "Primary Version": "Legal Notices", "Article Total View Count": "4,694", "": "", "Article Created Date": "10/24/2022, 9:41 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Legal Notices\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Getting Started\n              \n", "url": "/s/topic/0TO5w000000ZanlGAC"}]}