{"file_path": "../../raw_kb_v2\\article\\360043430493\\index.html", "content": {"title": "\n\n\n Projects and Tasks Best Practices\n\n\n", "article_body": "\n\nIntro\n-------\n\nThis topic lists and describes a number of best practices for setting up and maintaining projects in Domo.\n\n\n Best Practices\n----------------\n\n\n* Clearly define what constitutes a project and what is a task. For example, if you’re in a sales organization and you have 5-6 steps you’ll always do to close a sale, you can copy the same tasks into each project set up for closing a sale.\n* Make sure that there is someone assigned to each task, the task is tagged to the appropriate project “swim lane” or category, and the task has a due date. This ensures people are receiving notices of their tasks and how to manage them.\n* Although we give you a number of recommendations for project and task set up, you should always customize projects to your needs. By determining what’s going on around the project, and scope of a project, you need to determine how to organize your process so you have a clear understanding of what you’re going to execute and how people will follow through on assigned tasks.\n\nProject Template Types to set up in Domo\n------------------------------------------\n\n\n###\n Initiative/Sprint Roadmap\n\n*Use case:**\n Tracks all ongoing and future initiatives. During the scoping conversation, the business unit and consultant team should outline and prioritize all immediate projects. Projects are sorted by their prioritization. The customer business unit is responsible for adding new projects to the sprint backlog list and ordering. It is helpful to document the level of difficulty and the perceived value in the task description. Using a prioritization matrix card can help facilitate this project list.\n\n\n###\n Basic\n\n*Use case:**\n Used to show tasks that need to be done, are being worked on, or are completed. The standard template is useful for simple projects or ad-hoc requests. Does not break apart tasks into different types. Can be used effectively if the project is broken into multiple tasks (ex: Scope, Connect, Design, Data Validation, User Testing). Can be too limited if used to track an entire project.\n\n\n###\n Domo Full Deployment Project\n\n*Use case:**\n Used for initial Domo implementation. Separates out tasks by project type and milestone. Very effective for capturing high level requirements. However, this task list can be confusing to customers due to the number of swim lanes and the ambiguity around swim lane titles. Tasks should be prioritized by adding them to the top of the swimlane.\n\n\n###\n MoSCoW (Must have, Should have, Could have, and Would like but won't get)\n\n*Use case:**\n Used to prioritize requirements throughout the current project or sprint.  Task items are set into swim lanes labeled Must, Should, Could, Won’t, or Can’t depending on the level of priority.  Items in the “Must” category are highest priority items that are needed for the project to be successful.  As items are completed from the must category, the project team moves to lower priority items.  The business unit owner or project manager is responsible for reprioritizing items as the project deadline approaches completion.  Items that cannot be completed due to limitations or roadblocks can either be placed in the “Won’t” category or “Can’t” category.  Can be confusing as tasks are not broken out by task type, for example, connection tasks, qc tasks, and design tasks all mix together.\n\n\n###\n Major/Domo Center of Excellence Support\n\n*Use case:**\n Used to track non sprint related support issues handled internally by the customer Center of Excellence or MajorDomo. This process works well if you have a really strong MajorDomo/COE. You can have a set up projects and tasks list that has the issues or requirements and it will be like issues, working on, complete; if the MajorDomo is transparent and users have a problem, they’ll send a Buzz to MajorDomo, and Major Domo can essentially assign those tasks from Buzz directly. Then it will drop into the Inbox so they have a log of all the issues that are outstanding and can facilitate them or handle them without having to go to Domo Support and the MajorDomo can maintain the instance well. People can put hash tags on those posts too and say ‘help’ or ‘support’ in addition to buzzing MajorDomo, so the MajorDomo knows it’s an issue that he/she needs to log or take care of next.\n\nAssigning Tasks from Buzz\n---------------------------\n\nAssigning tasks from Buzz lets you quickly determine who is going to complete a task from a conversation you’re having in Buzz about a project.\n\nOther Best Practices Topics\n-----------------------------\n\nFor more Domo best practices, visit the following topics:\n\n Best Practices for Creating Visualization Cards\n* Best Practices for Managing DataSets\n* Best Practices for Choosing Chart Types\n* Top 10 Dashboard Design Best Practices\n* Best Practices for Standardizing Visualization Cards\n* Best Practices for Designing KPIs\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043430493\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004363\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nProjects and Tasks Best Practices\n\n", "article_total_view_count": "\n\n\n 4,886\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:45 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "projects_and_tasks_best_practices", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "projects_and_tasks", "url": "/s/topic/0TO5w000000Zao5GAC"}]}