{"file_path": "../../raw_kb_v2\\article\\360043438373\\index.html", "content": {"Title": "Form Builder App", "Article Body": "Intro\n                       \n\n\n                         Form Builder is a premium app you can use to create and edit custom forms, form templates, and questionnaires to collect feedback from your users.  Use the\n                         \n                          Form Viewer\n                         \n                         app to enter data into your forms. You can download and install both apps from the Domo Appstore. You can download Form Builder in trial mode. If you then purchase the app, Domo converts the trial version to a full version.\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The trial version of Form Builder is\n                           \n                            not\n                           \n                           feature restricted.\n                          \n\n\n\n\n\n                         Form Builder can exist on one or more Domo dashboards. Response data entered into a form using Form Viewer is stored in the app database, and then synced to the Domo Data Center. Usually, you must then\n                        \n\n                         transform the data in Domo.\n                        \n\n\n                        Response DataSets\n                       \n\n                        You can use one form that you create in Form Builder to collect data, whether in one or more instances of Form Viewer, or in Form Builder itself.\n                       \n\n                        An example is that Person A and Person B each use a separate instance of Form Viewer to enter data into the same form. Person C, who created the form in Form Builder, also enters data into the same form.\n                       \n\n                        There will be three DataSets of responses to the form: Person A's responses, Person B's responses, and Person C's responses.\n                       \n\n                        By default, these DataSets have the following naming convention:\n                       \n\n                        <\n                        \n                         form name\n                        \n                        > Responses - <\n                        \n                         GUID of form\n                        \n                        >_<\n                        \n                         GUID of instance of Form Builder or Viewer\n                        \n                        >\n                       \n\n                        To learn more about the response data, see\n                        \n                         Understanding Form Response Data.\n                        \n\n\n                        Prerequisites\n                       \n\n                        Before you can create forms, templates, or questionnaires, you need to create the following groups in your Domo instance:\n                       \n\n\n                         _FB_CreateForms_\n                        \n\n                         _FB_CreateTemplate_\n                        \n\n\n                        Each of these groups grants a unique set of permissions to its members while using Form Builder.\n                       \n\n\n                         Members of the\n                         \n                          _FB_CreateForms_\n                         \n                         group are granted permission to create and manage forms for their Domo groups.\n                        \n\n                         Members of the\n                         \n                          _FB_CreateTemplate_\n                         \n                         group are granted permission to manage all questionnaires, templates, and forms for all Domo groups and users.\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You do not need to be a member of one of these groups to enter data into a form. Only users who need to create and edit forms should be members of the groups.\n                          \n\n\n\n\n                        Configuration\n                       \n\n                        Download Form Builder from the\n                        \n                         Appstore\n                        \n                        . When you download the app, Domo creates a dashboard for it automatically. You can add additional cards for the app from the Domo Asset Library.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           When you are deploying a new card for the app, you may see an error message that states \"An occurred while fetching data from the server.\" This is because some of the underlying application data isn't created until you save the card. You can ignore this error.\n                          \n\n\n\n\n                        To use Form Builder, access the dashboard deployed for it and choose one of the tasks outlined later in this article.\n                       \n\n                        FormDefinition DataSets\n                       \n\n                        After you create your first form in Form Builder, a series of FormDefinition DataSets are created in Domo and appear in the Data Center. These DataSets contain the metadata that define the forms. You need to connect these FormDefinition DataSets to Form Viewer to use the app.\n                       \n\n                        The FormDefinition DataSets are listed below:\n                       \n\n\n                         ExportForms\n                        \n\n                         ExportGroups\n                        \n\n                         ExportTags\n                        \n\n                         ExportSubmittedUsers\n                        \n\n                         ExportSections\n                        \n\n                         ExportItems\n                        \n\n                         ExportColumns\n                        \n\n                         ExportFilters\n                        \n\n                         ExportPreviousResponseItems\n                        \n\n\n                        To learn how to connect to these DataSets in Form Viewer, see\n                        \n                         Form Viewer\n                        \n                        .\n                       \n\n                        Creating a Form\n                       \n\n                        After you have installed the app, and if you are a member of one of the\n                        \n                         _FB_CreateForms_\n                        \n                        or\n                        \n                         _FB_CreateTemplate_\n                        \n                        groups, you have access to create and manage forms.\n                       \n\n                        1. Open the Form Builder card and go to the\n                        \n                         Form\n                        \n                        tab.\n                       \n\n                        2. Select\n                        \n                         Create\n                        \n\n                         Form\n                        \n                        .\n                       \n\n\n\n\n                        The form editor displays.\n                       \n\n                        3. Define your form. See below for information on form definition.\n                       \n\n                        Basic Form Definition\n                       \n\n                        When creating a new form or managing an existing form, you can choose how users find and interact with your form by configuring the basic form definition with the following items in the form editor.\n                       \n\n\n\n                          Name  —\n                         \n                         the name of the form\n                        \n\n\n                          Description (optional) —\n                         \n                         a description of the form\n                        \n\n\n                          Tags (optional) —\n                         \n                         searchable tags so you can locate a form faster\n                        \n\n\n                          Groups (optional) —\n                         \n                         the users who are permitted to respond to your form, designated in one or more groups\n                        \n\n\n                          Response Type (required) —\n                         \n                         determines response limitations and formats\n                        \n\n\n                          Form Settings (optional) —\n                         \n                         various ways that users can interact with your form\n                        \n\n\n\n\n\n\n\n                          Response Types\n                         \n\n\n\n                        There are several different response types that govern how end users can interact with your form. Each type is appropriate for specific use cases. The following table defines four of the possible response types available in the form editor, including some notes about possible use cases.\n                       \n\n                        Bulk response is defined below the table.\n                       \n\n\n\n\n\n                            Response Type\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n                            Crowdsourced\n                            \n                            (collaborative)\n                           \n\n\n\n                            Crowdsourced responses allow multiple users to contribute to the same submission.\n                           \n\n                            When loading an active submission, users may see other users' unsubmitted responses.\n                           \n\n                            Users can save form submissions without submitting and return later to modify the submission before submitting.\n                           \n\n\n\n\n\n\n\n                            One response per user\n                           \n\n\n\n                            Each user may only submit one response.\n                           \n\n                            This type can be useful for collecting votes or obtaining other one-time responses.\n                           \n\n\n\n\n\n\n\n                            Multiple responses per user\n                           \n\n\n\n                            Users can submit multiple responses.\n                           \n\n                            This type can be useful for collecting data on multiple occasions, such as for a maintenance request.\n                           \n\n\n\n\n\n\n\n                            Multi-session form\n                           \n\n\n\n                            Users can submit multiple responses. Users may have multiple named sessions active at one time. When visiting the form, users are prompted to start a new entry or resume an existing session.\n                           \n\n                            To rename an existing session, select the session name to activate the text entry, enter the desired title, and then click away from the text input to save the new name.\n                           \n\n                            Users can save form submissions without submitting and return later to modify the submission before submitting.\n                           \n\n\n\n\n\n\n\n\n\n\n                         Bulk Response\n                        \n\n\n                        The bulk response option is not available in the\n                        \n                         Response Type\n                        \n                        menu in the form editor. To use it, follow the steps below.\n                       \n\n                        1. In the\n                        \n                         Form Settings\n                        \n                        in the form editor, check the box to\n                        \n                         Allow bulk response uploads\n                        \n                        .\n                       \n\n\n\n\n                        2. Finish configuring your form in Form Builder.\n                       \n\n                        3. In\n                        \n                         Form Viewer\n                        \n                        , select\n                        \n                         Bulk Upload\n                        \n                        .\n                        \n                        The Bulk Upload menu displays.\n                       \n\n                        4. Select\n                        \n                         Download Template\n                        \n                        .\n                       \n\n\n\n\n                        The bulk response template is formatted as a comma separated value file (.CSV). By default, the first four lines are filled and include important metadata to ensure that, when uploaded, the file and responses can be parsed and submitted correctly. In order, the default values in the template are:\n                       \n\n\n                         Section ID\n                        \n\n                         Section Name\n                        \n\n                         Question ID\n                        \n\n                         Question Name\n                        \n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can learn more about these values and the other response data in\n                           \n                            Understanding Form Response Data.\n                           \n\n\n\n\n\n                        5. Fill out your responses in the .CSV file.\n                       \n\n                        6. In Form Viewer, select\n                        \n                         Bulk Upload\n                        \n                        >\n                        \n                         Upload Bulk Responses\n                        \n                        .\n                       \n\n                        7. Upload the file containing your responses.\n                       \n\n                        8. Wait for the bulk response to process. If any errors are found, you are notified and all responses are rejected until the errors have been resolved.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           The first four lines in the bulk response template should remain unchanged. Altered templates may be rejected when submitted\n                          \n\n\n\n\n\n                        Form Settings\n                       \n\n                        This table defines each of the Form Settings available in the form editor.\n                       \n\n\n\n\n\n                            Setting\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Show submit button on every page\n                           \n\n\n\n                            Indicates whether the submit button is displayed on all pages or on only the final page of the form.\n                           \n\n\n\n\n\n\n\n                            Make all questions required\n                           \n\n\n\n\n                             If the box is checked —\n                            \n                            Users are required to enter a valid response to all questions before submitting the form (does not apply to table sections).\n                           \n\n\n                             If the box is unchecked —\n                            \n                            Users may choose not to respond to questions that are marked 'optional.'\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               If you check the\n                               \n                                Make all questions required\n                               \n                               box, you can no longer change the required setting for individual questions.\n                              \n\n\n\n\n\n\n\n\n\n\n                            Allow bulk response uploads\n                           \n\n\n\n                            Indicates whether users can perform bulk submissions (see\n                            \n                             Bulk Response\n                            \n                            ).\n                           \n\n\n\n\n\n\n\n                            Allow previous submissions to be viewed\n                           \n\n\n\n                            Indicates whether users can see their own previous submitted responses to a form.\n                            \n\n                            You can\n                            \n                             Select preview fields\n                            \n                            to allow user to configure the fields that are displayed on the\n                            \n                             Previous Submissions\n                            \n                            page.\n                           \n\n\n\n\n\n\n\n                            Allow previous submissions to be edited\n                           \n\n\n\n                            Indicates whether users can edit previous submitted responses to a form.\n                           \n\n                            Is not available unless\n                            \n                             Allow previous submissions to be viewed\n                            \n                            is enabled.\n                           \n\n\n\n\n\n\n                           Allow previous submissions to be deleted\n                          \n\n\n                            Indicates whether users can delete previous submitted responses to a form.\n                           \n\n                            Is not available unless\n                            \n                             Allow previous submissions to be viewed\n                            \n                            is enabled.\n                           \n\n\n\n\n\n\n\n                        Sections\n                       \n\n                        After filling out the form definition, before adding questions to your form, you need to add at least one section. Each section you define displays as a page of the form when end users are entering data. You can use sections to your advantage if you keep related questions in the same section.\n                       \n\n                        Form Builder supports two types of sections:\n                       \n\n\n\n                          Item Sections\n                         \n\n                          —\n                         \n                         support standard question types such as text inputs and dropdown selections\n                        \n\n\n                          Table Sections\n                         \n\n                          —\n                         \n                         use a Table Card to prompt users for itemized input\n                        \n\n\n\n\n                          Adding a Section\n                         \n\n\n\n                        In the section management menu to the right of the form editor, select\n                        \n\n\n\n                         A\n                        \n\n                         dd Item Section\n                        \n                        or\n                        \n\n                         A\n                        \n\n                         dd Table Section\n                        \n                        .\n                       \n\n\n\n\n                        The new unnamed section displays below the form editor.\n                       \n\n                        We recommend you name each section by entering a\n                        \n                         Section Name\n                        \n                        to keep things organized.\n                       \n\n\n\n\n\n\n                          Reordering Sections\n                         \n\n\n\n                        1. Select\n                        \n\n                         R\n                        \n\n                         eorder\n                        \n                        in the section management menu.\n                        \n                        The\n                        \n                         Reorder Sections\n                        \n                        modal displays.\n                        \n\n\n\n                        2. Hover over the\n                        \n                        click-and-drag handle for the section you want to move til the cursor changes to a hand.\n                       \n\n                        3. Click on the handle and drag the section to the position that you want.\n                       \n\n\n\n                          Deleting a Section\n                         \n\n\n\n                        1. Find the section you wish to remove and select\n                        \n\n                         More Options\n                        \n                        .\n                       \n\n\n\n\n                        2. Select\n                        \n\n                         D\n                        \n\n                         elete\n                        \n                        .\n                       \n\n                        A dialog displays to confirm deletion. Selecting\n                        \n                         Delete\n                        \n                        again deletes the section. This action cannot be undone.\n                        \n\n\n\n\n\n                         Item Sections\n                        \n\n\n                        The following table defines the item and question types supported in item sections.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Icon\n                           \n\n\n\n                            Name\n                           \n\n\n\n                            Description\n                           \n\n\n                           Multi Value\n                           \n                           Response Allowed\n                          \n\n\n\n\n\n\n\n\n                           Title and Description\n                          \n\n\n                            Additional metadata and contextual information.\n                           \n\n                            Can be used to create logical breaks within a single section or simply to provide additional information.\n                           \n\n\n                           No\n                          \n\n\n\n\n\n\n                           Text\n                          \n\n                           Prompts the user for free-form text response.\n                          \n\n                           No\n                          \n\n\n\n\n\n\n                           Dropdown\n                          \n\n                           Limits user input to a list of configurable options.\n                          \n\n                           Yes\n                          \n\n\n\n\n\n\n                           Date\n                          \n\n                           Prompts the user for a date or date range.\n                          \n\n                           Yes\n                          \n\n\n\n\n\n\n                           Image\n                          \n\n                           Displays an image in your form (does not support user input).\n                          \n\n                           No\n                          \n\n\n\n\n\n\n                           Lookup\n                          \n\n                           A dropdown question for which the list of options is generated from the unique values of a Table Card (supports PDP).\n                          \n\n\n                            Yes\n                           \n\n\n\n\n\n\n\n                           File Attachment\n                          \n\n                           Allows the user to attach a file as part of their response.\n                          \n\n\n                            No\n                           \n\n\n\n\n\n\n\n                        To choose an item type, select the icon in the item management menu at the bottom of the section definition. For more more information about item and question types, see\n                        \n                         Advanced Item Configuration\n                        \n                        below.\n                       \n\n\n\n\n\n                         Table Sections\n                        \n\n\n\n\n\n                        Table sections leverage Domo Table Cards to display data and prompt users for input in a row/column format.\n                       \n\n                        When you select a table section, select the\n                        \n                         Table Card\n                        \n                        menu in the section and find and select the page/dashboard where your Table Card resides.\n                       \n\n\n\n\n                        Then use the next menu control to find the Table Card from the page/dashboard you selected. Choose the Table Card you want to use and select\n                        \n                         Connect\n                        \n                        to begin the connection process.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Table sections support PDP.\n                          \n\n\n\n\n\n                         Connecting a Table Card\n                        \n\n\n                        After you select the the Table Card you want to connect to your table section, a modal displays.\n                       \n\n                        You must select one or more columns from the table whose values, when combined, can be used to uniquely identify every row. Some Table Cards may have a unique id column while others may require multiple identifier columns. In the example below, the identifier columns are: Region, State, and City.\n                       \n\n                        After you've chosen your identifier column(s), select\n                        \n                         Connect\n                        \n                        to complete the connection process.\n                       \n\n\n\n\n\n                         Table Columns\n                        \n\n\n                        After the connection process is complete, the table section of your form in Form Builder displays the list of columns that make up the Table Card. You can change the input type of a column by choosing one of the available options in the menu option on the right hand side of the column's list entry.\n                       \n\n\n\n\n                        The following table describes the input types that table columns support.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Identifier columns cannot be configured as input columns.\n                          \n\n\n\n\n\n\n\n\n                            Input Type\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Custom Column Supported\n                           \n\n\n\n                            Existing Column Supported\n                           \n\n\n\n\n\n\n                           None\n                          \n\n\n                            No input control\n                           \n\n                            Displays existing data from Table Card\n                           \n\n\n\n                            No\n                           \n\n\n\n                            Yes\n                           \n\n\n\n\n                           Checkbox\n                          \n\n                           Select one or more rows from the table by checking a box\n                          \n\n\n                            Yes\n                           \n\n\n\n\n                             Yes\n                            \n\n\n\n\n\n                           Dropdown\n                          \n\n\n                            Limit user input to a set of values configured in the form editor\n                           \n\n\n\n\n\n\n                            Yes\n                           \n\n\n\n                            Yes\n                           \n\n\n\n\n                           Lookup\n                          \n\n\n                            Limit user input to the unique values from the column of a table card; select a page, card, and column to configure the lookup options\n                           \n\n\n\n\n\n\n\n\n                            Yes\n                           \n\n\n\n\n\n                            Yes\n                           \n\n\n\n\n                           Single Select (radio)\n                          \n\n                           Choose/mark a single row from the table\n                          \n\n\n                            Yes\n                           \n\n\n\n                            Yes\n                           \n\n\n\n\n                           Text\n                          \n\n                           Allows freeform text entry\n                          \n\n\n                            Yes\n                           \n\n\n\n                            Yes\n                           \n\n\n\n\n                           Validated Input\n                          \n\n\n                            Detects the type assigned to the table card's column to display the correct input control type.\n                           \n\n                            Supported types:\n                           \n\n\n                             Text - freeform, no validation enforced\n                            \n\n                             Date (short) - does not support time value\n                            \n\n                             Date (datetime) - supports time values\n                            \n\n                             Numeric (long) - does not support decimal values\n                            \n\n                             Numeric (decimal/double) - supports decimal values\n                            \n\n\n\n\n                            No\n                           \n\n\n\n                            Yes\n                           \n\n\n\n\n\n\n\n                        You may add custom columns by selecting\n                        \n                         A\n                        \n\n                         dd column\n                        \n                        at the bottom of the column list. To change the name of a custom column, hover over the space where the name should be and select the gray box to activate the text editor. Enter the desired name then click anywhere outside the text input.\n                       \n\n\n\n\n                        To delete a custom column or to change the visibility of an existing column, hover over the left side of a column's list entry and select\n                        \n\n                         Delete\n                        \n                        or\n                        \n\n                         Hide Column\n                        \n                        .\n                       \n\n\n\n\n\n                         Table Filters (Filter Fields)\n                        \n\n\n                        Under the\n                        \n                         Filter field\n                        \n                        sub-menu, you can manage fields that can be used to filter the table rows. Filter fields are dropdown menus (select boxes) that contain the unique values from their assigned columns. When a user changes the selection in these fields and applies the new selection, a filtered view of the table card is loaded so that only rows that match their filter configuration are displayed. To add a filter field, select a column from the\n                        \n                         filter field\n                        \n                        input control and click\n                        \n                         add filter\n                        \n                        . To allow users to select multiple values in a single filter, check the\n                        \n                         multi-select\n                        \n                        box on the right side of the list entry.\n                       \n\n\n\n\n\n                         Table Settings\n                        \n\n\n                        To help manage how your table section is displayed and used, table sections support the following settings:\n                       \n\n\n\n\n                           Setting\n                          \n\n                           Description\n                          \n\n\n\n                           Freeze identifier columns\n                          \n\n\n                            Freezes the identifier columns to the left side of the table so they are always visible.\n                           \n\n                            Aids users in identifying the distinct row which is being viewed or modified.\n                           \n\n\n\n\n                           Interdependent filter fields\n                          \n\n                           Causes the options in each table filter field to be filtered based on preceding selections.\n                          \n\n\n\n                           Prefer page filters over filter fields\n                          \n\n\n                            If enabled, the table is filtered based on the Page Filter configuration, allowing for a more rich filtering experience.\n                           \n\n                            For instructions to enable Page Filters on your forms, see\n                            \n                             Using Page Filters\n                            \n                            .\n                           \n\n\n\n\n\n                        Advanced Item Configuration\n                       \n\n                        The following table displays configuration supported by the various item and question types:\n                       \n\n\n\n\n\n                            Type of item/question\n                           \n\n\n\n                            Configuration\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            All item and question types\n                           \n\n\n\n                            Descriptions\n                           \n\n\n\n                            Provides additional information and context for a question.\n                           \n\n\n\n\n\n                            Required questions\n                           \n\n\n\n\n\n\n\n                                All items that take user input can be flagged as\n                                \n                                 required\n                                \n                                , preventing form submission until a response has been provided ('title and description' and 'image' items do not support the\n                                \n                                 required\n                                \n                                setting as they do not take user input).\n                               \n\n                                Each question can be marked as required individually or all questions can be marked simultaneously by using the form level setting (see\n                                \n                                 Form Settings\n                                \n                                ).\n                               \n\n\n\n\n\n\n\n\n\n                            Text questions\n                           \n\n\n\n                            Multiline\n                           \n\n\n                           Use the\n                           \n                            Multiline\n                           \n                           setting to display a larger text input (textarea).\n                          \n\n\n\n\n                            Dropdown questions\n                           \n\n\n\n                            Multiselect\n                           \n\n\n                           Enable the\n                           \n                            Multiselect\n                           \n                           setting to allow users to choose more than one value for their response.\n                          \n\n\n\n\n                            Explanation field\n                           \n\n\n                           To prompt the user for additional information about their selection, you can add an explanation field by clicking\n                           \n                           to open the\n                           \n                            additional options\n                           \n                           menu and choosing\n                           \n                            include explanation field\n                           \n                           . You can choose the prompt's message by entering your desired note in the newly displayed text box. If left empty, the default message of 'Please explain your response' will be used.\n                          \n\n\n\n\n                            Date questions\n                           \n\n\n\n                            Date Range\n                           \n\n\n                           Allows users to select a date range (start and end date) by enabling the\n                           \n                            date range\n                           \n                           setting.\n                          \n\n\n\n\n                            Lookup questions\n                           \n\n                            To configure a lookup question select a page, card, and column from which to retrieve the options displayed in the select/input control.\n                           \n\n\n\n                            Use Page Filters to filter available options\n                           \n\n\n                           To quickly and easily locate the desired value(s), you can use page filters to narrow down the option list (see\n                           \n                            Using Page Filters\n                           \n                           for setup instructions).\n                          \n\n\n\n\n                            Filter based on preceding lookup question responses\n                           \n\n\n\n                            When you have several lookup questions\n                            \n                             built from the same table card\n                            \n                            in the same section, you can build a chain of dependence that uses the selected value of a preceding lookup question to filter the options available in subsequent lookup questions. When building the chain of dependence, here are some things to keep in mind:\n                           \n\n\n                             Lookup questions can only be made dependent on other lookup questions built from\n                             \n                              different columns of the same table card\n                             \n\n\n                             Lookup questions can only be made dependent on other lookup questions in the same section\n                            \n\n                             If the order in which the lookup questions appear in the section is altered, the chain of dependence may be broken and must be rebuilt for the questions directly affected by the change in order\n                            \n\n                             When viewing the dependent lookup questions in an active response session, child lookup questions are disabled (preventing user input) until their parent has a response\n                            \n\n\n                            For a configuration example see\n                            \n                             Configuration Examples\n                            \n                            >\n                            \n                             Dependent Lookup Questions\n                            \n                            .\n                           \n\n\n\n\n\n                            File attachment\n                           \n\n\n\n                            Allowed file types\n                           \n\n\n\n                            You can restrict the format of the uploaded file to ensure it's always the correct type. If no type is selected, any file of a format supported by the Domo file service will be allowed.\n                            \n\n\n\n\n\n\n\n                             v\n                             \n\n\n                                Note:\n                               \n                               When a user submits a file attachment, use this URL to read the file from inside your instance of Domo:\n                               \n                                https://{INSTANCE}.domo.com/api/data/v1/data-files/{FILE_ID}\n                               \n                               .\n                               \n                               INSTANCE is the user's individual instance of Domo, and FILE_ID is the unique identifier of the form returned in the output DataSet.\n                               \n                               You may want to consider generating the complete URL through a Beast Mode or ETL using concatenation.\n                              \n\n\n\n\n\n\n\n\n                        Using Page Filters\n                       \n\n                        To make your forms feel like an integrated part of Domo, the Form Builder and Form Viewer applications both support Page Filters. Follow the steps below to connect your DataSet to an application and enable Page Filters.\n                       \n\n                        Connecting Data to Form Builder and Form Viewer\n                       \n\n                        1. Open Form Builder or Form Viewer.\n                       \n\n                        2. Select\n                        \n                         Card options\n                        \n                        .\n                       \n\n                        3. Select\n                        \n                         Edit Card\n                        \n                        .\n                        \n                        The card editor opens.\n                       \n\n                        4. Scroll to the bottom and find the list of\n                        \n                         FilterConfiguration\n                        \n                        DataSets.\n                        \n                        Both the Form Builder and Form Viewer have 25 placeholder DataSets you can change for your own DataSets which you want to use for table and lookup filtering.\n                       \n\n                        5. Select one of the unused\n                        \n                         FilterConfiguration\n                        \n                        DataSets.\n                       \n\n                        6. Under\n                        \n                         Select DataSet\n                        \n                        , select the DataSet.\n                        \n                        The\n                        \n                         Select a DataSet\n                        \n                        modal displays.\n                       \n\n                        7. Search for and select the DataSet you want to connect to your application.\n                       \n\n                        8. Select\n                        \n                         Choose DataSet\n                        \n                        .\n                       \n\n                        9. Select\n                        \n                         S\n                        \n\n                         ave & Finish\n                        \n                        to close the editor.\n                        \n                        Now that you've connected your DataSet to the application, its Page Filters are also applied to the relevant queries.\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           Page Filters are only applied to lookup questions or table sections if the Table Card used to create the lookup question/table section matches the DataSet targeted by the Page Filters.\n                          \n\n\n\n\n                        Configuration Use Case\n                       \n\n                        Consider the following Table Card:\n                       \n\n\n\n\n                        Using this Table Card, we can create a lookup question for each column:\n                       \n\n\n\n\n\n                            Region Lookup Question\n                           \n\n\n\n\n\n\n\n\n                            State Lookup Question\n                           \n\n\n\n\n\n\n\n\n                            City Lookup Question\n                           \n\n\n\n\n\n\n\n\n\n\n                        If we want to restrict the list of states to those in the region selected by the user in the\n                        \n                         Region\n                        \n                        lookup question, we can choose\n                        \n                         Region\n                        \n                        in the menu labeled\n                        \n                         Use previous lookup question response to filter available options\n                        \n                        under the\n                        \n                         State\n                        \n                        lookup question. The new\n                        \n                         State\n                        \n                        lookup question configuration:\n                       \n\n\n\n\n\n\n                        Similarly, if we want to restrict the available cities to those in the state chosen by the user in the\n                        \n                         State\n                        \n                        lookup question, we can configure the\n                        \n                         City\n                        \n                        lookup question like this:\n                       \n\n\n\n\n\n\n                        Now, when the user views these questions in an active session, they'll see the following:\n                       \n\n\n\n\n\n\n                        Making the\n                        \n                         State\n                        \n                        dependent on the\n                        \n                         Region\n                        \n                        also disables the\n                        \n                         State\n                        \n                        input until the user has chosen a region. Additionally, the available\n                        \n                         State\n                        \n                        values are limited to those that correspond to the selected\n                        \n                         Region\n                        \n                        while the\n                        \n                         City\n                        \n                        values are limited to those corresponding with the selected\n                        \n                         State\n                        \n                        :", "Preview Article": "Click here to preview", "URL Name": "360043438373", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004981", "Archived Date": "", "Language": "English", "Primary Version": "Form Builder App", "Article Total View Count": "5,547", "": "", "Article Created Date": "11/1/2022, 11:18 PM", "First Published Date": "11/1/2022, 11:23 PM"}, "title": "\n              Form Builder App\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}