{"file_path": "../../raw_kb_v2\\article\\360046864914\\index.html", "content": {"title": "\n\n\n Resolving Issues with Failing Jobs in Workbench 4\n\n\n", "article_body": "\n\n\n**Important:**\n Support for Workbench 4 ended on\n **April 15, 2021**\n . Workbench may continue to run on installed machines, but it will no longer receive feature enhancements and security updates. When issues are encountered in Workbench 4, the recommended course of action from the Domo Support team will be to upgrade to the latest version of Workbench 5.\n\nIntro\n-------\n\nIf you find that your Workbench jobs are failing, the steps you should take depend on whether the jobs are failing a) on an automated schedule while successfully running manually, or b) on a fixed interval, i.e. jobs run for a specific number of minutes and then fail. This article describes in detail what you should do in both scenarios.\n\n##\n Scenario #1: Jobs Are Failing on an Automated Schedule\n\n\n If you encounter the issue of Workbench Jobs failing on an automated schedule while successfully running manually, you may consider checking permissions and rights for the Windows Workbench Service.\n\n\n When running a Job manually in Workbench, Windows recognizes this as a user-requested action and treats it accordingly. Any local permissions granted to this user is passed down through this user-requested action. If you’re a local Admin, the Job is run with “Admin” rights. Conversely, a Workbench Job running on an automated schedule is initiated by the Workbench service itself. Depending on the credentials used to authorize the Workbench service, it may or may not have elevated permissions sufficient to execute that same Job. The schedule kicks off the job, but fails in lacking proper permissions.\n\n\n By default, the Workbench service starts with “Local System” permissions. Depending on your IT security policies, this user may be denied the rights necessary to execute tasks or access data sources within your network.\n\n\n A few possible solutions:\n\n\n* As it is considered best practice to run the Workbench service as “Local System,” your IT group may be able to modify the local security policies of your PC to 1) allow the service to access the internet, incoming and outgoing on ports 80 and 443, and 2) allow the service to execute tasks as an Administrator.\n* If the above option is not feasible, your IT group can create a service account with full Admin rights at either the local or domain level. This service account will be used in lieu of “Local System.” To switch the Workbench service to the new service account, do the following:\n\n1. Click the Start button, then type “services.”\n\t2. In Services, locate and right-click on\n\t **Domo Workbench**\n\t , then select\n\t **Properties**\n\t .\n\t3. Click the\n\t **Log On**\n\t tab.\n\t4. Change the selected radio button to\n\t **This account**\n\t .\n\t5. Enter the credentials supplied by your IT group.\n\t6. Restart the service when prompted.\n\n\n\t If the service starts successfully, the credentials were accepted.\n* If your IT group is unable to modify the permissions for\n **Local System**\n or create a service account, you can use your own credentials, either local or domain.\n\n\n**Note:**\n T\n\nhis is\n *not*\n a recommended configuration. If a user’s password changes, or they leave the company, the service will fail to start and Workbench jobs will fail.\n\n\n###\n\n\n Scenario #2: Jobs Are Failing at a Fixed Interval\n\nYou may find that a Job runs for a specific number of minutes and then fails each time.\n\n\n**To fix this problem,**\n\n. Check the logs for the Job.\n2. Find the point in the logs at which the query starts (look for the query string), and make note of the time stamp.\n3. Go down the log to the point of the error and find the time stamp there.\n4. Compare the difference.\n\nIf it’s five minutes, then there is a good chance that the execution query time needs to be increased in your Workbench Job because it is taking longer than five minutes to be passed. (Workbench has a default query execution timeout of 300 seconds/5 minutes.)\n\n*Note:**\n\nThere may be additional points of configuration for query timeout in your ODBC driver settings.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360046864914\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004766\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nResolving Issues with Failing Jobs in Workbench 4\n\n", "article_total_view_count": "\n\n\n 4,809\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:30 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "resolving_issues_with_failing_jobs_in_workbench_4", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_4", "url": "/s/topic/0TO5w000000ZapSGAS"}]}