{"file_path": "../../raw_kb_v2\\article\\360043427793\\index.html", "content": {"Title": "Editing a SQL DataFlow", "Article Body": "The options available when editing an existing SQL\n                        \n                        DataFlow\n                        \n                         are almost the same as those available when you create one.\n                        \n\n\n\n                         To edit a DataFlow,\n                        \n\n\n\n\n                          Click\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Click\n                          \n                          in the left-hand navigation pane.\n                          \n                          The\n                          \n                           DataFlows\n                          \n                          tab appears. This tab lists all\n                          \n                           DataFlows\n                          \n                          in Domo and can be filtered using a variety of filter criteria.\n                         \n\n\n\n                          Locate the DataFlow you want to edit in the list then click it.\n                         \n\n\n                         Click\n                         \n                         on the right-hand side of the screen.\n                         \n                         The\n                         \n                          Edit DataFlow\n                         \n                         view for this DataFlow opens.\n                        \n\n\n                          Make the desired edits to the DataFlow. For information about available options, see the previous section.\n                         \n\n\n\n                          (Optional) If you want to automatically run the DataFlow when the input DataSets are updated, check the boxes for those DataSets at the bottom of the screen.\n                         \n\n\n\n                          (Conditional) Do one of the following to save your DataFlow:\n                         \n\n\n\n                            If you want to run the script that outputs this DataFlow to usable DataSets in Domo, click\n                            \n                             Save and Run\n                            \n                            , enter a version description if desired, then click\n                            \n                             Save\n                            \n                            to confirm.\n                            \n                            This starts the process of generating DataSets from the DataFlow, or updating the DataSets if they have already been generated. This generation/updating process may take from a minute to an hour or more, depending on the size of the input DataSets.\n                           \n\n\n\n                            If you want to save your progress on this DataFlow without outputting it to DataSets, updating the DataSets at this time, and allow you to continue to edit the DataFlow, click\n                            \n                             Save\n                            \n                            , enter a version description if desired, then click\n                            \n                             Save\n                            \n                            to confirm. You can run the DataFlow to output DataSets at any time by mousing over the card for the DataFlow in the\n                            \n                             DataFlows\n                            \n                            listing, clicking\n                            \n                            , and selecting\n                            \n                             Run\n                            \n                            .\n                           \n\n\n                           If you want to save this DataFlow without outputting it to DataSets or updating the DataSets at this time, click\n                           \n                            Save and Close\n                           \n                           , enter a version description if desired, then click\n                           \n                            Save\n                           \n                           to confirm. You can run the DataFlow to output DataSets at any time by mousing over the card for the DataFlow in the\n                           \n                            DataFlows\n                           \n                           listing, clicking\n                           \n                           , and selecting\n                           \n                            Run\n                           \n                           .\n                          \n\n\n\n\n                        When you save a DataFlow, an entry for this version is added to the\n                        \n                         Versions\n                        \n                        tab in the Details view for the DataFlow. If you entered a description when saving, that description is shown in the entry for the DataFlow. For more information about versions, see\n                        \n                         Viewing the Version History for a DataFlow\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043427793", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004590", "Archived Date": "", "Language": "English", "Primary Version": "Editing a SQL DataFlow", "Article Total View Count": "4,939", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Editing a SQL DataFlow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               SQL DataFlows\n              \n", "url": "/s/topic/0TO5w000000Zao9GAC"}]}