{"file_path": "../../raw_kb_v2\\article\\360042930534\\index.html", "content": {"Title": "Apache Kafka Connector", "Article Body": "Intro\n                       \n\n                        Apache Kafka is a streams messaging platform built to handle high volumes of data very quickly. Domo's Kafka Connector lets you pull information on messaging topics, topic data, and partitions so that you can cut through the noise and focus on the communication that is most vital. To learn more about the Kafka API, visit their page (\n                        \n                         https://kafka.apache.org/documentation/\n                        \n                        ).\n                        \n\n\n\n                        You connect to your Kafka account in the Data Center. This topic discusses the fields and menus that are specific to the Kafka connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Kafka account and create a DataSet, you must have the server name or IP address of your Kafka server. You must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n                        \n                         Whitelisting IP Addresses for Connectors\n                        \n                        .\n                       \n\n                        Connecting to Your Kafka Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Kafka Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Kafka account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Kafka Server\n                          \n\n                           Enter the server name or IP address of your Kafka server.\n                          \n\n\n\n\n\n                         Once you have entered valid Kafka credentials, you can use the same account any time you go to create a new Kafka DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Kafka report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Partitions\n                               \n\n\n\n                                Returns a list of partitions for a selected topic.\n                               \n\n\n\n\n\n                                Topics\n                               \n\n\n\n                                Returns a list of available topics.\n                               \n\n\n\n\n\n                                Topics Data\n                               \n\n\n\n                                Returns all data for the selected topic.\n                               \n\n\n\n\n\n\n\n\n\n                            Topic Name\n                           \n\n\n\n                            Select the topic you want to retrieve data for.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042930534", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003406", "Archived Date": "", "Language": "English", "Primary Version": "Apache Kafka Connector", "Article Total View Count": "4,759", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Apache Kafka Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}