{"file_path": "../../raw_kb_v2\\article\\1500011338741\\index.html", "content": {"title": "\n\n\n Snowflake OAuth Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Snowflake OAuth Writeback Connector makes it easy to bring all your data into Domo and normalize it, then send it back to Snowflake while simultaneously making it available for queries. If you are already using Snowflake as a data warehousing solution, this connector helps you use Domo in conjunction with it to get the most from your data. To use this connector, you must have your Snowflake account name (domain), and the client id and client secret\n\nprovided by Snowflake when the client is registered\n\n. For more information about the Snowflake API, go to\n\nhttps://docs.snowflake.net/manuals\n\n.\n\n\n You connect to your Snowflake account in the Data Center. This topic discusses the fields and menus that are specific to the Snowflake OAuth Writeback connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nBest Practices\n----------------\n\n\n**Important:**\n Snowflake asserts your need to manually re-connect your Domo account every time the account expires. The Snowflake integration controls how often the account will expire. If it is set to expire the refresh tokens every 90 days, then you will need to reconnect the account every 90 days. If you would like to increase the refresh timeout to more than 90 days, then you will need to contact the\n **Snowflake Support**\n , and they can increase the maximum timeout from 90 days to 1 year.\n\nPrerequisites\n---------------\n\nTo connect to your Snowflake database account and create a DataSet, you must have the following:\n\n The full name of your account (provided by Snowflake). This is the portion of your Snowflake URL immediately following https://.\n\n\n Note that your full account name may include additional segments that identify the region and cloud platform where your account is hosted. The following table provides account name examples by cloud platform/region. For each row, it assumes your account name is \"xy12345.\"\n* The Client ID and Client Secret provided by Snowflake when the client is registered.\n\n\n**Important**\n : You will need the following permissions on Snowflake:\n * CREATE TABLE\n* COPY INTO\n* PUT\n* CREATE FILE FORMAT\n* REMOVE\n* LIST\n\n\n Configuring the connection\n-----------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the\n\nSnowflake OAuth Writeback\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Snowflake account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Account Name\n  |\n Enter the account name for your Snowflake account. For information about finding your account name, see \"Prerequisites.\"\n  |\n|\n Client ID\n  |\n Enter your Client ID provided by Snowflake when the client is registered.\n  |\n|\n Client Secret\n  |\n Enter your Client Secret provided by Snowflake when the client is registered.\n  |\n|\n Role\n  |\n Enter your role.\n  |\n\n\n Once you have entered valid Snowflake credentials, you can use the same account any time you go to create a new Domo-Snowflake connection. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\n\n This pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Input DataSet ID\n  |\n Enter the DataSet ID (GUID) for the DataSet you want to copy to Snowflake. You can find the ID by opening the details view for the DataSet in the Data Center and looking at the portion of the URL following\n\ndatasources/\n\n. For example, in the URL\n\n\n https://mycompany.domo.com/datasources/845305d8-da3d-4107-a9d6-13ef3f86d4a4/details/overview\n\n\n , the DataSet ID is\n\n845305d8-da3d-4107-a9d6-13ef3f86d4a4\n\n.\n  |\n|\n Select Table Name\n  |\n Select how you want to name the table where data will be copied.\n * ****Use Input DataSet GUID-****\n The table name will be the number you entered for\n\n\n**Input**\n****DataSet ID****\n .\n* **Enter Table Name-**\n You will give the table a custom name in the\n ****Custom Table Name****\n field.\n |\n|\n Enter Table Name\n  |\n Enter the name of the Snowflake table you want your data copied to (spaces and special characters will be replaced with underscores).\n  |\n|\n Warehouses\n  |\n Select the warehouse containing the table you want to send data to.\n  |\n|\n Databases\n  |\n Select the database containing the table you want to send data to.\n  |\n|\n Database Schema\n  |\n Select the database schema containing the data you want to retrieve.\n  |\n|\n Use All Caps for Column Names and Table Name\n  |\n\nSelect 'True' if you want to write back your column names and table name in ALL CAPS so the names are case insensitive within Snowflake; otherwise, select 'False.'\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n###\n When should I use this connector?\n\nThis connector allows you to write data from a Domo dataset to a Snowflake instance. The connector uses a user-defined app in Snowflake to support OAuth authentication.\n\n###\n\nI am receiving an error saying, \"OAuth access token expired.\" Why?\n\n\n To avoid this error, you need to refresh the token. Snowflake asserts your need to manually re-connect your Domo account every time the account expires. The Snowflake integration controls how often the account will expire. If it is set to expire the refresh tokens every 90 days, then you will need to reconnect the account every 90 days. If you would like to increase the refresh timeout to more than 90 days, then you will need to contact the\n **Snowflake Support**\n , and they can increase the maximum timeout from 90 days to 1 year.\n\n\n####\n\nWhat kind of credentials do I need to power up this connector?\n\n\n You need the full name of your account, and the client ID and client secret provided by Snowflake when the client is registered. You may also provide your role.\n\n\n####\n\nAre there any API limits I should be aware of?\n\nThis depends on your server configuration.\n\n###\n\nHow frequently will my data update?\n\nDataSets can run as often as every 15 minutes. However, depending on the runtime of the query, DataSets may need to run less frequently.\n\n###\n How do I find the Input Dataset ID?\n\nYour Domo input dataset id is in the URL of the dataset you are exporting data from.\n\n\n Example:\n\nhttps://customer.domo.com/datasources/\n\n*aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee**\n /details/settings\n\n###\n\nWhy can't I connect to my Snowflake database? Do I need to whitelist any IP addresses?\n\nBefore you can connect to a Snowflake database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses in Domo\n\n.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500011338741\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003999\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSnowflake OAuth Writeback Connector\n\n", "article_total_view_count": "\n\n\n 4,713\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "snowflake_oauth_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}