{"file_path": "../../raw_kb_v2\\article\\360043427893\\index.html", "content": {"Title": "Separating Staging and Production Data", "Article Body": "It can be valuable to separate staging data, used for development and testing, from production data, which power the cards and dashboards that your users see. This allows for ample testing and changes to be made on the staging DataSets while not affecting the production DataSets until you are ready to implement those changes.\n                       \n\n                        This would be used for DataFlows that may need editing but you don't want the output production data to change until you know the changes made accomplish the intended goals.\n                       \n\n\n                         To separate staging and production data,\n                        \n\n\n                        You can\n                        \n                         create a copy\n                        \n                        of your DataFlow. By making a DataFlow copy, you also create a copy of your output DataSet.  This method allows you to make any change to the copy DataFlow and not affect your original production DataSet. Also, you can keep the original DataFlow on its scheduled update time so users are not without the newest data while you are testing.\n                       \n\n                        Once you are happy with the changes made and there are no issues with the output data, you will want to recreate those transforms in your production DataFlow. This is the most efficient way of making changes to a DataFlow and with zero interruption of your production DataFlow.", "Preview Article": "Click here to preview", "URL Name": "360043427893", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004554", "Archived Date": "", "Language": "English", "Primary Version": "Separating Staging and Production Data", "Article Total View Count": "4,681", "": "", "Article Created Date": "10/24/2022, 10:14 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Separating Staging and Production Data\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               DataFlow Management\n              \n", "url": "/s/topic/0TO5w000000ZanUGAS"}]}