{"file_path": "../../raw_kb_v2\\article\\000005178\\index.html", "content": {"Title": "ADLS Gen 2 OAuth Writeback Connector", "Article Body": "Intro\n                       \n\n                        Azure Data Lake Storage is Microsoft's optimized storage solution for big data analytics workloads. A fundamental part of Data Lake Storage Gen2 is the addition of a hierarchical namespace to Blob storage. Use this connector to bring-in data from Azure storage into Domo for creating visual insights on the data. Azure Data Lake Gen2 OAuth WriteBack connector provides file system semantics, file-level security, and scale. It makes Azure Storage the foundation for building enterprise data lakes on Azure. It allows you to easily manage massive amounts of data and helps to speed up your transition from proof of concept to production. Azure Data Lake Storage Gen2 is a set of capabilities dedicated to big data analytics, built on Azure Blob storage. Azure Data Lake Storage Gen2 is the result of converging the capabilities of the two existing storage services, Azure Blob storage and Azure Data Lake Storage Gen1. Use Domo's prebuilt Azure Data Lake Storage Gen2 WriteBack connector that connects with Azure Active Directory to export your data from a Domo dataset to your Microsoft Azure Data Lake Storage Gen2. For more information about Microsoft Azure Data Lake Gen2, see\n                        \n                         https://docs.microsoft.com/en-us/azure/storage/blobs/data-lake-storage-introduction\n                        \n                        .\n                       \n\n                        You export data to a Azure Data Lake Gen2 in the Data Center. This topic discusses the fields and menus that are specific to the Microsoft Azure Data Lake Gen2 Writeback connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n                          \n\n\n\n\n\n\n                        Prerequisites\n                       \n\n                        To configure this connector, you need the following:\n                       \n\n\n\n                          Your client ID (GUID) and secret key of the client web app obtained from Azure Active Directory configuration\n                         \n\n\n\n                          Your Microsoft Azure Data Lake Storage account name\n                         \n\n\n\n                          Your Tenant ID\n                         \n\n\n                         Client Secret Key\n                        \n\n\n                        Configuring Your Azure App\n                       \n\n                        To create a connection with your Microsoft Exchange Metrics account, you must first create a Microsoft Azure Web App to obtain the necessary client ID and secret.\n                       \n\n\n\n                          To configure an Azure App\n                         \n\n                        :\n                       \n\n\n\n                          Login into\n                          \n                           Azure Portal\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n\n                            Azure Active Directory > App Registrations > New Registration\n                           \n\n                          .\n                         \n\n\n\n\n\n\n                        3. Fill out the registration form as follows:\n                       \n\n\n\n                          Name: Enter name for your application.\n                         \n\n\n\n                          Supported account types: Select an option to specify who can use this application or access this API.\n                         \n\n\n\n                          Redirect URI: Enter the redirect URI. The authentication response is sent to this URI after successfully authenticating the user. Providing the URI at this stage is optional and it can be changed later, but a value is required for most of the authentication scenarios.\n                         \n\n\n\n\n\n\n                        4. Click\n                        \n\n\n\n                            Register\n                           \n\n\n\n                        . An overview of your registered App will appear. The\n                        \n\n                          Application ID\n                         \n\n                        that appears here is the\n                        \n\n                          Client ID\n                         \n\n                        you will enter in the\n                        \n\n                          Credentials\n                         \n\n                        pane in Domo.\n                       \n\n                        5. Click\n                        \n\n\n\n                            API Permissions >> +Add a permission\n                           \n\n\n\n                        .\n                       \n\n                        6.\n                        \n\n                          Request API permissions\n                         \n\n                        section appears. Add the API permissions for your application.\n                       \n\n\n\n\n                        7. Now, click on\n                        \n\n\n\n                            Certificates and secrets\n                           \n\n\n\n                        . Certificates can be used as secrets to prove the application’s identity when requesting a token. Also, can be referred to as public keys.\n                       \n\n                        8. Click\n                        \n\n                          +\n                          \n\n                            New client secret\n                           \n\n\n\n                        .\n                       \n\n                        9. Specify the client secret description and the expiry period for your client secret, and click\n                        \n\n\n\n                            Add\n                           \n\n\n\n                        .\n                       \n\n                        10. Copy the value and paste it into the\n                        \n\n\n\n                            Client Secret\n                           \n\n\n\n                        field in the\n                        \n\n                          Connector credentials\n                         \n\n                        section in Domo.\n                       \n\n                        11. Specify the client secret description and the expiry period for your client secret, and click\n                        \n                         Add\n                        \n                        .\n                       \n\n                        12. Copy the value and paste it into the\n                        \n                         Client Secret\n                        \n                        field in the Connector credentials section in Domo.\n                       \n\n                        Assigning User Role Permissions\n                       \n\n\n                         Go to the\n                         \n                          Container\n                         \n                         in which you would like to write back the data.\n                        \n\n                         Select\n                         \n                          IAM\n                         \n                         .\n                        \n\n                         Select\n                         \n                          Add Roles\n                         \n                         .\n                        \n\n                         Give\n                         \n                          Storage Blob Data Contributor\n                         \n                         role to the user.\n                        \n\n\n                        Configuring the Connection\n                       \n\n                        This section enumerates the options in the\n                        \n\n\n\n                            Credentials\n                           \n\n\n\n                        and\n                        \n\n\n\n                            Details\n                           \n\n\n\n                        panes in the ADLS Gen 2 OAuth Writeback Connector page. The components of the other panes in this page,\n                        \n\n\n\n                            Scheduling\n                           \n\n\n\n                        and\n                        \n\n\n\n                            Name & Describe Your DataSet\n                           \n\n\n\n                        , are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        This pane contains fields for entering credentials to connect to your Azure Data Lake file system (container). The following table describes what is needed for each field:\n                       \n\n\n\n\n\n                            Field\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Client ID\n                          \n\n                           Enter the client ID (GUID) of the client web app obtained from Azure Active Directory configuration. See Prerequisites for more information.\n                          \n\n\n\n                           Client Secret\n                          \n\n                           Enter the secret key of the client web app.\n                          \n\n\n\n                           Tenant ID\n                          \n\n                           Enter your Tenant ID. Go to\n                           \n                            Portal.azure.com\n                           \n                           > Azure Active Directory > Properties. The Directory ID is your Tenant ID.\n                          \n\n\n\n\n                        Once you have entered valid credentials, you can use the same account any time you go to set up a new Domo-Azure Data Lake Storage Gen2 connection. You can manage connector accounts in the\n                        \n\n\n\n                            Accounts\n                           \n\n\n\n                        tab in the Data Center. For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n\n\n                            Reports\n                           \n\n\n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Input DataSet ID\n                           \n\n\n\n                            Enter the DataSet ID (GUID) for the DataSet you want to copy to the selected Azure Data Lake Storage file system (container). You can find the ID by opening the details view for the DataSet in the Data Center and looking at the portion of the URL following datasources/.\n                           \n\n                            Example, in the URL\n                            \n                             https://mycompany.domo.com/datasources/845305d8-da3d-4107-a9d6-13ef3f86d4a4/details/overview\n                            \n                            , the DataSet ID is 845305d8-da3d-4107-a9d6-13ef3f86d4a4.\n                           \n\n\n\n\n                           File System Name\n                          \n\n                           Enter the file system name where you wish to upload the file. A file system acts as a container for your files.\n                          \n\n\n\n                           Select Filename\n                          \n\n                           Select whether you want to reference your DataSet using the\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                           Input DataSet ID\n                                                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                           or an output\n                           \n\n                             file name\n                            \n\n                           .\n                          \n\n\n\n                           Filename\n                          \n\n                           Enter the output file name for your data.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "000005178", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005178", "Archived Date": "", "Language": "English", "Primary Version": "ADLS Gen 2 OAuth Writeback Connector", "Article Total View Count": "513", "": "", "Article Created Date": "4/5/2023, 5:22 AM", "First Published Date": "4/5/2023, 5:22 AM"}, "title": "\n              ADLS Gen 2 OAuth Writeback Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}