{"file_path": "../../raw_kb_v2\\article\\5885581953047\\index.html", "content": {"title": "\n\n\n Snapchat Publisher Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAs one of the most popular social media apps, Snapchat is a popular platform for both Millennials and Gen Z. Story Studio is a Snapchat self-serve tool to create, upload, and publish Shows and publisher stories in Snapchat Discover. Snapchat Publisher API allows a Story Studio user to call the Content, Analytics and Revenue API for their Shows and Publisher Stories.\n\n\n Get the real time updates about your story performance and revenue metrics with Domo's leading business intelligence platform. By combining your data with Domo, you'll be able to develop comprehensive marketing strategies to fully optimize your advertising across all platforms.\n\nTo learn more about the Snapchat Ads API, visit their page (\n\n\n https://developers.snapchat.com/ads/\n\n\n ).\n\nThe Snapchat Publisher Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Snapchat account in the Data Center. This topic discusses the fields and menus that are specific to the Snapchat Publisher Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Snapchat account and create a DataSet, you must have the username and password associated with your Snapchat account.\n\n\n Connecting to Your Snapchat Publisher Account\n-----------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the Snapchat Publisher Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Snapchat Publisher Connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Snapchat accounts in Domo) to open the Snapchat OAuth screen where you can enter your Snapchat username and password. Once you have entered valid Snapchat credentials, you can use the same account any time you go to create a new Snapchat Publisher DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Snapchat when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Snapchat account.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Snapchat Publisher report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Daily Audience Metrics\n  |\n\nGet the daily performance metrics for a publisher over the specified date range\n\n|\n|\n Daily Behaviour Metrics\n  |\n\nGet the daily performance metrics for a publisher over the specified date range\n\n|\n|\n ECPM\n  |\n Retrieve revenue by editions\n  |\n|\n Publishers\n  |\n Retrieve a list of publishers associated with the current user\n  |\n|\n Publisher Story Performance Metrics\n  |\n Get the stories performance metrics for a publisher over the specified date range\n  |\n|\n Publisher Summary Key Metrics\n  |\n Provide an aggregated summary of key metrics for the specified publisher over the specified date range\n  |\n|\n Total Revenue\n  |\n Retrieve single aggregation of revenue metrics\n  |\n\n|\n|\n Publisher ID\n  |\n Select the publisher IDs.\n  |\n|\n Revenue Type\n  |\n Filter revenue data by revenue type. To get All, omit this parameter.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Time Period\n  |\n\nChoose the time period for which you would like to receive data.\n\n|\n|\n Starting Day of the Week\n  |\n\nSelect the day that you want to set as the beginning day of the week.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the Snapchat API does this connector use?\n\nThis connector uses version 1 of the Snapchat API (\n\nhttps://api.snapkit.com/v1/stories/studio/\n\n.)\n\n###\n Which endpoint(s) does each report call in this Connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n DailyAudienceMetrics\n  |\n /publisher/{publisherId}/daily/audience\n  |\n|\n DailyBehaviourMetrics\n  |\n /publisher/{publisherId}/daily/behavior\n  |\n|\n ECPM\n  |\n /revenue/publisher/{publisherId}/editions\n  |\n|\n Publishers\n  |\n /publishers\n  |\n|\n Publisher Story Performance Metrics\n  |\n /analytics/publisher/{publisherId}/stories\n  |\n|\n PublisherSummaryKeyMetrics\n  |\n /publisher/{publisherId}/summary\n  |\n|\n Total Revenue\n  |\n /revenue/publisher/{publisherId}/aggregate\n  |\n\n\n####\n What kind of credentials do I need to power up this Connector?\n\nYou need the username and password associated with your Snapchat account.\n\n###\n How do I know that my Snapchat credentials are secure?\n\nThe login process uses the OAuth process, so your Snapchat credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits I should be aware of?\n\nNo\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 5885581953047\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003186\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSnapchat Publisher Connector\n\n", "article_total_view_count": "\n\n\n 4,759\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "snapchat_publisher_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}