{"file_path": "../../raw_kb_v2\\article\\360058716453\\index.html", "content": {"title": "\n\n\n Gong Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGong is a real-time insights platform for sales conversations. With its Revenue Intelligence, Gong enables you to gain critical insights into what’s happening with your remote sales team, your deals, and your market. Use Domo’s Gong Connector to get real-time insights into your sales conversations and adapt your revenue strategy for success.\n\n\n You connect to your Gong account in the Data Center. This topic discusses the fields and menus that are specific to the Gong connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Gong account and create a DataSet, you must have the following:\n\n The Access Key for your Gong API user\n* The Access Key Secret for your Gong API user\n\nTo obtain your credentials, go to the\n\nGong API Page\n\nand click\n **Create**\n to receive the\n **Access Key**\n and\n **Access Key Secret**\n .\n\n\n**NOTE**\n : To receive the Access Key and Access Key Secret, you must be a technical administrator in Gong.\n\n\n Connecting to Your Gong Account\n---------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the\n\nGong\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your\n\nGong\n\naccount. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Access Key\n  |\n Enter the access key for your Gong API user. For more information, see\n\nPrerequisites\n\n.\n  |\n|\n Access Key Secret\n  |\n Enter the access key secret for your Gong API user. For more information, see\n\nPrerequisites\n\n.\n  |\n\n\n Once you have entered valid\n\nGong\n\ncredentials, you can use the same account any time you go to create a new\n\nGong\n\nDataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Gong report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Calls\n  |\n This report returns the call data for calls that occurred in the selected date range.\n  |\n|\n Call Details\n  |\n This report returns the call detail information broken down by the selected sub report for the selected date range.\n  |\n|\n Call Transcripts\n  |\n This report returns the call transcripts broken down by sentence for the selected date range.\n  |\n|\n Company Productivity (Calls & Interaction Stats)\n  |\n Returns the metrics on the basis of calls & interaction stats data for the selected date range.\n  |\n|\n Interaction Stats\n  |\n This report returns the interaction statistics for calls that occurred in the selected date range.\n  |\n|\n Scorecards\n  |\n This report returns the scorecard data for scorecards with a review date in the selected range.\n  |\n|\n User Activity\n  |\n This report returns the user activity by selected aggregation and date range.\n  |\n|\n Users\n  |\n This report returns a list of users.\n  |\n|\n Workspaces\n  |\n This report returns a list of workspaces.\n  |\n\n|\n|\n Date Selection\n  |\n Select the date format for your data.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n **Days Back**\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ********End Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ********Start Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Time Period\n  |\n Specify the time period that you would like to receive data for.\n  |\n|\n Starting Day of the Week\n  |\n Select the day you would like your week to start with.\n  |\n|\n Aggregation Period\n  |\n Select the period you would like the data to be aggregated for.\n  |\n|\n Subreport\n  |\n Select the sub report data you are interested in.\n  |\n|\n Context Links\n  |\n Returns the user activity for selected aggregation and date range with respect to the context links.\n  |\n|\n Points of Interest\n  |\n Returns the user activity for selected aggregation and date range with respect to the user's points of interests.\n  |\n|\n Topics\n  |\n Returns the user activity for selected aggregation and date range with respect to the user's topics.\n  |\n|\n Trackers\n  |\n Returns the user activity for selected aggregation and date range with respect to the user's trackers.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360058716453\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003874\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGong Connector\n\n", "article_total_view_count": "\n\n\n 2,476\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "gong_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}