{"file_path": "../../raw_kb_v2\\article\\360043435933\\index.html", "content": {"Title": "Owler Connector", "Article Body": "Important:\n                            \n                            The Owler Fortune 500 public DataSet will no longer be available for use after September 2, 2019. Customers using this data will need to create their own DataSets using the Owler Connector and their personal Owler account.\n                           \n\n\n\n\n\n                        Intro\n                       \n\n                        Owler crowdsources business insights by providing news alerts, company profiles, and polls and allows members to follow, track, and research companies in real time. Use Domo's Owler connector to retrieve company and competitor data as well as feeds for selected companies. To learn more about the Owler API, visit their page (\n                        \n                         https://developers.owler.com/\n                        \n                        ).\n                        \n\n\n\n                        You connect to your Owler account in the Data Center. This topic discusses the fields and menus that are specific to the Owler connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Owler account and create a DataSet, you must have an Owler API key. For information about obtaining an API key, reach out to your Owler representative.\n                       \n\n                        Connecting to Your Owler Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Owler Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Owler account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            API Key\n                           \n\n\n\n                            Enter your Owler API key.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Owler credentials, you can use the same account any time you go to create a new Owler DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Owler report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Company Search\n                               \n\n\n\n                                Returns the top 30 companies most likely to match your search criteria.\n                               \n\n\n\n\n\n                                Company Detail\n                               \n\n\n\n                                Returns detailed information for the selected companies.\n                               \n\n\n\n\n\n                                Competitors\n                               \n\n\n\n                                Returns competitor information for the selected companies.\n                               \n\n\n\n\n\n                                Feeds\n                               \n\n\n\n                                Returns the top 10 feeds for the selected companies.\n                               \n\n\n\n\n\n\n\n\n\n                            Search Filter\n                           \n\n\n\n                            Select the type of filter you want to apply to your report. You then enter the actual search term in the\n                            \n                             Search\n                            \n                            field. For example, if you wanted to filter on the company name \"Kablinko,\" you would select\n                            \n                             Name\n                            \n                            as your search filter type then enter\n                            \n                             Kablinko\n                            \n                            in the\n                            \n                             Search\n                            \n                            field.\n                           \n\n\n\n\n\n                            Search\n                           \n\n\n\n                            Enter the term you want to retrieve information for in your report. Make sure you select the matching filter type in the\n                            \n                             Search Filter\n                            \n                            menu. For example, if you wanted to filter on the company name \"Kablinko,\" you would select\n                            \n                             Name\n                            \n                            in the\n                            \n                             Search Filter\n                            \n                            menu then enter\n                            \n                             Kablinko\n                            \n                            in the\n                            \n                             Search\n                            \n                            field.\n                           \n\n\n\n\n\n                            Input Type\n                           \n\n\n\n                            Select how you would like to input company data to search for. If you select\n                            \n                             Manual Entry\n                            \n                            , you are prompted to enter the IDs for all companies you want to retrieve information for. If you select\n                            \n                             Search\n                            \n                            , you are prompted to enter a search term to filter by. If you select\n                            \n                             Fortune 500\n                            \n                            , data is returned for Fortune 500 companies.\n                           \n\n\n\n\n\n                            Company IDs\n                           \n\n\n\n                            Enter a comma-separated list of IDs for companies you want to retrieve information for.\n                           \n\n\n\n\n\n                            Sub Report\n                           \n\n\n\n                            Select a sub report, either\n                            \n                             Industries\n                            \n                            ,\n                            \n                             Funding\n                            \n                            , or\n                            \n                             Acquisition\n                            \n                            . If you do not want a sub report, select\n                            \n                             None\n                            \n                            .\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043435933", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003318", "Archived Date": "", "Language": "English", "Primary Version": "Owler Connector", "Article Total View Count": "2,367", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Owler Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}