{"file_path": "../../raw_kb_v2\\article\\360042924374\\index.html", "content": {"title": "\n\n\n Available Data Science Charts\n\n\n", "article_body": "\n\nData science graphs enable you to perform in-depth statistical analyses on your Domo data.\n\n\n The following table lists the types of Data Science graphs available in Domo. You can click a thumbnail image to see a larger image.\n\n\n Chart Type\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Scatter Plot graph\n\n|\n A standard Scatter Plot graph has two value scales, one on the vertical axis (or y-axis) and one on the horizontal axis (or x-axis). These values are treated as coordinates; for every x and y value pair, a single point is plotted on the graph. Points can be assigned into specific groups by including series data in the graph.\n\n\n You can also create a Scatter Plot Time graph, in which you include timeline data instead of value data on the x-axis. In this case, all points are plotted on their appropriate date/time coordinates. The position of a point for a given date/time coordinate is still determined by its y coordinate value, however.\n\n\n The first example shows a standard Scatter Plot graph. The second example shows a Scatter Plot Time graph.\n\n\n As of our July 2017 release, the Scatter Plot graph has been updated and no longer aggregates data (which had the effect of lumping all data in a series into a single dot). If you want to use the old version of the graph, you can do so by selecting the Scatter Plot Legacy chart type.\n\n\n For more information, see\n\nScatter Plot Chart\n\n.\n  |\n |\n|\n Bubble graph (deprecated)\n\n|\n**Deprecated**\n Bubble graphs are similar to Scatter Plot graphs in that they have two value scales, and x and y coordinate pairs are plotted on the graph. Bubble graphs are more complex than Scatter Plot graphs in that they include an additional dimension—bubble size. Thus they require an additional DataSet column containing size values for each bubble. In the example at right, the y-axis measures employee salaries and the x-axis measures the average number of employees receiving those salaries. In addition, the size of each bubble represents the total percentage of the payroll for each department.\n\n\n You can also create a Bubble Time graph, in which you include timeline data instead of value data on the x-axis. In this case, all bubbles are plotted on their appropriate date/time coordinates. The position of a point for a given date/time coordinate is still determined by its y coordinate value, however.\n\n\n The first example shows a standard Bubble graph. The second example shows a Bubble Time chart.\n\n\n As of our July 2017 release, you are no longer required to include series data in a Bubble graph, though this option is still available. If you want to use the old version of the graph, you can do so by selecting the Bubble Legacy chart type.\n\n\n For more information, see\n\nBubble Chart\n\n.\n  |\n |\n|\n XY Line\n\n|\n An XY Line graph uses x and y coordinate pairs instead of date/time data to plot trendlines. Because of this mathematical plotting, there are not evenly spaced intervals between data points as there are in graphs that use date/time data; therefore, these graphs are useful for portraying trendlines with greater accuracy.\n\n\n A basic XY line graph requires only two columns of data to draw the line, but you can also include a series column to show multiple lines. You can also add a line for a median value and specify lower and upper range values. Be aware that this chart type does\n *not*\n currently include algorithms to identify your median line and upper and lower ranges. You must identify these elements yourself in the DataSet you use to power the graph. However, you can use tools such as R and Python to help you identify these elements.\n\n\n The screenshot shows an XY graph with a single trendline, median line, and upper and lower bounds set.\n\n\n For more information, see\n\nXY Line Chart\n\n.\n  |  |\n|\n Predictive Modeling\n\n|\n A Predictive Modeling graph is essentially a Scatter Plot graph that includes a model fit line. If you want, you can also specify the upper and lower bounds of the model fit line.\n\n\n Be aware that this chart type does\n *not*\n currently include algorithms to identify your model fit line and upper and lower bounds. You must identify these elements yourself in the DataSet you use to power the graph. However, you can use tools such as R and Python to help you identify these elements.\n\n\n For more information, see\n\nPredictive Modeling Chart\n\n.\n  |  |\n|\n Forecasting\n\n|\n A Forecasting graph consists of a basic trendline for all data up until the current date/time, along with a forecast line showing predicted changes beyond the current date/time. You can optionally indicate the lower and upper bounds of the forecast line. If you want, you can even include a second forecast line with its own upper and lower bounds.\n\n\n Be aware that this chart type does\n *not*\n currently include algorithms to create forecast line(s) and upper and lower bounds. This data must already be present in the DataSet you are using to power the graph. However, you can use tools such as R and Python to create these columns in your data source before bringing them into Domo.\n\n\n For more information, see\n\nForecasting Chart\n\n.\n  |  |\n|\n Outliers\n\n|\n An Outliers graph is nearly identical to a basic Line graph but allows you to call out any points you deem to be outliers.\n\n\n Be aware that this chart type does\n *not*\n currently include algorithms to identify outlier points. You must identify these points yourself in the DataSet you use to power the graph. However, you can use tools such as R and Python to help you identify these outliers.\n\n\n For more information, see\n\nOutliers Chart\n\n.\n  |\n\n|\n|\n Vertical Box Plot graph\n\n|\n Box Plot graphs are commonly used to represent statistics and quality measurements. For any given category, at least five values are required in the DataSet. From these values, Domo derives a\n *high*\n value, a\n *Q3*\n (Quartile 3) value, a\n *median*\n value, a\n *Q2*\n (Quartile 2) value, and a\n *low*\n value. These values are plotted on the graph as a\n *box and whisker plot*\n , with the Q1, median, and Q3 values forming the box and the high and low values forming the \"whiskers.\"\n\n\n In a vertical Box Plot graph, values are represented on the vertical axis (or y-axis) and categories are represented on the horizontal axis (or x-axis) so the boxes stretch from top to bottom.\n\n\n For more information, see\n\nBox Plot Chart\n\n.\n  |\n\n|\n|\n Horizontal Box Plot graph\n\n|\n Horizontal Box Plot graphs are the same as vertical Box Plot graphs, except that categories are represented on the vertical axis (or y-axis) and values are represented on the horizontal axis (or x-axis), so the boxes stretch from left to right rather than top to bottom.\n\n\n For more information, see\n\nBox Plot Chart\n\n.\n  |\n\n|\n|\n\nSPC (statistical process control) chart\n\n\n |\n SPC (statistical process control) charts, also known as control charts, Shewhart charts, or process-behavior charts, are line charts used to determine if a manufacturing or business process is in a state of control. Domo's SPC charts lets you set up rules from SPC standards by configuring them in the Chart Properties. When values outside the specified rules are encountered, these are flagged in the chart as outliers.\n\n\n 8 different rules are available. You can implement the rules singly or in combination.\n\n\n For more information, see\n\nBuilding SPC Charts\n\n.\n  |  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042924374\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004731\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAvailable Data Science Charts\n\n", "article_total_view_count": "\n\n\n 5,009\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:27 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "available_data_science_charts", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}