{"file_path": "../../raw_kb_v2\\article\\1500009295041\\index.html", "content": {"title": "\n\n\n Scheduler App\n\n\n", "article_body": "\n\nIntro\n-------\n\nThank you for your interest in the Scheduler app! This guide will help you familiarize yourself with the features and layout of the app— please refer to the Scheduler Implementation Guide for app set-up and further explanation into the app’s features. The main purpose of the Scheduler app is to allow for a broad variety of scheduling use-cases, as opposed to other offerings in the market which are targeted towards very specific business needs. You can also select which language you would like the app to appear in, the language configuration is done in the admin settings.\n\nHow do I get this?\n--------------------\n\nTo begin using the Scheduler app, locate the app in the Appstore or have an Admin contact your Customer Success Manager.\n\n\n Scheduler\n-----------\n\nThe Scheduler portion of the app, which is set-up and configured in the Admin settings, is where end-users will go to schedule initial and follow-up appointments. The flow/ordering of sections, questionnaire, and availability, are a few of the options that appear throughout the Scheduler that are implemented on the Admin side and are not hard-coded.\n\n##\n Splash Screen\n\nThe first thing that you will see in the app is the app splash screen, which can be customized in the Admin settings. End-users will only be able to see the\n **Schedule Now**\n button and\n **Schedule Follow-Up**\n button—if follow-up appointments have been enabled in the app—and will not be able to see the\n **Admin**\n button.\n\n\n###\n Schedule Now - Information\n\nThe first step of the Scheduler is the\n **Information**\n section—note that the title can be changed by admins in Admin settings. The questions in the Information section are hard-coded and cannot be changed by admins. The questions include:\n\n. First Name: free-text field\n2. Last Name: free-text field\n3. Date of Birth: validated MM/DD/YYYY format\n4. Address: free-text field\n5. City: free-text field\n6. State: dropdown with pre-populated options\n7. Zip Code: validated numeric field (5-to-9-digit format)\n8. Phone Number: validated numeric field (\\_\\_\\_) \\_\\_\\_-\\_\\_\\_\\_\n9. Email Address: validated free-text field\n10. Validate Email Address: validated free-text field (validated against the end-users answer to the Email Address question)\n\nAll of the questions are required in this section, and if any fields are left blank end-users will not be able to move on to the next section.\n\n\n Users can move to the next section by selecting the\n **Next Step**\n button from the bottom-right corner of the screen. The\n **Cancel**\n button will take users back to the splash screen.\n\n\n###\n Schedule Now - Location\n\nA list of locations—configured in the Admin settings—will be available to end-users in this section. Users can only select one option from the list, or they can select the\n **Any**\n option if it has been enabled by Admins. The selected location will determine the date and time range available for scheduling.\n\n\n Users can move to the next section by selecting the\n **Next Step**\n button from the bottom-right corner of the screen or move to the previous section by selecting the\n **Previous Step**\n button. The\n **Cancel**\n button will take users back to the splash screen.\n\n\n###\n Schedule Now - Resource\n\nA list of resources—configured in the Admin settings—will be available to end-users in this section. Available resources will be dependent upon the location that was selected. Users can only select one option from the list, or they can select the\n **Any**\n option if it has been enabled by Admins.\n\n\n###\n Schedule Now - Service\n\nA list of services—configured in the Admin settings—will be available to end-users in this section. Available services will be dependent upon the location and resource that were selected. Users can only select one option from the list, or they can select the\n **Any**\n option if it has been enabled by Admins.\n\n\n###\n Schedule Now - Date & Time\n\nThe date and time of an appointment can be selected on this screen. Resources can also be changed on this screen if users want to use a different resource for their appointment. Available appointments will be indicated on the calendar and once a date has been selected the available appointment times will show on to the right of the calendar. Only one appointment can be scheduled at a time. If there are no available time periods for the selected day then the time option will not appear.\n\n\n###\n Schedule Now - Questionnaire\n\nThe questionnaire section may or may not be available in the Scheduler, depending on if the Admin included it in the configuration portion of the app. The questionnaire may be different for every version of the Scheduler depending on the connected Form Builder DataSet.\n\n\n###\n Schedule Now - Summary\n\nThe Summary screen shows an overview of all of the submitted answers in each section in order (i.e., Information, Resource, Location, Date & Time, etc.). In order to book their appointment, users will need to select the\n **Submit**\n from the bottom-right corner of the screen. The Summary screen also includes a reCAPTCHA checkbox that will need to be checked before submitting their appointment information.\n\n\n###\n Schedule Now - Confirmation\n\nThe Confirmation screen will show the users’ appointment information and display the QR code that the user may need in order to get into their appointment. Users can book another appointment (start over) by selecting the\n **Book Again**\n button from the bottom of the screen.\n\n\n###\n Schedule Follow Up - Customer ID\n\nThe only difference with the follow-up scheduling flow is the\n **Customer ID**\n step. This step prompts users to enter the customer ID they have been provided—this ensures that they are scheduling the correct service based upon their initial appointment.\n\n\n###\n\nAdmin\n-------\n\nThe Admin portion of the app allows users with admin-level roles to see a list view of all appointments and configure the app settings. The Admin screen can be accessed either by selecting the\n **Admin**\n button from the splash screen or selecting the gear icon in the Scheduler portion of the app.\n\n##\n List View\n\nAdmin users are able to see a list view of all currently scheduled appointments. Admins can view today’s appointments, this week’s, this month’s, and past appointments. Admins are also able to filter by location, service, and resource as well as search by first and last name, email, and phone number to find specific appointments. The\n **New Item**\n button will take admin users through the Scheduler flow, where they can schedule appointments for users.\n\n\n###\n Admin Settings - Set up Workflow\n\nAdmins can set up the workflow order for the Scheduler portion of the app in the\n **Set Up Workflow**\n tab. The workflow options include Location, Resource, Service, and Questionnaire. Each of these steps can be hidden by selecting the checkbox next to each step. Steps can be moved around in order by selecting the dot menu next to each step. The\n **Show Any**\n button will allow users to see an\n **Any**\n option when they are selecting a location, service, or resource. The\n **Invitations required for appointment scheduling**\n configures the Scheduler app to only accept appointments if the user has an invite code.\n\n\n###\n Admin Settings - Edit Locations\n\nThe\n **‘Edit Locations’**\n tab allows admins to add, edit, delete, and hide locations in the Scheduler app. Location items include the location name, location address, associated resource(s), and associated service(s). Set locations as ‘Private’ to generate a unique Invite ID that can be sent to recipients. Resource and service are required, if they are not added then the location will be marked as incomplete and will not be visible in the app. New locations can be added by selecting the ‘Add New Location’ option from the upper-right corner of the screen.\n\n\n###\n Admin Settings - Edit Services\n\nThe\n **Edit Services**\n tab allows Admins to add, edit, delete, and hide services in the Scheduler app. Service items include the service name, description of the service, estimated service duration, booking type (initial, follow-up, or both), associated inventory, inventory usage, follow-up at least, follow-up at most, follow-up parent service, associated resource(s), and associated location(s). Resources and locations are required fields on service items—services without these will show as incomplete and will not be visible in the Scheduler app. New services can be added by selecting the\n **Add New Service**\n button from the upper-right corner of the screen.\n\n\n###\n Admin Settings - Edit Resources\n\nThe\n **Edit Resources**\n tab allows Admins to add, edit, delete, and hide resources in the Scheduler app. Resource items include the resource name, description of the resource, double booking, associated location(s), and associated service(s). Locations and services are required fields on resource items—resources without these will show as incomplete and will not be visible in the Scheduler app. New resources can be added by selecting the\n **Add New Resource**\n button from the upper-right corner of the screen.\n\n\n###\n Admin Settings - Edit Availability\n\nThe\n **Edit Availability**\n tab allows Admins to set company availability and both default and custom schedules. Schedules can be added, edited, and deleted by Admins at any time. Start and end dates, the scheduling time zone, and time slot intervals are also set on this screen. Default schedules are applied to all users/resources who are not added to custom schedules. Default schedules includes the schedule name, days of the week it applies to, blackout periods, and available hours. Custom schedules override default schedules and should include added users/resources. Custom schedules include the schedule name, days of the week it applies to, blackout periods, scheduled resources, and available hours.\n\n\n###\n Admin Settings - Edit Inventories\n\nThe\n **Edit Inventories**\n tab allows Admins to add, edit, and delete inventories. Inventories include the inventory name, inventory description, current inventory, and the ability to add or remove from the current inventory. New inventories can be added by selecting the\n **Add Inventory**\n button from the upper-right corner of the screen.\n\n\n###\n Admin Settings - Add Questionnaire\n\nThe\n **Add Questionnaire**\n tab is where questionnaires built in the Form Builder app can be added to the Scheduler. Only one questionnaire can be added at a time and a preview of the questionnaire will be available to review. To add a new questionnaire, select the\n **Add a New Form Builder DataSet**\n button.\n\n\n###\n Admin Settings - Edit Languages\n\nThe\n **‘Edit Languages’**\n tab allows admin users to set languages up in the app. The currently configurable languages include English, Spanish, Haitian Creole, and Japanese. Admins can set one language as the default and enable all or some as translatable fields. Once a language is selected, users will be able to go through all of the text fields and translate them for the corresponding language. If one language text field has been changed, a warning sign will appear on that language tab letting you know that something has been changed and the number of changed fields will appear on all of the other language tabs.\n\n\n###\n Admin Settings - Customize Settings\n\nThe ‘Customize Settings tab is where admins can customize the logo, color palette, and add/edit app name. Logos can be added to the app by selecting the ‘Upload’ button in the ‘Add/Edit Logo’ section. The primary and secondary colors can be updated in the app, as well as the primary and secondary font colors—a preview of these changes can be seen in the ‘Preview of colors selected’ section. The app name can be added or edited, the name will automatically be set as Domo Scheduler App.\n\nFAQ\n-----\n\n\n#####\n Why is this app important?\n\nEnables you to quickly and efficiently customize your scheduling within the app to gather and share only necessary information with your users.\n\n####\n How do I use/demo it?\n\nOnce the app has been added to your Domo instance, connect the necessary DataSets and begin configuring the app so end-users can begin scheduling appointments.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500009295041\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004126\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nScheduler App\n\n", "article_total_view_count": "\n\n\n 4,687\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:23 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "scheduler_app", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}