{"file_path": "../../raw_kb_v2\\article\\360042933094\\index.html", "content": {"Title": "Using the Domo Word Plugin", "Article Body": "Intro\n                       \n\n                        Use the Domo Word plugin to download Cards or DataSet data from Domo into Microsoft Word. This is an excellent way to share your Domo data with others in your company who may not have access to Domo.\n                       \n\n                        You can choose which Card components you want to import; for example, for a given chart Card you could import just the chart, the summary number, last update date, etc., or you could import all of these. You can also use the Word plugin to import DataSets or portions of DataSets into Word through the use of \"query tables.\" These are subsets of DataSets or single values you pull into Word based on aggregates, filters, limits, etc. Once you have pulled your Domo data into Word, you can refresh it at any time with the click of a button.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Notes:\n                            \n\n\n\n\n                              The Domo Word plugin works\n                              \n                               only\n                              \n                              in Word on Windows machines and is only supported by Office 2000 and later.\n                             \n\n\n\n                              Multi-factor verification is available for the Word Plugin.\n                             \n\n\n                             Admin-, Privileged-, and Editor-level users can all use this plugin.\n                            \n\n\n\n\n\n\n\n\n                          Video - Domo Word Plugin\n                         \n\n\n\n\n\n\n\n\n\n                        What You Can Do with the Plugin\n                       \n\n                        Using this plugin, you can do all of the following:\n                       \n\n\n\n                          Import\n                          \n                           Visualization Cards\n                          \n                          or individual components of Visualization Cards (such as chart/table content, summary numbers, owner name, etc.) into Word.\n                         \n\n\n\n                          Use query tables to import DataSet data as selected fields or as a single value.\n                         \n\n\n\n                          Highlight the Domo content in your Word document so viewers can recognize it immediately.\n                         \n\n\n\n                          Refresh the content—if anything has changed in the Card or DataSet, it will be \"redownloaded.\"\n                         \n\n\n\n                        Downloading the plugin\n                       \n\n                        You can download the Domo Word plugin in the Admin Settings.\n                       \n\n\n\n\n\n\n\n\n\n\n                         To download the Domo Word plugin,\n                        \n\n\n\n\n                          In Domo, navigate to\n                          \n                           Admin Settings\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Tool Downloads\n                          \n                          .\n                         \n\n\n\n                          Scroll down to the\n                          \n                           Domo Word plug-in\n                          \n                          section.\n                         \n\n\n\n                          Click\n                          \n                           Try the Word Plug-In\n                          \n                          .\n                         \n\n\n\n                        Installing the plugin\n                       \n\n                        You can install the plugin either through the wizard that opens after installation or by command line.\n                       \n\n                        Wizard Install\n                       \n\n\n\n                          After the plugin finishes downloading, follow the steps in the wizard to install it to your computer.\n                         \n\n\n\n                        The plugin will now be available when you open Word.\n                       \n\n                        Command Line Install\n                       \n\n\n                         First, ensure that you are an Admin on the Windows machine.\n                        \n\n\n                          Open up the Command Prompt by clicking the\n                          \n                           Start Menu\n                          \n                          .\n                         \n\n\n\n                          Type CMD in the search bar.\n                         \n\n\n\n                          Right-click\n                          \n                           Command Prompt\n                          \n                          then click\n                          \n                           Run as Administrator\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Navigate to the Domo Word Plugin download from your Admin Portal > Tool Downloads\n                         \n\n\n\n                          In the command line terminal, run a command line using the file pathway that points to the Domo Word Plugin downloaded file similar to this:\n                          \n\n\n                           C:\\Windows\\system32>\\Users\\user_account_name\\Downloads\\domowordsetup.msi\n                          \n\n\n\n\n                          This will start of the Domo Word Add-in Setup Wizard.\n                         \n\n\n\n                          Follow the prompts to install the Domo Word plugin.\n                         \n\n\n\n                        Sequence of steps\n                       \n\n                        The process for using the plugin to download Domo content to Word can be summarized as follows:\n                       \n\n\n\n\n                           Connect to the server\n                          \n                          for the Domo instance you want to retrieve Domo content from.\n                         \n\n\n\n\n                           Download the desired Card or DataSet content\n                          \n\n\n                          into Word.\n                         \n\n\n\n                          Highlight the Domo content so viewers will recognize it as such in your document.\n                         \n\n\n\n\n                           Refresh the data\n                          \n                          as necessary to keep everything up to date.\n                         \n\n\n\n                        Parts of the Domo Tab and Sidebar in Word\n                       \n\n                        After you have installed the Domo Word plugin, a\n                        \n                         Domo\n                        \n                        tab appears near the end of the main tab row in Word. This tab appears as follows:\n                       \n\n\n\n\n                        The following table describes the components of this tab:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Connect to Domo\n                           \n\n\n\n                            Lets you connect to a specified Domo instance. You can be connected to multiple instances at once. If you are already connected to an instance, this button reads\n                            \n                             Connected\n                            \n                            . In this case, you can add new connections or delete connections using this option.\n                           \n\n\n\n\n\n                            Highlight Domo Content\n                           \n\n\n\n                            Lets you toggle highlighting of Domo content in your Word document.\n                           \n\n\n\n\n\n                            Open Sidebar\n                           \n\n\n\n                            Opens a sidebar on the right side of the screen from which you can choose the Cards or DataSet data you want to import into Word. This is discussed in more detail below.\n                           \n\n\n\n\n\n                            Refresh\n                           \n\n\n\n                            Refreshes the Domo content in this Word document.\n                           \n\n\n\n\n\n                            Help\n                           \n\n\n\n                            Lets you see the version number for this version of Domo Word as well as check for newer versions.\n                           \n\n\n\n\n\n                        The sidebar appears when you click\n                        \n                         Open Sidebar\n                        \n                        in the\n                        \n                         Domo\n                        \n                        tab.\n                       \n\n\n\n\n                        The following table describes the components of the sidebar:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Connect to Domo\n                           \n\n\n\n                            Lets you connect to a specified Domo instance. You can be connected to multiple instances at once. If you are already connected to an instance, this button reads\n                            \n                             Connected\n                            \n                            . In this case, you can add new connections or delete connections using this option.\n                           \n\n\n\n\n\n                            Server Menu\n                           \n\n\n\n                            Lets you select the connected Domo server you want to retrieve data from. Only appears if you have connected to more than one server.\n                           \n\n\n\n\n\n                            Search Field\n                           \n\n\n\n                            Lets you search for Cards or pages in the connected Domo instance.\n                           \n\n\n\n\n\n                            Add Custom Query Table\n                           \n\n\n\n                            Lets you import subsets of DataSets or single values into Word, based on aggregates, filters, limits, etc. Query tables are discussed in more detail later in this topic.\n                           \n\n\n\n\n\n                            Pages/Subpages\n                           \n\n\n\n                            Provide access to the Cards and/or subpages located under them. Indicated using the\n                            \n                            icon.\n                           \n\n\n\n\n\n                            Cards\n                           \n\n\n\n                            Let you open Cards in the sidebar, broken down into their individual components (such as visual content, summary number, etc.), which you can drag into your Word document as desired. Indicated using the\n                            \n                            icon.\n                           \n\n\n\n\n\n                            Apply Page Filters\n                           \n\n\n\n                            Determines whether page filters are applied to the pages listed in the sidebar.\n                           \n\n\n\n\n\n                            Refresh Button\n                            \n\n\n\n\n\n                            Allows you to refresh the list of pages appearing in the sidebar.\n                           \n\n\n\n\n\n                        Connecting to a Domo Server\n                       \n\n                        You can connect to the server for any Domo instance for which you have access. You can be connected to multiple instances at once.\n                       \n\n\n                         To connect to a Domo server,\n                        \n\n\n\n\n                          Click the\n                          \n                           Connect to Domo\n                          \n                          button on the left side of the Domo tab in Word. (If you are already connected to any servers, the button reads\n                          \n                           Connected\n                          \n                          .)\n                          \n\n\n\n\n                          A dialog appears requesting that you add a connection.\n                         \n\n\n\n                          Click the \"+\" button in the left pane.\n                         \n\n\n\n                          Enter the URL for your Domo server in the field, then click\n                          \n                           Authenticate\n                          \n                          .\n                          \n\n\n\n\n                          If you are already logged into the specified instance, you are authenticated automatically. Otherwise, a browser window opens prompting you to enter your credentials for the specified instance.\n                         \n\n\n\n                          (Conditional) Enter your Domo credentials for the specified instance if prompted to do so.\n                          \n                          You must have an \"Admin\" or \"Privileged\" security profile to connect.\n                          \n                          If you have entered your credentials correctly, a checkmark appears next to the account name in the\n                          \n                           Manage Connections\n                          \n                          pane.\n                         \n\n\n\n                          Click\n                          \n                           Close\n                          \n                          .\n                         \n\n\n\n                        Deleting a Server Connection\n                       \n\n                        You can delete a connection to a server in the same dialog in which you add a server connection.\n                       \n\n\n                         To delete a server connection,\n                        \n\n\n\n\n                          Click the\n                          \n                           Connected\n                          \n                          button on the left side of the Domo tab in Word.\n                         \n\n\n\n                          Select the server you want to disconnect from.\n                         \n\n\n\n                          Click\n                          \n                           Delete.\n                          \n\n\n\n\n                          Click\n                          \n                           Yes\n                          \n                          to confirm the deletion.\n                         \n\n\n\n                        Testing or Reauthorizing Server Connections\n                       \n\n                        If you need to reauthorize a connection for a server or test all of your connections, you can do so in the\n                        \n                         Manage Connections\n                        \n                        dialog.\n                       \n\n\n                         To test or reauthorize server connections,\n                        \n\n\n\n\n                          Click the\n                          \n                           Connected\n                          \n                          button on the left side of the Domo tab in Word.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            To test your connections, click\n                            \n                             Test Connections\n                            \n                            .\n                           \n\n\n\n                            To reauthorize a server, select the server you want to reauthorize, then click\n                            \n                             Reauthorize\n                            \n                            .\n                           \n\n\n\n\n\n                        Importing Card Content into Word\n                       \n\n                        After you have connected to a Domo server, you can import Visualization Card content from any page in that instance to which you have access. You do this by selecting the page and Card in the sidebar then choosing the components of the Card you want to import.\n                       \n\n\n                         To import Card content into Word,\n                        \n\n\n\n\n                          (Conditional) Open the sidebar if it is not open already, by clicking\n                          \n                           Open Sidebar\n                          \n                          in the Domo tab at the top of the screen.\n                          \n\n\n\n\n\n\n                          (Optional) If you have connected to more than one Domo server, select the server you want to retrieve data from in the menu at the top of the sidebar.\n                         \n\n\n\n                          In the sidebar, locate the page containing the content you want to import into Word, either by scrolling down the list (pages are shown in alphabetical order) or by entering the page name in the\n                          \n                           Search\n                          \n                          field.\n                          \n                          Pages in the sidebar are indicated using the\n                          \n                          icon.\n                         \n\n\n\n                          Click a page in the sidebar to show all of its subpages and/or Visualization Cards.\n                          \n                          Visualization Cards in the sidebar are indicated using the\n                          \n                          .\n                          \n\n                          The following screenshot shows an example of a page (\"Client Services\") that contains two subpages and a number of Cards:\n                          \n\n\n\n\n\n\n                          Click a Card name in the sidebar to display all of the individual components of that Card.\n                          \n                          In the following screenshot, the user has clicked on a Card called \"RT: Customer Satisfaction.\"\n                          \n\n\n\n\n\n\n                          Drag the desired components into your Word document.\n                          \n\n                          You can pull over the Card name, summary number, and visual content as a group by clicking anywhere outside the dotted lines in the large rectangle (the empty space will turn blue when you mouse over it) and dragging into your Word document.\n                          \n\n\n\n\n                          You can also pull any of these individually by clicking within the dotted lines for the component and dragging it. The Card owner, last update date/time, and last modified date/time can\n                          \n                           only\n                          \n                          be pulled individually.\n                         \n\n\n\n                          (Optional) After you have dragged all the desired components into your Word document, you can highlight them as Domo content by clicking\n                          \n                           Highlight Domo Content\n                          \n                          in the\n                          \n                           Domo\n                          \n                          tab.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Table Cards are not currently supported in the Word Plugin.\n                          \n\n\n\n\n                        Building a Query Table\n                       \n\n                        You can add a \"query table\"—a subset of a DataSet in which you can optionally configure filters or aggregations—to a Word document. You can add this data as one or more columns, or you can aggregate the data to yield a single value.\n                       \n\n\n                         To add DataSet data to a Word document,\n                        \n\n\n\n\n                          Click\n                          \n                           Add Custom Query Table\n                          \n                          in the sidebar.\n                          \n                          A list of all DataSets in your connected Domo instance appears.\n                         \n\n\n\n                          Select the DataSet you want to add as a query table, then click\n                          \n                           Next\n                          \n                          to proceed to the next screen.\n                          \n                          You can use the various search/filter options to narrow down the DataSets in the list.\n                          \n\n\n\n\n                          A dialog opens in which you can set filters, aggregate, select or deselect columns, and change the order of columns. A preview is provided so you can see changes you have made to the selected data.\n                         \n\n\n\n                          Enter a name for the query table in the field at the top of the\n                          \n                           DataSets\n                          \n                          tab.\n                         \n\n\n\n                          (Optional) Configure filters as follows:\n                         \n\n\n\n                            Click the\n                            \n                             Filter\n                            \n                            tab if it is not open already.\n                           \n\n\n\n                            In the first dropdown, select the column you want to filter.\n                           \n\n\n\n                            In the second dropdown, select the comparison for the filter.\n                           \n\n\n\n                            In the last dropdown, enter the value for the condition.\n                           \n\n\n\n                            Click\n                            \n                             R\n                            \n\n                             efresh\n                            \n                            to show the changes in the query table.\n                            \n\n\n\n\n                            For example, if you wanted your query table to show only those rows in which your number of daily visitors is less than 20, you would select \"Daily Visitors\" in the first dropdown, select\n                            \n                             is less than\n                            \n                            in the second dropdown, and enter\n                            \n                             20\n                            \n                            in the last dropdown.\n                            \n\n                            You can add additional filters by clicking\n                            \n                             Add a filter\n                            \n                            then repeating the previous step.\n                           \n\n\n\n\n\n                          (Optional) To group a column (which combines all like rows in the column into a single row and aggregates the values in that row), do the following:\n                         \n\n\n\n                            Click the\n                            \n                             Group & Aggregate\n                            \n                            tab.\n                           \n\n\n\n                            In the menu on the left side of the tab, select the column you want to group.\n                           \n\n\n\n                            Click\n                            \n                             R\n                            \n\n                             efresh\n                            \n                            to show the changes in the query table.\n                            \n\n                            The following screenshot shows a preview of a DataSet that has not been grouped. Each \"AccountName\" row has its own unique values. For example, the account called \"Parker, Inc.\" has an \"OpportunityAmount\" of 9,125.\n                            \n\n\n\n\n                            If the user then selects \"AccountIndustry\" as the group by column, all of the like rows under \"Account Industry\" are combined, and all other columns are aggregated. This is shown in the following screenshot. Note that the \"AccountName\" column is given an aggregation of COUNT because the items in that column were strings, e.g. there were 555 accounts with an \"AccountIndustry\" of \"Consumer Services.\" \"OpportunityAmount,\" on the other hand, contained values, which can be summed to yield totals for each account industry.\n                            \n\n\n\n\n                            Each data type has a default aggregation when grouping. Strings are counted, values are summed, and dates receive an aggregation of MIN (meaning the earliest date is shown). Though there is no way to change the aggregation for a column, if you want to see a particular column aggregated differently, you can do so by adding an aggregation using the menus on the right side of the tab. For example, if the user in the previous example wants to show the average \"OpportunityAmount\" for each industry, he can do so by choosing \"OpportunityAmount\" as the column to be aggregated and AVERAGE as the aggregation type. This is shown in the following screenshot, in which a new \"OpportunityAmount (AVG)\" column has been added.\n                            \n\n\n\n\n                            You can add additional groupings and aggregations by clicking\n                            \n                             Add a Group By\n                            \n                            and\n                            \n                             Add an aggregation\n                            \n                            , respectively.\n                            \n\n                            Be aware that you can only add new aggregation columns in this way after specifying a grouping. If you add an aggregation without first doing a grouping, the data in your DataSet is consolidated into a single value, as explained in the next step.\n                           \n\n\n\n\n\n                          (Optional) To aggregate your DataSet data into a single value (which is only possible if you haven't grouped columns as explained in step 5):\n                         \n\n\n\n                            Click the\n                            \n                             Group & Aggregate\n                            \n                            tab.\n                           \n\n\n\n                            In the first menu on the right side of the tab, select the column you want to aggregate.\n                           \n\n\n\n                            In the second menu on the right side of the tab, select the desired aggregation.\n                            \n                            For best results, choose \"COUNT\" or \"DISTINCT COUNT\" for string columns; \"SUM,\" \"MIN,\" \"MAX,\" or \"AVERAGE\" for data columns; and \"MIN\" or \"MAX\" for date columns.\n                           \n\n\n\n                            Click\n                            \n                             R\n                            \n\n                             efresh\n                            \n                            to show the changes in the query table.\n                           \n\n\n\n\n\n\n\n\n\n\n                                 Note:\n                                \n                                When you aggregate to yield a single value in this way, the\n                                \n                                 Column\n                                \n                                and\n                                \n                                 Order\n                                \n                                tabs disappear. This is because there is now only one column in your query table, meaning you cannot add/remove or reorder columns.\n                                \n\n\n\n\n\n\n\n\n\n\n\n                          (Optional) Add or remove columns to/from your query table by doing the following:\n                         \n\n\n\n                            Click the\n                            \n                             Columns\n                            \n                            tab.\n                           \n\n\n\n                            Check or uncheck the boxes for the columns you want to keep or remove, respectively.\n                            \n                            You can use\n                            \n                             Select All\n                            \n                            to check all columns or\n                            \n                             Deselect All\n                            \n                            to uncheck all columns.\n                           \n\n\n\n                            Click\n                            \n                             R\n                            \n\n                             efresh\n                            \n                            to show the changes in the query table.\n                           \n\n\n\n\n\n                          (Optional) Change the order of rows in your query table by doing the following:\n                         \n\n\n\n                            Click the\n                            \n                             Order\n                            \n                            tab.\n                           \n\n\n\n                            Select a column to order by in the first dropdown under \"Order rows by,\" then select the order type (\n                            \n                             ascending\n                            \n                            or\n                            \n                             descending\n                            \n                            ) in the next dropdown.\n                            \n\n\n\n\n\n\n                            If you want to include another column to order by, click\n                            \n                             Add an order clause\n                            \n                            then repeat the instructions in the previous step.\n                           \n\n\n\n                            Click\n                            \n                             R\n                            \n\n                             efresh\n                            \n                            to show the changes in the query table.\n                           \n\n\n\n\n\n                          (Optional) Limit the rows of data returned by doing the following:\n                         \n\n\n\n                            Enter the row number in which you want to begin returning data in the first dropdown under \"Limit.\"\n                           \n\n\n\n                            Specify the number of rows of data to return in the second dropdown.\n                            \n\n                            For example, if you only wanted to return rows 10 through 20, you would enter\n                            \n                             10\n                            \n                            in both dropdowns (the first signifying that the import should begin at row 10, and the second signifying that 10 rows of data should be imported).\n                            \n\n\n\n\n\n\n                            Click\n                            \n                             R\n                            \n\n                             efresh\n                            \n                            to show the changes in the query table.\n                           \n\n\n\n\n\n                          Click\n                          \n                           Save\n                          \n                          when you are done making changes to the query table in the\n                          \n                           DataSets\n                          \n                          tab.\n                          \n\n                          Your query table data now appears in the sidebar, broken up into components you can manipulate separately, similar to Cards. These components include the name of the query table; a preview of the query table's column headers if the table contains one or more columns OR the single value if you chose to aggregate the data; and the SQL query being used to generate the table. The following screenshot shows an example of a query table with columns:\n                          \n\n\n\n\n\n\n                          Pull query table components into your document by dragging them from the sidebar into Word.\n                         \n\n\n\n                          (Optional) If you need to open the wizard for this query table so you can make changes, you can do so by clicking\n                          \n                           Edit this Query\n                          \n                          .\n                         \n\n\n\n                          (Optional) To delete this query, click\n                          \n                           Delete this Query\n                          \n                          .\n                         \n\n\n\n                        Refreshing Domo Content\n                       \n\n                        After you add Domo content (either Card components or query tables) to a Word document, you can refresh as necessary to update the data.\n                       \n\n\n                         To refresh your Domo content,\n                        \n\n\n\n\n                          Click\n                          \n                           Refresh\n                          \n                          in the\n                          \n                           Domo\n                          \n                          tab.\n                         \n\n\n\n                          Click\n                          \n                           Yes\n                          \n                          to confirm.\n                         \n\n\n\n                        Troubleshooting\n                       \n\n                        Several customers have reported an issue in which Microsoft disables the plugin after a crash; hence the plugin is still installed but is in a disabled state, so the\n                        \n                         Domo\n                        \n                        tab doesn't appear. Reinstalling the plugin leaves it in the disabled state. Below are instructions to re-enable the plugin.\n                       \n\n\n                         To re-enable the Word Plugin\n                        \n\n                         ,\n                        \n\n\n\n\n                          Open Word.\n                         \n\n\n\n                          Select\n                          \n                           File > Options\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Add-ins\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Manage\n                          \n                          dropdown, select\n                          \n                           COM Add-ins\n                          \n                          , then click\n                          \n                           Go\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Check the box next to\n                          \n                           DomoWord\n                          \n                          then click\n                          \n                           OK\n                          \n                          .\n                          \n\n\n\n\n\n\n                        If the box is already checked and the\n                        \n                         Domo\n                        \n                        tab still doesn't appear, make sure you don't have multiple versions of the plugin installed. You can remove extra instances by doing the following:\n                       \n\n\n\n                          In the Windows Control Panel, go to\n                          \n                           Add/Remove Programs\n                          \n                          .\n                         \n\n\n\n                          Remove all instances of \"DomoWord.\"\n                         \n\n\n\n                          Reinstall the plugin.", "Preview Article": "Click here to preview", "URL Name": "360042933094", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004256", "Archived Date": "", "Language": "English", "Primary Version": "Using the Domo Word Plugin", "Article Total View Count": "11,819", "": "", "Article Created Date": "10/24/2022, 9:35 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Using the Domo Word Plugin\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Plugins For Sharing Domo Content\n              \n", "url": "/s/topic/0TO5w000000Zao3GAC"}]}