{"file_path": "../../raw_kb_v2\\article\\360042929634\\index.html", "content": {"Title": "Oracle CRM on Demand Connector", "Article Body": "Intro\n                       \n\n                        Oracle's CRM On Demand solutions help organizations drive sales, marketing, loyalty, and service effectiveness through a CRM that integrates with other Oracle products and services.\n                       \n\n                        You connect to your Oracle CRM On Demand account in the Data Center. This topic discusses the fields and menus that are specific to the Oracle CRM On Demand connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Oracle CRM On Demand account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The user host where your Oracle CRM On Demand account is located\n                         \n\n\n\n                          Your Oracle CRM On Demand username and password\n                         \n\n\n\n                        Connecting to Your Oracle CRM On Demand Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Oracle CRM On Demand Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Oracle CRM On Demand account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Host\n                           \n\n\n\n                            Enter the host name where the Oracle CRM On Demand account is found.\n                           \n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter the username for the Oracle CRM On Demand account.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter the username for the Oracle CRM On Demand account.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Oracle CRM On Demand credentials, you can use the same account any time you go to create a new Oracle CRM On Demand DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains two primary menus from which you select your resource and the attributes (columns) for the resource you want to appear in the DataSet. You can also add an optional query expression to filter resources.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Resources\n                           \n\n\n\n                            Select the Oracle CRM On Demand resource (record) you want to pull into Domo as a DataSet.\n                           \n\n\n\n\n\n\n                           Attributes\n                          \n\n                           Select all the attributes (columns) of the selected resource you want to appear in your DataSet.\n                          \n\n\n\n                           Advanced Options\n                          \n\n                           Check this box to reveal the optional\n                           \n                            Query Expression\n                           \n                           field.\n                          \n\n\n\n                           Query Expression (Optional)\n                          \n\n\n                            Enter a query expression to filter resources in a collection. A query expression is comprised of one or more \"field expressions.\" The maximum supported query expression length is 4096 characters.\n                           \n\n                            The following is the query expression syntax:\n                            \n\n\n                             QUERY EXPRESSION = FIELD EXPRESSION [; FIELD EXPRESSION]\n                             \n\n                             [FIELD EXPRESSION] = <Field> <OPERATOR> <VALUE> [ANDOR CLAUSE]\n                             \n\n                             [ANDOR CLAUSE] = <AND/OR> <OPERATOR> <VALUE> [ ANDOR CLAUSE]\n                            \n\n\n                            The following example shows a query expression with two field expressions separated by a semicolon:\n                            \n\n\n                             AccountName='PSKDemo02' OR = 'A. C. Networks'; Reference = false\n                            \n\n\n\n\n\n\n\n\n\n\n\n                                 Tips:\n                                \n\n\n\n\n                                Use single quotes around values.\n                               \n\n                                Use the same date format as exists in the field you are writing the expression for.\n                               \n\n\n\n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042929634", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003494", "Archived Date": "", "Language": "English", "Primary Version": "Oracle CRM on Demand Connector", "Article Total View Count": "4,693", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Oracle CRM on Demand Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}