{"file_path": "../../raw_kb_v2\\article\\360042923134\\index.html", "content": {"Title": "Copying a DataFlow", "Article Body": "You can create a copy of a DataFlow. This is similar to doing a \"Save As,\" in that copied DataFlows can be renamed, edited, saved, and run independently of their original DataFlow. This is an excellent way to make minor changes to a complicated DataFlow without having to rebuild it from scratch.\n                       \n\n                        When you choose to create a copy of a DataFlow, the\n                        \n                         Edit DataFlow\n                        \n                        view opens. You can make any changes you want to the copy of the DataFlow, including giving it a new name, before saving/running it.\n                       \n\n                        When you copy a DataFlow, the version history of the DataFlow is\n                        \n                         not\n                        \n                        preserved. For more information about DataFlow versioning, see\n                        \n                         Viewing the Version History for a DataFlow\n                        \n                        .\n                       \n\n\n                         To make a copy of a DataFlow,\n                        \n\n\n\n\n                          In Domo, click\n                          \n                           Data\n                          \n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Click\n                          \n                          in the left-hand navigation pane.\n                         \n\n\n\n                          The\n                          \n                           DataFlows\n                          \n                          tab opens.\n                         \n\n\n\n                          Locate the DataFlow you want to copy.\n                          \n                          You can use the filter options to narrow down the DataFlows that appear in the list.\n                         \n\n\n\n                          Mouse over the desired DataFlow then click\n                          \n                          to display a list of options.\n                         \n\n\n\n                          Click\n                          \n                           Create Copy\n                          \n                          .\n                          \n                          The\n                          \n                           Edit DataFlow\n                          \n                          view opens.\n                          \n                          When you copy a DataFlow, the title of the copied DataFlow is prefixed with \"Copy of \" before the title, which you can edit.\n                         \n\n\n\n                        From this point, you can rename the DataFlow, edit the input and output data sets and transforms, save it with or without running it, etc.\n                        \n                        You can also copy a DataFlow from its Details view, by selecting\n                        \n                         Create Copy\n                        \n                        in the\n                        \n                        menu.", "Preview Article": "Click here to preview", "URL Name": "360042923134", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004561", "Archived Date": "", "Language": "English", "Primary Version": "Copying a DataFlow", "Article Total View Count": "5,324", "": "", "Article Created Date": "10/24/2022, 10:14 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Copying a DataFlow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               DataFlow Management\n              \n", "url": "/s/topic/0TO5w000000ZanUGAS"}]}