{"file_path": "../../raw_kb_v2\\article\\4402322966807\\index.html", "content": {"Title": "Register Snowflake with Cloud Amplifier", "Article Body": "Intro\n                       \n\n                        With Cloud Amplifier, you can power your Domo instance using Snowflake.\n                       \n\n                        This article assumes you\n                        \n\n                        are familiar with Snowflake and provides information on how to register Snowflake with Cloud Amplifier in the following topics:\n                       \n\n\n\n                          Prerequisites\n                         \n\n\n\n                          Read-only setup\n                         \n\n\n\n                          Write setup\n                         \n\n\n\n                          Use Snowflake-sourced DataSets\n                         \n\n\n\n                          FAQ\n                         \n\n\n\n                          Troubleshooting\n                         \n\n\n\n\n\n                        Prerequisites\n                       \n\n                        Cloud Amplifier setup consists of two parts: Read-only or Read/Write.\n                       \n\n                        After the Read-only setup is complete, you may begin using virtual tables that read from Snowflake to create cards, set up Alerts, or serve as inputs in Magic ETL flows. You can set up Read only and return later to set up the Write portion.\n                       \n\n                        Recommended Account Creation - All\n                       \n\n                        Before setting up the Snowflake connection, we strongly recommend that you complete the following:\n                       \n\n\n\n                          (Recommended) ​Create a Snowflake service account —\n                         \n                         We recommend creating a new Snowflake account specifically for this integration. You can use any account with read access in Snowflake, but a service account is best practice. This account must have read access to your default Snowflake environment in order to create virtual Snowflake tables in Domo.\n                        \n\n\n                          (Recommended) Create a Domo service account —\n                         \n                         We recommend creating a new Domo account specifically for this integration. The account role must have the Manage Cloud Accounts and Manage DataSet grants enabled.\n                        \n\n\n                        For more information about roles and grants, see our article about\n                        \n                         Managing Custom Roles.\n                        \n\n\n                        Account Creation - Write\n                       \n\n                        Before registering with Cloud Amplifier for the Write portion of the setup, you must complete the following:\n                       \n\n\n\n\n                           (Required) Create a default Snowflake database —\n                          \n                          You need a Snowflake database that is exclusively for Domo to write Domo-managed tables. During setup, this database is the default.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Any tables not managed by Domo in this database will not be seen by Cloud Amplifier.\n                            \n\n\n\n\n\n\n\n\n                          (Conditional) Place IP Addresses on an allowlist —\n                         \n                         If your Snowflake environment restricts access based on IP address, you may need to place Domo IPs on an allowlist.\n                         \n                          For more information, see our article about\n                          \n                           Allowlisting IP Addresses for Connectors and Federated Adapters\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             During the Write setup process, you are provided with SQL statements to create the integration. These statements must be executed against your Snowflake environment by a Snowflake administrator with the ACCOUNTADMIN role.\n                             \n                              This is a Snowflake requirement and prevents the need to manage your Snowflake administrator credentials within Domo, which is especially important in larger organizations where your Snowflake administrator may not have Domo access. After the integration is established, you no longer need a Snowflake administrator account.\n                             \n\n\n\n\n\n\n\n\n\n                        Read-only Setup\n                       \n\n                        To set up Read-only access and\n                        \n                         to\n                        \n                        begin referencing Snowflake tables from within Domo using Cloud Amplifier, follow these steps:\n                       \n\n\n                         Log in to your Domo service account.\n                        \n\n                         In the navigation header, select\n                         \n                          Data\n                         \n                         .\n                         \n                         The Data Center displays.\n                        \n\n                         If you are not already there, go to the\n                         \n\n                          Data Warehouse\n                         \n                         in the side rail.\n                        \n\n                         In the warehouse area of the screen, select the molecule shown below.\n                         \n                         Selecting the molecule brings it\n                         \n\n                         into focus.\n                         \n\n\n\n\n\n\n\n                         Select\n                         \n\n                          Add New Cloud\n                         \n                         .\n                         \n                         The Amplify modal displays.\n                        \n\n                         In the modal under\n                         \n                          Native integration\n                         \n                         , select\n                         \n                          Snowflake\n                         \n                         .\n                         \n                         The\n                         \n                          Cloud integrations\n                         \n                         modal displays.\n                         \n\n\n\n\n                         Select\n                         \n                          + Add New Integration\n                         \n                         .\n                         \n\n\n\n\n                         Enter the Snowflake setup information:\n                         \n\n\n\n                             Integration name\n                            \n                            — A unique name to help you identify the integration in Domo.\n                           \n\n\n\n                            (Optional)\n                            \n                             Integration description\n                            \n                            — A description of the integration.\n                           \n\n\n\n\n                             Snowflake connection URL\n                            \n                            — This is your Snowflake URL,\n                            \n\n                            which you can find\n                            \n\n                            on the Snowflake login page. The URL is in this format:\n                            \n                             instancename.region\n                            \n                            .snowflakecomputing.com.\n                           \n\n\n\n\n                             Username/password\n                            \n                            — The credentials for the Snowflake service account that you created.\n                           \n\n\n\n\n\n\n\n                         Select the Snowflake warehouse to use for loading and/or querying data.\n                         \n\n\n\n\n                         Read-only configuration is now complete. Continue to the next step to add Snowflake data to Domo.\n                         \n\n\n\n\n                         (Optional) Select\n                         \n                          Choose Data Tables\n                         \n                         to create DataSets in Domo.\n                         \n                         The modal displays navigation for databases, schemas, and tables in Snowflake that you want to add to Domo. Locate and select the data you want to add and select\n                         \n                          Create DataSets\n                         \n                         .\n                         \n\n\n\n\n\n\n\n                        Write Setup\n                       \n\n                        Registering with Cloud Amplifier for write capabilities is a multi-step process that requires a Snowflake administrator.\n                       \n\n                        The following graphic displays the process to register a Snowflake instance with Cloud Amplifier:\n                       \n\n\n\n                       Follow these steps to configure write capabilities:\n                       \n\n                         Enter the name of the\n                         \n                          Default Role\n                         \n                         that you assigned to the Snowflake service account and the\n                         \n                          Snowflake write database name\n                         \n                         .\n                         \n                          The\n                          \n                           Snowflake write database name\n                          \n                          is the default Snowflake database to which all new data coming from Domo is added. The name is case\n                          \n\n                          sensitive,\n                          \n\n                          and each letter should be capitalized.\n                         \n\n\n                         Select\n                         \n                          Generate SQL\n                         \n                         to generate SQL unique to this integration.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             You cannot use this SQL for other integrations or accounts and you must regenerate it if the credentials are changed.\n                            \n\n\n\n\n\n\n\n                         Copy the SQL from the dialog and execute the SQL against your Snowflake warehouse. This SQL can only be executed by a Snowflake account administrator with the ACCOUNTADMIN role.\n                         \n                         The output of that SQL is a CSV file description of the integration that includes IDs required by Domo to continue setup.\n                         \n\n\n\n\n                         Copy the following values from the SQL output:\n                         \n\n\n                            User ARN\n                           \n                           :\n                           \n\n                           STORAGE_AWS_IAM_USER_ARN\n                          \n\n\n                            External ID\n                           \n                           : STORAGE_AWS_EXTERNAL_ID\n                           \n\n                            Additional SQL is generated to register the ARN and External ID with Domo. A Snowflake administrator with the ACCOUNTADMIN role must execute this SQL against the warehouse you selected for storing data earlier in this process.\n                           \n\n\n\n\n\n\n\n\n\n\n                         In Domo, confirm that the script successfully executed.\n                         \n                         Domo then initializes the Snowflake integration, creates required assets in Snowflake, such as tables and schemas, and enables Cloud Amplifier for this account.\n                        \n\n\n                          Finalize the write integration by checking the box to acknowledge that you understand that Domo can make changes to your Snowflake environment.\n                         \n\n\n\n\n\n\n                          Select\n                          \n                           Apply\n                          \n                          .\n                          \n                          When you see the\n                          \n                           Select Snowflake tables\n                          \n                          screen, your connection is working.\n                         \n\n\n                         (Optional) The modal displays navigation for databases, schemas, and tables in Snowflake that you want to add to Domo. Locate and select the data you want to add and select\n                         \n                          Create DataSets\n                         \n                         .\n                         \n\n\n\n\n                       Write setup for Snowflake is now complete.\n                       \n\n\n                        Use Snowflake-sourced DataSets\n                       \n\n                        When you use Snowflake-sourced DataSets in a DataFlow, the data is queried live from Snowflake at the time the flow is executed. In addition, Snowflake-sourced DataSets are checked for updates every 15 minutes based on the table's\n                        \n                         LAST_ALTERED\n                        \n                        DateTime. If a table has been updated since it was last checked, DataFlows that use that table as a trigger will execute.\n                       \n\n\n\n                        FAQ\n                       \n\n\n                         Are there requirements for database configuration (outside of Domo) or best practices?\n                        \n\n\n                        Make sure to create a dedicated database inside Snowflake for your Domo integration. If you connect to an existing Snowflake database, then Domo does not see the tables that are in that database.\n                       \n\n\n                         What is the guidance around warehouse configuration in Snowflake for Cloud Amplifier?\n                        \n\n\n                        Domo performs different activities within the CDW account, such as data loading and querying. For proof of concepts and initial testing, we recommend a small-sized multi-cluster warehouse (multi-purpose for load and query) set to scale up automatically. You can set a limit on the\n                        \n\n                        max cluster size to put an upper bound on scaling and limit the cost envelope.\n                       \n\n                        When you are ready for production data, we recommend setting up warehouses depending on the purpose. Using separate warehouses for querying and loading allows you to optimize performance as needed.\n                       \n\n\n                         How do I use data transformation on my Snowflake data?\n                        \n\n\n                        With your data in Snowflake, Domo supports two different mechanisms for transforming data:\n                       \n\n\n\n\n\n\n\n\n\n\n                           DataSet Views\n                          \n                          — DataSet Views provide\n                          \n\n                          the Views Explorer tool to create data transformations on your Snowflake DataSets. You can perform operations such as filtering, grouping/aggregation, JOINs, UNIONs, and creating calculated columns from a graphic user interface. DataSet Views are created as virtual DataSets, with queries sent back to the parent DataSets.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Creating a DataSet View in Domo does not create a View (normal or materialized) in Snowflake. The View definition is stored in Domo, and the resulting query is sent to Snowflake table(s) when needed.\n                            \n\n\n\n\n\n\n\n\n\n                           Magic ETL DataFlows\n                          \n                          — Magic ETL is supported with Domo running on the customer's CDW. Using Magic ETL with Snowflake data results in data being exported from Snowflake to Magic ETL in a transient state, processed, and written back to Snowflake. Note that Domo only operates on this data in a transient fashion and does not store DataFlow outputs in Domo. (They are sent to the Snowflake warehouse.)\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Data is cached in the Magic ETL execution environment for seven days, or the two most recent data versions from that Magic ETL execution.\n                            \n\n\n\n\n\n\n\n\n\n                         What is the difference between Domo-managed and customer-managed Snowflake DataSets?\n                        \n\n\n                        When you connect Domo to your Snowflake account, Domo operates over two classes of databases and underlying tables. Tables you create and update directly through independent pipelines or ingestion mechanisms can be explored and registered in Domo, accessible in a read-only fashion. Domo can read and directly query these customer-managed databases.\n                       \n\n                        Additionally, we recommend creating a new database in Domo for Read/Write access. Domo uses this Domo-managed database to write data that comes\n                        \n\n                        in through the Domo ingestion pipeline, such as with the thousands of connectors available to bring data into Snowflake. Domo also uses this Domo-managed database to create outputs of data transformations (DataFlow outputs).\n                       \n\n\n                         How are permission configured between Domo and Snowflake?\n                        \n\n\n                        Permissions originating in Snowflake are not programmatically passed into Domo. However, you can use Domo's native permission model, as well as personalized data permisssons (PDP) for data security to manage data access to underlying assets in Snowflake.\n                       \n\n\n                         What are the differences between using connectors to create DataSets from Snowflake and using Cloud Amplifier to create DataSets?\n                        \n\n\n\n\n                          Leaving data in Snowflake\n                         \n                         — Perhaps the biggest difference is that all Snowflake connectors import/duplicate data from Snowflake to Domo, while Cloud Amplifier leaves the data in Snowflake.\n                        \n\n\n                          Bulk create\n                         \n                         — Cloud Amplifier allows you to look up and bulk select up to 50 Snowflake tables to immediately create 50 unique DataSets. To do this with connectors, you would have to configure each DataSet individually with a connector.\n                        \n\n\n\n\n                        Troubleshooting\n                       \n\n                        If you get stuck, one of the following troubleshooting steps may help:\n                       \n\n\n\n                          Check Snowflake Service Account\n                         \n\n\n\n\n                         Log into Snowflake with the service account credentials.\n                        \n\n                         Make sure you can view the default Snowflake Database and can query tables that you expect to import.\n                        \n\n\n\n\n                          Assign Correct Role\n                         \n\n\n\n                        Make sure that a Snowflake administrator with the ACCOUNTADMIN role is executing the SQL that Domo provided in Snowflake.\n                       \n\n\n\n                          Use Correct URL\n                         \n\n\n\n                        Make sure that the Snowflake connection URL in Domo matches the Snowflake login URL.\n                       \n\n                        You can find the URL on the Snowflake login page. The URL will be in this format:\n                        \n                         instancename.region.\n                        \n                        snowflakecomputing.com.\n                       \n\n                        If you are still experiencing issues, please submit a request to the\n                        \n                         Domo Support\n                        \n                        team.", "Preview Article": "Click here to preview", "URL Name": "4402322966807", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003148", "Archived Date": "", "Language": "English", "Primary Version": "Register Snowflake with Cloud Amplifier", "Article Total View Count": "5,346", "": "", "Article Created Date": "10/24/2022, 9:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Register Snowflake with Cloud Amplifier\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Cloud Amplifier\n              \n", "url": "/s/topic/0TO5w000000Zjd3GAC"}]}