{"file_path": "../../raw_kb_v2\\article\\360043430973\\index.html", "content": {"Title": "Celtra Connector", "Article Body": "Intro\n                       \n\n                        Celtra empowers agencies, media suppliers and brand leaders with the leading creative technology for data-driven brand display advertising across all screens. To learn more about the Celtra API, refer to their blog (\n                        \n                         http://www.celtra.com/insights/blog/...ed-adcreator-3\n                        \n                        ).\n                       \n\n                        You connect to your Celtra account in the Data Center. This topic discusses the fields and menus that are specific to the Celtra connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Best Practices\n                       \n\n                        The dimensions and metrics available when using the Celtra connector are almost identical to those in the Celtra Report Builder (which you can find in Celtra by going to\n                        \n                         Reporting Center > Report Builder\n                        \n                        ). It is recommended you use the Report Builder to build the report you want in Domo, noting the dimensions and metrics, then select those same fields in the Domo connector. This lets you quickly find the right data, speed up your connector configuration time, and schedule your reporting.\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Celtra account and create a DataSet, you must have the following:\n                       \n\n\n\n                          A Celtra App ID\n                         \n\n\n\n                          A Celtra secret key\n                         \n\n\n\n                          Your Celtra subdomain\n                         \n\n\n\n                        You can obtain your App ID and secret key by navigating to\n                        \n                         User Name > Settings\n                        \n                        in Celtra. After you create the API application, you will receive these credentials.\n                       \n\n                        You can find your Celtra subdomain by looking at the portion of your Celtra instance URL right after\n                        \n                         https://\n                        \n                        . For example, if your Celtra instance was\n                        \n\n                          customerxyz.celtra.com\n                         \n\n                        , your subdomain would be\n                        \n                         customerxyz\n                        \n                        .\n                       \n\n                        Connecting to Your Celtra Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Celtra Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Celtra account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           App ID\n                          \n\n                           Enter your Celtra app ID.\n                          \n\n\n\n                           Secret Key\n                          \n\n                           Enter your Celtra secret key.\n                          \n\n\n\n                           Subdomain\n                          \n\n                           Enter your Celtra subdomain.\n                          \n\n\n\n\n                        For information about obtaining these credentials, see \"Prerequisites,\" above.\n                       \n\n\n                         Once you have entered valid Celtra credentials, you can use the same account any time you go to create a new Celtra DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on options you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Celtra report you want to run. Currently only one report type is available.\n                           \n\n\n\n\n                               Analytics\n                              \n\n                               Returns analytics data for the authenticated user.\n                              \n\n\n\n\n\n\n\n                           Filter Type\n                          \n\n                           Select whether you want the data in your report to be filtered by an account, campaign, creative, or placement.\n                          \n\n\n\n                           Account ID\n                          \n\n\n                            Enter the ID of the account you want to retrieve data for. The ID is presented as an 8 character alpha-numeric value.\n                           \n\n\n                             To find an account ID in Celtra, do the following:\n                            \n\n\n\n\n                              Log into Celtra.\n                             \n\n\n\n                              Navigate to the Report Builder (\n                              \n                               Reporting Center > Report Builder\n                              \n                              ).\n                             \n\n\n\n                              Locate the \"Account ID\" dimension and include it in the report.\n                             \n\n\n\n                            The spreadsheet sample panel then populates with the \"Account ID\" column.\n                           \n\n                            If you only have one account in Celtra, the ID that appears as the data for the \"Account ID\" column is your Account ID to use for the connector configuration. If you have many accounts, it is recommended that you download the report from Celtra as an Excel file to see all the Account IDs that exist for your organization. You may then pick and choose the Accounts IDs you want to use for the connector.\n                           \n\n                            The Domo connector currently only supports 1 Account ID per DataSet, so if you have 4 Accounts IDs you want to use in Domo, at a minimum you must set up 4 DataSets, 1 DataSet per Account ID.\n                           \n\n\n\n\n                           Campaign ID\n                          \n\n                           Enter the ID of the campaign you want to retrieve data for. You can find the campaign ID under the campaign name in the\n                           \n                            My Campaign\n                           \n                           tab.\n                          \n\n\n\n                           Creative ID\n                          \n\n                           Enter the ID of the creative you want to retrieve data for.\n                          \n\n\n\n                           Placement ID\n                          \n\n                           Enter the ID of the placement in which the creative was trafficked.\n                          \n\n\n\n                           Dimension\n                          \n\n                           Select all of the dimensions you want your data to be broken down by.\n                          \n\n\n\n                           Metrics\n                          \n\n                           Select all of the metrics you want to appear in your report.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043430973", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003788", "Archived Date": "", "Language": "English", "Primary Version": "Celtra Connector", "Article Total View Count": "2,374", "": "", "Article Created Date": "10/24/2022, 9:15 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Celtra Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}