{"file_path": "../../raw_kb_v2\\article\\360043439413\\index.html", "content": {"Title": "Specifying Your Personal Profile Information", "Article Body": "In your\n                        \n                         Profile\n                        \n                        page, you can specify much of the personal information that appears in the profile header. The information you can specify here includes your name, position, department, landline number, cell number, company location, and tenure. Your employee number also appears here if one has been specified in the Admin Settings; however, you cannot edit it on this screen. You can only edit it in the\n                        \n\n                          People\n                         \n\n                        tab in the Admin Settings. For more information, see\n                        \n                         Changing User Information\n                        \n                        . Your email address does\n                        \n                         not\n                        \n                        appear here; however, if you click the\n                        \n                        icon on a user's\n                        \n                         Profile\n                        \n                        page, your email client opens with the user's email address automatically entered in the\n                        \n\n                          To\n                         \n\n                        field.\n                       \n\n                        If you have an \"Admin\" default security role or a custom role with \"Edit Users\" enabled, you can specify or edit any other user's personal information on their personal\n                        \n                         Profile\n                        \n                        page. For example, if a user has just started at your company and you want to get them set up quickly, you could create a\n                        \n                         Profile\n                        \n                        page for them and populate it with their basic information.\n                        \n                         For more information about default security roles, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n                        The following screenshot indicates the locations of the editable personal information items in the\n                        \n                         Profile\n                        \n                        page.\n                       \n\n\n\n\n\n\n                        The following table describes these items in more detail:\n                       \n\n\n\n\n\n                            Item\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Department\n                           \n\n\n\n                            The department to which this user belongs. Click to edit.\n                           \n\n\n\n\n\n                            Name\n                           \n\n\n\n                            The name of this user. Click to edit. You can also edit a user's name in the\n                            \n                             People\n                            \n                            tab in Admin Settings.\n                           \n\n\n\n\n\n                            Title\n                           \n\n\n\n                            This user's title. Click to edit. You can also edit a user's title in the\n                            \n                             People\n                            \n                            tab in Admin Settings.\n                           \n\n\n\n\n\n                            Tenure\n                           \n\n\n\n                            The amount of time this user has been employed in your company, based on an entered start date. You can edit a user's tenure by clicking to open a calendar, from which you can select the user's start date.\n                           \n\n\n\n\n\n                            Employee Number\n                           \n\n\n\n                            This user's employee number. Employee numbers can\n                            \n                             only\n                            \n                            be entered/edited in the\n                            \n                             People\n                            \n                            tab in the Admin Settings.\n                           \n\n\n\n\n\n                            Location\n                           \n\n\n\n                            This user's location. Click to edit.\n                           \n\n\n\n                              Add info on the Company Locations tab in Admin Settings when available\n                             \n\n\n\n\n\n\n\n                            Mobile number\n                           \n\n\n\n                            This user's mobile number. Click\n                            \n                            to display the number, then click the number to edit. You can also display the user's landline number by clicking\n                            \n                            .\n                           \n\n\n\n                            Your valid mobile phone number MUST start with a country code. If your phone number in Japan is 080-1234-5678, enter it as \"+81 80-1234-5678\" where 81 is Japan's country code. If you are unsure what your country code is, see\n                            \n                             https://countrycode.org/\n                            \n\n\n\n\n\n\n                              If you are planning to enable multi-factor authentication for Domo for your company, users\n                              \n                               must\n                              \n                              enter their mobile numbers. Otherwise, they will not be able to log in. For more information, see\n                              \n                               Turning On Multi-Factor Authentication\n                              \n                              .\n                             \n\n\n\n\n\n\n\n\n                         To specify or edit an item of personal profile information,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Open your\n                            \n                             Profile\n                            \n                            page by clicking your profile picture in the top right corner of the screen. (If you have not yet selected a profile picture, a\n                            \n                            icon appears instead.)\n                           \n\n\n\n                            Open another user's\n                            \n                             Profile\n                            \n                            page by clicking that user's profile picture anywhere that it appears.\n                           \n\n\n\n\n\n                          Click in the area for the information you want to add or change.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            If you are specifying tenure, use the left and right arrow buttons at the top of the calendar to locate the desired start date, then click the start date to select it. You can also \"zoom out\" in the calendar to show a wider range by clicking the month or year in the top center of the calendar. For example, in the following screenshot, the user clicks on the month name, and the calendar zooms out to show all of the months in 2006. Clicking the left and right arrows would then scroll through years, rather than months. Clicking \"2006\" would zoom out again to show a 10-year range you could select from.\n                           \n\n\n\n\n\n\n\n\n\n\n                          Selecting a date updates the number of years in\n                          \n\n                            Tenure\n                           \n\n                          .\n                         \n\n\n                         If you are not specifying tenure, just enter the appropriate information.\n                        \n\n\n                        For information about changing your Domo password, see\n                        \n                         Changing Your Password\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439413", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004395", "Archived Date": "", "Language": "English", "Primary Version": "Specifying Your Personal Profile Information", "Article Total View Count": "4,904", "": "", "Article Created Date": "10/24/2022, 9:46 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Specifying Your Personal Profile Information\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               User Profile\n              \n", "url": "/s/topic/0TO5w000000ZaoLGAS"}]}