{"file_path": "../../raw_kb_v2\\article\\360060270674\\index.html", "content": {"title": "\n\n\n Google Ads Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n**Important:**\n Google will sunset their Adwords API on April 27th 2022 in favor of their Google Ads API.\n\n\n As a result, Domo will deprecate its Google Ads connector (com.domo.connector.adwords.oauth) which relies on the Adwords API.  See\n\nGoogle Ads Connector Deprecation\n\nfor more information.\n\n\n Google Ads, formerly Google Adwords, is an online advertising service where advertisers pay to display brief ads to web users. Use the Google Ads connector to retrieve performance reports about your accounts, ads, campaigns, budgets, and many more.\n\nFor more information about the Ads API, see\n\nhttps://developers.google.com/adword...s/guides/start\n\n.\n\n\n This topic discusses the fields and menus that are specific to the Google Ads OAuth connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Google Ads data using this connector,\n\nyou must have your Google credentials (email address and password).\n\nConnecting to Google Ads Account\n----------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Ads OAuth Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google Ads OAuth connector uses OAuth to connect to Google. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google Ads accounts in Domo) to open the Google OAuth screen where you can select the account you want to connect to. After selecting an account, specify the password for that account. After you have entered a valid password, you can use the same account in Domo any time you create a Google Ads OAuth DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of the currently active Google account.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields and menus you can use to configure your report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Google Ads OAuth report type to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account Performance\n  |\n Returns all statistics aggregated by default at the account level.\n  |\n|\n Ad Performance\n  |\n Returns all statistics aggregated at the ad level.\n  |\n|\n Ad Group Performance\n  |\n Returns all statistics aggregated by default at the ad group level.\n  |\n|\n Budget Performance\n  |\n Returns all statistics aggregated by default at the budget level.\n  |\n|\n Keywords Performance\n  |\n Returns all statistics aggregated at the keyword level.\n  |\n|\n Campaign Performance\n  |\n Returns all statistics aggregated by default at the campaign level.\n  |\n|\n Placement Performance\n  |\n Returns all statistics aggregated at the placement level.\n  |\n\n|\n|\n Customer ID\n  |\n\nEnter a comma-separated list of the Customer ID you want to retrieve data for. Customer IDs must be for your Google Ads advertiser accounts not for a manager account.\n\n|\n|\n Segments\n  |\n Select the segments to breakdown the data.\n  |\n|\n Metrics\n  |\n Select the metrics you want to retrieve.\n  |\n|\n Currency Display\n  |\n\nSelect whether to display money amounts as micro units of local currency ($100.00->100,000,000.00) or local currency.\n\n|\n|\n Date Range\n  |\n Select the date range for the data in your report.\n  |\n|\n Date Type\n  |\n Specify whether you want to retrieve the data for a specific date or a date range.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n\n\n**Days Back**\n\n\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ********End Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ********Start Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n This connector is not working for me. Are there any other ways to bring my AdWords data into Domo?\n\nIf this connector does not bring your data into Domo, try using one of the following Domo connectors:\n\n\n Google Ads via Google BigQuery Service Connector, Google BigQuery Service Connector, or Google Sheets Connector.\n\nGoogle Ads Connector\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need your Google credentials.\n\n###\n How do I know that my login credentials are secure?\n\nThe login process uses the OAuth process, so your Google credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n###\n Can I use the same account to create multiple datasets?\n\nYes\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360060270674\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003252\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Ads Connector\n\n", "article_total_view_count": "\n\n\n 5,109\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "google_ads_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}