{"file_path": "../../raw_kb_v2\\article\\360048116074\\index.html", "content": {"title": "\n\n\n November 2015 Release Notes\n\n\n", "article_body": "\n\n\n**Note:**\n Depending on the product version you are using, the documentation may include information about features that may not be available or may have changed.\n\n\n New features and enhancements\n--------------------------------\n\nFeatures and enhancements in this release include the following:\n\n##\n The Data Warehouse\n\nThe Data Warehouse provides a visually engaging way for you to interact with your data warehouse that has been built within Domo. The Data Warehouse gives you quick insight into the breadth of your data and also allows you to drive into the depth of individual data providers. You can then take your newly gained insights and take effective action on a specific data source or create new data source where a gap was discovered.\n\n\n The Data Warehouse provides a three-dimensional visual representation of all data sources and Magic connectors in your Domo, along with data currently flowing into and between them. These are represented as stacks on a rotating palette. You can configure the order and height of the stacks to indicate different metrics.\n\n#####\n Data Warehouse main view\n\n\n Mousing over a stack causes the palette to stop rotating, and an information panel appears for the data source or Magic connector. This panel shows information such as the number of DataSets for the data source or connector, the number of cards built, the number of successful and failed runs, etc.\n\n\n You can click and drag the panel to move it manually. The panel can be moved in three dimensions.\n\n\n Stacks are colored differently depending on their type and current activity. Green indicates a functional data source, blue indicates a Magic connector, orange indicates a warning state for a data source, and red indicates that one or more DataSets for a data source is broken and needs immediate attention.\n\n\n The arrangement of stacks around the palette and the height of the individual stacks indicate specified metrics. By default, stack arrangement indicates status and stack height indicates the number of rows of data. If you want, you can change the criteria determined by arrangement and height. For example, you could set the arrangement of stacks around the palette to indicate the number of cards built using the data source or Magic connector and the height of the stacks to indicate the number of DataSets.\n\n\n Clicking a connector stack changes the view to show three-dimensional representations of all DataSets for the connector. This view also shows the data sources, the number of DataSets, and the number of rows for the data source or connector.\n\n#####\n Connector stack view for The Data Warehouse\n\n\n For information about The Data Warehouse, see\n\nUsing The Data Warehouse to Manage Data\n\n.\n\n##\n Workbench 4\n\nWorkbench version 4 is here. The latest version of Domo Workbench provides a clean and intuitive user experience that will help you get the most out of Workbench. New features like API token login and parallel job processing improve security and performance while new connections like the external process plugin will extend the reach to Workbench to almost any data you have in your Data Center.\n\n\n The user interface has been updated with all of the following improvements:\n\n Uses .Net and Windows best practices\n* Provides wizards for executing primary activities\n* Uses a tree navigation system to provide a cleaner flow for the creation of accounts, DataSet Jobs, and transforms\n* Provides enhanced logging\n\n\n In Workbench 4 you also have access to numerous security and performance upgrades, including the following:\n\n The use of API tokens for all Workbench users\n* Implementation of multi-part uploading for all large DataSet Jobs\n* Automated proxy setting determination\n* Simplification of multiple instance connections\n* Parallel job processing\n\nWorkbench 4 also includes a new developer plugin model that will enable you to do all of the following:\n\n Install new plugins directly in Workbench\n* Create data provider, transport, and transform plugins that can be consumed in a common format (DLL)\n\nIn addition to all this, this release includes other new functionality such as the ability to connect to OLAP cubes; the ability to define connections using external process file providers; the ability to create groups of DataSet Jobs on the same update schedule; and more.\n\n\n For information about Workbench 4, see\n\nWorkbench 4\n\n.\n\n##\n Buzz v3\n\nBuzz has been updated to provide more enjoyable and meaningful social experiences with your colleagues in Domo.\n\n\n You can view a discussion in the Buzz panel or expand it to fill the screen. The Buzz panel now displays only the first and last comments in each conversation in chronological order; however, you can expand any particular conversation to show only that conversation in its entirety. You can also filter the feed activity to show only discussions that are connected to a trending topic, card, or project.\n\n\n In addition, you can now do all of the following in Buzz:\n\n @ mention the users or groups you want to see your message\n* @ mention cards or projects you want to reference in the message\n* reference specific users, cards, groups, or projects using @ or popular topics using #\n* add new hash tags #\n* select images for URLs\n* attach documents and images by selecting from the browser, dragging and dropping, or entering the image URL\n* attach YouTube videos that can be played inline\n* navigate through previews of referenced cards using a card carousel\n* filter by browse mode or trending topic, card, or project\n* specify a post as public or private\n* \"mute\" discussions so you don't receive notifications when new comments are added to that discussion\n\n\n######\n Buzz - Main panel\n\n\n######\n Buzz - New discussion view\n\nFor more information about Buzz, see\n\nBuzz\n\n.\n\n##\n Notifications Management\n\nNotifications provide a way for you to know when important things happen in Domo that demand your attention. The new\n **Manage Notifications & Alerts**\n page in Domo gives you the flexibility to determine how, when, and which notifications come to you. This page lets you set options for Notifications, Instant Alerts, Daily Alerts, and Weekly Alerts.\n\n\n In the\n **Notifications**\n tab, you can toggle global settings for receiving notifications via email, mobile app, or SMS. You can also specify if and how you receive notifications for all of the following:\n\n Someone @ mentioning you or a group you're in\n* Someone commenting on a conversation you're mentioned in\n* Someone liking something you posted\n* Someone sharing a card or page with you\n* Someone assigning a task to you or updating your task\n* Someone uploading a new version of a document card you've favorite\n\nYou can also toggle subscription emails in the Notifications tab.\n\n#####\n Manage Notifications & Alerts - Notifications tab\n\nIn the\n **Instant Alerts**\n tab, you can set options for instant notifications for triggered alerts. In the\n **Daily Alerts**\n tab, you can set the time at which daily summary emails (lists of alerts) are sent to you. You can also specify whether updates to \"Favorited\" cards are included in the email. In the\n **Weekly Alerts**\n tab you can set the day of the week and time when weekly summary emails are sent.\n\n#####\n Manage Notifications & Alerts - Daily Alerts tab\n\nFor any alert, you can now select whether you want to receive instant, daily, and/or weekly notifications. Alerts with\n **Daily**\n selected appear in your daily summary email, and alerts with\n **Weekly**\n selected appear in your weekly summary email.\n\n\n For more information, see\n\nCustomizing Notification and Alert Settings\n\n.\n\n##\n Alert Summary card\n\nDomo's existing alert interface has been updated in the form of an alert summary card. This card contains all of the information and options necessary for understanding, editing, and deleting alerts. The card is available from the Alerts Center, the card Details view, and the Profile page.\n\n\n The alert summary card allows you to do all of the following from one place:\n\n Set instant, daily, and weekly notifications on the alert\n* Edit the alert\n* Delete the alert\n* View the Details view for the card in which the alert has been set\n* See the creator and followers of the alert\n* View the 180-day history for the alert\n* View a list of events when the alert has been triggered\n\nFor more information, see\n\nNotifications and Alerts\n\n.\n\n##\n Domo University training videos access\n\nYou can now access and authenticate to Domo University using a link in the Domo product.\n\nThis link provides access to a new Domo University page where hundreds of training videos can be viewed. No separate login is required, and new videos are added at frequent intervals. Customers should visit the Help Center to register for webinars and/or public courses.\n\n\n###\n Improved document card\n\nThe document card has been updated with a number of exciting new capabilities. Now you can make Domo the place where all of your documents are stored so you can collaborate around them, compare them with data, and easily view the version history. You'll know exactly when a file has been updated, and you'll never have to leave Domo to view your documents.\n\n\n New document card features include the following:\n\n The ability to show your actual document in Domo, rather than just a placeholder.\n* A number of new supported file types, including images. (Image cards will still be available in Domo with all of the same functionality before; however, they will gradually be phased out as more and more users switch to using document cards to display images.) All of these file types will be available for use in document cards:\n\n+ PDF\n\t+ DOCX\n\t+ DOC\n\t+ XLSX\n\t+ XLS\n\t+ PPTX\n\t+ PPT\n\t+ TXT\n\t+ PNG\n\t+ JPG\n\t+ BMP\n* A maximum upload file size of 100 MB.\n* A panel in the document card\n **Details**\n view in which old versions of the document are stored as thumbnails. You can see any old version of the document by clicking its thumbnail, as well as delete any version.\n* A document preview mode with standard and full-screen viewing modes, page navigation controls, and a download icon.\n* An option that allows you to receive notifications when a document card you have added as a Favorite gets a new version.\n\n\n######\n Document Details view\n\n\n######\n Document preview mode\n\nFor more information about document cards, see\n\nAdding a Document Card to Domo\n\n.\n\n##\n Ability to change page owner\n\nYou can now change the owner of a card page as long as you are already the owner or have an \"Admin\" security role.\n\n\n For more information about changing the owner of a page, see\n\nManaging Pages\n\n.\n\n##\n Ability to rename pages\n\nYou can now rename card pages inline instead of having to make the change in the\n **Manage Pages**\n dialog.\n\n\n For more information about renaming a page, see\n\nManaging Pages\n\n.\n\n##\n Notebook card non-owner editing\n\nNotebook cards can now be edited by any Admin, Privileged, or Editor user with access to the card.\n\n\n For more information about notebook cards, see\n\nNotebook Cards\n\n.\n\n##\n Country maps for Portugal and United Arab Emirates\n\nYou can now add map cards for Portugal and United Arab Emirates.\n\n#####\n Portugal\n\n\n######\n United Arab Emirates\n\nFor more information, see\n\nCountry Map\n\n.\n\n##\n Regression lines\n\nYou can now add regression lines to single-series Vertical Bar and Line charts and most Line chart subtypes. You can specify the color of regression lines as well as the style (dashed or plain). You can also indicate whether the last date point in your chart is included in the calculation for the regression line.\n\n#####\n Bar chart with regression line\n\n\n######\n Line chart with regression line\n\nFor more information, see\n\nLine Chart\n\n.\n\n##\n First day of week selection in Calendar charts\n\nIn Calendar charts, you can now specify the day that begins each week instead of using the default day of Sunday.\n\n\n For more information about building calendars, see\n\nCalendar\n\n.\n\n##\n Expanded hover functionality for Donut graphs\n\n*Details**\n views for Donut graphs now include additional hover functionality similar to that found in Pie charts. When you hover over a section of a Donut graph, hover text next to the graph indicating the name of the section and the total of all sections of the graph.\n\n\n For more information about Donut graphs, see\n\nDonut Chart\n\n.\n\n##\n DataFlow Improvements\n\nA number of improvements have been made to our DataFlows functionality. These include the following:\n\n Improved error messages for Magic DataFlows.\n* The ability to click and drag multiple items in a Magic DataFlow.\n* The ability to delete multiple items in a Magic DataFlow.\n* The ability to restrict edit access for a Redshift or MySQL DataFlow to the owner and users with an \"Admin\" security profile.\n* DataFlow versioning. A new\n **Versions**\n tab in the DataFlow Details view lists all versions of a DataFlow. Each time you save changes to a DataFlow, a new version entry appears here. When saving, you also have the option of describing the changes you made, similar to saving edits to a KPI card. Each version entry includes the save time, editor, inputs and outputs, runs vs. success rate, and change description (if one has been provided). In addition, for any version you have the option of making it the current version. This functionality is available for all DataFlow types.\n* The ability to choose the columns in an input DataSet for a Redshift of MySQL DataFlow. This speeds up the processing time and allows for columns to have more room for values.\n\n\n######\n DataFlow edit restriction control\n\n\n######\n Save DataFlow dialog\n\n\n######\n DataFlow Versions tab\n\n\n######\n Input DataSet column selection\n\nFor more information about DataFlows, see\n\nSQL DataFlows\n\n.\n\n##\n Table encoding protection\n\nWe are turning on a higher level of security on all table cards. This will reduce the vulnerability of malicious attacks using cross site scripting and other methods. Domo will only allow tags in tables that are part of our \"whitelist group.\" In addition, only approved style attributes will be allowed.\n\n##\n Release guides\n\nAdmin users in Domo will now have access to release guides that describe all of the features for an upcoming product release. These will be accessible in an admin user's Domo one week before the release.\n\n\n Getting Help\n--------------\n\nYou can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n **> Help Center**\n .\n\n\n If you have questions about Domo,\n\n search for a topic in the Help Center\n* train in Domo University at\n\nhttp://www.domo.com/university\n* get answers in the Domo Community at\n\ndojo.domo.com\n* contact Technical Support\n* reach out to your Domo Customer Success Manager or Technical Consultant\n\nIf you have feedback, please send it from within Domo Or send an email to\n\nproduct.feedback@domo.com\n\n.\n\n\n For more information about getting help, see\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360048116074\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004456\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nNovember 2015 Release Notes\n\n", "article_total_view_count": "\n\n\n 2,417\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "november_2015_release_notes", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "release_notes", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "archived_feature_release_notes", "url": "/s/topic/0TO5w000000Zan7GAC"}]}