{"file_path": "../../raw_kb_v2\\article\\360042934394\\index.html", "content": {"Title": "Set Your Time Zone and Regional Formatting", "Article Body": "Intro\n                       \n\n                        You can specify the global corporate time zone for your company. Or you can specify the time zone for your personal instance of Domo. For answers to commonly asked questions regarding time zones in Domo, see\n                        \n                         Time Zone Troubleshooting FAQ\n                        \n                        .\n                       \n\n                        You can only edit these settings if you have an Admin default security role or a custom role with the Manage All Company Settings grant enabled. For more information about default security roles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n                        Set the Global Time Zone\n                       \n\n                        When you specify the global corporate time zone, all visualizations use it and days begin at the corporate midnight.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If all of your data in Domo is in your corporate time, you do\n                           \n                            not\n                           \n                           need to set the time zone.\n                          \n\n\n\n\n\n\n\n\n                            Status\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Not enabled\n                           \n\n\n\n                            When the global corporate time zone setting is not enabled, there is no way to convert DATETIME info for your corporate time zone. Example of DATETIME data:\n                            \n                             '2014-08-14 15:05:30'\n                            \n                            . All DATETIME fields in your data are visualized based on the assumption that your \"current time\" is UTC (Coordinated Universal Time). For example, if you were in New York City and your data is time-stamped in UTC, the date changes at 7:00PM since UTC is 5 hours ahead of Eastern time zone. The new time zone setting compensates for this situation. (If your data were already time-stamped in Eastern Time, you would\n                            \n                             not\n                            \n                            need to set the new time zone feature.)\n                           \n\n\n\n\n\n                            Enabled\n                           \n\n\n\n                            When the global corporate time zone setting is enabled, all DATETIME data sent into Domo\n                            \n                             must be\n                            \n                            in UTC (Coordinated Universal Time). The DATETIME data converts from UTC to the time zone setting when you view your charts. Your data remains unchanged. This time zone setting applies to all of your DataSets within Domo. The global corporate time zone does\n                            \n                             not\n                            \n                            affect any DATE fields within your data; the time zone setting affects only DATETIME fields.\n                           \n\n\n\n\n\n                        Follow these steps to set the global corporate time zone:\n                       \n\n\n\n                          In the navigation header, select\n                          \n                           More\n                          \n\n\n                            > Admin\n                           \n\n                          .\n                          \n                          The Admin Settings display.\n                         \n\n\n\n                          In the\n                          \n                           Company settings\n                          \n                          menu, select\n                          \n                           Company overview\n                          \n                          .\n                          \n                          The\n                          \n                           Company overview\n                          \n                          page displays.\n                         \n\n\n\n                          Under\n                          \n                           Formatting\n                          \n                          , select a new time zone from the\n                          \n                           Time zone\n                          \n\n\n                          list.\n                         \n\n\n\n\n\n\n                          Select\n                          \n\n                            Save\n                           \n\n                          .\n                         \n\n\n\n\n\n\n                        Set the Global Language\n                       \n\n                        Set date and number formats globally on the Domo platform based on your region. Formatting conventions based on your region are used to display numerical, financial, and date/time values based on your region.\n                       \n\n                        Follow these steps to set the global corporate language:\n                       \n\n\n\n                          In the navigation header, select\n                          \n                           More > Admin\n                          \n                          .\n                          \n                          The Admin Settings display.\n                         \n\n\n\n                          In the\n                          \n                           Company settings\n                          \n                          menu, select\n                          \n                           Company overview\n                          \n                          .\n                          \n                          The\n                          \n                           Company overview\n                          \n                          page displays.\n                         \n\n\n\n                          Under\n                          \n                           Formatting\n                          \n                          , select a language from the\n                          \n                           Language\n                          \n                          list.\n                         \n\n\n\n\n\n\n                          Select\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n\n\n\n                        Set Your Personal Time Zone\n                       \n\n                        You can set the time zone for your own Domo. This time zone determines when you receive notifications, alerts, and scheduled reports. You can change your time zone in your\n                        \n                         Settings\n                        \n                        menu.\n                       \n\n                        Follow these steps to set your personal time zone:\n                       \n\n\n\n                          Select your user profile picture in the top right corner of the screen.\n                         \n\n\n\n                          Click\n                          \n                          .\n                          \n                          The\n                          \n\n                            Settings\n                           \n\n                          page displays.\n                         \n\n\n\n                          Click\n                          \n                           Click to change time zone.\n                          \n\n\n\n\n                          Click the area on the map or select a major city in the menu for the time zone you want, then click\n                          \n\n                            Save\n                           \n\n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           This will not offset any datetime data that you are viewing in Domo to display as the time zone you select here. Only the global time zone in Admin Settings can offset any datetimes.\n                          \n\n\n\n\n\n\n                        How Domo Handles Date/Time Data\n                       \n\n                        When changing any company-wide or personal time zone settings, it is very important to understand how that may affect your data or visualizations.\n                       \n\n\n                         When a time zone has been set in your Domo instance,\n                        \n\n\n\n                         The time difference between the chosen time zone and UTC will be added or subtracted from all datetime values whenever the data is: (e.g. If the time zone is set to PST, 8 hours is subtracted from all datetime columns.)\n                         \n\n\n                            Rendered for display in a DataSet preview\n                           \n\n\n\n                            Rendered for display on a card\n                           \n\n\n\n                            Used in a Beast Mode calculation\n                           \n\n\n\n\n\n                          Day/Week/Month date grains on cards and pages will honor the selected time zone and will occur at midnight of the company time zone, not UTC.\n                         \n\n\n\n                        Other time zone specifics\n                       \n\n\n                         Standalone Date and Time values are not affected by the time zone conversion process, only Datetime values.\n                        \n\n\n                          The expectation by Domo is that all datetime values loaded into Domo represent UTC time.\n                         \n\n\n\n                            If a DataSet loaded into Domo has datetime values which actually represent PST, Domo cannot know this. Conversions will be applied as if the data is UTC and will be rendered as PST-8:00.\n                           \n\n\n\n\n\n                          Changing the company time zone setting has no effect on the values in the raw data.\n                         \n\n\n\n                            If your company time zone is currently set to UTC, and the value \"2016-12-07T15:00:00 exists in the database, it will remain the same after switching the time zone setting to PST. Automatic conversions only occur when the data is rendered.\n                           \n\n\n\n\n\n                          Datetime values are not converted to UTC during import from self-managed DataSets (Excel, Box, Google Sheets, file upload, etc.). Data in these sources must be stored in UTC prior to import.\n                         \n\n\n\n                          Datetime values are not converted to UTC during import from certain cloud app connectors (Qualtrics, Adobe Analytics, SurveyMonkey, etc.). However, most cloud app connectors deliver UTC values by default.\n                          \n\n\n\n\n\n\n\n\n\n\n\n                               Important:\n                              \n                              Always check to see if values coming in from any cloud app connector are in UTC to ensure any time zone conversions are happening correctly.\n                             \n\n\n\n\n\n\n\n                          Datetime values are not converted to UTC during Workbench uploads unless a\n                          \n                           Shift Data Time Zone Transform\n                          \n                          is applied to the DataSet job.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n                              Scheduled runtimes for Workbench DataSet jobs follow the clock of the machine that Workbench is installed on. Company time zone settings have no effect on Workbench scheduling.\n                             \n\n\n\n\n\n\n\n                          Scheduled runtimes for DataSets will still be specified using UTC time values. There is a UTC label next to those scheduling fields.\n                         \n\n\n\n                          Runtimes displayed in the History tab for DataSets and DataFlows are unaffected. They always display in the time zone of the computer that you are viewing them from.\n                         \n\n\n\n                          DataFlows operate on the raw data values stored in the database, and not on converted values.\n                         \n\n\n\n                            You will have different calculated results when grouping values utilizing a datetime field in a DataFlow (raw values) compared to doing the same grouping on a card with the converted values.\n                           \n\n\n\n\n\n\n\n\n\n\n                                 Tip:\n                                \n                                You can use the\n                                \n                                 SUBDATE\n                                \n                                or\n                                \n                                 ADDDATE\n                                \n                                functions in DataFlows to manually adjust your datetime columns as needed. See\n                                \n                                 Beast Mode Functions\n                                \n                                for more information.\n                               \n\n\n\n\n\n\n\n\n\n                          Dynamic Date and Time value functions in DataFlows and Beast Modes are unaffected by any time zone set in your instance. The following functions will always reference UTC:\n                         \n\n\n\n\n                             CURDATE()\n                            \n\n\n\n\n\n                             CURRENT_DATE()\n                            \n\n\n\n\n\n                             CURRENT_TIME()\n                            \n\n\n\n\n\n                             CURRENT_TIMESTAMP()\n                            \n\n\n\n\n\n                             CURTIME()\n                            \n\n\n\n\n\n                             NOW()\n                            \n\n\n\n\n\n                             SYSDATE()\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Tip:\n                            \n                            You can use the\n                            \n                             SUBDATE\n                            \n                            or\n                            \n                             ADDDATE\n                            \n                            functions in Beast Modes to adjust these values as needed. See\n                            \n                             Beast Mode Functions\n                            \n                            for more information.\n                           \n\n\n\n\n                           If a datetime column is brought into Domo as a string data type rather than a datetime, it will not be converted based on the time zone settings.", "Preview Article": "Click here to preview", "URL Name": "360042934394", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003057", "Archived Date": "", "Language": "English", "Primary Version": "Set Your Time Zone and Regional Formatting", "Article Total View Count": "5,913", "": "", "Article Created Date": "10/24/2022, 9:09 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Set Your Time Zone and Regional Formatting\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Specifying Company Settings\n              \n", "url": "/s/topic/0TO5w000000ZaoGGAS"}]}