{"file_path": "../../raw_kb_v2\\article\\360043433093\\index.html", "content": {"Title": "Amazon CloudWatch Connector", "Article Body": "Intro\n                       \n\n                        Amazon CloudWatch is a monitoring service for AWS cloud resources and applications. Use Domo's Amazon CloudWatch connector to gain system-wide visibility into resource utilization, application performance, and operational health. To learn more about the Amazon CloudWatch API, visit their page (\n                        \n                         http://docs.aws.amazon.com/AmazonClo...e/Welcome.html\n                        \n                        ).\n                       \n\n                        You connect to your Amazon CloudWatch account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon CloudWatch connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Amazon CloudWatch account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The access key for your AWS account\n                         \n\n\n\n                          The secret key for your AWS account\n                         \n\n\n\n                        For information about obtaining these credentials, see\n                        \n                         http://docs.aws.amazon.com/general/l...et-access-keys\n                        \n                        .\n                       \n\n                        Connecting to Your Amazon CloudWatch Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Amazon CloudWatch Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Amazon CloudWatch account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Access Key\n                          \n\n                           Enter the access key for your AWS account.\n                          \n\n\n\n                           Secret Key\n                          \n\n                           Enter the secret key for your AWS account.\n                          \n\n\n\n\n                        For information about obtaining these credentials, see\n                        \n                         http://docs.aws.amazon.com/general/l...et-access-keys\n                        \n                        .\n                       \n\n\n                         Once you have entered valid Amazon CloudWatch credentials, you can use the same account any time you go to create a new Amazon CloudWatch DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Amazon CloudWatch report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Alarms for Metrics\n                               \n\n\n\n                                Retrieves all alarms for a single metric.\n                               \n\n\n\n\n\n                                Describe Alarm History\n                               \n\n\n\n                                Retrieves the history for all the authenticated user's alarms.\n                               \n\n\n\n\n\n                                Describe Alarms\n                               \n\n\n\n                                Retrieves all of the authenticated user's alarms.\n                               \n\n\n\n\n                               GetLogEvents\n                              \n\n\n                                Lists log events from the specified log stream.\n                               \n\n\n\n\n                               GetAllLogEvents\n                              \n\n\n                                Retrieves log events for all the log streams in the specified date range.\n                               \n\n\n\n\n\n                                List Metrics\n                               \n\n\n\n                                Returns a list of valid metrics stored for the authenticated user.\n                               \n\n\n\n\n\n                                Metric Statistics\n                               \n\n\n\n                                Returns statistics for a specified metric.\n                               \n\n\n\n\n\n\n\n\n\n                            Metric Name\n                           \n\n\n\n                            Enter the name of the metric you want to retrieve data for.\n                           \n\n\n\n\n\n                            Namespace\n                           \n\n\n\n                            Enter the namespace for the metric you want to retrieve data for.\n                           \n\n\n\n\n\n                            Period\n                           \n\n\n\n                            Enter the period value to return data for. This should be a multiple of 60 (such as 60, 120, 180, etc.).\n                           \n\n\n\n\n\n                            Statistics\n                           \n\n\n\n                            Enter a comma-separated string of statistics you want to retrieve data for. You can choose from any of the following statistics:\n                           \n\n\n\n                              Average\n                             \n\n\n\n                              Sum\n                             \n\n\n\n                              SampleCount\n                             \n\n\n\n                              Maximum\n                             \n\n\n\n                              Minimum\n                             \n\n\n\n\n\n\n\n                            Dimensions\n                           \n\n\n\n                            Enter a comma-separated string of dimensions you want to fetch, in the format\n                            \n                             dimension:value\n                            \n                            . For example:\n                           \n\n\n                             StreamName:my-stream-name,ShardID:my-shard-id\n                            \n\n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Select whether to pull data for a specific or relative start date. If you select\n                            \n                             Specific\n                            \n                            , you will be asked to choose a specific start date from a date picker. If you select\n                            \n                             Relative\n                            \n                            , you will be asked to enter an offset value (i.e. the number of days in the past you want to start pulling data for).\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the date you want to start pulling data for. Combine with\n                            \n                             Select Specific End Date\n                            \n                            to create a range of dates.\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Select whether to pull data for a specific or relative end date. If you select\n                            \n                             Specific\n                            \n                            , you will be asked to choose a specific end date from a date picker. If you select\n                            \n                             Relative\n                            \n                            , you will be asked to enter an offset value (i.e. the number of days in the past you want to stop pulling data for).\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the date you want to stop pulling data for. Combine with\n                            \n                             Select Specific Start Date\n                            \n                            to create a range of dates.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043433093", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003600", "Archived Date": "", "Language": "English", "Primary Version": "Amazon CloudWatch Connector", "Article Total View Count": "4,685", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Amazon CloudWatch Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}