{"file_path": "../../raw_kb_v2\\article\\360042935094\\index.html", "content": {"Title": "Accessing Business-in-a-Box Dashboards", "Article Body": "You can access live Business-in-a-Box Dashboards in your company Domo instance by doing the following:\n                       \n\n\n\n                          (Conditional) Click\n                          \n                           Dashboards\n                          \n                          in the toolbar at the top of the screen (if it is not already open).\n                         \n\n\n\n                          Select\n                          \n                           Business-in-a-Box\n                          \n                          in the\n                          \n                           Dashboards\n                          \n                          pane on the left side of the screen to open a page in which you can access all of the Business-in-a-Box Dashboards.\n                          \n\n\n\n\n\n                          Alternatively, you can click the arrow to the right of \"Business-in-a-Box\" in the\n                          \n                           Dashboards\n                          \n                          pane to see all of the Business-in-a-Box Dashboards. If you want, you can click any of these to open them directly.\n                          \n\n\n\n\n\n\n                          Select the desired department Dashboard.\n                          \n\n\n\n\n\n\n                          Select a \"Live Data\" Dashboard page from the department tab that appears.\n                          \n                          \"Live Data\" indicates that the Page is already powered by live data (as opposed to those that haven't yet been powered up by live data, indicated by the name \"Sample Data\").\n                          \n\n\n\n\n\n\n                        If you do not have any Dashboards in your instance powered up with live data, you can do any of the following:\n                       \n\n\n\n                          Click on any of the pre-installed Business-in-a-Box Dashboards in the department tab being powered by sample data (such as the \"Compensation & Payroll\" Dashboard in the above screenshot) then\n                          \n                           follow these instructions\n                          \n                          to power it with your own data.\n                         \n\n\n\n                          Scroll down to the bottom of the department tab then click\n                          \n                           Add Dashboard\n                          \n                          . (This option appears\n                          \n                           only\n                          \n                          if you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled.) Then choose one of these options:\n                         \n\n\n\n\n                             Reference Existing\n                            \n                            . This allows you to link any existing page in Domo to this department tab.\n                           \n\n\n\n\n                             Appstore\n                            \n                            . This allows you to select a dashboard with sample data from the Appstore then power it with your own data\n                            \n                             as described here\n                            \n                            .\n                           \n\n\n\n\n\n                        Page Restrictions\n                       \n\n                        Business-in-a-Box Dashboards are initially shared with your default user group, meaning all of the users in the instance have instant access. However, users with an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled can adjust individual Dashboards to allow or restrict certain users and/or groups. Unlike other Dashboards in Domo, users without access can still see the names of Business-in-a-Box Dashboards in their navigation. However, just as with any other Dashboard in Domo, if a user attempts to navigate to a Dashboard that he/she is not permitted to access, a\n                        \n                         Request Access\n                        \n                        button appears instead. For more information about sharing access to a Dashboard, see\n                        \n                         Sharing Access to Cards and Pages\n                        \n                        .\n                        \n\n                        Admin users cannot remove Business-in-a-Box Dashboards or the Cards within them from Domo.", "Preview Article": "Click here to preview", "URL Name": "360042935094", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004310", "Archived Date": "", "Language": "English", "Primary Version": "Accessing Business-in-a-Box Dashboards", "Article Total View Count": "4,838", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Accessing Business-in-a-Box Dashboards\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Business In A Box\n              \n", "url": "/s/topic/0TO5w000000ZanBGAS"}]}