{"file_path": "../../raw_kb_v2\\article\\4412849158167\\index.html", "content": {"Title": "Cloud Amplifier Overview", "Article Body": "Intro\n                       \n\n                        Cloud Amplifier provides a native integration with cross-cloud systems to unlock data products at the speed your business needs them.\n                       \n\n                        Why Cloud Amplifier?\n                       \n\n\n\n                          IT limitations —\n                         \n                         IT alone cannot realize the full potential of data. A broad and inclusive approach with all LOBs is required, and all valuable data is not yet controlled by IT.\n                        \n\n\n                          Increased stress and time constraints —\n                         \n                         Business users demand timely access to data products, increasing the pressure to deliver.\n                        \n\n\n                          Rigidity and friction in data processes —\n                         \n                         Rigid processes and tooling prevent the building of databases in a speedy and flexible manner, requiring too much time effort.\n                        \n\n\n                        Cloud Amplifier can provide solutions for\n                        \n\n                        these issues and more.\n                       \n\n                        This article provides information about configuring Cloud Amplifier for your Domo environment in the following topics:\n                       \n\n\n\n                          Required grants\n                         \n\n\n\n                          Setup\n                         \n\n\n\n                          Best practices\n                         \n\n\n\n                          Federated data vs. Cloud Amplifier\n                         \n\n\n\n                          Technical FAQ\n                         \n\n\n\n\n\n                        Required Grants\n                       \n\n                        After Cloud Amplifier is enabled for your Domo environment, you can assign the following Cloud Amplifier grants to manage access to these features:\n                       \n\n\n\n\n                           Manage Cloud Accounts\n                          \n                          — Allows a user to add/remove cloud accounts and add/remove tables from a cloud account. This grant also allows a user to change the default storage cloud.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This grant must be assigned to a user with the Manage DataSet grant to work properly.\n                            \n\n\n\n\n\n\n\n                           Override Default Cloud\n                          \n                          — Allows a user to use any storage cloud account that is shared with them instead of the default cloud. If you do not have this grant, you can't use any other cloud besides the default cloud.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             This grant must be assigned to a user with the Edit DataSet or Manage DataSet grant to work properly.\n                            \n\n\n\n\n\n\n\n\n                        Setup\n                       \n\n                        To enable Cloud Amplifier, contact your Customer Success Manager (CSM) or Account Executive (AE). You can then connect your existing data warehouses from the providers listed below. Each provider has their own unique requirements, and you can follow the links below to see the documentation for each provider and their requirements.\n                       \n\n\n\n                        Available providers include:\n                       \n\n\n\n                          Snowflake\n                         \n\n\n\n                          Dremio\n                         \n\n\n                       Support for the following providers is in beta as of March 2023. To join the beta for one of these providers, contact your CSM or AE.\n                       \n\n                         BigQuery (Read only)\n                        \n\n                         Databricks (Read only)\n                        \n\n                         Redshift (Read only)\n                        \n\n\n                        Defaults\n                       \n\n                        Cloud Amplifier allows you to specify a default storage account for all DataSets. Changing these settings does not change existing DataSets or DataFlows. These defaults are only used for new assets.\n                       \n\n\n\n\n                           Back to top\n                          \n\n\n\n\n\n\n                        Best Practices\n                       \n\n                        We recommend you choose a default storage cloud. To do this, follow the steps below:\n                       \n\n\n                         In the Domo navigation header, go to\n                         \n                          More\n                         \n                         >\n                         \n                          Admin\n                         \n                         .\n                        \n\n                         Under\n                         \n                          Features\n                         \n                         , select\n                         \n                          Cloud Amplifier\n                         \n                         .\n                        \n\n                         On the\n                         \n                          Cloud Amplifier\n                         \n                         page, select an option from the\n                         \n                          Select the default storage cloud\n                         \n                         list.\n                        \n\n                       We recommend that you set up your Cloud Amplifier connections using a service account.\n                       \n\n                       If you need to move a DataSet from one warehouse to another, you can use Magic ETL to copy a specific DataSet hosted in your database and materialize it in Domo, where it runs on a schedule.\n                       \n\n\n\n                           Back to top\n                          \n\n\n\n\n\n\n                        Federated Data vs. Cloud Amplifier\n                       \n\n                        The table below compares federated data to Cloud Amplifier read and read/write configurations:\n                       \n\n\n\n\n\n                            Capability\n                           \n\n\n\n                            Federated-Direct Query\n                           \n\n\n                           Cloud Amplifier Integration (Read-Adapter)\n                          \n\n                           Cloud Amplifier Integration (Read/Write Adapter)\n                          \n\n\n\n\n\n\n                            Visualize data from existing tables\n                            \n                            - Create cards\n                            \n                            - Create dashboards\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Visualize on-premise data behind firewall via an agent\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Get updated metadata from source tables\n                            \n                            - Last updated time\n                            \n                            - Updated row count\n                           \n\n\n\n\n\n\n\n\n\n\n\n                             (\n                             \n                              Every 15 minutes\n                              \n                              Configurable\n                             \n                             )\n                            \n\n\n\n\n\n\n                            (\n                            \n                             Every 15 minutes\n                             \n                             Configurable\n                            \n                            )\n                           \n\n\n\n\n\n                            Card Alerts\n                           \n\n\n\n\n\n\n\n\n\n\n                            (\n                            \n                             Every 15 minutes\n                             \n                             Configurable\n                            \n                            )\n                           \n\n\n\n\n\n                            (\n                            \n                             Every 15 minutes\n                             \n                             Configurable\n                            \n                            )\n                           \n\n\n\n\n                           DataSet Alerts\n                          \n\n\n\n\n\n\n\n                            (\n                            \n                             Every 15 minutes\n                             \n                             Configurable\n                            \n                            )\n                           \n\n\n\n\n\n                            (\n                            \n                             Every 15 minutes\n                             \n                             Configurable\n                            \n                            )\n                           \n\n\n\n\n                           DataSet Views\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                           Use data from existing tables in Magic ETL as inputs\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                           Use data updates from existing tables to trigger other DataFlows\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                           Custom fiscal calendar for source table data (one per instance)\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                           Use Domo Connectors, Workbench, SDK, CLI to write to customer-owned EDW/Data Lake\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Native direct rewrite\n                             \n\n\n\n\n\n\n                           Write Magic ETL output to customer-owned EDW/Data Lake\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Native direct rewrite\n                             \n\n\n\n\n\n\n                           PDP | Governance\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                           Domo App Support\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                           Jupyter Workspace Support\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                           Domo auto-caching of card loads\n                          \n\n\n\n\n\n\n\n                              Set static TTL on each DataSet\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                           Back to top\n                          \n\n\n\n\n\n\n\n                        Technical FAQ\n                       \n\n                        General\n                       \n\n\n                         How do Cloud Amplifier DataSets impact DataFlows scheduled to run when a DataSet refreshes?\n                        \n\n\n                        Cloud Amplifier DataSets operate the same as Domo DataSets. Additionally, Magic ETL can trigger the ETL to run when the data is updated in your database.\n                       \n\n                        By default, Domo polls the database metadata every 15 minutes to check for updates.\n                       \n\n\n                         Is the 15-minute interval at which Domo checks for updates configurable?\n                        \n\n\n                        Yes,\n                        \n                         Domo Support\n                        \n                        can adjust the window down to one minute on the back end.\n                       \n\n\n                         How are Cloud Amplifier DataSets supported as inputs?\n                        \n\n\n                        Magic ETL v2 supports Cloud Amplifier DataSets.\n                       \n\n\n                         Can I use Cloud Amplifier if I also use Domo Everywhere?\n                        \n\n\n                        Yes, you can. You can designate DataSets created via Cloud Amplifier as published DataSets in order to create a virtualized DataSet in a subscriber organization. You can then use the virtualized subscriber DataSeta as an input to Magic ETL transformations and configure it for DataSet Alerts.\n                       \n\n                        You can also use DataSets created via Cloud Amplifier with\n                        \n                         Domo Everywhere Embed\n                        \n                        .\n                       \n\n\n                         Does Cloud Amplifier work with Bring Your Own Key (BYOK)?\n                        \n\n\n                        Not at this time.\n                       \n\n                        External Cloud Storage\n                       \n\n                        Can I create DataSet Views or DataFusions that are materialized and then stored in an external cloud (outside of Domo)?\n                       \n\n                        Not at this time.\n                       \n\n                        Can I use Domo to define a view and have it create a view in my database?\n                       \n\n                        Not at this time.\n                       \n\n\n                         Does Domo cache data on DataSets that are stored in an external cloud?\n                        \n\n\n                        Data can be cached for up to 24 hours, but the cache is cleared when data updates. For customer-managed DataSets, there may be up to a 15-minute delay between when the data updates and the cache is cleared.\n                       \n\n\n                         Does Cloud Amplifier use my cloud warehouse account?\n                        \n\n\n                        Yes, Domo operates on your cloud warehouse account.\n                       \n\n\n                         How does Domo access my cloud warehouse account?\n                        \n\n\n                        Domo's method of accessing a cloud warehouse account depends on the warehouse. We recommend using a system account, rather than individual user accounts, to grant Domo access to all cloud warehouses. See the\n                        \n                         individual provider guides\n                        \n                        listed above to learn how that Domo accesses that particular provider.\n                       \n\n\n                         Does Domo support OAUTH for Cloud Amplifier?\n                        \n\n\n                        Not at this time.\n                       \n\n\n                         Can I use both \"traditional\" Domo and Cloud Amplifier in parallel?\n                        \n\n\n                        Yes. By default, you have access to both Domo's proprietary Adrenaline engine and the Cloud Amplifier engine. You can configure your Domo environment so that only the Cloud Amplifier DataSets are allowed to run in your Domo environment, but\n                        \n                         Domo Support\n                        \n                        needs to help with this.\n                       \n\n\n                         Can I move existing DataSets from Domo to my cloud provider using Cloud Amplifier?\n                        \n\n\n                        For existing DataSets created via a connector or Domo APIs, you can reach out to\n                        \n                         Domo Support\n                        \n                        for assistance to move them to your cloud provider. If those DataSets were created via some other method, you would need to recreate those in your cloud provider manually.\n                       \n\n\n                         Does Cloud Amplifier work with Domo's DataSet APIs?\n                        \n\n\n                        Domo's APIs can be used with any DataSet in a Domo-managed database, as long as that table is in the Domo-managed database that was configured during the write integration step of your Cloud Amplifier setup. Customer-managed databases that exist in the cloud,\n                        \n                         from\n                        \n                        which Domo can read but\n                        \n                         can\n                        \n                        not write to, cannot be updated with Domo APIs.\n                       \n\n                        This includes, but is\n                        \n\n                        not limited to, the streams API, webhooks, custom apps that generate new data such as Form Builder, and managing a DataSet via the DataSet API (such as updating a DataSet, managing personalized data permissions (PDP) policies, changing the owner of a DataSet, exporting a DataSet).\n                       \n\n                        For a more comprehensive guide to using the DataSets API, see our\n                        \n                         developer docs\n                        \n                        .\n                       \n\n\n\n\n                           Back to top", "Preview Article": "Click here to preview", "URL Name": "4412849158167", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003147", "Archived Date": "", "Language": "English", "Primary Version": "Cloud Amplifier Overview", "Article Total View Count": "5,487", "": "", "Article Created Date": "10/24/2022, 9:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Cloud Amplifier Overview\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Cloud Amplifier\n              \n", "url": "/s/topic/0TO5w000000Zjd3GAC"}]}