{"file_path": "../../raw_kb_v2\\article\\360042928374\\index.html", "content": {"Title": "Sage Intacct Connector", "Article Body": "Important:\n                           \n                           Intacct imposes a \"concurrency limit\" on API requests to their systems. Most customers are allowed 2 concurrent requests. However, depending on your service level agreement with Intacct, you may have a greater concurrency limit. If you have a service level agreement that allows for a greater number of concurrent connections, you will need to go into your Domo account in the account center (https://[yourinstance].\n                           \n                            domo.com/datacenter/accounts\n                           \n                           ) and update the value in your Intacct account. Otherwise, Domo will simply default your account to the normal limit of 2 concurrent requests imposed by Intacct.\n                           \n\n                           This change will improve performance and help increase the stability of the Intacct connector. Overall, this should have very little impact on your DataSets, however, the downside of this change is that you may see an increase in the amount of time it takes to get your data into Domo if you do not update your account to reflect the appropriate limit.\n                           \n\n                           Additional steps can be taken to mitigate any potential slowdown by scheduling your Intacct DataSets in such a way that they do not overlap each other.\n                          \n\n\n\n\n                        Intro\n                       \n\n\n                         Intacct helps you manage financials on your own terms with cloud-based accounting software. With Domo, stakeholders can visualize Intacct data together with data from any other system in a real-time dashboard. That means fewer reports for finance and better insights all around.\n                        \n\n\n                         Once your data is in Domo, connect easily to your data and create powerful, dynamic visualizations. Get the up-to-date information you need to make smart decisions on cashflow, ledgers, accounts receivable, accounts payable, journals, P&L, and more. Get real-time alerts via email and text when Intacct metrics hit your predefined levels.\n                        \n                        Use Domo's Intacct connector to retrieve data relating to customers, accounts, invoices, payments, expenses, and the like. To learn more about the Intacct API, visit their page (\n                        \n                         https://developer.intacct.com/\n                        \n                        ).\n                       \n\n                        You connect to your Intacct account in the Data Center. This topic discusses the fields and menus that are specific to the Intacct connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n\n                           The Intacct connector only imports standard reports. Within your Intacct account you can create custom reports, set them to run on a schedule and have them delivered in a CSV format to a cloud storage service. Intacct supports Dropbox, Box, Google Drive, and Amazon S3.Once delivered there customers can use the relevant Domo connector to import the custom report from the cloud storage service into Domo.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector is appropriate for pulling financial reporting and accounting, sales, and inventory data.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Cashflow\n                             \n\n\n\n                              Ledgers\n                             \n\n\n\n                              Accounts receivable\n                             \n\n\n\n                              Accounts payable\n                             \n\n\n\n                              Journals\n                             \n\n\n\n                              Profits and loss\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              CFO\n                             \n\n\n\n                              Accountant\n                             \n\n\n\n                              Sales\n                             \n\n\n\n                              Inventory\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            Connector runtimes vary based on data, but generally it should take between 2 and 8 hours.\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            7\n                           \n\n\n\n\n\n                        Best Practices\n                       \n\n                        Keep date ranges reasonable. If you only need the last quarter, do the last quarter; if you need the last three years, do all three years.\n                       \n\n\n                         For Custom report, this Connector only supports 'current month' and 'current year' as the reporting period values.\n                        \n                        There might be a possibility of having other/additional supported values for Reporting Period. Contact Sage Intacct for other possible Reporting Duration values for filtering the data.\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Intacct account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The user ID for your Intacct account. This is the same user ID you use to sign into the Intacct cloud ERP software.\n                         \n\n\n\n                          The password for your Intacct account. This is the same password you use to sign into the Intacct cloud ERP software.\n                         \n\n\n\n                          Your Intacct company ID. This ID is usually different for sandbox and production accounts. To locate the Company ID in Intacct, hover over\n                          \n                           Company\n                          \n                          and click\n                          \n                           Company Info\n                          \n                          .\n                          \n                           Company ID\n                          \n                          is found in the\n                          \n                           ID\n                          \n                          field.\n                         \n\n\n                         (Optional) You can also provide a Location ID. This may help narrow your data request to a specific location. To locate the location ID in Intacct, hover over\n                         \n                          Company\n                         \n                         and click\n                         \n                          Locations\n                         \n                         . Select a\n                         \n                          Location ID\n                         \n                         from the report.\n                        \n\n                         (Optional) Max Concurrent Connections.\n                         \n                          This is a number value for the maximum number of concurrent connections that Intacct allows for your account. If you have increased your API rate limits with Intacct, you can provide how many concurrent connections you are allowed here.\n                         \n\n\n\n                          Additionally, the Customer may need to add \"Domo\" as an\n                          \n                           authorized sender ID\n                          \n                          in their company configurations Security tab.\n                         \n\n\n\n                        To obtain Intacct Web Services credentials, contact your Intacct account representative.\n                       \n\n                        Connecting to Your Intacct Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Intacct Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Intacct account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           User ID\n                          \n\n                           Enter your Intacct user ID. See \"Prerequisites\" for more details.\n                          \n\n\n\n                           Password\n                          \n\n                           Enter your Intacct password. See \"Prerequisites\" for more details.\n                          \n\n\n\n                           Company ID\n                          \n\n                           Enter your Intacct company ID. This ID is usually different for sandbox and production accounts.\n                          \n\n\n\n                           Location ID\n                          \n\n                           Enter your Intacct location ID. This may help you narrow your data request to a specific location.\n                          \n\n\n\n                           Max Concurrent Connections\n                          \n\n\n                            Enter the number value for the maximum number of concurrent connections that Intacct allows for your account. If you have increased your API rate limits with Intacct, specify how many concurrent connections you are allowed here.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Intacct credentials, you can use the same account any time you go to create a new Intacct DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Sage Intacct report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Account Group\n                              \n\n                               Receives data about Intacct Account Group accounting reports.\n                              \n\n\n\n                               AP Account Label\n                              \n\n                               Receives data about Intacct Accounts Payable Account Label accounting reports.\n                              \n\n\n\n                               AP Adjustment\n                              \n\n                               Receives data about Intacct Accounts Payable Adjustment accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AP Bill\n                              \n\n                               Receives data about Intacct Accounts Payable Bill accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AP Bill Detail\n                              \n\n                               Receives data about Intacct Accounts Payable Bill Detail accounting reports.\n                              \n\n\n\n                               AP Payment\n                              \n\n                               Receives data about Intacct Accounts Payable Payment accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AP Payment Request\n                              \n\n                               Receives data about Intacct Accounts Payable Payment Request accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AP Term\n                              \n\n                               Receives data about Intacct Accounts Payable Term accounting reports.\n                              \n\n\n\n                               AR Account Label\n                              \n\n                               Receives data about Intacct Accounts Receivable Account Label accounting reports.\n                              \n\n\n\n                               AR Adjustment\n                              \n\n                               Receives data about Intacct Accounts Receivable Adjustment accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AR Invoice\n                              \n\n                               Receives data about Intacct Accounts Receivable Invoice accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AR Invoice Detail\n                              \n\n                               Receives data about Intacct Accounts Receivable Invoice Detail accounting reports.\n                              \n\n\n\n                               AR Payment\n                              \n\n                               Receives data about Intacct Accounts Receivable Payment accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AR Payment Summary\n                              \n\n                               Receives data about Intacct Accounts Receivable Payment Summary accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               AR Term\n                              \n\n                               Receives data about Intacct Accounts Receivable Term accounting reports.\n                              \n\n\n\n                               AR Transaction Definition\n                              \n\n                               Receives data about Intacct Accounts Receivable Transaction Definition accounting reports.\n                              \n\n\n\n                               Bank Account\n                              \n\n                               Receives data about Intacct Bank Account accounting reports.\n                              \n\n\n\n                               Bill\n                              \n\n                               Receives data about Intacct Bill accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               Class\n                              \n\n                               Receives data about Intacct Class accounting reports.\n                              \n\n\n\n                               Company Information\n                              \n\n                               Receives data about Intacct Company Information accounting reports.\n                              \n\n\n\n                               Contact\n                              \n\n                               Receives data about Intacct Contact accounting reports.\n                              \n\n\n\n                               Contact Tax Group\n                              \n\n                               Receives data about Intacct Contact Tax Group accounting reports.\n                              \n\n\n\n                               CSN History\n                              \n\n                               Receives data about Intacct CSN History accounting reports.\n                              \n\n\n\n                               Cust GL Group\n                              \n\n                               Receives data about Intacct Cust General Group accounting reports.\n                              \n\n\n\n                               Customer\n                              \n\n                               Receives data about Intacct Customer accounting reports.\n                              \n\n\n\n                               Customer Ach Info\n                              \n\n                               Receives data about Intacct Customer Ach Info accounting reports.\n                              \n\n\n\n                               Customer Bank Account\n                              \n\n                               Receives data about Intacct Customer Bank Account accounting reports.\n                              \n\n\n\n                               Customer Charge Card\n                              \n\n                               Receives data about Intacct Customer Charge Card accounting reports.\n                              \n\n\n\n                               Customer P Package\n                              \n\n                               Receives data about Intacct Customer P Package accounting reports.\n                              \n\n\n\n                               Custom Reports\n                              \n\n                               Receives data about Intacct Custom accounting reports.\n                              \n\n\n\n                               Department\n                              \n\n                               Receives data about Intacct Department accounting reports.\n                              \n\n\n\n                               Employee\n                              \n\n                               Receives data about Intacct Employee accounting reports.\n                              \n\n\n\n                               Expense Report\n                              \n\n                               Receives data about Intacct Expense Report accounting reports.\n                              \n\n\n\n                               Expense Report Summary\n                              \n\n                               Receives data about Intacct Expense Report Summary accounting reports.\n                              \n\n\n\n                               Expense Types\n                              \n\n                               Receives data about Intacct Expense Types accounting reports.\n                              \n\n\n\n                               GL Account\n                              \n\n                               Receives data about Intacct General Account accounting reports.\n                              \n\n\n\n                               GL Account Balance\n                              \n\n                               Receives data about Intacct General Account Balance accounting reports.\n                              \n\n\n\n                               GL Account Group\n                              \n\n                               Receives data about Intacct General Account Group accounting reports.\n                              \n\n\n\n                               GL Account Group Member\n                              \n\n                               Receives data about Intacct General Account Group Member accounting reports.\n                              \n\n\n\n                               GL Batch\n                              \n\n                               Receives data about Intacct General Batch accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               GL Budget\n                              \n\n                               Receives data about Intacct General Budget accounting reports.\n                              \n\n\n\n                               GL Budget Item\n                              \n\n                               Receives data about Intacct General Budget Item accounting reports.\n                              \n\n\n\n                               GL Account Category\n                              \n\n                               Receives data about Intacct General Account Category accounting reports.\n                              \n\n\n\n                               GL Entry\n                              \n\n                               Receives data about Intacct General Entry accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               GL Transaction\n                              \n\n                               Receives data about Intacct General Transaction accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               IC Item\n                              \n\n                               Receives data about Intacct Inventory Control Item accounting reports.\n                              \n\n\n\n                               IC Transaction\n                              \n\n                               Receives data about Intacct Inventory Control Transaction accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               IC Transaction Definition\n                              \n\n                               Receives data about Intacct Inventory Control Transaction Definition accounting reports.\n                              \n\n\n\n                               Invoice\n                              \n\n                               Receives data about Intacct Invoice accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               Item GL Group\n                              \n\n                               Receives data about Intacct Item General Group accounting reports.\n                              \n\n\n\n                               Item Tax Group\n                              \n\n                               Receives data about Intacct Item Tax Group accounting reports.\n                              \n\n\n\n                               Journal\n                              \n\n                               Receives data about Intacct Journal accounting reports.\n                              \n\n\n\n                               Location\n                              \n\n                               Receives data about Intacct Location accounting reports.\n                              \n\n\n\n                               Location Entity\n                              \n\n                               Receives data about Intacct Location Entity accounting reports.\n                              \n\n\n\n                               Location Group\n                              \n\n                               Receives data about Intacct Location Group accounting reports.\n                              \n\n\n\n                               PO Price List\n                              \n\n                               Receives data about Intacct Purchase Order Price List accounting reports.\n                              \n\n\n\n                               PO Transaction\n                              \n\n                               Receives data about Intacct Purchase Order Transaction accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               PO Transaction Definition\n                              \n\n                               Receives data about Intacct Purchase Order Transaction Definition accounting reports.\n                              \n\n\n\n                               Pricelist Item\n                              \n\n                               Receives data about Intacct Pricelist Item accounting reports.\n                              \n\n\n\n                               Product Line\n                              \n\n                               Receives data about Intacct Product Line accounting reports.\n                              \n\n\n\n                               Project\n                              \n\n                               Receives data about Intacct Project accounting reports.\n                              \n\n\n\n                               Renewal Macro\n                              \n\n                               Receives data about Intacct Renewal Macro accounting reports.\n                              \n\n\n\n                               Reporting Period\n                              \n\n                               Receives data about Intacct Reporting Period accounting reports.\n                              \n\n\n\n                               Revenue Recognition Schedule\n                              \n\n                               Receives data about Intacct Revenue Recognition Schedule accounting reports.\n                              \n\n\n\n                               Revenue Recognition Schedule Entry\n                              \n\n                               Receives data about Intacct Revenue Recognition Schedule Entry accounting reports.\n                              \n\n\n\n                               Revenue Recognition Template\n                              \n\n                               Receives data about Intacct Revenue Recognition Schedule Template accounting reports.\n                              \n\n\n\n                               Sales Document\n                              \n\n                               Receives data about Intacct Sales Document reports.\n                              \n\n\n\n                               Sales Document Detail\n                              \n\n                               Receives data about Intacct Sales Document Detail reports.\n                              \n\n\n\n                               Sales Document Subtotals\n                              \n\n                               Receives data about Intacct Sales Document Subtotal reports.\n                              \n\n\n\n                               Smart Event Log\n                              \n\n                               Receives data about Intacct Smart Event Log reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               SO Price List\n                              \n\n                               Receives data about Intacct Sales Order Price List accounting reports.\n                              \n\n\n\n                               SO Transaction\n                              \n\n                               Receives data about Intacct Sales Order Transaction accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               SO Transaction Definition\n                              \n\n                               Receives data about Intacct Sales Order Transaction Definition accounting reports.\n                              \n\n\n\n                               SO Transaction Detail\n                              \n\n                               Receives data about Intacct Sales Order Transaction Detail accounting reports.\n                              \n\n\n\n                               Stat GL Account\n                              \n\n                               Receives data about Intacct Stat General Ledger Account accounting reports.\n                              \n\n\n\n                               Statistical Journal\n                              \n\n                               Receives data about Intacct Statistical Journal accounting reports.\n                              \n\n\n\n                               ST Kit Transaction\n                              \n\n                               Receives data about Intacct Kit Transaction accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               Subscription\n                              \n\n                               Receives data about Intacct Subscription accounting reports.\n                              \n\n\n\n                               Tax Detail\n                              \n\n                               Receives data about Intacct Tax Detail accounting reports.\n                              \n\n\n\n                               Tax Schedule\n                              \n\n                               Receives data about Intacct Tax Schedule accounting reports.\n                              \n\n\n\n                               Tax Schedule Detail\n                              \n\n                               Receives data about Intacct Tax Schedule Detail accounting reports.\n                              \n\n\n\n                               Tax Schedule Map\n                              \n\n                               Receives data about Intacct Tax Schedule Map accounting reports.\n                              \n\n\n\n                               Territory\n                              \n\n                               Receives data about Intacct Territory accounting reports.\n                              \n\n\n\n                               Transaction Currency\n                              \n\n                               Receives data about Intacct Transaction Currency accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               Unit of Measure\n                              \n\n                               Receives data about Intacct Unit of Measure accounting reports.\n                              \n\n\n\n                               Vendor GL Group\n                              \n\n                               Receives data about Intacct Vendor General Group accounting reports.\n                              \n\n\n\n                               Vendor\n                              \n\n                               Receives data about Intacct Vendor accounting reports.\n                               \n\n\n                                Date Filter\n                               \n\n\n                               is required for this report.\n                              \n\n\n\n                               VSOE Item Pricelist\n                              \n\n                               Receives data about Intacct Vendor-Specific Objective Evidence Item Pricelist accounting reports.\n                              \n\n\n\n                               VSOE Pricelist\n                              \n\n                               Receives data about Intacct Vendor-Specific Objective Evidence Pricelist accounting reports.\n                              \n\n\n\n                               Warehouse\n                              \n\n                               Receives data about Intacct Warehouse accounting reports.\n                              \n\n\n\n\n\n\n\n\n\n\n                            Fixed or Relative Date Range\n                           \n\n\n\n                            Select a fixed or relative date range. For a fixed date range, you enter a specific start date and end date, and your report always pulls data for that range. For a relative date range, you enter a number of days back for your report. Each time the report is run, data is pulled for that number of days based on today's date.\n                           \n\n\n\n\n\n                            Fixed Start Date\n                           \n\n\n\n                            Select the start date for your report.\n                           \n\n\n\n\n\n                            Fixed End Date\n                           \n\n\n\n                            Select the end date for your report.\n                           \n\n\n\n\n\n                            Days Back (Incremental Days)\n                           \n\n\n\n                            Enter the number of days back from today's date that should appear in your report. For example, if you entered\n                            \n                             7\n                            \n                            , the report would pull data for the past week each time it was run.\n                           \n\n                            Enter an initial backfill amount if you are using a daily incremental data pull. The\n                            \n                             Update Method\n                            \n                            under\n                            \n                             Scheduling\n                            \n                            (below) must be set to\n                            \n                             Append\n                            \n                            .\n                           \n\n\n\n\n                           Reporting Period\n                          \n\n\n\n                             Enter the reporting duration for filtering the data. This Connector supports 'current month' and 'current year' as the reporting period values.\n                            \n\n\n\n                             Example: 'Current Year' or 'Current Month'\n                            \n\n\n\n\n\n\n\n\n\n\n                                Note\n                               \n                               :There might be a possibility of having other/additional supported values for Reporting Period. Contact Sage Intacct for other possible Reporting Duration values for filtering the data.\n                              \n\n\n\n\n\n\n\n                           Date Filter\n                          \n\n                           Select whether you want to filter results by the date of creation or the date when they were last modified.\n                          \n\n\n\n                           Page Size\n                          \n\n\n                            Select the page size. It must be between 10 and 250. The page size number limits how much data is consumed from the API at once. If you are receiving an error, try decreasing the page size.\n                           \n\n\n\n\n                           Custom Report Name\n                          \n\n\n                            Enter the custom report name.\n                           \n\n\n\n\n                           Filter Data\n                          \n\n\n                            Select this checkbox if you'd like to filter your custom report by date. If your report supports date filtering, you'll be able to select options to set the date range.\n                           \n\n\n\n\n                           Filter Arguments\n                          \n\n\n                            Filter Arguments give you options to filter the custom report by a specific or relative date range, or by a reporting period such as 'Current Month' or 'Current Year'. If your custom report does not support date filters, this drop down will be empty.\n                           \n\n\n\n\n                           Module Key\n                          \n\n\n                            Select a module key.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n\n                         The biggest pitfall with this connector is credentials. Often, the username or password is wrong and the connector will fail. See\n                         \n                          Prerequisites\n                         \n                         to get the right information.\n                        \n\n\n                          If you cannot authenticate, even with correct credentials, you may need to enable the XML Gateway API for your company. To do this, follow these instructions:\n                         \n\n\n\n                            Log into Intacct.\n                           \n\n\n\n                            Mouse over the\n                            \n                             Company\n                            \n                            tab.\n                           \n\n\n\n                            Click the plus button next to\n                            \n                             Users.\n                            \n\n\n\n\n                            Fill in the fields as follows:\n                           \n\n\n\n\n                               User ID\n                              \n                              : Enter\n                              \n                               xml_gateway.\n                              \n\n\n\n\n\n                               Last Name:\n                              \n                              Enter\n                              \n                               Gateway\n                              \n                              .\n                             \n\n\n\n\n                               First Name:\n                              \n                              Enter\n                              \n                               XML.\n                              \n\n\n\n\n\n                               Email address:\n                              \n                              Enter your own email address.\n                             \n\n\n\n\n                               User Type\n                              \n                              : Select\n                              \n                               Business\n                              \n                              .\n                             \n\n\n\n\n                               Admin Privileges\n                              \n                              : Select\n                              \n                               Full\n                              \n                              .\n                             \n\n\n\n\n\n                            Check the box that reads \"Keep my password until I reset it.\"\n                            \n\n\n\n\n                            Do one of the following:\n                           \n\n\n\n                              If you use roles...\n                             \n\n\n\n                                Open the\n                                \n                                 Roles Information\n                                \n                                tab.\n                               \n\n\n\n                                Click in row 1 to show a dropdown menu.\n                               \n\n\n\n                                Select the role that should have full access in your system (most likely\n                                \n                                 Admin\n                                \n                                ).\n                               \n\n\n\n\n\n                              If you are not using roles...\n                             \n\n\n\n                                Save your changes.\n                               \n\n\n\n                                Give the user the proper subscriptions.\n                               \n\n\n\n\n\n\n\n                            Click\n                            \n                             Save\n                            \n                            .\n                            \n\n                            This sets up the user. Intacct now sends an email with a temporary password to the email address you specified. You should now be able to use this user to log into the Connector interface in Domo.", "Preview Article": "Click here to preview", "URL Name": "360042928374", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003620", "Archived Date": "", "Language": "English", "Primary Version": "Sage Intacct Connector", "Article Total View Count": "2,585", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Sage Intacct Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}