{"file_path": "../../raw_kb_v2\\article\\360043439893\\index.html", "content": {"Title": "March 2019 Release Notes", "Article Body": "New Features and Enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        PDP Improvements\n                       \n\n                        The following improvements have been made to PDP (Personalized Data Permissions), giving you even more control over who sees what data in your company.\n                       \n\n                        Dynamic PDP\n                       \n\n                        Your company is growing, and so is your company's use of Domo. You need an easier way to configure how each person accesses only the appropriate data.\n                        \n\n                        Dynamic PDP makes your job easier. Instead of selecting individual values in specific columns to pertain to users or groups, you select a column and a user attribute, and Domo takes care of the rest, only allowing people to see the rows that match that user attribute. And because user attributes must be locked by an \"Admin\"-level user before they can be used in a PDP policy, you can feel just as secure as when you use a standard PDP policy.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Creating and Deleting PDP Policies\n                        \n                        .\n                       \n\n                        Custom PDP Filters\n                       \n\n                        For more precise control over the rows used in PDP policies, use custom PDP filters. This allows you to set rules for values that are returned, using general filter conditions such as \"is greater than,\" \"is between,\" \"begins with,\" and so on. For example, if you had a subset of users who should only be allowed to view data within a certain date range, you could create such a filter here.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Creating and Deleting PDP Policies\n                        \n                        .\n                       \n\n                        PDP on DataFusions\n                       \n\n                        Scaling and security go hand in hand now that DataFusions support Personalized Data Permissions. Build powerful, scalable DataFusions and use PDP to control access. PDP can be applied to either the inputs to the Fusion, the DataFusion output itself, or both. Domo seamlessly calculates across all your data so your users only see what they’re supposed to see.\n                       \n\n                        For more information, see\n                        \n                         PDP and DataFlows\n                        \n                        .\n                       \n\n                        Domo Stories\n                       \n\n                        Domo Stories allow you to easily create beautiful Domo Dashboards with powerful narratives. Because each layout has been optimized individually for web, mobile, tablet, print, and Scheduled Reports, each Domo Stories Dashboard tells a consistent story no matter where it's viewed.\n                        \n\n                        You can create your own Card layout, or choose from one of over 100 template options to bridge the gap between understanding the data and taking action. Domo Stories also create consistency and clarity as they use pre-established templates. This ensures that different device restrictions don’t change the meaning and context of a story.\n                        \n\n                        Domo Stories give you more freedom to tell your data stories and communicate the things that matter most to your end users.\n                       \n\n\n\n\n                        When building Domo Stories Dashboards, you can do all of the following:\n                       \n\n\n\n                          Create the exact layout you want by adding card slots then resizing.\n                         \n\n\n\n                          Add new Card layouts based on a variety of Domo Stories templates.\n                         \n\n\n\n                          Drag and drop Cards into the slots in the layouts you have added.\n                         \n\n\n\n                          Create new Cards in empty slots.\n                         \n\n\n\n                          Resize templates and the Cards within them by dragging their borders.\n                         \n\n\n\n                          Swap Cards in a layout by dragging one card on top of another.\n                         \n\n\n\n                          Add headers and borders.\n                         \n\n\n\n                          Add images and Notebook Card content inline, without having to first open the Doc Card upload screen or Notebook Card editor.\n                         \n\n\n\n                          Change the background color of your Page and individual Cards.\n                         \n\n\n\n                          Specify which Card elements appear (for example, you could hide the Summary Number for a Card).\n                         \n\n\n\n                          Define the actions that take place when a user clicks on a Card. Actions include:\n                         \n\n\n\n                            Opening the Card details view in a new browser tab.\n                           \n\n\n\n                            Enabling Interactions Filters for all cards for all Cards on the Page or for selected Cards.\n                           \n\n\n\n                            Opening other content in Domo, either in the same browser tab or in a different tab.\n                           \n\n\n\n                            Opening a specified web page.\n                           \n\n\n\n\n\n                        You can also export Domo Stories Dashboards as PDFs.\n                       \n\n                        For more information about Domo Stories, see\n                        \n                         Creating Domo Stories\n                        \n                        .\n                       \n\n                        Card-to-Card Filtering\n                       \n\n                        Business insights pop off the page when you use Card-to-Card Filtering. These filters allow you to see relationships between Cards simply by hovering over values on an individual Card. Get insights in second that used to require extensive Page filtering or additional clicking in and out of Details. Analysis of your business data has never been this easy.\n                       \n\n                        With Card-to-Card Filtering, you can also click on a chart element to apply a filter for that element to all cards in the page. For example, if you clicked on the bar for \"2014-Jan,\" all cards would be filtered to that month. This also works for rows in tables. You can turn off this filter by clicking the element again.\n                       \n\n                        Card-to-Card Filters are automatically enabled in Domo Stories Pages. To turn on Card-to-Card Filters in standard Pages, first turn on Page Filters by selecting\n                        \n\n\n                          > Turn on Page Filters\n                         \n\n                        . An\n                        \n\n                          Interaction Filters\n                         \n\n                        toggle appears and is turned on by default. You can disable or reenable Card-to-Card Filters by clicking this toggle. If you turn off page filters, Card-to-Card Filters also turn off.\n                        \n\n\n\n\n                        For more information about Card-to-Card Filters, see\n                        \n                         Applying Page-Level Filters\n                        \n                        .\n                       \n\n                        Filter Chart Types\n                       \n\n                        New Filter chart types—Slicer, Checkbox, Radio Button, Range, and Date Selector—make filtering data on a card page even easier. Once you have added a Filter Chart Card to a Page, anyone viewing it can click on one or more values to filter the other Cards on the Page.\n                       \n\n\n\n\n                           Slicer\n                          \n                          ,\n                          \n                           Checkbox\n                          \n                          , and\n                          \n                           Radio Button\n                          \n                          charts are all used to filter on specific values. For example, you could create a Card with a Slicer chart containing names of U.S. states and add it to a Page. If you then clicked \"Texas\" and \"Oklahoma,\" all of the Cards in the Page would be filtered to show only data for those states. With Slicer and Checkbox charts, anyone can apply as many filters at a time as they want. With Radio Button charts, users can apply only one filter at a time.\n                         \n\n\n\n\n                           Date Selector\n                          \n                          charts are used to filter on a specified date range. For example, you could build a Card with a Date Selector chart containing a 2014 calendar. If a user then selected all dates from February to June, all other Cards in the Page would filter to show data for those dates.\n                         \n\n\n\n\n                           Range\n                          \n                          charts are used to filter values within a range using a slider. For example, you could build a Card with a Range chart with a minimum value of $2000 and a maximum value of $4000. Viewers could then narrow the range using the slider buttons, and the other Cards in the Page would update to show data for that range of values.\n                         \n\n\n\n                        You can apply filters from multiple Cards. These should apply to any card so long as all of the selected criteria pass the filters. If any filter you have selected doesn't apply to a card, an \"Out of range\" error appears.\n                       \n\n                        Cards with Filter charts only work when Card-to-Card Filters are turned on. If Card-to-Card  Filters are not turned on, clicking a filter opens the Details view for the card instead of applying the filter.\n                       \n\n\n                         Slicer Card\n                        \n\n\n\n\n\n\n\n                         Checkbox Card\n                        \n\n\n\n\n\n\n\n                         Radio Button Card\n                        \n\n\n\n\n\n\n\n                         Range Card\n                        \n\n\n\n\n\n\n\n                         Date Selector Card\n                        \n\n\n\n\n\n                        You build Filter cards in Analyzer, just like any other chart type. For more information about building Slicer, Radio Button, and Checkbox charts, see\n                        \n                         Date Selector Chart\n                        \n                        .\n                       \n\n                        For information about using Filter cards on a page, see\n                        \n                         Applying Page-Level Filters\n                        \n                        .\n                       \n\n                        Chart Improvements\n                       \n\n                        For this release, we have added a number of exciting improvements to our charting functionality.\n                       \n\n                        Trellis Charts\n                       \n\n                        Add richness to your charts by including up to 2 additional dimensions. These additional dimensions are represented in the chart by overlaying boxes on top of each grouping. For example, the following Grouped Bar chart shows revenue by product by campaign by lead source.\n                        \n\n\n\n\n\n                        Note that this functionality is intended to be used with\n                        \n                         string\n                        \n                        columns, not date columns. To add date grouping to a chart, it is recommended that you use Tiered Dates, the next item in this list.\n                       \n\n                        Trellis Chart functionality is available for all graph types that utilize series data, like Bar graphs, Line graphs, and Area graphs.\n                       \n\n                        For more information, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        Tiered Dates\n                       \n\n                        Tiered Dates allow greater ease of understanding by presenting multiple time periods in a single view. For example, you can now show weekly data that is also grouped by month and by quarter—all on the same chart. For any chart, you can choose up to 3 date tiers.\n                        \n\n\n\n\n\n                        For more information, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        Data Tables for Charts\n                       \n\n                        Get more insights from your data by including data tables under your charts. This allows your viewers to see the underlying data in your chart without having to lose context by switching to the\n                        \n                         Table\n                        \n                        tab in the chart Details view.\n                        \n\n\n\n\n\n                        Data tables appear for charts\n                        \n                         only\n                        \n                        in the Details view, not in the Page view. This functionality is available for most vertical graph types.\n                       \n\n                        For more information, see\n                        \n                         Properties Available for Most Charts\n                        \n                        .\n                       \n\n                        Flex Tables\n                       \n\n                        Use Flex Tables to display detailed, customized information about individual series in a DataSet. You can customize rows in a Flex Table to show any of the following for each series in your data:\n                       \n\n\n\n                          The name of the series\n                         \n\n\n\n                          A Spark Line or Spark Bar graph representing the series\n                         \n\n\n\n                          A change indicator that shows at a glance whether overall change for the series has been positive or negative\n                         \n\n\n\n                          The percent of change for the series\n                         \n\n\n\n                          The actual amount of change for the series\n                         \n\n\n\n                          The first, penultimate, last, minimum, maximum, or average value for the series\n                         \n\n\n\n                        The Flex Table in the following example screenshot shows the name, a Spark Line, a change indicator, and the percent of change for each series in the data:\n                       \n\n\n\n\n                        You can include up to 10 columns in any given Flex Table.\n                       \n\n                        For more information about Flex Tables, see\n                        \n                         Flex Table\n                        \n                        .\n                       \n\n                        Dynamic Textboxes\n                       \n\n                        Dynamic Textboxes let you build text Cards with dynamic fields that update whenever your data updates. More than a dozen macros are available, allowing you to reference information from your DataSet such as change percentage, column names, first/last/penultimate value, minimum/maximum/average value, first or last category, and so on. In the following example textbox, all of the called-out fields are set to update dynamically based on the content in the DataSet:\n                        \n\n\n\n\n                        The text can be as long as you want and can contain any character. You can format text style and alignment and margins, as well as change the font size, color, and style.\n                       \n\n                        For more information, see\n                        \n                         Dynamic Textbox\n                        \n                        .\n                       \n\n                        Multi-Period Projection\n                       \n\n                        New multi-period projection functionality lets you project as many future periods onto a chart as you want. All multi-period projections are based on linear regression models (though a number of different options are available for configuring your linear regression). Multi-Period Projections are available for vertical Single Bar, Grouped Bar, Stacked Bar, and Running Total Bar graphs, as well as most Line graphs.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Projecting the Last Value in Your Chart\n                        \n                        .\n                       \n\n                        Enriched Tooltips\n                       \n\n                        With our new enriched tooltips functionality, you can use macros in data labels and hovers to reference columns you have dropped into the\n                        \n\n                          Tooltip\n                         \n\n                        fields above the chart preview. You can use up to 3 such fields. This is an excellent way to show data for columns that aren't being used to build the chart. For example, in a chart showing sales over time, you may want to also see the profit and cost values for a particular time period. You could use enriched tooltips to incorporate these values into the data labels or hovers in your chart, allowing your viewers to see the extra data while maintaining an uncluttered chart.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Formatting Data Label and Hover Text in Your Chart\n                        \n                        .\n                       \n\n                        DataSet Certification\n                       \n\n                        Ensure you’re using trusted data to build your Cards with new DataSet certification. Simply choose\n                        \n                         Request Certification\n                        \n                        from the wrench menu to start the certification process.\n                        \n\n\n\n\n                        Two important things to note:\n                       \n\n\n\n                          Only DataSet owners—\n                          \n\n                            not\n                           \n\n                          co-owners—can start the certification process for the DataSet. If a request for certification is submitted by someone other than the owner, a message is sent to the owner informing them that certification has been requested. That person can then choose whether or not to go in and request certification.\n                         \n\n\n\n                          The certification will expire if the DataSet undergoes a schema change (i.e. columns are deleted or renamed), a configuration change, or an account change.\n                         \n\n\n\n                        For more information about certifying DataSets, see\n                        \n                         Certifying Cards and DataSets\n                        \n                        .\n                       \n\n                        Mobile DataSet Details\n                       \n\n                        DataSet details are now available in the Domo iOS and Android apps, so you can get quick insight into DataSets even while running your business from your phone. DataSet details give you context to better understand the data powering your Cards, including last run information, the owner, size, Cards powered by the data, and people with access.\n                       \n\n                        To use the new mobile DataSet details, update your app from the Apple or Google Play stores. After updating, navigate to a Card and tap on the DataSet information below the Card.\n                       \n\n\n\n\n                        Sample Apps for Popular Connectors\n                       \n\n                        What's better than having awesome visualizations of your data? Not having to build them all yourself. Increase your time-to-value by using our Sample Apps for popular connectors. Sample Apps provide representative catalog content for incoming data whenever you power up a Domo Connector, so you have a big head start when building visualizations for your data.\n                       \n\n                        To deploy a Sample App for a connector, just click\n                        \n                         Get the Sample App\n                        \n                        when powering up the connector. Note that Sample Apps use your own DataSet data,\n                        \n                         not\n                        \n                        sample data.\n                       \n\n\n\n\n                        For more information about deploying connectors, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Accounts API\n                       \n\n                        Now you can manage all of your accounts at scale directly from the Accounts API. The Accounts API allows you to create, update, validate, and share accounts through an internal system or a Domo App that can be customized to send alerts to users when they need to update credentials.\n                       \n\n                        Visit\n                        \n                         https://developer.domo.com\n                        \n                        to get started with the Accounts API.\n                       \n\n                        Features Available by Request\n                       \n\n                        The following features are now available\n                        \n                         by request\n                        \n                        . If you are interested in having this features turned on for your instaince, please reach out to your CSM or sales representative.\n                       \n\n                        Improved Navigation\n                       \n\n                        Domo has transformed your experience by making it easier to find and organize content. Specifically, this means you can now...\n                       \n\n\n\n                          create a second level of subpages,\n                         \n\n\n\n                          add Dashboards as Favorites,\n                         \n\n\n\n                          scroll for quick and easy discovery of your Dashboards,\n                         \n\n\n\n                          find Dashboards by name in the filter menu,\n                         \n\n\n\n                          quickly manage, organize, and create Dashboards, and\n                         \n\n\n\n                          hide the Dashboard menu to take advantage of more real estate on the screen.\n                         \n\n\n\n                        Enhanced Dashboard Filters\n                       \n\n                        Enhanced Dashboard Filters bring more clarity, context, and simplification to Page filtering. Instead of choosing a DataSet to filter on, you can choose your filter columns from a list of all available columns used in Cards on the Page. And summary text on each Page appears whenever filters are applied, so you quickly see which filters are applied as you dive into your data.\n                       \n\n                        Enhanced Analyzer Card Filters\n                       \n\n                        With the new filtering improvements in Analyzer, you no longer need to create a Beast Mode LIKE function if you want to filter on a value that contains a specific word. You also don’t need to open a DataFlow just to change the data type for a column. These options are now available using the new Analyzer filter options.\n                       \n\n                        OPC Plugin\n                       \n\n                        Sync all of your OPC-compliant devices directly in Domo to watch how all your industrial devices and systems are performing in real-time. OPC data can update in as little as 2 minutes.\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking by clicking\n                        \n                        in the top navigation bar .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n                          \n                           /support\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439893", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004424", "Archived Date": "", "Language": "English", "Primary Version": "March 2019 Release Notes", "Article Total View Count": "4,766", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              March 2019 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}