{"file_path": "../../raw_kb_v2\\article\\360043431353\\index.html", "content": {"title": "\n\n\n HubSpot Webhook Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nHubSpot develops software for social media and email marketing, content management, web analytics, and search engine optimization. The Domo HubSpot Webhook connector allows you to subscribe to changes happening in the accounts of any HubSpot user who installs your integration. Using this connector requires that you set up a HubSpot app to use the API by subscribing to changes you want to be notified about, and by specifying a URL to send those notifications. See HubSpot's\n\nprerequisites documentation\n\nfor more details about creating an app.\n\n\n Webhooks are set up for a HubSpot app, not individual portals.  Any portals that install your app (by going through the OAuth flow) will be subscribed to any webhook subscriptions set up for the app.\n\n\n Because this connector is webhook-based, DataSets created using this connector update automatically when new data is sent to your Hubspot account. You do\n *not*\n need to worry about scheduling updates when using this connector.\n\n\n You connect to your HubSpot account in the Data Center. This topic discusses the fields and menus that are specific to the HubSpot Webhook connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n For more information about webhooks in Hubspot, see\n\nhttps://developers.hubspot.com/docs/...hooks-overview\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your HubSpot account and create a DataSet, you must first create an app within Hubspot. To create an app, you must first open a developer account. You can learn more about opening a developer account and creating an app by navigating here:\n\nhttps://developers.hubspot.com/docs/...app-in-hubspot\n\nIn addition to creating a Hubspot app, you must have the following:\n\n The client ID and client secret associated with the app you have created\n* The username and password for your Hubspot account\n\nYou can find your client ID and client secret in the\n **Details**\n tab for the app, as shown in the following screenshot:\n\nConnecting to Your HubSpot Account\n------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the HubSpot Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your HubSpot account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Client ID\n  |\n Enter the client ID associated with your Hubspot app. For information about finding your client ID, see \"Prerequisites,\" above.\n  |\n|\n Client Secret\n  |\n Enter the client secret associated with your Hubspot app. For information about finding your client secret, see \"Prerequisites,\" above.\n  |\n\nAfter you click\n **Connect**\n , you are taken to the Hubspot login screen, where you can log into your Hubspot account using your Hubspot credentials (the password associated with your Hubspot account as well as your Hubspot password). Alternatively, you can connect to Hubspot using Google credentials or SSO.\n\nOnce you have entered valid credentials for your Hubspot app and account, you can use the same account any time you go to create a new HubSpot Webhook DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nIn this pane, you configure webhook subscriptions for your Hubspot app by pasting a URL from Domo into the app. This creates a connection between the app and the DataSet, meaning the DataSet will update anytime the data in the app is updated.\n\n\n**To configure webhook subscriptions for your app,**\n\n. In the Details pane in Domo, copy the URL found in the\n **Webhook URL**\n field.\n2. Go into your Hubspot app. (This should be the same app you provided credentials for in the\n **Credentials**\n pane.)\n3. Under\n **Webhook Subscriptions**\n , select\n **Configure**\n .\n4. Paste the copied URL into the empty field.\n5. Create as many subscriptions as necessary using the\n **Create Subscription**\n button.\n6. In Domo, select\n **Yes**\n in the dropdown menu if you want to include metadata such as IP address and timestamp in your returned data. Otherwise select\n **No**\n .\n7. (Conditional) If you want new data in your DataSet to be replaced instead of simply added onto, click\n **Change update settings**\n then choose\n **Replace.**\n8. Click\n **Save**\n .\n\nFAQs\n------\n\n\n#####\n How often can the data be updated?\n\nThe Hubspot Webhook connector updates automatically as Hubspot receives data.\n\n####\n Are there any API limits I should be aware of?\n\nNo.\n\n####\n What's the difference between this connector and the HubSpot connector?\n\nThe Hubspot Webhook connector automatically updates as Hubspot receives more data and does not update on a set schedule. The HubSpot connector, on the other hand, is a more \"standard\" connector in which you choose a report and set an update schedule.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431353\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003761\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nHubSpot Webhook Connector\n\n", "article_total_view_count": "\n\n\n 2,428\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "hubspot_webhook_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}