{"file_path": "../../raw_kb_v2\\article\\360043428833\\index.html", "content": {"Title": "Understanding the Data Table in Analyzer", "Article Body": "Intro\n                       \n\n                        The Data Table in Analyzer allows you to see and manipulate the data in all columns you have applied to your chart, along with any other unused columns you want to show. Changes you make to the data in the Data Table are reflected in your chart preview. Likewise, when you make changes to the chart using other tools such as filters and sorting, the data in the table is updated.\n                       \n\n\n\n                          Video - Using the Analyzer Data Table\n                         \n\n\n\n\n\n\n\n\n\n                        Showing/hiding the Data Table\n                       \n\n                        You can show the Data Table by clicking\n                        \n                         Data Table\n                        \n                        in the toolbar at the top of the Analyzer window. (If the Toolbar does not appear, click\n                        \n                        .)\n                       \n\n\n\n\n                        The Data Table then appears at the bottom of the Analyzer window, under the chart preview. You can expand it to show more rows by clicking and dragging upward on the border separating the chart preview and Data Table, or collapse it by clicking and dragging downward on that border. If you want to see just the Data Table without the chart preview and other options, you can make it full-screen by clicking\n                        \n                        .\n                       \n\n                        You can hide the Data Table by clicking\n                        \n                         Data Table\n                        \n                        again in the toolbar (when it is highlighted in blue).\n                       \n\n                        Parts of the Data Table\n                       \n\n                        The following screenshot points out the most important parts of the Analyzer Data Table:\n                       \n\n\n\n\n                        You can use the following table to learn more about these components:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Data type icon\n                           \n\n\n\n                            Indicates the data type for this column. Icons include\n                            \n                            for string columns,\n                            \n                            for numeric columns, and\n                            \n                            for date-time columns. For more information about data types, see\n                            \n                             Understanding Chart Data\n                            \n                            .\n                           \n\n\n\n\n\n                            Sort icon\n                           \n\n\n\n                            Lets you sort the values in a given column in ascending or descending order. Sorting is done alphabetically in string columns, numerically in numeric columns, and by date in date columns. Changes you make to sorting in the Data Table are reflected in the\n                            \n                             Sorting\n                            \n                            field and vice-versa. For more information about sorting, see\n                            \n                             Sorting the Data in Your Chart\n                            \n                            .\n                           \n\n\n\n\n\n                            Filter/aggregation icon\n                           \n\n\n\n                            Lets you access filter and aggregation options for a given column. Filters apply to all rows in a column, while aggregations affect the total row only.\n                           \n\n                            Changes you make to filters are reflected in the\n                            \n                             Filters\n                            \n                            field and vice-versa. For more information about filters, see\n                            \n                             Adding Filters to Your Chart\n                            \n                            .\n                           \n\n                            Changes you make to aggregations are reflected in the column dropdowns above the chart preview. For more information about aggregating data, see\n                            \n                             Aggregating your data\n                            \n                            .\n                           \n\n\n\n\n\n                            Show Columns option\n                           \n\n\n\n                            Lets you add or remove columns to/from the Data Table. Columns you add in this way are shown in gray and appear in the Data Table only; you do not see them in the fields area above the chart preview. However, filtering or sorting on one of these columns may still change the data in a chart. For example, a certain chart may not show dates on a date range, but if you were to add a date column to the Data Table then filter the dates, the chart preview would update to reflect the date range you specified.\n                           \n\n                            Columns you have already added to the chart by dragging column names into the fields above the chart preview are grayed out and cannot be removed in this view (though you can still remove them by mousing over the column names in the fields and clicking \"x\").\n                           \n\n                            In the\n                            \n                             Search Columns\n                            \n                            dialog you can search for columns to add or remove by typing the column name in the\n                            \n                             Search Columns\n                            \n                            field.\n                           \n\n\n\n\n\n                            Gear menu\n                           \n\n\n\n                            Provides two viewing options for the data in the Data Table:\n                           \n\n\n\n\n                               Show Totals\n                              \n                              . Shows or hides the \"TOTAL\" row in the second row of the chart. For more information, see \"Total Row\" above.\n                             \n\n\n\n\n                               Show Chart Data/Show Raw Data\n                              \n                              . Lets you toggle between chart data and raw data in the Data Table. \"Raw data\" is the unaggregated data used to power your chart, while \"chart data\" shows the data with any aggregations that have been applied.\n                             \n\n\n\n\n\n\n\n                            Used columns\n                           \n\n\n\n                            Columns that have been applied to your chart (by dragging and dropping them into the fields above the chart preview). Used string and date columns appear in blue, while used numeric columns appear in green. You cannot remove these columns from the Data Table directly, though you can remove them by mousing over the column names in the fields over the chart preview and clicking \"x.\"\n                           \n\n\n\n\n\n                            Unused columns\n                           \n\n\n\n                            Columns that have not been applied to your chart but that you have shown by clicking on the\n                            \n                             Show columns\n                            \n                            link then checking the boxes for the columns you want to show. You do not see these columns in the fields area above the chart preview. However, filtering or sorting on one of these columns may still change the data in a chart. For example, a certain chart may not show dates on a date range, but if you were to add a date column to the Data Table then filter the dates, the chart preview would update to reflect the date range you specified.\n                           \n\n\n\n\n\n                            Full-screen icon\n                           \n\n\n\n                            Opens the Data Table in full-screen mode. When you are in full-screen mode, you can revert to the default mode by clicking\n                            \n                            .", "Preview Article": "Click here to preview", "URL Name": "360043428833", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004631", "Archived Date": "", "Language": "English", "Primary Version": "Understanding the Data Table in Analyzer", "Article Total View Count": "11,983", "": "", "Article Created Date": "10/24/2022, 10:17 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Understanding the Data Table in Analyzer\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Analyzer\n              \n", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}