{"file_path": "../../raw_kb_v2\\article\\360043427593\\index.html", "content": {"Title": "Encrypting Data with Domo's Bring Your Own Key (BYOK)", "Article Body": "Intro\n                       \n\n                        Domo's BYOK is a security tool that gives complete control of the encryption keys for your Domo instance, allowing you to verify that your data is kept private at all times. In addition, BYOK includes rolling generation of data encryption keys and a built-in kill switch. You can revoke the encryption key at any time, nullifying all of your data in Domo, and ensuring that no one will have access to sensitive data.\n                       \n\n                        How Does it Work?\n                       \n\n                        Domo's BYOK is composed of the following three parts:\n                       \n\n\n\n\n\n\n\n\n\n                             Encryption Key Management\n                            \n\n\n                            BYOK supports the rotation of the encryption keys every hour. This equates to 8,760 rotating keys annually. Domo's access to the encrypted key can be revoked at any time so that the data can no longer be accessed.\n                           \n\n\n\n\n\n\n\n\n\n                             Kill Switch\n                            \n\n\n                            Utilizing the kill switch immediately caches and indexes data, rendering it unusable within seconds. This includes data accessed through laptops and mobile devices. To use this feature, you need to first revoke Domo's access to Amazon. Then, two different Domo Admins will need to activate the kill switch in their Domo Admin settings.\n                           \n\n\n\n\n\n\n\n\n\n                             Activity Logs\n                            \n\n\n                            If a user chooses to revoke their encryption keys and execute the kill switch, these events are logged in the Domo Activity Logs. This allows for immediate confirmation that data is no longer accessible.\n                           \n\n\n\n\n\n\n\n\n\n\n                        How Do I Get This?\n                       \n\n                        To begin using Domo's BYOK, speak with your Domo Account Executive or Customer Success Manager.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Be prepared to include your IT team in the process of setting up BYOK.\n                           \n\n\n\n\n\n                        Prerequisites\n                       \n\n\n\n                          Must have a Domo Enterprise account\n                         \n\n\n\n                          An Amazon Key Management System (KMS) account\n                         \n\n\n\n                            Speak with your Domo Account Executive to determine the type of KMS account needed\n                           \n\n\n\n\n\n                          Cannot be on Microsoft Azure\n                         \n\n\n\n                          Cannot be a federated data customer", "Preview Article": "Click here to preview", "URL Name": "360043427593", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003026", "Archived Date": "", "Language": "English", "Primary Version": "Encrypting Data with Domo's Bring Your Own Key (BYOK)", "Article Total View Count": "4,980", "": "", "Article Created Date": "10/24/2022, 9:00 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Encrypting Data with Domo's Bring Your Own Key (BYOK)\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Domo Security Options\n              \n", "url": "/s/topic/0TO5w000000ZandGAC"}]}