{"file_path": "../../raw_kb_v2\\article\\360042925314\\index.html", "content": {"Title": "Properties for Pie-Type Charts", "Article Body": "Intro\n                       \n\n                        Refer to this topic to find information about chart properties available for Pie-type charts, such as those for configuring value formatting, sorting, Funnel options, and so on.\n                       \n\n                        \"General\" Properties\n                       \n\n                        The properties in the following table are found in the\n                        \n                         General\n                        \n                        category in Chart Properties.\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Examples\n                           \n\n\n\n\n\n\n\n                            Maximum Slices Before Other\n                           \n\n\n\n                            Determines the number of slices in a Pie or Donut chart that are represented as unique slices—all remaining slices in the chart are aggregated into an \"Other\" slice.\n                           \n\n                            In the first example at right, the user entered \"6\" as the\n                            \n                             Maximum Slices Before Other\n                            \n                            value; therefore, the first six slices appear as unique slices, and the remaining slices are grouped into an \"Other\" slice. In the second example, the user mouses over the \"Other\" slice, and the legend updates to show the items that have been grouped into that slice. In addition, the total and percentage for the combined \"Other\" items appears next to the pie.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Maximum Items Before Other\n                           \n\n\n\n                            Determines the number of squares in a Tree Map that are represented as unique squares—all remaining squares in the chart are aggregated into an \"Other\" square. In the example at right, the user entered \"8\" as the\n                            \n                             Maximum Items Before Other\n                            \n                            value; therefore, the first eight squares appear as unique squares, and the remaining squares are grouped into an \"Other\" square.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Value Format\n                           \n\n\n\n                            Determines whether currency symbols are appended to values in Pie and Donut charts.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in values in Pie and Donut charts.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Percent Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in percent values in Pie and Donut charts and Tree Maps.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            Display in Legend\n                           \n\n\n\n                            In Pie and Donut charts, allows you to choose whether the legend values are represented as values (as in your DataSet) or as percentages.\n                           \n\n\n\n\n\n                            —\n                           \n\n\n\n\n\n                            Hide Pie Labels\n                           \n\n\n\n                            Determines whether labels appear for pie slices in the Details view for a Pie chart.\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Unsorted Data\n                           \n\n\n\n                            Determines whether or not the slices in a Pie chart are automatically sorted from highest to lowest value. By default, in a Pie chart, slices are arranged from highest value to lowest value. In this situation, you\n                            \n                             cannot\n                            \n                            change the sort order by selecting different options in the\n                            \n                             Sorting\n                            \n                            menu. However, if you check the\n                            \n                             Unsorted Data\n                            \n                            box, you can use\n                            \n                             Sorting\n                            \n                            to change the sort order. For more information, see\n                            \n                             Sorting the Data in Your Chart\n                            \n                            .\n                           \n\n\n\n                            —\n                            \n\n\n\n\n\n\n                            Legend Percentage\n                           \n\n\n\n                            Lets you specify how legend percentages in Funnel graphs are derived. When\n                            \n                             Percent of Total\n                            \n                            is selected, the percentage for each funnel slice is derived from the chart total, much like a Pie chart. When\n                            \n                             Percent of Previous\n                            \n                            (default) is selected, the percentage for each slice is derived from the value of the slice above it. The\n                            \n                             Percent of Previous\n                            \n                            option is appropriate for conversion funnel charts in which you want to show the percent of change between successive layers.\n                           \n\n                            The two example screenshots at right compare these two types of Funnel charts. The first screenshot shows a chart in which\n                            \n                             Percent of Total\n                            \n                            is used. The percentage shown for each layer is derived from the total chart value. The second screenshot shows a chart in which\n                            \n                             Percent of Previous\n                            \n                            is used. The percentage shown for each layer is derived from the value of the previous layer.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        \"Legend\" Properties\n                       \n\n                        The properties in the following table are found in the\n                        \n                         Legend\n                        \n                        category in Chart Properties.\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Examples\n                           \n\n\n\n\n\n\n\n                            Hide Legend\n                           \n\n\n\n                            When this option is selected, no legend appears next to your Pie or Donut graph. The example shows a Pie graph in which the legend has been hidden.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n                            Display in Legend\n                           \n\n\n\n                            Determines whether values from your DataSet display as literal values or as their corresponding percentages in your Pie graph. For example, a value from your DataSet might be \"26\" but take up 35.9% of the pie. Therefore, if you selected\n                            \n                             Value Only\n                            \n                            for this property, the legend item would read \"26,\" and if you selected\n                            \n                             Percentage\n                            \n                            , the legend item would read \"35.9%.\" If you selected\n                            \n                             No Label\n                            \n                            , only the name of each slice would appear in the legend.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                        \"Hover Legend\" Properties\n                       \n\n                        The properties in the following table are found in the\n                        \n                         Hover Legend\n                        \n                        category in Chart Properties.\n                       \n\n\n\n\n                           Option\n                          \n\n                           Description\n                          \n\n                           Examples\n                          \n\n\n\n\n\n                           Hide Legend\n                          \n\n                           When this option is selected, the \"hover legend,\" which normally appears when you mouse over a slice in your Pie or Donut graph, is hidden from view.\n                          \n\n                           —\n                          \n\n\n\n                           Title Text\n                          \n\n                           Lets you customize the summary text that appears above your Pie or Donut graph's hover legend area (which normally reads \"Total\").The example shows a Pie graph in which this text has been customized to read \"Sum of Amount.\"\n                          \n\n\n\n\n\n\n\n\n                           Title Value\n                          \n\n                           Lets you specify an aggregation type for the summary value in your Pie or Donut graph's hover legend. By default all of the data in your graph is totaled, but you can change this to show the average, minimum, or maximum amount in the graph.\n                          \n\n                           —\n                          \n\n\n\n                           Hide Percent Value\n                          \n\n                           When this option is selected, the percent of total value that appears when you mouse over a slice in your Pie or Donut chart does not appear.\n                          \n\n                           —\n                          \n\n\n\n\n                        \"Data Label Settings\" Properties\n                       \n\n                        The properties in the following table are found in the\n                        \n                         Data\n                        \n\n                         Label Settings\n                        \n                        category in Chart Properties.\n                       \n\n\n\n\n                           Option\n                          \n\n                           Description\n                          \n\n                           Examples\n                          \n\n\n\n\n\n                           Hide Labels\n                          \n\n                           Hides the labels that normally appear on the slices in your Pie graph.The example shows a Pie graph in which labels have been hidden.\n                          \n\n\n\n\n\n\n\n\n                           Text\n                          \n\n                           Specifies text to replace the default text in labels in Pie graphs. The example at right shows a Pie graph in which the user has implemented a macro to show the value for each state. For more information about creating data label text, including a list of available macros, see\n                           \n                            Formatting Data Label and Hover Text in Your Chart\n                           \n                           .\n                          \n\n\n\n\n\n\n\n\n                           Font Size\n                          \n\n                           Lets you increase or decrease the font size for the labels in your Pie graph. If you choose the default setting (\"Auto\"), an optimal font size for your labels is determined based on the amount of space in each slice.\n                          \n\n                           —\n                          \n\n\n\n\n                        \"Label Settings\" Properties (Tree Maps)\n                       \n\n                        The properties in the following table are found in the\n                        \n                         Label Settings\n                        \n                        category in Chart Properties.\n                       \n\n\n\n\n                           Option\n                          \n\n                           Description\n                          \n\n                           Examples\n                          \n\n\n\n\n\n                           Position\n                          \n\n                           Determines the position of labels in Tree Maps.\n                          \n\n                           —\n                          \n\n\n\n                           Text\n                          \n\n                           Specifies text to replace the default text in Tree Maps. The example at right shows a Tree Map in which the user has implemented a macro to show the value for each state. For more information about creating data label text, including a list of available macros, see\n                           \n                            Formatting Data Label and Hover Text in Your Chart\n                           \n                           .", "Preview Article": "Click here to preview", "URL Name": "360042925314", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004653", "Archived Date": "", "Language": "English", "Primary Version": "Properties for Pie-Type Charts", "Article Total View Count": "4,931", "": "", "Article Created Date": "10/24/2022, 10:18 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Properties for Pie-Type Charts\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Properties\n              \n", "url": "/s/topic/0TO5w000000ZaodGAC"}]}