{"file_path": "../../raw_kb_v2\\article\\360047499793\\index.html", "content": {"title": "\n\n\n Connecting to ODBC Data in Workbench 4\n\n\n", "article_body": "\n\n\n**Important:**\n Support for Workbench 4 ended on\n **April 15, 2021**\n . Workbench may continue to run on installed machines, but it will no longer receive feature enhancements and security updates. When issues are encountered in Workbench 4, the recommended course of action from the Domo Support team will be to upgrade to the latest version of Workbench 5. To see this article for Workbench 5, click\n\n*here**\n\n.\n\nIntro\n-------\n\nYou can create an ODBC DataSet Job in Workbench 4. When you select ODBC as your Data Source type, you can provide the details of your connection and configure your query.\n\n\n**Note:**\n Workbench 4 determines at runtime whether you are using a 32- or 64-bit version of Windows; thus you are not asked to specify a version.\n\n*Training Video - Creating an ODBC Connection**\n\nLearn how to set up an ODBC connection in Workbench 4.\n\n*Training Video - Creating a System DSN**\n\nLearn how to create a system DSN for your ODBC connection in Workbench 4.\n\n\n Connecting to ODBC Data\n-------------------------\n\n*To create an ODBC DataSet Job in Workbench 4,**\n\n. Click\n **Add New**\n in the\n **DataSet Jobs**\n grouping in the Buttons toolbar at the top of the Workbench window.\n\n\n This opens the\n **Workbench DataSet Job Creation Wizard**\n .\n2. (Conditional) If requested, select the desired Domo server. (This screen only appears if you have more than one server set up in Workbench.)\n3. In the\n **DataSet Job Name**\n field, enter a name for the DataSet Job. This is the name of the job as it appears in Workbench,\n *not*\n the name of the uploaded DataSet in Domo.\n4. In the\n **DataSet Name**\n field, enter the name of the DataSet. This is the name of the uploaded DataSet in Domo.\n5. Select the desired update method in the\n **Update Method**\n menu:\n\n* Select\n\t **Replace DataSet**\n\t if you want the DataSet to be replaced entirely upon updating.\n\t* Select\n\t **Append to DataSet**\n\t if you want new data to be added to the existing data set upon updating.\n6. In the\n **Transport Method**\n menu, select\n **ODBC Connection Provider**\n .\n7. Click\n **Next**\n .\n8. In the\n **DataSet Type**\n field, select the type of DataSet in the dropdown or enter a custom name.\n\n\n The DataSet type you select or enter here is reflected as the connector type in Domo after you execute the job.\n\n*Tip:**\n It is recommended that you select or enter the DataSet type that tells users what data is being represented,\n *not*\n the data reader you are using to present the data. For example, you might be connecting to an ODBC database that contains Twitter data. In this case, the best option would be to enter \"Twitter\" rather than selecting\n **ODBC**\n because the data you are representing in Domo is from Twitter.\n9. (Optional) Enter a description in the\n **DataSet Description**\n field.\n\n*Note:**\n You can change any of the settings you made in the above steps in the\n **Source**\n panel for the DataSet Job after you complete all of the steps in the Wizard\n *except*\n the transport method.\n10. Click\n **Next**\n .\n\n\n A new ODBC DataSet Job is added to the list of jobs for the currently authenticated server in the\n **Accounts**\n pane.\n11. Under the ODBC DataSet Job that was just added to the jobs list, select\n **Source**\n .\n\n\n A panel opens with options for configuring your ODBC connection and defining your query.\n12. In the\n **Connection Type**\n field, select a connection option.\n\n\n The following table describes the available options:\n\n\n|\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n System DSN\n  |\n You select the DSN to use for the desired DataSet from all of the DSNs available in your system. You can indicate whether credentials are required.\n\n*Notes:**\n\n* When uploading data from an ODBC DataSet, you must specify an existing Data Source Name (DSN). You can create a DSN using the Windows ODBC Data Source Administrator. (You can access the the Windows ODBC Data Source Administrator by entering \"ODBC\" in the Start Menu search, then selecting \"Data Sources (ODBC)\".) For more information about creating a DSN, refer to the Windows ODBC Help (by searching for \"ODBC\" in Windows Help and Support) or view the training video in\n\n How can I improve the performance of a MySQL driver?\n\t* For information about defining DataSet names (DSNs) and using Open Database Connectivity (ODBC) to access data, refer to documentation for ODBC.\n\t* By default, the ODBC connection uses the settings defined in the DSN. This means that queries that could potentially be detrimental to databases that are allowed to be sent through the ODBC connection when previewing and executing jobs. This includes statements such as\n\n alter\n\n ,\n\n delete\n\n ,\n\n create table\n\n ,\n\n insert into\n\n , etc. If you want to prevent Workbench from being able to execute such commands, you must make these changes in the DSN.\n\n|\n|\n Connection Builder\n  |\n You enter details for your ODBC connection, such as login credentials, driver, server URL, database name, port, timeout value, and connection parameters.\n  |\n|\n Connection String\n  |\n You enter a single string for your connection.\n  |\n\n\n13. (Conditional) Do one of the following:\n\n* If you selected\n\t **System DSN**\n\t as your\n\t **Connection Type**\n\t ...\n\n\t1. In the\n\t\t **System DSN**\n\t\t menu, select the desired system DSN from those available in your system.\n\t\t2. (Conditional) If this DSN connection requires credentials to connect, set\n\t\t **Required Credentials**\n\t\t to \"On,\" then enter your username and password in the appropriate fields. Otherwise set\n\t\t **Required Credentials**\n\t\t to \"Off.\"\n\t* If you selected\n\t **Connection Builder**\n\t as your\n\t **Connection Type**\n\t ...\n\n\t1. Enter the appropriate information in the fields.\n\n\n\t\t Some parameters may or may not be required, depending on your connection.\n\n\n\t\t You can use the following table for reference:\n\n\n\t\t|\n\t\t Field\n\t\t  |\n\t\t Description\n\t\t  |\n\t\t| --- | --- |\n\t\t|\n\t\t Driver\n\t\t  |\n\t\t Specify the name of the driver used to access the database.\n\t\t  |\n\t\t|\n\t\t Server\n\t\t  |\n\t\t Specify the server name or URL for the database.\n\t\t  |\n\t\t|\n\t\t Database\n\t\t  |\n\t\t Specify the name of the database to access.\n\t\t  |\n\t\t|\n\t\t Port\n\t\t  |\n\t\t Enter the port number where the database is found. The default port is the MySQL port.\n\t\t  |\n\t\t|\n\t\t Timeout\n\t\t  |\n\t\t Enter the desired timeout value in seconds that the connection is kept alive before it is refreshed from the DataSet.\n\t\t  |\n\t\t|\n\t\t Username\n\t\t  |\n\t\t Specify the username you use to connect to the database.\n\t\t  |\n\t\t|\n\t\t Password\n\t\t  |\n\t\t Specify the password you use to connect to the database.\n\t\t  |\n\t\t|\n\t\t Connection Parameters\n\t\t  |\n\t\t Specify parameters for connecting to the DataSet.\n\t\t  |\n\t* If you selected\n\t **Connection String**\n\t as your\n\t **Connection Type**\n\t ...\n\n\t1. Enter a connection string to connect to the data source.\n14. Click\n **Validate Configuration**\n**.**\n15. In the\n **Data Source Properties**\n pane, enter a query for the data you want to retrieve. For example:\n\n\n`SELECT\n\n\n order_audit_id,\n\n\n user_name,\n\n\n customer_name,\n\n\n order_source,\n\n\n order_total,\n\n\n created\n\n\n FROM order_audit`\n16. (Optional) Define replacement variables for columns in the DataSet in the\n **Replacement Variables**\n tab. For each replacement variable...\n\n1. Select the applicable column in the\n\t **Column Dropdown**\n\t .\n\n**Note:**\n\t The\n\t **Column**\n\t dropdown does not populate until you create a successful ODBC connection in the\n\t **Transport Method**\n\t pane.\n\t2. Define replacement variables for the selected column in the\n\t **Value**\n\t dropdown.\n\n\n\t|\n\t Variable Type\n\t  |\n\t Description\n\t  |\n\t| --- | --- |\n\t|\n\n lastvalue\n\n |\n\n lastvalue\n\n variables keep track of relevant fields for the last row of data that was sent with the most recent upload for the associated job. The syntax is\n\n\n\t`!{lastvalue:_name_}!`\n\n lastvalue\n\n variables values are updated by Workbench after an upload finishes.\n\n lastvalue\n\n variables are stored in the job (\n\n .xml\n\n ) file. This variable lets you construct a query that gets only the \"new\" rows each time it runs. For example, if your data has a column with a row \"id\" that increments with each new row, you can construct a query containing\n\n\n\t`!{lastvalue:id}!`\n\n\n\t similar to the following:\n\n\n\t`select id, name, type, sales from tablename where id > !{lastvalue:id}! order by id`\n\n\n\t In this example, the column \"id\"\n\t *must*\n\t be in the\n\n SELECT\n\n ,\n\n WHERE\n\n , and\n\n ORDER BY\n\n clauses for the variable to be used and updated.\n\n\n\t When uploading this job, Workbench replaces the\n\n\n\t`!{lastvalue:id}!`\n\n\n\t variable with the current value of \"id\". After finishing the upload, Workbench stores the last uploaded value of \"id\" in the job (\n\n .xml\n\n ) file.\n\n**Note:**\n\t You\n\t *must*\n\t include any column you reference with a\n\n lastvalue\n\n variable in your\n\n SELECT\n\n ,\n\n WHERE\n\n , and\n\n ORDER BY\n\n clauses in order for the variable to be used and updated after the data upload.\n\n |\n\t|\n\n previewonly\n\n |\n\t Used to indicate that certain actions should take place when loading a preview in Workbench. For example, you could request that your preview return only 100 rows of data instead of the 1,000,000 present in the data source. The syntax is\n\n\n\t`!{previewonly:Statement}!`\n\t |\n\nYou are now ready to execute the DataSet Job, thereby creating an ODBC DataSet in Domo. However, there are many other actions you can take on the DataSet Job before you send it to Domo. These include the following:\n\n Setting an update schedule for the job\n* Adding the job to a group of jobs with an advanced schedule set in Windows Task Scheduler\n* Configuring notifications to be sent when the job update succeeds or fails\n* Encrypting and decrypting Workbench data\n* Creating new columns using calculations\n* Setting a custom date format on a column\n* Replacing a value in a column\n* Combining DataSets\n* Applying filters to columns\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360047499793\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004777\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nConnecting to ODBC Data in Workbench 4\n\n", "article_total_view_count": "\n\n\n 4,876\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:30 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "connecting_to_odbc_data_in_workbench_4", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_4", "url": "/s/topic/0TO5w000000ZapSGAS"}]}