{"file_path": "../../raw_kb_v2\\article\\360042927174\\index.html", "content": {"Title": "Sailthru Advanced Connector", "Article Body": "Intro\n                       \n\n                        Sailthru is a cross-platform marketing company whose platform tracks user preferences and behavior on clients' websites, email, and mobile apps. Use Domo's Sailthru connector to compile reports on emails, blasts, users, and the like. To learn more about the Sailthru API, visit their page (\n                        \n                         https://getstarted.sailthru.com/new-.../api-overview/\n                        \n                        ).\n                       \n\n                        There are two versions of the Sailthru connector—a simplified and an advanced version. The major difference is that the advanced version allows you to configure a range of specific or relative dates for the data in your report, whereas the simplified version only lets you enter a number of past days. Also, the advanced version offers an additional report type—\"Emails.\" This topic discusses the advanced version of the report. To learn about the simplified version, see\n                        \n                         Sailthru Connector\n                        \n                        .\n                       \n\n                        You connect to your Sailthru account in the Data Center. This topic discusses the fields and menus that are specific to the Sailthru Advanced connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Sailthru account and create a DataSet, you must have the following:\n                       \n\n\n\n                          A Sailthru API key\n                         \n\n\n\n                          A Sailthru API secret\n                         \n\n\n\n                        You can obtain both of these by logging into your Sailthru account and navigating to the\n                        \n                         Account Settings\n                        \n                        page.\n                       \n\n                        Check\n                        \n                         https://my.sailthru.com/settings/api_postbacks\n                        \n                        to see if IP whitelisting is enabled for API access on your Sailthru account. If so, your credentials will not validate in the connector until you add Domo's IPs to the whitelist. A current list of Domo's IPs can be found here:\n                        \n                         http://knowledge.domo.com?cid=whitelistingip\n                        \n\n\n                        Connecting to Your Sailthru Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Sailthru Advanced Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Sailthru account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Sailthru API key.\n                          \n\n\n\n                           API Secret\n                          \n\n                           Enter your Sailthru API secret.\n                          \n\n\n\n\n                        For information about obtaining these credentials, see \"Prerequisites,\" above.\n                       \n\n\n                         Once you have entered valid Sailthru credentials, you can use the same account any time you go to create a new Sailthru Advanced DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Sailthru Advanced report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Blast ID Details\n                              \n\n                               Retrieves details about Blasts, such as subject, from email, from name, email count, and so on.\n                              \n\n\n\n                               Blast Status\n                              \n\n                               Retrieves Blast status metadata.\n                              \n\n\n\n                               Blast Repeat\n                              \n\n                               Retrieves data on all repeating campaigns.\n                              \n\n\n\n                               Content\n                              \n\n                               Retrieves metadata about the 20 most recent pieces of content.\n                              \n\n\n\n                               Email\n                              \n\n                               Retrieves information about one of your Users, referenced by email address.\n                              \n\n\n\n                               List\n                              \n\n                               Retrieves basic information about all of your Lists.\n                              \n\n\n\n                               Stats\n                              \n\n                               Retrieves various statistics.\n                              \n\n\n\n                               Templates\n                              \n\n                               Retrieves information about all existing Templates.\n                              \n\n\n\n                               User\n                              \n\n                               Retrieves information about a specified User.\n                              \n\n\n\n\n\n\n\n                           Status\n                          \n\n                           Select the Blast status you want to filter your results by.\n                          \n\n\n\n                           Start Date\n                          \n\n                           Select whether to pull data for a specific or relative start date. If you select\n                           \n                            Specific\n                           \n                           , you will be asked to choose a specific start date from a date picker. If you select\n                           \n                            Relative\n                           \n                           , you will be asked to enter an offset value (i.e. the number of days in the past you want to start pulling data for).\n                          \n\n\n\n                           Select Specific Start Date\n                          \n\n                           Select the date you want to start pulling data for. Combine with\n                           \n                            Select Specific End Date\n                           \n                           to create a range of dates.\n                          \n\n\n\n                           End Date\n                          \n\n                           Select whether to pull data for a specific or relative end date. If you select\n                           \n                            Specific\n                           \n                           , you will be asked to choose a specific end date from a date picker. If you select\n                           \n                            Relative\n                           \n                           , you will be asked to enter an offset value (i.e. the number of days in the past you want to stop pulling data for).\n                          \n\n\n\n                           Select Specific End Date\n                          \n\n                           Select the date you want to stop pulling data for. Combine with\n                           \n                            Select Specific Start Date\n                           \n                           to create a range of dates.\n                          \n\n\n\n                           Start Date Offset\n                          \n\n                           Enter the number of days back you want to start pulling data for. Combine with\n                           \n                            End Date Offset\n                           \n                           to create a relative date range. For example, if you entered\n                           \n                            10\n                           \n                           for\n                           \n                            Start Date Offset\n                           \n                           and\n                           \n                            5\n                           \n                           for\n                           \n                            End Date Offset\n                           \n                           , each time the report ran it would pull data from the last 10 days up until the last 5 days.\n                          \n\n\n\n                           End Date Offset\n                          \n\n                           Enter the number of days back you want to stop pulling data for. Combine with\n                           \n                            Start Date Offset\n                           \n                           to create a relative date range. For example, if you entered\n                           \n                            10\n                           \n                           for\n                           \n                            Start Date Offset\n                           \n                           and\n                           \n                            5\n                           \n                           for\n                           \n                            End Date Offset\n                           \n                           , each time the report ran it would pull data from the last 10 days up until the last 5 days.\n                          \n\n\n\n                           Email Address\n                          \n\n                           Enter the email address of the user you want to pull information for.\n                          \n\n\n\n                           Stat\n                          \n\n\n                            Select the type of statistic you want to pull information for.\n                            \n\n\n                             Blast\n                            \n                            retrieves aggregated information from all campaigns over a specified date range.\n                           \n\n\n                             Blast Stats by Blast\n                            \n                            retrieves stats organized by Blast.\n                           \n\n\n                             List\n                            \n                            retrieves information about your subscriber counts for a specified date. You can choose to pull all lists OR all subscribers not broken down by list.\n                           \n\n\n                             Send\n                            \n                            retrieves aggregated information from transactionals over a specified date range.\n                           \n\n\n\n\n                           List Information\n                          \n\n                           Select whether to pull all lists or all subscribers not broken down by list.\n                          \n\n\n\n                           Date\n                          \n\n                           Select the date to pull data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042927174", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003718", "Archived Date": "", "Language": "English", "Primary Version": "Sailthru Advanced Connector", "Article Total View Count": "2,372", "": "", "Article Created Date": "10/24/2022, 9:14 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Sailthru Advanced Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}