{"file_path": "../../raw_kb_v2\\article\\4744010382871\\index.html", "content": {"title": "\n\n\n ServiceDesk Plus Domo Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nManageEngine ServiceDesk Plus is a comprehensive help desk and asset management software that provides help desk agents and IT managers an integrated console to monitor and maintain the assets and IT requests generated from their end users. ServiceDesk Plus connector in Domo lets you fetch request and change dataset from ServiceDesk Plus Cloud and project it to DOMO, where you can visualize datasets as per your requirements. Please note that this connector is supported only in the Enterprise edition of ServiceDesk Plus. In this guide, we will discuss the prerequisites for using the connector, best practice, and steps to connect to ServiceDesk Plus account.\n\n\n Prerequisites\n---------------\n\nYou will need the ServiceDesk Plus login username and password for authenticating via OAuth 2.0.\n\n\n Best Practices\n----------------\n\nSchedule reports at frequent intervals to maintain an accurate and latest data of request and change details.\n\n\n How to connect to ServiceDesk Plus\n------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the ServiceDesk Plus Connector page.\n\nThis c\n\n\n onnector uses OAuth to connect, so there is no need to enter credentials within Domo.\n\n\n* After logging into Domo, go to the\n **AppStore**\n in your Domo instance and search for\n **SDP Cloud Connector**\n .\n* Click on the\n **Service DeskPlus Connector**\n as it appears in the search result.\n* Click\n\n*Connect**\n\nto open the\n\n\n OAuth screen.\n\n\n The credentials pane opens up. Enter credentials for your SDP account.\n\n\n* Once your account is selected in the credentials pane, click\n **Next**\n .\n\n\n###\n Details Pane\n\nUnder the Details Pane, select Request or Change report.\n\n##\n Dataset Schedule\n\nSelect a schedule for the data fetch. You have two options: Basic and Advanced.\n\n Under Basic scheduling, you can set the\n **Update**\n interval to\n **Every Hour**\n ,\n **Every Day**\n ,\n **Every Weekday**\n ,\n **Every Week**\n ,\n **Every Month**\n , or\n **Manually**\n . You can also set a specific time for the schedule.\n* In the update method, you can choose either\n **Replace**\n or\n **Append**\n . The\n **Replace**\n option replaces all the data in the application with the new data that is being added. The\n **Append**\n option compares and adds only the differential data on top of the existing data.\n\n\n Under the\n **Advanced**\n option, you get to schedule the data update in the following ways:\n\n Once a day, More than once a day, Every day, Specific days of the week, Specific days of the month, Every Month, and Specific months. Select the schedule you require and set the time.\n\n###\n Error Handling\n\n\n* Select how the data update failure should be handled. You can choose between the options, \"Do not retry when update fails\" and \"Always retry when an update fails\".\n* Once you have configured the scheduling, click\n **Next**\n .\n\n\n###\n Name and Description for Dataset\n\n\n* Enter a Dataset Name and Description. The name you select here will be displayed for your dataset under\n **Data**\n in Domo.\n\n Click\n **Save and Run**\n . The dataset will be render.\n\n##\n Fetched Data Entities\n\n\n####\n Requests\n\nRequest ID, Subject, Description, Template, Status, Technician, Created Time, Mode, Site, Group, Level, Approval Status, and etc.\n\n###\n Changes\n\nChange Display ID, Title, Description, Template, Urgency, Status, Impact, Priority, Reason for Change, Stage, Created time, Item, and etc.\n\n\n Shown below is a sample request data set fetched in Domo.\n\n\n###\n Service Desk Support Contact Information\n\nEmail :\n\nservicedeskplus-cloud-support@manageengine.com\n\nFor more information visit -\n\nhttps://www.manageengine.com/products/service-desk/support.html?cloud\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4744010382871\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003815\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nServiceDesk Plus Domo Connector\n\n", "article_total_view_count": "\n\n\n 4,756\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "servicedesk_plus_domo_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "available_custom_connectors", "url": "/s/topic/0TO5w000000ZaoVGAS"}]}