{"file_path": "../../raw_kb_v2\\article\\360042923194\\index.html", "content": {"Title": "Should I Use a DataFusion or a DataFlow?", "Article Body": "Intro\n                       \n\n                        It’s important to know when using a DataFusion might be the best option and when using a DataFlow makes the most sense. Both tools have their advantages and disadvantages, but let’s start by summarizing the primary use cases for each tool:\n                       \n\n\n\n\n                           DataFusion:\n                          \n                          Use when you’re dealing with lots of data (>20 million rows and >25 columns) that needs to be combined (joined or union/append) with other data quickly (for example, daily sales numbers or other data that updates regularly throughout the day).\n                         \n\n\n\n\n                           DataFlow:\n                          \n                          Use when you need to perform a transformation that can’t be accomplished by just combining data and/or leveraging Beast Mode calculations to run the job.\n                         \n\n\n\n                        DataFusion: Advantages and Disadvantages\n                       \n\n\n\n                          Because a DataFusion is a just a view of the data, the output doesn’t have to be materialized and indexed into the Domo databases, which makes it so that data can be combined, visualized, and updated very quickly in Domo.\n                         \n\n\n\n                          It makes data transformations fast when you’re working with a lot of data; more specifically, any DataSets with more than 20 million rows and >25 columns of data should be combined using a DataFusion.\n                         \n\n\n\n                          You can leverage creative Beast Mode calculations within Analyzer to specify which data you want to display and how.\n                         \n\n\n\n                          You can control naming of columns during initial setup of the DataFusion.\n                         \n\n\n\n                          You can control which columns to include or exclude at any time.\n                         \n\n\n\n                          You can only do joins or appends using DataFusion.\n                         \n\n\n\n                          You cannot use DataFusions as inputs for DataFlows.\n                         \n\n\n\n                          You have less backend control over renaming or editing your column names after the initial creation of the DataFusion.\n                         \n\n\n\n                        DataFlow: Advantages and Disadvantages\n                       \n\n\n\n                          DataFlows offer much more up front flexibility. You can set up nearly any type of transformation you want, without limitations in terms of collapsing, combining, and naming columns, as well as controlling date and group by operations as well as a myriad of other affordances. And you do not have to use as many Beast Modes in Analyzer to visualize the data how you want it to appear.\n                         \n\n\n\n                          Big data can take a long time to run or update in Domo depending on the transformations that are occurring. If you are dealing with DataSets that hold mass amounts of columns and/or rows that are being combined into a DataFlow that aren’t going to be grouped down in some way, it can take significantly longer to update these DataSets in Domo. It can sometimes take hours for these assets to update.", "Preview Article": "Click here to preview", "URL Name": "360042923194", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004553", "Archived Date": "", "Language": "English", "Primary Version": "Should I Use a DataFusion or a DataFlow?", "Article Total View Count": "5,704", "": "", "Article Created Date": "10/24/2022, 10:14 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Should I Use a DataFusion or a DataFlow?\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               DataFlow Management\n              \n", "url": "/s/topic/0TO5w000000ZanUGAS"}]}