{"file_path": "../../raw_kb_v2\\article\\360043436633\\index.html", "content": {"title": "\n\n\n Google Sheets Connector\n\n\n", "article_body": "\n\nIntro\n--------\n\nGoogle Sheets is a spreadsheet program, part of a free, web-based software office suite\n\noffered\n\nby Google within its Google Drive service. The program allows users to create and edit spreadsheets online while collaborating with other users in real-time. To learn more about the Google API, visit their website (\n\nhttps://developers.google.com\n\n).\n\n\n The Google Sheets connector is a \"Cloud App\" connector, meaning it pulls data from a cloud-based application into Domo. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n\n\n**Cloud App**\n\n\n in the toolbar at the top of the window.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is appropriate for data sources in which multiple users are contributing to a single data source.\n  |\n|\n**Primary Metrics**\n |\n Users can create a wide variety of metrics using Google Sheet DataSets. Some frequently used metrics are...\n * Tracking a list of items\n* People\n* Help requests\n* Company assets\n* Employee compliance / trainings\n |\n|\n**Primary Company Roles**\n |\n Appropriate for all roles\n  |\n|\n**Average Implementation Time**\n |\n 10 minutes or less\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\n##\n\nOther panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Best practices\n-----------------\n\nGoogle Forms (surveys) don't currently have a connector; however, you can convert Google Forms into Google Sheets, which can then be pulled into Domo with the Google Sheets connector.\n\nPrerequisites\n----------------\n\nTo connect to your Google account and create a Google Sheets DataSet, you must have Google credentials.\n\nConnecting to Your Google account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Sheets Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials pane\n\nThe Domo Google Sheets connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google Sheets accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Sheets  DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n\nDetails Pane\n\nIn this pane, you specify the Google Drive file you want to import into Domo and set options for how you want to data to appear.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n File Selection\n  |\n Select whether you want to identify your desired Google Sheet by\n **Discovery**\n (which auto-populates a list of the files in your account),\n **Search**\n (which allows you to search for a specific filename), or\n **Spreadsheet ID**\n (which allows you to specify a file by its ID).\n  |\n|\n Search\n  |\n Enter the name of the file you want to search for.\n  |\n|\n Spreadsheet ID\n  |\n Enter the ID of the Google Sheet you want to pull into Domo.\n  |\n|\n Google Sheet\n  |\n Select the Google Sheet you want to pull into Domo.\n  |\n|\n Worksheet Name\n  |\n Select the specific worksheet you want to pull into Domo.\n  |\n|\n Spreadsheet Layout\n  |\n Select whether your Google Sheet has column headers or row headers.\n  |\n|\n Manually Enter Cell Ranges\n  |\n Check this box if you want to specify a that certain range of data from the spreadsheet be pulled into Domo.\n  |\n|\n Column Header Cell Range\n  |\n Enter the range for the column headers you want to be imported into Domo.\n  |\n|\n Column Data Cell Range\n  |\n Enter the range for the data you want to be imported into Domo.\n  |\n\n\n###\n\nOther Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n-------\n\n\n**How do I know my Google credentials are secure?**\n\n\n The login process uses the OAuth process, so your Google credentials are never seen or stored by Domo. You can revoke Domo's access to your account at any time.\n\n\n**How often can the data be updated?**\n\n\n As often as needed.\n\n\n**Are there any API limits I should be aware of?**\n\n\n Google enforces total and concurrent call rate limits. To prevent rate limiting, reduce the number of DataSets scheduled to run at the same time.\n\n\n**Why does the connector seem to be pulling in unwanted data?**\n\n\n Confirm that you have selected the correct Google Sheet worksheet. If you are using advanced options, make sure you have selected the correct range of data.\n\n\n Troubleshooting\n------------------\n\n\n* If the connection fails, confirm the Google account username and password are still accurate.\n* If the connector seems to pull back the wrong data, confirm you selected the correct Google Sheet worksheet or, if using advanced options, confirm you have the correct range of data selected.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436633\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003933\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Sheets Connector\n\n", "article_total_view_count": "\n\n\n 5,434\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_sheets_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}