{"file_path": "../../raw_kb_v2\\article\\360043437753\\index.html", "content": {"title": "\n\n\n Data Assembler Usage Guidelines\n\n\n", "article_body": "\n\nIntro\n-------\n\nThere are six key criteria for any Data Assembler job. If the job does not meet these criteria, the stability of the job and the validity of the data may be compromised.\n\n\n Usage Guidelines\n------------------\n\n\n####\n Average Partition Size\n\n\n* Calculate this by dividing the total row count by the number of partitions.\n* Choose a partition key that makes the average partition size as large as possible.\n* An ideal average partition size is over 100k rows, but we recommend a minimum of 50k rows per partition.\n\n\n####\n Input Ratio\n\n\n* This is the ratio of the input DataSets to the output DataSets. It represents the amount of data that is updated during execution and should be as small as possible.\n* We recommend targeting 1% or less, but this percentage should not be greater than 10%.\n* When using the Upsert option, limit yourself to one input.\n\n\n####\n Update Frequency\n\n\n* The Data Assembler is intended to be used to update data once a day.\n* We strongly recommend that you do not exceed four executions a day.\n* You should not use the Data Assembler to update data more frequently than once an hour.\n\n\n####\n Number of Partitions Updating on Each Execution\n\n\n* You should not use the Data Assembler if you need to update a large number of partitions on each execution.\n* Jobs that execute daily should not exceed 100 partitions.\n* Jobs that execute more frequently than daily should not exceed 10 partitions.\n\n\n####\n Schema Changes\n\n\n* The schemas of the input and output DataSets should not change. The Data Assembler can handle certain schema changes, but we do not recommend using the tool to make these changes because the data may become corrupted.\n\n\n####\n Overall Data Size\n\n\n* For data sizes less than 10 million rows, we generally recommend using the standard DataFlow options due to the additional flexibility provided by these Domo features.\n\n\n####\n Other Tips\n\n\n* When you create a new job, start with a manual schedule. When the job is confirmed as ready for production, change the schedule as needed.\n* Do not use triggers unless necessary. We recommend that you use the scheduling options first.\n* Review jobs periodically. Deactivate or delete jobs that are no longer needed.\n* When processing large historical fill jobs (over 100 million rows), consider breaking the history into smaller DataSets. If an error occurs, you can restart the job on the portion of the data that failed.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043437753\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003157\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nData Assembler Usage Guidelines\n\n", "article_total_view_count": "\n\n\n 4,853\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:10 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "data_assembler_usage_guidelines", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "other_connection_methods", "url": "/s/topic/0TO5w000000ZanzGAC"}]}