{"file_path": "../../raw_kb_v2\\article\\4418190973335\\index.html", "content": {"title": "\n\n\n SiteLink Reporting Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nSiteLink Reporting's self-storage software helps small and large operators manage their self-storage tenants and grow profits while reducing costs. It manages your units, tenants, invoices, etc. quickly and cost-effectively.\n\n\n Domo connects directly to SiteLink and delivers the information you need in real-time visualizations that make analysis easier. Use this information to ensure you have all the customer data you need to drive your strategic growth plans. By combining your data with Domo, you empower the data-driven decisions at every level of your organization in an efficient and streamlined manner. Enhance your performance with the powerful insights about the finance, inquiry, discounts, rent, management, and much more. To learn more about the SiteLink Reporting API, visit their page (\n\nhttps://www.sitelink.com/solutions/integrations-partners\n\n).\n\n\n The SiteLink Reporting Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your SiteLink account in the Data Center. This topic discusses the fields and menus that are specific to the SiteLink Reporting Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your SiteLink Reporting account and create a DataSet, the username, password, and corp code associated with your SiteLink account.\n\n\n Connecting to Your SiteLink Account\n-------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the SiteLink Reporting Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your SiteLink account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Username\n  |\n Enter your username associated with the SiteLink account.\n  |\n|\n Password\n  |\n Enter your password associated with the SiteLink account.\n  |\n|\n Corp Code\n  |\n Enter the corporate code associated with your SiteLink account.\n  |\n\nOnce you have entered valid SiteLink credentials, you can use the same account any time you go to create a new SiteLink Reporting DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the SiteLink Reporting report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Consolidated Management Summary\n  |\n Returns consolidated management summary.\n  |\n|\n Custom Reports By Report ID\n  |\n Returns custom report's data for the provided report ID.\n  |\n|\n Discounts\n  |\n Returns details about discounts.\n  |\n|\n Financial Summary\n  |\n Returns financial summary data.\n  |\n|\n Inquiry Tracking\n  |\n Returns inquiry tracking data.\n  |\n|\n Insurance Roll\n  |\n Returns insurance roll data.\n  |\n|\n Management Summary\n  |\n Returns management summary data.\n  |\n|\n Move Ins and Move Outs\n  |\n Returns details about move ins and move outs.\n  |\n|\n Occupancy Statistics\n  |\n Returns occupancy statistics.\n  |\n|\n Past Due Balances\n  |\n Returns details about past due balances.\n  |\n|\n Rent Roll\n  |\n Returns details about rent rolls.\n  |\n\n|\n|\n Site/Location Option\n  |\n Specify whether you want to select all sites or from the available sites.\n  |\n|\n Location Code\n  |\n Select the l\n\nocation code.\n  |\n|\n Custom Report ID\n  |\n Select the custom report ID.\n  |\n|\n Start Date\n  |\n Select report start date using relative or specific dates. Relative meaning number of days from today or a specific date using the date selector\n  |\n|\n Select Specific Start Date\n\n|\n Select the report date using the date selector.\n  |\n|\n Days back to start from\n\n|\n The number of days back that you would like to get data from (start day). Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n End Date\n  |\n Select report end date using relative or specific dates. Relative meaning number of days from today or a specific date using the date selector\n  |\n|\n Select Specific End Date\n\n|\n Select the report date using the date selector.\n  |\n|\n Days back to end at\n\n|\n The number of days back that you would like to get data to (end day). Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What endpoint is the base URL for this Connector use?\n\nThis base URL for the SiteLink Reporting Connector is\n\n\n https://api.smdservers.net/CCWs\\_3.5/ReportingWs.asmx\n\n.\n\n\n####\n\nWhat kind of credentials do I need to power up this Connector?\n\nYou need the username, password, and corp code associated with your Sitelink account.\n\n###\n Can I use the same account multiple times to create datasets?\n\nYes\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4418190973335\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003195\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSiteLink Reporting Connector\n\n", "article_total_view_count": "\n\n\n 4,634\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "sitelink_reporting_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}