{"file_path": "../../raw_kb_v2\\article\\360043439753\\index.html", "content": {"Title": "Adding Other Dashboards to Business-in-a-Box", "Article Body": "In addition to allowing you to power up pre-installed best practice dashboards as described in\n                        \n                         Powering Up Business-in-a-Box Dashboards\n                        \n                        , Business-in-a-Box also lets you do the following:\n                       \n\n\n\n                          Link card pages from your Domo instance to a given department tab.\n                         \n\n\n\n                          Add apps from the Appstore.\n                         \n\n\n\n                        When you add card pages or Appstore dashboards to a department tab, they appear in the list of dashboards for that tab, providing quick and easy navigation for users with a given role. For example, Domo user Judy is over YouTube marketing campaigns for her company. In addition to the pre-installed Business-in-a-Box dashboards available in the Business-in-a-Box \"Marketing\" tab, she also regularly refers to another card page in Domo called \"YouTube Marketing.\" Instead of having to constantly switch between Business-in-a-Box and the \"YouTube Marketing\" page, Judy can simplify her navigation by linking \"YouTube Marketing\" to the \"Marketing\" tab in Business in a Box. She can then access all her marketing dashboards from one place.\n                       \n\n                        You can\n                        \n                         only\n                        \n                        add card pages or Appstore dashboards to Business-in-a-Box if you have an \"Admin\" security role or a custom role with \"Manage All Cards and Pages\" enabled.\n                       \n\n\n                         To link to one or more card pages from Business-in-a-Box,\n                        \n\n\n\n\n                          Select\n                          \n                           Dashboards\n                          \n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Select\n                          \n                           Business-in-a-Box\n                          \n                          in your left-hand navigation pane.\n                          \n\n\n\n\n\n\n                          Select the tab for the department in which you want to add a link to a card page.\n                         \n\n\n\n                          Scroll to the bottom of the department tab to find the\n                          \n                           Add Dashboard\n                          \n                          option.\n                          \n                          This option only appears if you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled.\n                         \n\n\n\n                          Click\n                          \n                           Add Dashboard\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Reference Existing\n                          \n                          .\n                         \n\n\n\n                          Check the boxes for all card pages you want to add to Business-in-a-Box.\n                         \n\n\n\n                          Click\n                          \n                           Add Dashboard\n                          \n                          .\n                         \n\n\n\n                        All of the pages you selected are added to the department tab.\n                       \n\n\n                         To add Appstore dashboards to Business-in-a-Box,\n                        \n\n\n\n\n                          Select\n                          \n                           Dashboards\n                          \n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Select\n                          \n                           Business-in-a-Box\n                          \n                          in your left-hand navigation pane.\n                          \n\n\n\n\n\n\n\n                          Select the tab for the department in which you want to add an Appstore dashboard.\n                         \n\n\n\n                          Scroll to the bottom of the department tab to find the\n                          \n                           Add Dashboard\n                          \n                          option.\n                          \n                          This option only appears if you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled.\n                         \n\n\n\n                          Click\n                          \n                           Add Dashboard\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Appstore\n                          \n                          .\n                          \n                          The Appstore opens, with the department tab name entered into the \"Filter\" field by default.\n                         \n\n\n\n                          Locate and click the dashboard you want to add.\n                         \n\n\n\n                          Click\n                          \n                           Add to Business-in-a-Box\n                          \n                          .\n                         \n\n\n\n                          In the dropdown menu, select the department tab where you want to install the dashboard.\n                         \n\n\n\n                          Click\n                          \n                           Confirm\n                          \n                          .\n                          \n                          You are automatically taken back to the department tab, where a link to the dashboard has been added.\n                         \n\n\n\n                          Connect the dashboard to live data as explained in\n                          \n                           Powering Up Business-in-a-Box Dashboards\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360043439753", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004309", "Archived Date": "", "Language": "English", "Primary Version": "Adding Other Dashboards to Business-in-a-Box", "Article Total View Count": "4,790", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Adding Other Dashboards to Business-in-a-Box\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Business In A Box\n              \n", "url": "/s/topic/0TO5w000000ZanBGAS"}]}