{"file_path": "../../raw_kb_v2\\article\\9485049422103\\index.html", "content": {"Title": "Understanding Form Response Data", "Article Body": "Intro\n                       \n\n                        When a form is used in\n                        \n                         Form Viewer,\n                        \n                        a DataSet is created with the responses. The owner of that DataSet is the user who first created that instance of the Form Builder or Form Viewer app. This is because in the AppDB system, where collections are stored, the collection owner and the DataSet owner must match for successful exporting.\n                       \n\n                        The data is exported every 15 minutes based on AppDB's default.\n                       \n\n                        The table below provides a reference for the response data.\n                       \n\n                        Response Data Reference\n                       \n\n\n\n\n\n\n\n\n\n                            Column\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n                           Form-level Attributes\n                          \n\n                           Form ID\n                          \n\n                           Unique identifier (GUID) of the form\n                          \n\n\n\n                           Form Name\n                          \n\n\n                            Form name as defined in the form editor\n                           \n\n\n\n\n                           Description\n                          \n\n                           Form description as defined in the form editor\n                          \n\n\n\n                           Tags\n                          \n\n\n                            Tags as defined in the form editor\n                           \n\n\n\n\n                           Response Type\n                          \n\n                           Response type mode (Ex: Single response, Multiple response)\n                          \n\n\n\n                           User Attributes\n                          \n\n\n                            User ID\n                           \n\n\n\n                            Domo user ID of the user who entered form responses\n                           \n\n\n\n\n\n                            User Name\n                           \n\n\n\n                            User name of the user who entered form responses\n                           \n\n\n\n\n                           Section-level Attributes\n                          \n\n\n                            Section ID\n                           \n\n\n\n                            Unique identifier (GUID) of the section. A form can contain one or more sections.\n                           \n\n\n\n\n\n                            Section Name\n                           \n\n\n\n                            Section name as defined in the form editor\n                           \n\n\n\n\n                           Item-level Attributes\n                          \n\n\n                            Item ID\n                           \n\n\n\n                            Unique identifier (GUID) of the item, or the form entry field.\n                            \n                            A form section can contain one or more items.\n                           \n\n\n\n\n\n                            Type\n                           \n\n\n\n                            The item type (Ex: text, dropdown)\n                           \n\n\n\n\n\n                            Label\n                           \n\n\n\n                            Item label (question text) as defined in the form editor\n                           \n\n\n\n\n\n                            Response Options\n                           \n\n\n\n                            For dropdown questions, this field contains the various options presented to the user\n                           \n\n\n\n\n\n                            Required\n                           \n\n\n\n                            Indicates whether a response is required for a particular item (TRUE or FALSE)\n                           \n\n\n\n\n\n                            Input Column\n                           \n\n\n\n                            Only applicable to table sections.\n                           \n\n                            The name of the column as presented in the form data entry grid.\n                           \n\n\n\n\n                           Submission Attributes\n                          \n\n\n                            Session ID\n                           \n\n\n\n                            Unique identifier (GUID) of a user session. This is per user and per device.\n                           \n\n\n\n\n\n                            Submission ID\n                           \n\n\n\n                            Unique identifier (GUID) of the submission\n                           \n\n\n\n\n\n                            Submitted\n                           \n\n\n\n                            A flag that indicates whether or not all the required fields in teh form were completed. (TRUE or FALSE)\n                           \n\n\n\n\n\n                            Submission Time\n                           \n\n\n\n                            Timestamp of the submission (NULL if not submitted)\n                           \n\n\n\n\n\n                            Last Modified\n                           \n\n\n\n                            Timestamp of the last time the item was modified\n                           \n\n\n\n\n\n                            Created\n                           \n\n\n\n                            Timestamp of when the item response was first created\n                           \n\n\n\n\n                           Responses\n                          \n\n\n                            Value\n                           \n\n\n\n                            The actual user response to the form question\n                           \n\n\n\n\n\n                            Response Number\n                           \n\n\n\n                            The number of the response to a particular question.\n                           \n\n                            This is populated for all question types but only meaningful for multi-select questions, for which each response has its own response number.\n                           \n\n\n\n\n\n                            Active Page Filters\n                           \n\n\n\n                            Page filters that were in place when the form was completed\n                           \n\n\n\n\n\n                            Response Archived\n                           \n\n\n\n                            Whether or not the specific response record is archived (TRUE or FALSE).\n                           \n\n                            You can consider archived responses deprecated and ignore them.\n                           \n\n\n\n\n\n                            UserComment\n                           \n\n\n\n                            For dropdown questions, the user entry in “Explain your response”.\n                           \n\n\n\n\n\n                            Pseudo Identifier\n                           \n\n\n\n                            Applicable only in table sections.\n                           \n\n                            This field contains a JSON string of\n                            \n                             key:value\n                            \n                            pairs representing the unique identifier columns and their values. These unique identifiers are defined when the table section is configured. The data in this field are used to map a specific response to a single record in the form data entry grid\n                           \n\n\n\n\n                           App Database Metadata\n                          \n\n\n                            __documentId__\n                           \n\n\n\n                            Unique identifier (GUID) of a single record in the response dataset.\n                           \n\n                            Created when the response data is written to the application database.\n                           \n\n\n\n\n\n                            __createdBy__\n                           \n\n\n\n                            Domo user ID of the user who created the form response\n                           \n\n\n\n\n\n                            __created__\n                           \n\n\n\n                            Timestamp for when the response record was written to the application database\n                           \n\n\n\n\n\n                            __modifiedBy__\n                           \n\n\n\n                            Domo user ID of the user who last modified the form response\n                           \n\n\n\n\n\n                            __modified__\n                           \n\n\n\n                            Timestamp of the most recent modification to the response record in the application database", "Preview Article": "Click here to preview", "URL Name": "9485049422103", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004122", "Archived Date": "", "Language": "English", "Primary Version": "Understanding Form Response Data", "Article Total View Count": "2,586", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Understanding Form Response Data\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}