{"file_path": "../../raw_kb_v2\\article\\360043433853\\index.html", "content": {"title": "\n\n\n Google Analytics MCF Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGoogle Analytics MCF (Multi-Channel Funnels) is derived from conversion path data, which shows user interactions with various traffic sources over multiple sessions prior to converting. To learn more about the Google Analytics MCF API, visit their page (\n\nhttps://developers.google.com/analyt...orting/mcf/v3/\n\n).\n\n\n You connect to your Google account in the Data Center. This topic discusses the fields and menus that are specific to the Google Analytics connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n\n Prerequisites\n---------------\n\nTo connect to your Google account and create a Google Analytics MCF DataSet, you must have a Google username and password.\n\n\n Connecting to Google Analytics MCF\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Analytics MCF Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n##\n Credentials Pane\n\nThe Domo Google Analytics MCF connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google Analytics MCF accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to create a new Google Analytics MCF DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Google.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus for configuring your report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Google Analytics report you want to run. Currently only a single report is available.\n\n\n|  |  |\n| --- | --- |\n|\n Custom MCF (Multi-Channel Funnels)\n  |\n Lets you build a custom Multi-Channel Funnel report in which you select the dimensions and metrics you want to appear.\n  |\n\n|\n|\n Dimensions\n  |\n Select up to 7 dimensions for your report.\n  |\n|\n Metrics\n  |\n Select at least one metric for your report. You can select up to 10.\n  |\n|\n View (Profile)\n  |\n Select all profiles you want to retrieve data for. Usually each website you maintain has one or more associated profiles.\n  |\n|\n Sampling Level\n  |\n Select the sampling level for the report. (This only applies if the report is forced to use sampled data.)\n\n\n For more information about sampling in Google Analytics, see\n\nhttps://developers.google.com/analyt...nceptsSampling\n\n.\n  |\n|\n Filters\n  |\n Enter any dimension and metric filters you want to apply to your report. Use commas (,) for OR cases and semicolons (;) for AND cases.\n\n\n For more information about utilizing Google Analytics filters, see\n\nhttps://developers.google.com/analyt...erence#filters\n\n.\n  |\n|\n Start Date\n  |\n Enter the start date for your report using the date format\n\nyyyy-MM-dd\n\n. You can also use the relative keywords\n\ntoday\n\nor\n\nyesterday\n\nor specify offsets such as\n\nyesterday-3\n\n. This would set the start date to three days in the past, starting from yesterday's date.\n\n\n If you do not specify a start date, your report uses a default start date of 30 days.\n  |\n|\n End Date\n  |\n Enter the end date for your report using the date format\n\nyyyy-MM-dd\n\n. You can also use the relative keywords\n\ntoday\n\nor\n\nyesterday\n\nor specify offsets such as\n\nyesterday-3\n\n. This would set the end date to three days in the past, starting from yesterday's date.\n\n\n If you do not specify an end date, your report uses a default start date of 30 days.\n  |\n|\n Backfill\n  |\n Enter the number of past days you want to retrieve data for on the first run (based on the\n **End Date**\n value). Subsequent runs do not backfill data.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\n\n Adding a DataSet Using a Data Connector\n\n\n .\n\n\n FAQs\n------\n\n\n#####\n Why do I keep getting the error \"Selected dimensions and metrics cannot be queried together\"?\n\nRefer to the\n\nDimensions and Metrics Explorer\n\nto understand what dimensions/metrics can actually be queried together because not all combinations are valid.\n\n####\n Why am I limited to 10 metrics and 7 dimensions?\n\nThis is a limitation given by the Google Analytics API. There is no way to add more than 10 metrics and 7 dimensions to a report.\n\n####\n Does the connector support backfilling?\n\nBackfilling is supported in the Google Analytics MCF connector for the first attempt only. When you set the backfill value, the Google Analytics MCF connector pulls the data for the mentioned number of days before the start date, along with the data between the specified start and end dates. Backfill is set to 30 days by default.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433853\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003533\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Analytics MCF Connector\n\n", "article_total_view_count": "\n\n\n 4,653\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_analytics_mcf_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}