{"file_path": "../../raw_kb_v2\\article\\4482007928983\\index.html", "content": {"title": "\n\n\n Talkdesk Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nTalkdesk is a cloud-based contact center and artificial intelligence software provider. With its AI-driven platform, it is a dedicated call center solution. It provides all the tools to manage call center agents either virtually or onsite. Talkdesk is a global customer experience leader for customer-obsessed companies.\n\n\n By combining your global customer experience metrics with Domo, you can create powerful visualizations and reports to analyze the call details. Combine your Talkdesk data with all your information on Domo and plan for future business demands. Upgrade your global customer experience by monitoring and analyzing the call details, survey logs, evaluation analysis, ring attempts and much more. To learn more about the Talkdesk API, visit their page (\n\nhttps://support.talkdesk.com/hc/en-us/articles/115001284103-Talkdesk-APIs\n\n).\n\n\n The Talkdesk Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Talkdesk account in the Data Center. This topic discusses the fields and menus that are specific to the Talkdesk Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Talkdesk account and create a DataSet, you must have the following:\n\n Your Talkdesk account name\n* The client ID and client secret provided by Talkdesk\n\nConnecting to Your Talkdesk Account\n-------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the Talkdesk Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your Talkdesk account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Talkdesk Account Name\n  |\n Enter your Talkdesk account name.\n  |\n|\n Client ID\n  |\n Enter the client ID provided by Talkdesk.\n  |\n|\n Client Secret\n  |\n Enter the client secret provided by Talkdesk.\n  |\n|\n Region\n  |\n Select the region for your Talkdesk account.\n  |\n\nOnce you have entered valid Talkdesk credentials, you can use the same account any time you go to create a new Talkdesk DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n\n\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Calls\n  |\n Provides a raw log of calls, call metadata, and call recordings for voice interactions.\n  |\n|\n Contacts\n  |\n Provides details on each contact within an interaction.\n  |\n|\n Feedback\n  |\n Provides a raw log of survey responses, channels and interactions associated with the responses and other response metadata.\n  |\n|\n Outbound Dialer Calls\n  |\n Provides metrics related to the calls dialed via a campaign of the Outbound Dialer Calls.\n  |\n|\n QM Evaluation Analysis\n  |\n Provides all the information collected during an interaction evaluation.\n  |\n|\n Ring Attempts\n  |\n Provides detailed information regarding ring attempts.\n  |\n|\n Studio Flow Execution\n  |\n Contains, at the step level, all the information related to the interaction.\n  |\n|\n User Status\n  |\n Provides a raw log of agent status changes occurring in Talkdesk.\n  |\n\n|\n|\n Date Selection\n  |\n Select the date format for your data.\n  |\n|\n Single Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Specific Date\n  |\n Select the specific date using the date selector.\n  |\n|\n Relative Date\n  |\n Enter the number of days back that you would like to get data for in the\n\n\n**Days Back**\n\n\n field. Specify either today or 0, yesterday or 1, or today-7 or 7 to get data for 7 days into the past.\n  |\n|\n Date Range\n  |\n Select the specific or relative date range.\n  |\n|\n Start Date - Specific\n  |\n Select the first date in your date range using the date selector.\n  |\n|\n End Date - Specific\n  |\n Select the last date in your date range using the date selector.\n  |\n|\n Start Date - Relative\n  |\n Enter the number of days back that you would like to get data from (start day). Combine with\n ********End Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n End Date - Relative\n  |\n Enter the number of days back that you would like to get data to (end day). Combine with\n ********Start Date********\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ********Start Date********\n and 5 for\n ********End Date********\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What kind of credentials do I need to power up this Connector?\n\nYou need your Talkdesk account name, and the client ID and client secret provided by Talkdesk.\n\n###\n Are there any API limits I should be aware of?\n\nNo\n\n###\n Can I use the same account to create multiple datasets?\n\nYes\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4482007928983\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003198\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nTalkdesk Connector\n\n", "article_total_view_count": "\n\n\n 4,677\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "talkdesk_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}