{"file_path": "../../raw_kb_v2\\article\\4402801176471\\index.html", "content": {"title": "\n\n\n Hubspot Engagement Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nHubSpot develops software for social media and email marketing, content management, web analytics, and search engine optimization. Use Domo's HubSpot Engagement connector to compile reports about your call engagements and dispositions. To learn about the HubSpot API, visit their website (\n\nhttp://developers.hubspot.com/docs/overview\n\n).\n\n\n The HubSpot Engagement connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your HubSpot account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the HubSpot Engagement connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Compiling reports about aspects of social media and email marketing, such as call engagements and call dispositions.\n  |\n|\n**Primary Metrics**\n | * Call engagement dispositions\n* Call engagements\n |\n|\n**Primary Company Roles**\n |\n Marketing/sales roles\n  |\n|\n**Average Implementation Time**\n |\n Less than 1 hour\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\nPrerequisites\n---------------\n\nTo connect to your HubSpot account and create a DataSet, you must have the following:\n\n Your Hubspot email address and password. Alternatively, you can login using your Google or SSO (Single Sign On) credentials.\n\nConnecting to Your HubSpot account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the HubSpot Engagement Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials pane\n\nThe Domo HubSpot Engagement Connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing HubSpot\n\n\n accounts in Domo) to open the HubSpot OAuth screen where you can enter your HubSpot email address and password. Once you have entered valid Hubspot credentials, you can use the same account any time you go to create a new HubSpot Engagement DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\n\n If you are already logged into\n\nHubSpot\n\nwhen you connect in Domo, you are authenticated automatically when you click\n\n\n**Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of\n\nHubSpot\n\n.\n\n\n###\n Details pane\n\nThis pane contains a primary menu in which you select your HubSpot Engagement report.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select a HubSpot report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Call Engagement Dispositions\n  |\n Get the possible dispositions for sales calls (stored as engagements), listed as the outcome when viewing the call's outcome when viewing the call in the timeline in HubSpot.\n  |\n|\n Engagement\n  |\n This endpoint is used to get all engagements in an account.\n  |\n\n\n |\n\n\n###\n Other panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQ\n-----\n\n\n####\n What endpoint is the base URL for this connector?\n\nThe base URL for the HubSpot Engagement connector is\n\nhttps://api.hubapi.com/\n\n.\n\n###\n Which endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Call Engagement Dispositions\n  |\n /calling/v1/disposition\n  |\n|\n Engagement\n  |\n /engagements/v1/engagements/page\n  |\n\n\n####\n What kind of credentials do I need to power up the HubSpot Engagement connector?\n\nYou need your Hubspot email address and password. Alternatively, you can login using your Google or SSO (Single Sign On) credentials.\n\n###\n How do I know my Hubspot credentials are secure?\n\nThe login process uses the OAuth process, so your Hubspot credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n What kind of HubSpot account do I need to access the API?\n\nYou need a Marketing Professional or Enterprise HubSpot account to access the API.\n\n###\n How frequently will my data update?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n###\n Can I use the same account to create multiple datasets?\n\nYes\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4402801176471\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003221\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nHubspot Engagement Connector\n\n", "article_total_view_count": "\n\n\n 2,356\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "hubspot_engagement_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}