{"file_path": "../../raw_kb_v2\\article\\360042935014\\index.html", "content": {"Title": "June 2018 Release Notes", "Article Body": "New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        Custom Map Regions\n                       \n\n                        People often want to represent unique regional areas in their maps. Many businesses divide data in heavily populated states like California or New York into multiple regions.\n                       \n\n                        With custom map regions, you can easily set up regional groupings in both built-in and custom maps. This provides the option to group zip codes, counties, or states into regions that match your specific regional needs.\n                       \n\n\n\n                        For more information, see\n                        \n                         Creating a Map with Regions\n                        \n                        .\n                       \n\n                        Improved Mobile Home Experience\n                       \n\n                        The mobile app home experience empowers you to personalize Domo with shortcuts to the content most important to you. Add trends, Dashboards, Cards, Buzz, or Projects to your custom home screen.\n                       \n\n                        The addition of Global Search to home lets you search mobile by pulling down from the top of your screen. The look of the home screen has also been refreshed with updated tile illustrations and a scrolling flow.\n                       \n\n\n\n                        NLQ Bots and Public DataSets in Appstore\n                       \n\n                        The Appstore now provides access to all of the NLQ Bots and public DataSets available in Domo. You can deploy any Bot or public DataSet to your own Domo instance with just a few simple clicks.\n                       \n\n\n\n\n\n                            NLQ Bots\n                           \n\n\n\n                        . Domo is excited to announce that NLQ (Natural Language Query) Bots are available in the Appstore. You can easily and effortlessly add NLQ Bots to any Buzz channel just as you can from Buzz. Once you have added an NLQ Bot, you can begin querying the connector in Buzz for key metrics using natural language. For example, you could find out how many Shopify refunds have been issued by asking a Bot in natural language. Access NLQ Bots in the Appstore by clicking the\n                        \n\n\n\n                            Bots\n                           \n\n\n\n                        tab.\n                        \n\n\n                        For more information about Bots, see\n                        \n                         Adding a Bot to Buzz\n                        \n                        .\n                       \n\n\n\n\n\n                            Public DataSets\n                           \n\n\n\n                        . Sometimes your data tells a more complete story when you can blend it with public data. Now, with Domo's new public DataSets, you can explore free public data and connect it directly to your Domo. Once you've selected a public DataSet, you can use it like any other DataSet. Access Public DataSets in the Appstore by clicking the\n                        \n\n\n\n                            Data\n                           \n\n\n\n                        tab.\n                        \n\n\n\n                        Domo ODBC Data Driver\n                       \n\n                        Interested in collaborating with other platforms? The Domo Open Database Connectivity (\"ODBC\") Data Driver extends the Domo platform, giving you a powerful new way to query your Domo DataSets using on-premise or third party tools.\n                       \n\n                        With the Domo ODBC Data Driver, you can now take advantage of Domo's 500+ Connectors and powerful data pipeline, querying the results using your existing database query tools. To access the Domo ODBC Data Driver, contact your sales representative.\n                       \n\n\n\n                        For step-by-step instructions about configuring the Domo ODBC Data Driver, see\n                        \n                         Domo ODBC Data Driver\n                        \n                        .\n                       \n\n                        Salesforce Advanced\n                       \n\n                        Salesforce is one of Domo's premier connectors and we are constantly looking for ways to improve its power and utility while simultaneously reducing technical complexity. The new advanced version is a tremendous step forward for both goals.\n                       \n\n                        Want to preview your query before execution and support multiple Salesforce currencies? The new Salesforce Advanced Connector makes these wishes possible and introduces a more intuitive user interface.\n                       \n\n                        You can find the Salesforce Advanced Connector in the Appstore today.\n                       \n\n                        For more information, see\n                        \n                         Salesforce Advanced Connector\n                        \n                        .\n                       \n\n                        Google Sheets Add-On\n                       \n\n                        You can now pull Domo DataSet data into Google Sheets using our Domo Google Sheets Add-on, similar to what you can already do with our\n                        \n                         Excel plugin\n                        \n                        . The add-on allows you to log into a Domo instance, choose a DataSet from that instance, preview it if you like, then import it into your sheet. The Domo Google Sheets Add-on is available from the Google Store. Simply open a new Google Sheet, select\n                        \n\n\n\n                            Add-ons > Get add-ons\n                           \n\n\n\n                        , search for Domo, then click on the Domo tile to download the add-on right into your Google.\n                       \n\n                        For more information, see\n                        \n                         Google Sheets Add-On\n                        \n                        .\n                       \n\n                        Short Codes for SMS Notifications\n                       \n\n                        With the new Twilio Copilot backend functionality, Domo has enabled shortcode for messaging, increasing international deliverability and meeting carrier requirements to ultimately increase dependability and readability of relevant messages received via SMS. Domo users throughout the entire world can now receive dependable messages in short code via a geographically relevant sender (e.g. from a Japan number if in Japan).\n                        \n\n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n\n\n\n\n\n\n\n                                > Help Center\n                               \n\n\n\n\n\n\n\n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://university.domo.com\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to /support.\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n\n\n\n\n\n\n\n                                > Feedback\n                               \n\n\n\n\n\n\n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042935014", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004432", "Archived Date": "", "Language": "English", "Primary Version": "June 2018 Release Notes", "Article Total View Count": "4,671", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              June 2018 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}