{"file_path": "../../raw_kb_v2\\article\\360042926914\\index.html", "content": {"Title": "Klaviyo Connector", "Article Body": "Intro\n                       \n\n                        Klaviyo allows ecommerce marketers to target, personalize, measure and optimize email and Facebook campaigns. To learn more about the Klaviyo API, visit their page (\n                        \n                         https://www.klaviyo.com/docs\n                        \n                        ).\n                        \n\n\n\n                        You connect to your Klaviyo account in the Data Center. This topic discusses the fields and menus that are specific to the Klaviyo connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Klaviyo account and create a DataSet, you must have a Klaviyo API key. For information about obtaining an API key, visit\n                        \n                         https://help.klaviyo.com/hc/en-us/ar...unt-s-API-Keys\n                        \n                        .\n                       \n\n                        Connecting to Your Klaviyo Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Klaviyo Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Klaviyo account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your Klaviyo API key. For information about obtaining an API key, visit\n                           \n                            https://help.klaviyo.com/hc/en-us/ar...unt-s-API-Keys\n                           \n                           .\n                          \n\n\n\n\n\n                         Once you have entered valid Klaviyo credentials, you can use the same account any time you go to create a new Klaviyo DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Klaviyo report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Campaign Information\n                               \n\n\n\n                                Returns summary information for the selected campaign.\n                               \n\n\n\n\n\n                                Campaigns in Account\n                               \n\n\n\n                                Returns a list of all the campaigns you've created.\n                               \n\n\n\n\n\n                                List All Templates\n                               \n\n\n\n                                Returns a list of all email templates you've created.\n                               \n\n\n\n\n\n                                List Exclusions or Unsubscribes\n                               \n\n\n\n                                Returns a list of global exclusions or unsubscribes.\n                               \n\n\n\n\n\n                                List Exclusions or Unsubscribes for a List\n                               \n\n\n\n                                Returns exclusions or unsubscribes for a selected list. Includes the person's email address and the reason for/time of the exclusion.\n                               \n\n\n\n\n\n                                List of Metrics\n                               \n\n\n\n                                Returns a list of metrics in Klaviyo.\n                               \n\n\n\n\n\n                                List of Timeline of All Events\n                               \n\n\n\n                                Returns a batched timeline of all events in your Klaviyo account.\n                               \n\n\n\n\n\n                                Listing a Person's Complete Event Timeline\n                               \n\n\n\n                                Returns a batched timeline of all events for a specified person.\n                               \n\n\n\n\n\n                                Listing a Person's Complete Event Timeline (with Extra Properties)\n                               \n\n\n\n                                Returns a batched timeline of all events for a specified person with extra properties.\n                               \n\n\n\n\n\n                                Listing a Person's Complete Event Timeline (with Person's Data)\n                               \n\n\n\n                                Returns a batched timeline of all events for a specified person, with that person's data.\n                               \n\n\n\n\n\n                                Listing The Event Timeline For A Particular Metric (With Extra Properties)\n                               \n\n\n\n                                Returns a batched timeline for one specific type of metric, with extra properties.\n                               \n\n\n\n\n\n                                Listing The Event Timeline For A Particular Metric (With Person's Data)\n                               \n\n\n\n                                Returns a batched timeline for one specific type of metric with a person's data.\n                               \n\n\n\n\n\n                                List of Accounts\n                               \n\n\n\n                                Returns a list of accounts.\n                               \n\n\n\n\n\n\n\n\n\n                            Campaign\n                           \n\n\n\n                            Select the campaign you want to retrieve information for.\n                           \n\n\n\n\n\n                            List\n                           \n\n\n\n                            Select the list you want to retrieve information for.\n                           \n\n\n\n\n\n                            Person ID\n                           \n\n\n\n                            Enter the ID of the person you want to retrieve information for.\n                           \n\n\n\n\n\n                            Metric\n                           \n\n\n\n                            Select the metric type you want to retrieve information for.\n                           \n\n\n\n\n\n                            Type\n                           \n\n\n\n                            Select whether you want to filter results by list or segment. If you select\n                            \n                             No Selection\n                            \n                            , all results are shown.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042926914", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003747", "Archived Date": "", "Language": "English", "Primary Version": "Klaviyo Connector", "Article Total View Count": "2,420", "": "", "Article Created Date": "10/24/2022, 9:14 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Klaviyo Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}