{"file_path": "../../raw_kb_v2\\article\\360042925474\\index.html", "content": {"title": "\n\n\n Beast Mode Manager\n\n\n", "article_body": "\n\nIntro\n-------\n\nBeast Mode provides a powerful and effective means of building new columns on cards so you can transform your data in ways you never thought possible. With such a powerful tool in your hands, you may eventually find that you have more Beast Mode calculations in your instance than you can easily handle. Luckily, Beast Mode Manager is here to help you regain control, by keeping tabs on all your Beast Mode calculations and performing actions on them as necessary.\n\n\n In Beast Mode Manager, you can do all of the following:\n\n See statistics on all Beast Mode calculations in your instance, such as the total number of calculations, the number saved to a DataSet, the number not being used, etc.\n* View information for a specific calculation, such as the number of Cards using it, the DataSets and Cards where it is found, the last updated date, the owner, etc.\n* Edit the formula for any Beast Mode calculation.\n* Add new Beast Mode calculations.\n* Lock or unlock a calculation (singly or in bulk.)\n* Change the owner of a calculation (singly or in bulk.)\n* Archive a calculation (singly or in bulk.)\n* Send a Buzz message to the owner of a calculation.\n* Duplicate calculations to a specified DataSet.\n\nTo perform bulk actions, you must either be an Admin or have a role with the \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled. For more information about roles and grants, see\n\nManaging Custom Roles\n\n.\n\n\n Beast Mode Manager is available in the Data Center. This topic provides instructions for accomplishing most basic Beast Mode Manager actions. For information about the Beast Mode user interface, see\n\nBeast Mode Manager tab\n\n.\n\n\n**Video - Beast Mode Manager**\n\n\n Filtering the calculations list\n---------------------------------\n\nBeast Mode Manager provides a list of all of the calculations in your instance that you have access to. You can click on calculations in this list to see their details views or select them to perform bulk actions on them (if you are an Admin or have a role with the \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled). By default, the list includes all calculations in the instance, but you can filter it in a number of ways, including the following:\n\n Entering keywords for the names of the desired calculation(s) in the\n **Search Beast Modes**\n field at the top of the list. (This search\n *only*\n searches calculation names. It does not search owner names or other metadata.)\n\n\n**Note:**\n Special characters are\n *not*\n supported in the search field (such as: ! # % etc.) Only letters and numbers are supported.\n* Clicking on the\n\nicon in the top right corner of the list, choosing the desired filter, then entering or selecting the criteria to filter on (if required).\n\nYou can combine filters from the menu\n *if*\n it makes sense to do so (for example, you could not apply\n **Used in Card**\n and\n **Not used in Card**\n together). You can also combine these filters with Dashboard filters (discussed in the next bullet). For example, you could click the\n **Saved to DataSet**\n filter in the dashboard to narrow your list to show only calculations saved to DataSets; if you then selected\n **Locked**\n in the filter menu, the list would be further narrowed to show only locked calculations.\n* Clicking on any of the dashboard filter cards on the right half of the screen (such as\n **Total Beast Modes**\n ,\n **Owned by you**\n ,\n **Saved to DataSet**\n , etc.). These can be combined with filters you have selected in the\n\nmenu.\n\nViewing Information for a Calculation\n---------------------------------------\n\nYou can open the details view for any Beast Mode calculation by clicking on it in the calculations list on the left side of the screen. In the details view, you can see the Beast Mode formula; the Card or DataSet the calculation is built on; metrics for the calculation such as the number of Cards using it, the total number of Card views, and the last update date; the data type and owner; the Cards using the calculation; and a preview of the calculated column together with the column(s) it is derived from. You can also take actions on the calculation, such as locking or unlocking it, changing the owner, or sending a Buzz message to the owner.\n\n\n To see all of the Cards that use a particular Beast Mode calculation, go into the details view for the calculation then click the\n **Cards**\n tab. This is an excellent way to find out which Cards will be affected if changes are made to this calculation.\n\nAdding a Calculation\n----------------------\n\nIn Beast Mode Manager, you can add a calculation to any DataSet you have access to. Note that calculations created in this way are tied to the\n *DataSet*\n , whereas calculations added in the\n\nAnalyzer\n\nare tied to the\n *Card*\n . This distinction becomes important when sharing content with other Domo users in your instance. If you share a Card with a Beast Mode calculation tied to it, that calculation is shared as well. Similarly, if you share a DataSet with a Beast Mode calculation tied to it, then that calculation is shared.\n\n\n**To add a calculation to a DataSet,**\n\n. In Beast Mode Manager, click\n **Add Beast Mode**\n in the upper right corner of the screen.\n\n\n A dialog appears in which you can choose a DataSet.\n\nThis dialog includes many options for locating your desired DataSet. In addition to being able to search by name, you can also apply various filters to your search. If you click the\n\nicon, a dialog appears with a number of selectable filters such as\n **Owned by**\n ,\n **Created Date**\n ,\n **Tag**\n , and so on. You can choose any of these filters then specify the criteria for the filter. For example, if you chose\n **Tag**\n , you would then be prompted to select the tag associated with your desired DataSet. You can also customize filters by applying operators. These differ between filters. Most filters include the\n **Not**\n operator so you can indicate that specified criteria are excluded from your filter. For example, you might build a filter in which the status is\n *not*\n disabled. Date-based filters include the\n **On**\n ,\n **Not On**\n ,\n **Before**\n , and\n **After**\n operators so you can narrow down when when a DataSet was created or last run. Number-based filters include\n **Equal To**\n ,\n **Not Equal To**\n ,\n **Less Than**\n , and\n **Greater Than**\n operators.\n\n\n In the filter dialog, you can also choose from several quick filters by clicking\n **Favorite Filters**\n . These include\n **Recently run**\n (which defaults to 7 days),\n **Owned by you**\n , and\n **Needs attention**\n .\n\n\n You can apply multiple filters to narrow down your results; for example, you might apply an\n **Owned by**\n filter specifying user \"Kate Nickelby,\" a\n **Type**\n filter specifying \"Adobe Analytics,\" and a\n **Status**\n filter specifying \"Disabled.\"\n\n\n Once you have your results set, you can change the sort by clicking\n **Created Date (oldest to newest**\n**)**\n and then choosing the desired sort method and direction.\n2. Click\n **Choose DataSet**\n when ready.\n3. Create your Beast Mode formula as explained in\n\nAdding a Beast Mode Calculation to Your Chart\n\n.\n\nEditing a Beast Mode Formula\n------------------------------\n\nYou can edit any Beast Mode calculation formula from within Beast Mode Manager. To do this, you must be an Admin or have a role with the \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled. For more information about roles and grants, see\n\nManaging Custom Roles\n\n.\n\n\n**To edit a Beast Mode formula,**\n\n. Click on the calculation in the list to open its Details view.\n2. Do one of the following:\n\n* Select\n\t **Edit formula**\n\t in the wrench menu in the upper right corner.\n\t* Mouse over the formula at the bottom of the screen and click the pencil icon that appears.\n3. Edit the formula as explained in\n\nAdding a Beast Mode Calculation to Your Chart\n\n.\n\nLocking or unlocking a calculation\n------------------------------------\n\nYou can lock a Beast Mode calculation so that it can be edited or unlocked only by the owner, an Admin, or any users who have a role with the \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled. For more information about roles and grants, see\n\nManaging Custom Roles\n\n. You can lock/unlock Beast Mode calculations singly or in bulk.\n\n\n**To lock or unlock a single calculation,**\n\n. Do one of the following:\n\n* Click on the calculation in the list to open its Details view, then click the wrench icon in the upper right corner.\n\t* Mouse over the calculation, check the box (this only appears if you are an Admin or have a role with \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled), then click the wrench icon at the top of the list.\n2. Select\n **Lock**\n or\n **Unlock**\n .\n\n*To lock or unlock multiple calculations at once,**\n\n. In the calculations list in the Overview screen, mouse over one of the calculations you want to lock or unlock then check the box. (This only appears if you are an Admin or have a role with \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled.)\n2. Check the boxes for all of the other calculations you want to lock or unlock.\n\n\n**Tip:**\n\nIf you have already filtered the list to show only the calculations you want to lock or unlock, you can check all the boxes at once by checking the\n **Select All**\n box at the top of the list.\n3. Select\n **Lock**\n or\n **Unlock**\n in the wrench menu at the top of the list.\n\nChanging the owner of a calculation\n-------------------------------------\n\nBy default, the owner of a Beast Mode calculation built on a DataSet is the DataSet owner, and the owner of a Beast Mode calculation built on a Card is the Card owner. Owners have many privileges not available to non-owners, such as the ability to lock or unlock calculations, change ownership, edit formulas, and duplicate calculations to other DataSets. To change the owner of a calculation, you must be an Admin or have a role with the \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled. For more information about roles and grants, see\n\nManaging Custom Roles\n\n.\n\n\n You can change ownership of Beast Mode calculations singly or in bulk.\n\n\n**To change the owner of single calculation,**\n\n. Do one of the following:\n\n* Click on the calculation in the list to open its Details view, then click the wrench icon in the upper right corner.\n\t* Mouse over the calculation in the list, check the box (this only appears if you are an Admin or have a role with \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled), then click the wrench icon at the top of the list.\n2. Select\n **Change owner**\n .\n3. Select the new owner in the\n **Search people**\n field.\n4. Click\n **Change**\n .\n\n*To change the owner of multiple calculations at once,**\n\n. In the calculations list in the Overview screen, mouse over one of the calculations you want to change ownership of then check the box. (This only appears if you are an Admin or have a role with \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled.)\n2. Check the boxes for all of the other calculations you want to change ownership of.\n\n\n**Tip:**\n\nIf you have already filtered the list to show only the calculations you want to change ownership of, you can check all the boxes at once by checking the\n **Select All**\n box at the top of the list.\n3. Select\n **Change owner**\n in the wrench menu at the top of the list.\n4. Select the new owner in the\n **Search people**\n field.\n5. Click\n **Change**\n .\n\nArchiving a calculation\n-------------------------\n\nYou now have the ability to archive Beast Modes. This removes Beast Modes from Cards or DataSets. You are only able to archive a Beast Mode if it is not in use on a Card. The archive feature is also available for bulk use. You can select up to 100 Beast Modes at a time when using bulk archive. There is no limit to the total amount of Beast Modes that you can archive. To archive a calculation, you must be an Admin or have a role with the \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled. For more information about roles and grants, see\n\nManaging Custom Roles\n\n.\n\n\n You can also unarchive Beast Modes following these same steps and it will restore it to the Card or DataSet it originated from. If a Card or DataSet is deleted, then the Beast Mode is also deleted. You can archive calculations singly or in bulk.\n\n\n**Video - Archiving and Unarchiving Beast Modes**\n\n*To archive a single calculation,**\n\n. Do one of the following:\n\n* Click on the calculation in the list to open its Details view, then click the wrench icon in the upper right corner.\n\t* Mouse over the calculation in the list, check the box (this only appears if you are an Admin or have a role with \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled,) then click the wrench icon at the top of the list.\n2. Select\n **Archive**\n .\n3. In the popup window that appears confirm you want to archive the Beast Mode by clicking\n **Archive**\n .\n\n*To archive multiple calculations at once,**\n\n. In the calculations list in the Overview screen, mouse over one of the calculations you want to archive then check the box. (This only appears if you are an Admin or have a role with \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled.)\n2. Check the boxes for all of the other calculations you want to archive.\n\n\n**Tip:**\n\nIf you have already filtered the list to show only the calculations you want to archive, you can check all the boxes at once by checking the\n **Select All**\n box at the top of the list.\n3. Select\n **Archive**\n in the wrench menu at the top of the list.\n4. In the popup window that appears confirm you want to archive the Beast Modes by clicking\n **Archive**\n .\n\nDuplicating calculations to a different DataSet\n-------------------------------------------------\n\nYou can copy Beast Mode calculations to a different DataSet in your instance. This essentially functions as a \"Save As\" because you can then make changes to the copied calculations without affecting the original (similar to how you can\n\nManaging Custom Roles\n\n.\n\n\n**To duplicate calculations to another DataSet,**\n\n. In the calculations list in the Overview screen, mouse over a calculation you want to duplicate then check the box that appears. (You must be an Admin or have a role with \"Manage All Cards and Pages\" and \"Manage DataSets\" grants enabled for the box to appear.)\n2. (Optional) If you want to duplicate more than one calculation, check the boxes for all the other calculations you want to change ownership of.\n\n\n**Tip:**\n\nIf you have already filtered the list to show only the calculations you want to change ownership of, you can check all the boxes at once by checking the\n **Select All**\n box at the top of the list.\n3. Select\n **Duplicate to DataSet**\n in the wrench menu at the top of the list.\n\n\n A dialog appears in which you can select a DataSet.\n4. Locate your DataSet using the various filter options.\n\n\n For more information about these options, see\n\nAdding a calculation\n\n, above.\n5. Click\n **Choose DataSet**\n when ready.\n\nSending a Buzz Message to a Calculation Owner\n-----------------------------------------------\n\nYou can send a Buzz message to the owner of a calculation from its details view. The message automatically loads the Buzz formula so that you can either send it as is or make edits to it before sending. This is a good way of reaching out to the owner to let him or her know that the calculation is broken or you want to suggest improvements.\n\n\n**To send a Buzz message to a calculation owner,**\n\n. Click on the calculation in the list in Beast Mode Manager to open its Details view.\n2. Select\n **Buzz owner**\n in the wrench menu in the upper right corner of the Details view. (If you are already the owner, this option is grayed out.)\n\n\n The\n **New Message**\n dialog appears.\n3. Enter your message.\n\n\n For more information, see\n\nChatting in Buzz\n\n.\n4. (Optional) Edit the formula if desired.\n\n\n For more information about writing and editing Beast Mode formulas, see\n\nAdding a Beast Mode Calculation to Your Chart\n\n.\n5. Press Enter to post the message.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042925474\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004084\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nBeast Mode Manager\n\n", "article_total_view_count": "\n\n\n 6,752\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:20 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "beast_mode_manager", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "beast_mode", "url": "/s/topic/0TO5w000000ZanAGAS"}]}