{"file_path": "../../raw_kb_v2\\article\\360042928134\\index.html", "content": {"title": "\n\n\n GetThere Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n GetThere is a corporate travel reservation system\n\nserving millions of business travelers in over 100 countries. To learn more about the GetThere API, visit their page (\n\nhttps://www.sabretravelnetwork.com/h...ons/developer/\n\n).\n\n\n**Note:**\n The user interface for building this connector is not yet available in our Connectors listing in the Data Center, meaning you will not be able to configure the connector on your own. However, we at Domo are more than happy to configure the connector for you so you can begin using it to pull your data into Domo. Please don't hesitate to reach out to your CSM or Domo Support. For contact information, see\n\n\n Getting Help\n\n\n .\n\n\n You connect to your GetThere account in the Data Center. This topic discusses the fields and menus that are specific to the GetThere connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\na DataSet Using a Data Connector\n\n.\n\n\n Best Practices\n----------------\n\nThe GetThere API only returns the last 7 days worth of data. Set the connector to Append to build a history of data over time, starting with the previous 7 days and appending new data each time it runs.\n\n\n Prerequisites\n---------------\n\nTo connect to your GetThere account and create a DataSet, you must have the following:\n\n The travel/agency site name you want to retrieve data for.\n* Your GetThere username and password.\n\nConnecting to Your GetThere Account\n-------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the GetThere Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your GetThere account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Site Name\n  |\n Enter the name of the travel/agency site you want to retrieve data for.\n  |\n|\n Username\n  |\n Enter your GetThere username.\n  |\n|\n Password\n  |\n Enter your GetThere password.\n  |\n\n\n Once you have entered valid GetThere credentials, you can use the same account any time you go to create a new GetThere DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the GetThere report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Booking Records\n  |\n Returns a list of booking records for the authenticated user.\n  |\n|\n User Profile Air Preferences Records\n  |\n Returns air travel preference data for the authenticated user.\n  |\n|\n User Profile Arrangers Records\n  |\n Returns a list of arrangers for the authenticated user.\n  |\n|\n User Profile Car Preferences Records\n  |\n Returns vehicle preference data for the authenticated user.\n  |\n|\n User Profile Company Info Records\n  |\n Returns company info for the authenticated user.\n  |\n|\n User Profile Custom Field Records\n  |\n Returns a list of custom fields for the authenticated user.\n  |\n|\n User Profile Delivery Records\n  |\n Returns a list of delivery records for the authenticated user.\n  |\n|\n User Profile EC Info Records\n  |\n Returns EC info for the authenticated user.\n  |\n|\n User Profile Gen Preferences Records\n  |\n Returns general preference information for the authenticated user.\n  |\n|\n User Profile Hotel Preferences Records\n  |\n Returns hotel preference data for the authenticated user.\n  |\n|\n User Profile Keys Records\n  |\n Returns key records for the authenticated user.\n  |\n|\n User Profile Loyalty Program Records\n  |\n Returns loyalty program data for the authenticated user.\n  |\n|\n User Profile Passport Records\n  |\n Returns passport data for the authenticated user.\n  |\n|\n User Profile Punchout Records\n  |\n Returns punchout data for the authenticated user.\n  |\n|\n User Profile Rail Preferences Records\n  |\n Returns rail travel preference data for the authenticated user.\n  |\n|\n User Profile Supervisor Info Records\n  |\n Returns supervisor data for the authenticated user.\n  |\n|\n User Profile Travelers Records\n  |\n Returns travel data for the authenticated user.\n  |\n|\n User Profile Traveler Security Data Records\n  |\n Returns security data for the authenticated user.\n  |\n|\n User Profile User Info Records\n  |\n Returns user information for the authenticated user.\n  |\n|\n User Profile Visa Records\n  |\n Returns visa data for the authenticated user.\n  |\n|\n User Profile Web Connect Records\n  |\n Returns profile web content for the authenticated user.\n  |\n\n|\n|\n Include Customfield\n  |\n Select\n **Yes**\n to include custom fields in your report.\n  |\n|\n Include Subsites\n  |\n Select\n **Yes**\n to include data from subsites in your report.\n  |\n|\n Report Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n Can I use the same account multiple times to create DataSets?\n\nYes.\n\n###\n How often can the data be updated?\n\nDataSets can be updated as often as once an hour. If you get rate limit errors, update the DataSets less frequently.\n\n###\n Are there any API limits I should be aware of?\n\nThe GetThere API has rate limits, but they are not documented. If you run into rate limit errors, try running your DataSets less often, or decrease the amount of data called in a single DataSet run with smaller date ranges.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928134\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003642\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGetThere Connector\n\n", "article_total_view_count": "\n\n\n 2,355\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "getthere_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}