{"file_path": "../../raw_kb_v2\\article\\360043428813\\index.html", "content": {"title": "\n\n\n Setting Color Rules for a Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nWhen you create a chart for displaying data for your users, it is often helpful to highlight exceptions and use consistent colors. The Color Rules tool in Analyzer helps you do both. Using Color Rules, you can apply colors to specific columns in a chart or set conditions in which certain colors are shown.\n\n\n For example, the owner of the ABC Cafe wants to replace the default Domo color scheme with a custom scheme more fitting for his business. He does this by going into the Color Rules dialog and setting the \"Sales\" series column to red and the \"Profit\" series column to black.\n\nAs another example, a user wants to be made instantly aware when profit values in a bar chart fall under a certain threshold. To this end, he sets a color rule on the value column specifying that a red color be applied to bars falling under a specific amount. This is shown in the following screenshot:\n\nThe color rule for this example is basically as follows: \"If the value of 'Profit' falls below 50,000 for a product subcategory, the bar for that subcategory appears red; otherwise the default color (blue) is applied.\"\n\n\n When you apply Color Rules to a chart, you are given the option to apply the rules to this card only or to all cards powered by this same DataSet. The latter option is a great way to ensure that all of your charts built with the same DataSets use the same custom color scheme. So, the user who created the chart in the first example could use this option to ensure that all cards built on this DataSet use the red/black color scheme for Sales and Profits, just as this card does.\n\n*Note:**\n\n\n You cannot change all cards powered by a DataSet unless you are the DataSet owner or have an \"Admin\" security profile or a custom role with \"Manage DataSets\" enabled.\n\nThe Color Rules tool is available for all chart types except for the following:\n\n All maps\n* All gauges\n* Box plot\n* Funnel bars\n* Folded funnel\n* Heat map\n* Category scatter\n* Candlestick\n* High low\n* Calendar\n\nYou can customize map colors by applying color \"themes.\" Color themes use different shades to denote various ranges in map data. For more information, see\n\nChanging Colors in Maps\n\n.\n\n\n For any chart or table, up to 100 color rules are allowed. This includes both card- and DataSet-level rules. For a drill view this limit is a combination of all color rules in all parent views. For more information about drilldown, see\n\nAdding Drill Path to Your Chart\n\n.\n\n*Video - Adding Color Rules**\n\nApplying color rules to a chart\n---------------------------------\n\nColor rules can be applied to any chart type in Domo. However, they are not currently recommended for use in charts with series data (such as multi-bar charts) unless you are applying color rules to the column with series data, as in the previous example (not the category or value columns).\n\n\n You set color rules on a chart by clicking\n **Color Rules**\n in the toolbar at the top of the Analyzer window then choosing the column you want to apply the rule to and setting the conditions (if any) and color.\n\n\n Because there are so many different scenarios for applying color rules to a chart, we present instructions for the two most common use cases: setting custom (static) colors and setting dynamic colors based on conditions.\n\n##\n Use case #1: Setting custom colors using color rules\n\nTo set custom colors on a chart (as in the first example in this topic), it is recommended you apply them to\n *category*\n columns in single-series charts (such as standard bar and line charts) and\n *series*\n columns in multi-series charts (such as grouped bar and multi-line charts). You should not apply color rules to value columns when setting custom colors.\n\n\n**To set custom colors on a chart,**\n\n. Open the Analyzer for the card you want to set custom colors for.\n\n\n You can do this by selecting\n **Edit in Analyzer**\n in either the page view or Details view for the card, or by clicking\n\nin the Details view.\n2. (Optional) If the Analyzer toolbar is not expanded near the top of the window, click\n\nto expand it.\n3. Click the\n **Color Rules**\n button in the toolbar.\n4. In the\n **Column**\n dropdown, select the text or date column you want to set a custom color on.\n\n\n**Tip:**\n You can choose from\n *any*\n columns in your DataSet, not just the ones you have applied to this chart. When setting color rules on DataSet columns, a great time-saver is to open the Analyzer for any chart based on that DataSet, open the\n **Color Rules**\n dialog, then set color rules for each column in the DataSet. Then, when you save, you can choose to apply the new rules to all cards based on the DataSet. This keeps you from having to manually set color rules on each card built around that DataSet.\n5. In the\n **Condition**\n dropdown...\n\n* If the column is a text column, check the boxes for all of the items you want to apply this rule to.\n\t* If the column is a date column...\n\n\t1. Choose the desired conditional statement.\n\t\t2. Choose the date(s) you want to apply this rule to.\n6. Select the desired color for this rule in the\n **Fill**\n dropdown.\n7. (Optional) To add additional rules, click\n **New**\n , then repeat steps 4-6 to configure the new rule.\n8. (Optional) To remove a rule you have set, click\n\nnext to the rule.\n9. Click\n **Next**\n .\n10. (Conditional) If you want this rule to be applied to all cards built on this DataSet (see the above tip), click\n **Apply to All Cards**\n ; otherwise click\n **Apply to Only this Card**\n .\n\nThe rule(s) you have configured are now applied to this chart (and any other charts built on the DataSet, if you selected\n **Apply to All Cards**\n in step 10).\n\n##\n Use case #2: Configuring dynamic colors based on conditions\n\nYou can set rules on a chart so that specific colors are used when values meet certain conditions. This is shown in the \"Profit per Product Subcategory\" example above, in which the bars that fall below a certain value appear red, while all other users use the default blue. You could go a step further and set a second rule on the same column stating that all values\n *above*\n the specified value appear green. Thus \"poor\" values appear as red and \"good\" values appear as green, and the default blue is not used at all. This has been shown in the following example, in which all values equal than or greater to 100,000 appear green and all values less than 100,000 appear red:\n\n*Note:**\n It is not recommended that you do this in charts with more than one series (such as multi-line charts).\n\n\n**To configure dynamic colors in a chart based on conditions,**\n\n. Open the Analyzer for the card you want to set custom colors for.\n\n\n You can do this by selecting\n **Edit in Analyzer**\n in either the page view or Details view for the card, or by clicking\n\nin the Details view.\n2. (Optional) If the Analyzer toolbar is not expanded near the top of the window, click\n\nto expand it.\n3. Click the\n **Color Rules**\n button in the toolbar.\n4. In the\n **Column**\n dropdown, select the value column you want to configure colors for.\n5. In the\n **Condition**\n dropdown, select the desired conditional statement in the menu and enter the value(s) in the field(s) that meet the condition.\n\n\n For example, if you wanted your color to be applied when your value exceeded 50, you would select\n **is greater than**\n in the menu then enter\n\n50\n\nin the field.\n6. Select the color that should be applied when the condition is met.\n7. (Optional) To set additional rules on the same value column (as described above), click\n **New**\n , select your value column, then repeat steps 5 and 6 for the new column.\n8. (Optional) To remove a rule you have set, click\n\nnext to the rule.\n9. Click\n **Next**\n .\n10. (Conditional) If you want this rule to be applied to all cards built on this DataSet, click\n **Apply to All Cards**\n ; otherwise click\n **Apply to Only this Card**\n .\n\nThe rule(s) you have configured are now applied to this chart (and any other charts built on the DataSet, if you selected\n **Apply to All Cards**\n in step 10).\n\n\n Applying color rules to a table\n---------------------------------\n\nIn tables, additional formatting options are available, including shading and styling options, as well as the ability to specify whether the rules apply only to the specific cell or to the whole row.\n\n\n In the event that a table row is affected by more than one rule, precedence is given to the newest rules. For example, a user working in the \"Western\" region may apply a rule to a table that changes the color of all of the states in his region to turquoise. If he then adds a second rule stating that cells in the \"Profit\" column with negative values appear red, this rule is applied to\n *all*\n cells in that column meeting that condition, whether or not they are in the \"Western\" region. This is shown in the following example, for the \"Paper\" and \"Computer Peripherals\" rows.\n\n*To configure color rules for a table,**\n\n. Open the Analyzer for the card you want to set custom colors for.\n\n\n You can do this by selecting\n **Edit in Analyzer**\n in either the page view or Details view for the card, or by clicking\n\nin the Details view.\n2. (Optional) If the Analyzer toolbar is not expanded near the top of the window, click\n\nto expand it.\n3. Click the\n **Color Rules**\n button in the toolbar.\n4. In the\n **Column**\n dropdown, select the column you want to set a custom color on.\n\n\n**Tip:**\n You can choose from\n *any*\n columns in your DataSet, not just the ones you have applied to this chart. When setting color rules on DataSet columns, a great time-saver is to open the Analyzer for any chart based on that DataSet, open the\n **Color Rules**\n dialog, then set color rules for each column in the DataSet. Then, when you save, you can choose to apply the new rules to all cards based on the DataSet. This keeps you from having to manually set color rules on each card built around that DataSet.\n5. In the\n **Condition**\n dropdown, select the desired conditional statement in the menu and enter the value(s) in the field(s) that meet the condition.\n\n\n For example, if you wanted your color to be applied when your value exceeded 50, you would select\n **is greater than**\n in the menu then enter\n\n50\n\nin the field.\n\n\n If you do not want to set a condition (i.e. you want this color to be applied to all rows in the column), leave the default menu setting of\n **contains (any)**\n .\n6. Select the color that should be applied when the condition is met.\n7. In the\n **Table Text**\n menu, select the desired text/background color option.\n8. In the\n **Table Text Style**\n menu, select the desired text style.\n9. (Conditional) If you want this color to be applied to all rows meeting the condition, check the box for\n **Apply format to table row**\n . If you want the color to be applied only to the actual cells meeting the condition, not the associated rows, uncheck the box.\n10. (Optional) To add additional rules, click\n **New**\n , then repeat steps 4-9 to configure the new rule.\n11. (Optional) To remove a rule you have set, click\n\nnext to the rule.\n12. Click\n **Next**\n .\n13. (Conditional) If you want this rule to be applied to all cards built on this DataSet (see the above tip), click\n **Apply to All Cards**\n ; otherwise click\n **Apply to Only this Card**\n .\n\nThe rule(s) you have configured are now applied to this chart (and any other charts built on the DataSet, if you selected\n **Apply to All Cards**\n in step 10).\n\n\n Color rules in drilldown\n--------------------------\n\nIn any given drill view for a card, all color rules that have been applied to any of the parent views (even as \"card only\" rules) are applied. Let's say you have a drill path for a card set up as follows:\n\n\n Drill Level\n  |\n Color Rules\n  |\n| --- | --- |\n|\n Top-level card\n  |\n Has rule X & Y from the DataSet, no \"card only\" rules\n  |\n|\n Drill 1\n  |\n No rules\n  |\n|\n Drill 2\n  |\n Has rule A & B applied as \"card only\" rules\n  |\n|\n Drill 3\n  |\n Has rule C & D applied as \"card only\" rules\n  |\n|\n Drill 4\n  |\n No rules\n  |\n\nIn this case, upon drilling, a user would see color rules applied as follows:\n\n\n Drill Level\n  |\n Color Rules\n  |\n| --- | --- |\n|\n Top-level card\n  |\n X then Y\n  |\n|\n Drill 1\n  |\n X then Y\n  |\n|\n Drill 2\n  |\n A then B\n  |\n|\n Drill 3\n  |\n A, B, C, then D\n  |\n|\n Drill 4\n  |\n A, B, C, then D\n  |\n\nFor more information about drilldown, see\n\nDrilling into Data\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428813\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004635\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nSetting Color Rules for a Chart\n\n", "article_total_view_count": "\n\n\n 6,813\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "setting_color_rules_for_a_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "analyzer", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}