{"file_path": "../../raw_kb_v2\\article\\360043434813\\index.html", "content": {"Title": "Dropbox for Business Advanced Connector", "Article Body": "Important:\n                            \n                            Dropbox has deprecated the Dropbox for Business v1 API and disabled the endpoints as of May 30, 2019. Domo has updated the Dropbox for Business connectors so that our customers can leverage the new Dropbox v2 API. Due to changes in authentication and schema in the new API, we will be deprecating the 2.x version of the Domo Dropbox for Business and Dropbox for Business Advanced connectors. In addition, Domo plans to consolidate the two connectors into a single Dropbox for Business Advanced connector. In order to minimize the interruptions with your Dropbox data, please be aware of the following dates for these changes.\n                           \n\n\n\n\n                             May 31, 2019\n                            \n                            : The 2.x version of the Dropbox for Business and Dropbox for Business Advanced connectors will be deprecated. Customers will still have access to all existing DataSets but will no longer be able to create new ones using the 2.x connectors. The updated 3.x version of the Dropbox for Business Advanced connector will be available for use on this date. In order to create new DataSets, customers will need to create a new Dropbox for Business Advanced DataSet and enter credentials there. Customers should begin migrating/re-creating existing Dropbox for Business and Dropbox for Business Advanced DataSets immediately to use the new 3.x Dropbox for Business Advanced connector.\n                           \n\n\n\n\n                             June 19, 2019\n                            \n                            : The 2.x versions of the Dropbox for Business and Dropbox for Business Advanced connectors will be disabled DataSets created using these versions of the connectors will no longer function. Customers will need to have created new accounts and DataSets using the updated 3.x version of Dropbox for Business Advanced connector by this date.\n                           \n\n\n\n\n\n                        Intro\n                       \n\n\n                         Dropbox for Business is a file sharing and storage solution that allows users to share, store, and sync files securely. You can use Domo's Dropbox for Business Advanced connector to compile reports about account information, team information, audit log, and team usage statistics. To learn more about the Dropbox for Business API, go to\n                         \n                          https://www.dropbox.com/developers/business\n                         \n                         .\n                        \n\n\n\n                         This connector is nearly identical to the standard Dropbox for Business connector but includes an additional report type, \"Groups Information,\" and some configuration options. For information about the standard Dropbox for Business connector, see\n                         \n                          Dropbox for Business Connector\n                         \n                         .\n                        \n\n\n\n                         This topic discusses the fields and menus that are specific to the Dropbox for Business Advanced connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            Use this connector to get information about system usage and make governance decisions.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Storage usage\n                             \n\n\n\n                              Membership\n                             \n\n\n\n                              User activity\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n                            Dropbox system administrator\n                           \n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            Less than 1 hour\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            3\n                           \n\n\n\n\n\n\n                         Prerequisites\n                        \n\n\n\n                         To connect to your Dropbox account and create a Dropbox for Business Advanced connector DataSet, you must have the following:\n                        \n\n\n\n\n\n                           The account you use to log into your Dropbox account.\n                          \n\n\n\n\n\n                           The password you use to log into your Dropbox account.\n                          \n\n\n\n\n                        If you don't have credentials you can get them here:\n                        \n                         https://www.dropbox.com/business\n                        \n\n\n\n                         Connecting to your Dropbox account\n                        \n\n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Dropbox for Business Advanced connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         The Domo Dropbox for Business Advanced connector uses OAuth to connect to Dropbox for Business. (Domo does not store or transmit user passwords.) Click\n                         \n                          Connect\n                         \n                         (or select\n                         \n                          Add Account\n                         \n                         if you have existing Dropbox accounts in Domo) to open the Dropbox OAuth screen where you can enter the account and password associated with your Dropbox account. You may also enter Google credentials. After you have entered valid Dropbox credentials, you can use the same account in Domo any time you create a Dropbox for Business Advanced DataSet.\n                        \n\n\n\n                         You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the\n                         \n                          Data Center\n                         \n                         . For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n                         Details Pane\n                        \n\n\n\n                         This pane includes a menu from which you select a report type, along with various configuration options.\n                        \n\n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select a Dropbox for Business Advanced report. The following reports are available:\n                           \n\n\n\n\n\n\n                                 Audit Log\n                                \n\n\n\n\n\n                                 Accesses the Dropbox for Business audit log for a team.\n                                \n\n\n\n\n\n\n                                Groups Information\n                               \n\n\n\n                                Retrieves reporting data about your Dropbox for Business groups.\n                               \n\n\n\n\n\n\n                                 Linked Devices\n                                \n\n\n\n\n\n                                 Retrieves reporting data about a team's linked devices.\n                                \n\n\n\n\n\n\n\n                                 Members\n                                \n\n\n\n\n\n                                 Lists members of a team.\n                                \n\n\n\n\n\n\n\n                                 Membership\n                                \n\n\n\n\n\n                                 Retrieves reporting data about a team's membership.\n                                \n\n\n\n\n\n\n\n                                 Storage usage\n                                \n\n\n\n\n\n                                 Retrieves reporting data about a team's storage usage.\n                                \n\n\n\n\n\n\n\n                                 Team Information\n                                \n\n\n\n\n\n                                 Retrieves information about a team.\n                                \n\n\n\n\n\n\n\n                                 User Activity\n                                \n\n\n\n\n\n                                 Retrieves reporting data about a team's user activity.\n                                \n\n\n\n\n\n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Enter the start date for the data you want to pull into Domo.\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Enter the end date for the data you want to pull into Domo.\n                           \n\n\n\n\n\n                            User\n                           \n\n\n\n                            Enter the email ID of the user you want to pull information for.\n                           \n\n\n\n\n\n                            Category Flag\n                           \n\n\n\n                            Select whether you want to filter your report data using a category.\n                           \n\n\n\n\n\n                            Category\n                           \n\n\n\n                            Select the category you want to filter your data by.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        How do I know my Dropbox credentials are secure?\n                       \n\n                        The login process uses the OAuth process, so your Dropbox credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n                       \n\n                        Can I use the same account to create multiple DataSets?\n                       \n\n                        Yes.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        DataSets should be set to update no more than once every 15 minutes.\n                       \n\n                        Are there any API limits I should be aware of?\n                       \n\n                        While Dropbox may enforce call rate limits, you should not need to worry about them.\n                       \n\n                        Troubleshooting\n                       \n\n                        Check credentials and permissions against the error code received.", "Preview Article": "Click here to preview", "URL Name": "360043434813", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003434", "Archived Date": "", "Language": "English", "Primary Version": "Dropbox for Business Advanced Connector", "Article Total View Count": "4,651", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Dropbox for Business Advanced Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}