{"file_path": "../../raw_kb_v2\\article\\7964629384087\\index.html", "content": {"title": "\n\n\n Amazon Selling Partner\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n Selling Partner API is a REST-based API that helps Amazon sellers programmatically access their data on listings, orders, payments, reports, and more. Applications using Selling Partner API can increase selling efficiency, reduce labor requirements, and improve response time to customers, helping sellers grow their businesses. Selling Partner API builds on the functionality of Amazon Marketplace Web Service (Amazon MWS), but provides features to improve usability and security for developers and the sellers they work with. This guide documents the Amazon Selling Partner connector.\n\n\n You connect to your Amazon Selling Partner account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon Selling Partner connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\n\n a DataSet Using a Data Connector\n\n\n .\n\nBest Practices\n----------------\n\n\n* For most reports, be conservative on date ranges. Only pull the data you need.\n* Be prepared for some reports to take hours to complete; this is a limitation of the Amazon API.\n* Be advised that years-old data takes much longer to retrieve.\n\nPrerequisites\n---------------\n\nTo connect to your Amazon Selling Partner account and create a DataSet, you must have the following:\n\n  |  |\n| --- | --- |\n| **Parameter Name**  | **Where to find it**  |\n|\n Username\n  |\n Credentials used to log into Seller Central\n  |\n|\n Password\n  |\n Credentials used to log into Seller Central\n  |\n|\n Country Code\n  |\n Select a Country code only for UK-EU Marketplace for others it will be NA\n  |\n|\n Marketplace\n  |\n Select desired marketplace\n  |\n\nConnecting to Your\n\nAmazon Selling Partner\n\nAccount\n-----------------------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes on the Amazon Selling Partner Connector page. The components of the other panes on this page,\n\n\n**Scheduling**\n\n\n and\n\n\n**Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo\n\nAmazon Selling Partner\n\nConnector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n\n\n**Connect**\n\n\n (or select\n\n\n**Add Account**\n\n\n if you have existing Amazon Selling Partner accounts in Domo) to open the Amazon Selling Partner OAuth screen where you can enter your Amazon Selling Partner username and password. Once you have entered valid Amazon Selling Partner credentials, you can use the same account any time you go to create a new\n\nAmazon Selling Partner\n\nDataSet. You can manage connector accounts in the\n\n\n**Accounts**\n\n\n tab in the Data Center. For more information about the accounts tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n\n\n If you are already logged into\n\nAmazon Selling Partner\n\nwhen you connect in Domo, you are authenticated automatically when you click\n\n\n**Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of amazon Selling Partner.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n\n\n**Report**\n\n\n menu, along with various other fields which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the\n\nAmazon Selling Partner\n\nreport you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Fulfillment Inventory - List Inventory Supply\n  |\n Returns a list of inventory summaries that have had changes after the date specified.\n  |\n|\n Products - My Price for SKU\n  |\n Returns pricing information for your own offer listings, based on SellerSKU.\n  |\n|\n Products - Competitive Prices By SKU\n  |\n Returns the current competitive price of a product, based on SellerSKU.\n  |\n|\n Products - Product Categories for SKU\n  |\n Returns the parent product categories that a product belongs to, based on SellerSKU.\n  |\n|\n Products - List Matching Products\n  |\n Returns a list of products and their attributes, based on a search query.\n  |\n|\n Fulfillment Inbound Shipment - Inbound Shipment Items\n  |\n Returns a list of items in a specified inbound shipment, or a list of items that were updated within a specified time frame.\n  |\n|\n Fulfillment Inbound Shipment - List Inbound Shipments\n  |\n Returns a list of inbound shipments based on criteria that you specify.\n  |\n|\n Fulfillment Outbound Shipment - Fulfillment Orders\n  |\n Returns a list of outbound shipments fulfilled by Amazon/Seller. This date is used to select fulfillment orders that were last updated after (or at) the specified day. An update is defined as any change in fulfillment order status, including the creation of a new fulfillment order.\n  |\n|\n Marketplace Participations\n  |\n Returns a list of marketplaces that the seller submitting the request can sell in and information about the seller's participation in those marketplaces.\n  |\n|\n Order Details\n  |\n Returns orders created or updated during a time frame that you specify. The update mode will be set to append by the connector.\n  |\n|\n Order Items\n  |\n Returns line-item-level data for orders between the dates you specify. The update mode will be set to append by the connector.\n  |\n|\n Orders - List Orders - Upsert\n  |\n Returns orders updated since the date you specify. The connector will automatically get the latest data up to 15 minutes ago. The update mode will be set to merge by the connector.\n  |\n|\n Orders - List Order Items By Input Dataset\n  |\n Returns line item level data for orders you specify through an input dataset. The input dataset should be the dataset created for either\n **Order Details**\n or\n **Orders - List Orders - Upsert**\n report. The update mode will be set to merge by the connector.\n  |\n|\n Orders - List Order Items Upsert\n  |\n Returns line item level data for orders created since the date you specify. The connector will automatically get the latest data up to 15 minutes ago. The update mode will be set to merge by the connector.\n  |\n|\n Create and Download Report\n  |\n Allows you to request a number of pre-built reports from Amazon that can help selling partners manage their businesses.\n\nThe following describes the different waiting periods for different ReportTypes:\n * Report-Creation Time (when they select a report)\n* Report-Import Time (when they run or re-run a report)\n* Frustration Time (when they are unable to understand as to why their report is failing)\n |\n\n|\n|\n\nReport Detail Filter\n\n|\n\nSelect the desired report detail filter.\n\n|\n|\n\nCSV Report Quote Character\n\n|\n\n\n Select the quote character to use to delineate columns in the CSV file version of your report. Double Quote is the default character. If your report data contains double quotes, try selecting the\n **Null Character**\n option.\n\n\n |\n|\n\nSelect Statuses\n\n|\n\nSelect the status you want to retrieve data for. You can select up to 10 statuses.\n\n|\n|\n\nSKU Selection Method\n\n|\n\nSelect the method to enter SKUs. Selecting\n **All**\n will return all available SKUs from your Inventory Supply. We will dynamically show SKUs based on the query date selected. To enter a list of SKUs yourself, use the\n **Advanced**\n option.\n\n|\n|\n\nEnter Seller SKUs\n\n|\n\nEnter the list of SKUs you want to retrieve data for, separated by commas.\n\n|\n|\n Pull report data by\n  |\n Select the type to pull report data. Report data can be pulled by Date or by ASIN.\n  |\n|\n\nDuration\n\n|\n\n\n Select the duration for the report (a Single Date, or a Date Range).\n\n\n |\n|\n\nDays Back\n\n|\n\nEnter the number of past days that should appear in the report. Specify either\n\ntoday\n\n(or\n\n0\n\n),\n\nyesterday\n\n(or\n\n1\n\n), or\n\ntoday-7\n\n(or\n\n7\n\n) to get data for 7 days into the past.\n\n|\n|\n Date From\n  |\n Select report start date using relative or specific dates. Relative meaning number of days from today or a specific date using the date selector.\n  |\n|\n\nStart Date\n\n|\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n\nEnd Date\n\n|\n\nSpecify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n\n|\n|\n\nSelect Specific Start Date\n\n|\n\nSelect the first date in your date range.\n\n|\n|\n\nSelect Specific End Date\n\n|\n\nSelect the second date in your date range.\n\n|\n|\n\nDays Back to Start From\n\n|\n Enter the number of the farthest day back that should be represented in the report. Specify either\n\ntoday\n\n(or\n\n0\n\n),\n\nyesterday\n\n(or\n\n1\n\n), or\n\ntoday-7\n\n(or\n\n7\n\n) to get data for 7 days into the past. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n\nDays Back to End At\n\n|\n Enter the number of the most recent day back that should be represented in the report. Specify either\n\ntoday\n\n(or\n\n0\n\n),\n\nyesterday\n\n(or\n\n1\n\n), or\n\ntoday-7\n\n(or\n\n7\n\n) to get data for 7 days into the past. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n\nQuery Date Type\n\n|\n\nSelect the date type for the query.\n **Created**\n returns data based on the creation date.\n **Last Updated**\n will return data based on the date of the last update.\n\n|\n|\n\nContinue on Invalid SKU Error\n\n|\n\n\n Amazon Selling Partner may return an error for invalid SKUs, causing the Domo dataset to stop import with an error. Selecting '\n **Skip Invalid SKUs**\n ' will continue the dataset import if an invalid SKU error is encountered. Selecting '\n **Warn About Invalid SKUs**\n ' will stop dataset import with an error if an invalid SKU error is encountered.\n\n\n |\n|\n\nQuery\n\n|\n\nA comma-delimited list of words to search the Amazon catalog for.\n\n|\n|\n\nBasic Scheduling\n\n|\n\nChoose a predefined update schedule (every day between 9 AM and 10 AM)\n\n Specify a daily window of activity for 15-minute, 30-minute, and hour intervals\n\nWith a\n **Manual schedule**\n , you can opt-in to receive a reminder when the data needs to be updated\n\n|\n|\n\nAdvanced Scheduling\n\n|\n\nDefine a fine-grained schedule with a specific time or update frequency\n\n Limit the schedule to run on specific days and months\n* Start scheduled updates on a future date with\n **Delay Start**\n\n\n**Note:**\n Schedules are set from the current time in UTC\n  |\n|\n\nUpdate Mode\n\n|\n\nWhen Domo retrieves your data from the source, you can determine how that new data is imported into the current DataSet. For this connector, we offer to Append and Replace.\n\n|\n|\n\nAppend Mode\n\n|\n\nThis method will take your new data and add it to your current DataSet. Using this may create duplicate data entries.\n\n|\n|\n\nReplace Mode\n\n|\n\nThis method will take your current DataSet and replace it with new data. Using this may result in some data loss.\n\n|\n\n\n###\n Other Panes\n\nA hybrid Selling Partner API application is an application that can make calls to both Selling Partner API and Amazon Marketplace Web Service (Amazon MWS). Use a hybrid application when your solution requires functionality from both services. When a seller authorizes your hybrid Selling Partner API application, they are (1) authorizing your Amazon MWS developer ID to make calls to Amazon MWS on their behalf, and (2) authorizing the application to make calls to Selling Partner API on their behalf.\n\n##\n FAQ\n\n\n#####\n What API version does Amazon Selling partner use?\n\nAmazon Selling partner uses version 0 of the API.\n\n####\n My Amazon store sells in multiple marketplaces across the world. How do I get all of my orders, inventory and other important Amazon Seller Partner data?\n\nYou will need to create an account for each marketplace. We recommend naming the accounts with the marketplace location: for example, 'United States' or 'Japan'. Once you have created the needed accounts, create connector datasets using each account to receive the data that matters to you. If you would like to join the data, use Domo's Magic ETL or Dataflow tools to bring the different marketplaces together.\n\n####\n How should I configure the Orders details or Order Items report?\n\nThe connector can be set up with Append mode and Replace mode.\n\n\n**Append Mode**\n : Once you select the append mode you can select the desired start date for your historic backfill, and use a relative end date with a value of 'yesterday' or '1'. Set the connector to only run once per day. The connector will get the most current day's data, then start getting backfill data from the most recent data to older, one day at a time. The connector will run for up to 24 hours and then will remember where it left off in the historical backfill. The next day, when the connector runs again, it will get the most current day's data appended to it first, then pick up where it left off with the historical backfill. This pattern will continue until the connector has received all data for the historical backfill. Once all the backfill is completed, it will continue to append the most current days data, one day at a time. If the connector doesn't run or is unsuccessful during a run, it is designed to receive the data it missed in both the current and historical backfill.\n\n\n**Replace Mode**\n : Once you select the replace mode, it will replace the existing data with new data for the selected date range\n\n####\n How frequently should I run the connector schedule?\n\nThe connector should only run once per day.\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 7964629384087\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003180\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon Selling Partner\n\n", "article_total_view_count": "\n\n\n 2,677\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:11 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "amazon_selling_partner", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}