{"file_path": "../../raw_kb_v2\\article\\360042930354\\index.html", "content": {"title": "\n\n\n CA Agile Central Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nCA Agile Central (formerly Rally Software) produces Agile project management tools that allow users to gain visibility into the status of features and quality, priorities, roadblocks, and risks. Use Domo's CA Agile Central connector to retrieve data about projects and tasks, users, defects, and the like. For more information about the CA Agile Central API, go to\n\nhttps://help.rallydev.com/access-web-services-api-wsapi\n\n.\n\n\n The CA Agile Central connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n This topic discusses the fields and menus that are specific to the CA Agile Central connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n You can use this connector to address all of the following use cases:\n * Gauging if you are you on track to completing customized solution/product for a customer\n* Gauging if you are on track to completing features for product?\n* Product roadmap\n* Average velocity by team/sprint\n* Iteration burndown—work remaining and completed in the iteration to anticipate whether the committed work will be delivered by the iteration end date\n* Weekly/bi-weekly sprint review\n* Overview of defect history\n* Defect summary by priority and severity\n* Defects opened and closed by month\n |\n|\n**Primary Metrics**\n | * Product/team velocity\n* Relative size of stories or portfolio items such as features and initiatives\n* Points: estimated vs planned\n* Points: accepted & completed\n* Defects\n* Tasks\n* Task hours\n* Iteration burndown rate\n* iteration burndown vs. ideal burndown rate\n |\n|\n**Primary Company Roles**\n | * Product manager\n* Project manager\n* Director\n* VP\n* Executives\n* CEO\n |\n|\n**Average Implementation Time**\n |\n ~20 hours\n\n\n Reasons for this lengthy implementation time are as follows:\n * Connecting is easy, but the reports you can pull are very raw.  To create meaningful Domo content you may need to do a decent amount of DataFlow work to combine these raw reports. For more information, see\n\nPrepare\n\n.\n* API field names in the raw reports do not necessarily match what you see on the CS Agile Central website, necessitating identification and renaming work.\n* You may have custom reports and fields that must be integrated with your DataFlow. These may replace some of the standard fields, which adds complexity.\n* API documentation is difficult to access and follow.\n |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 7\n  |\n\nBest Practices\n----------------\n\n\n* Forecast and track progress: The states of the scheduled work items indicate the progress of your development as it moves to completion. To determine if you are on target to complete the work within the scheduled iteration, track the accepted state.\n* Manage scope: As your scheduled work item bars become level, it is easy to see when excess work is added to an iteration. If the level of the bars do not remain uniform and instead continue to increase, you need to re-address the scope of your iteration.\n* Identify bottlenecks: Use the rolled-up states of your scheduled work items to determine if there are trends that indicate bottlenecks. For example, a large section of scheduled items in a completed state as compared to a small amount of accepted may indicate a testing roadblock.\n\nPrerequisites\n---------------\n\nTo connect to your CA Agile Central account and create a DataSet, you must have the following:\n\n The API key for your CA Agile Central account.\n* The URL for your CA Agile Central account (for example,\n\n\n https://rally1.rallydev.com\n\n\n ).\n\nConnecting to Your CA Agile Central Account\n---------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the CA Agile Central Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your CA Agile Central account. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n API Key\n  |\n Enter the API Key for your CA Agile Central account.\n\n\n**To get the API Key for Rally,**\n1. Log into CA Agile Central Application Manager (\n\nhttps://rally1.rallydev.com/login\n\n\n )\n\nusing your CA Agile Central username and password.\n2. Click the\n **API KEYS**\n tab at the top of the page.\n3. Click the\n **Create New API Key**\n link.\n4. Enter a name or description for the key in the\n **Description**\n field. For example, \"Domo API Connection\"\n5. In the\n **Grants**\n section, select the\n **Full Access**\n option.\n6. Click the\n **Create**\n button.\n |\n|\n URL\n  |\n Enter the URL for your CA Agile Central account. For example,\n\nhttps://rally1.rallydev.com/login\n\n|\n\nAfter you have entered valid CA Agile Central credentials, you can use the same account in Domo any time you create a CA Agile Central DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu in which you select a report type. The following table describes all of the reports you can create using the Domo CA Agile Central connector:\n\n\n Report\n  |\n Description\n  |\n| --- | --- |\n|\n Hierarchical Requirement\n  |\n Returns information about the hierarchical requirements for your account.\n  |\n|\n Workspace Configuration\n  |\n Returns information about the workspace configuration for your account.\n  |\n|\n Blocker\n  |\n Returns information about blockers for your account.\n  |\n|\n Build\n  |\n Returns build information for your account.\n  |\n|\n Defect\n  |\n Returns information about defects for your account.\n  |\n|\n Iteration\n  |\n Returns information about iterations for your account.\n  |\n|\n Iteration Cumulative Flow Data\n  |\n Returns the states of work in an iteration to analyze the trend in lead time for delivery of working code.\n  |\n|\n Preference\n  |\n Returns user preference information for all users in your account.\n  |\n|\n Project\n  |\n Returns information about projects in your account, such as owner, creation date, etc.\n  |\n|\n Release Cumulative Flow Data\n  |\n Returns work-in-progress status to analyze the trend in lead time for release value delivery.\n  |\n|\n SCM Repository\n  |\n Returns information about SCM repositories for your account.\n  |\n|\n Subscription\n  |\n Returns information about your CA Agile Central subscription, such as expiration date, maximum projects, etc.\n  |\n|\n Task\n  |\n Returns information about tasks in an iteration, including owner, description, status, estimate, etc.\n  |\n|\n User\n  |\n Returns information about all of the users in your account.\n  |\n|\n User Iteration Capacity\n  |\n Returns workload data by iteration for all of the users in your account.\n  |\n\n##\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\nFAQ\n-----\n\n\n#####\n How often can the data be updated?\n\nDatasets can be updated as often as once an hour.\n\n####\n Are there any API limits that I need to be aware of?\n\nRally does not document any limits in their API.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042930354\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003417\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCA Agile Central Connector\n\n", "article_total_view_count": "\n\n\n 4,775\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "ca_agile_central_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}