{"file_path": "../../raw_kb_v2\\article\\360043432753\\index.html", "content": {"Title": "Bureau of Economic Analysis (BEA) Connector", "Article Body": "Intro\n                       \n\n                        The Bureau of Economic Analysis (BEA) is a U.S. government agency that provides official macroeconomic and industry statistics including the gross domestic product of the United States.  To learn more about the BEA API, visit their page (\n                        \n                         https://www.bea.gov/API/signup/index.cfm\n                        \n                        ).\n                        \n\n\n\n                        You connect to your BEA account in the Data Center. This topic discusses the fields and menus that are specific to the BEA connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your BEA account and create a DataSet, you must have a BEA API key. This API key is provided to you by email after you register at\n                        \n                         https://www.bea.gov/API/signup/index.cfm\n                        \n                        .\n                       \n\n                        Connecting to Your BEA Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the BEA Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your BEA account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           API Key\n                          \n\n                           Enter your BEA API key. This API key is provided to you by email after you register at\n                           \n                            https://www.bea.gov/API/signup/index.cfm\n                           \n                           .\n                          \n\n\n\n\n\n                         Once you have entered valid BEA credentials, you can use the same account any time you go to create a new BEA DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the BEA report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Direct Investment\n                              \n\n                               Retrieves income and financial transactions in direct investment that underlie the U.S. balance of payments statistics, and direct investment positions that underlie the U.S. international investment positions.\n                              \n\n\n\n                               Fixed Assets\n                              \n\n                               Retrieves data from the standard set of Fixed Assets tables as published online.\n                              \n\n\n\n                               GDP by Industry (Gross Domestic Product by Industry)\n                              \n\n                               Retrieves estimates for value added, gross output, intermediate inputs, KLEMS and employment statistics, in both current and chained (real) dollars.\n                              \n\n\n\n                               IIP (International Investment Position)\n                              \n\n                               Retrieves data on the U.S. international investment position. BEA's international investment position accounts include the end of the period value of accumulated stocks of U.S. financial assets and liabilities.\n                              \n\n\n\n                               International Services Trade\n                              \n\n                               Retrieves annual estimates of U.S. trade in services and of services supplied to international markets through U.S. and foreign affiliates of multinational enterprises. EA's statistics on services supplied through affiliates by multinational enterprises are not included in this dataset.\n                              \n\n\n\n                               ITA (International Transactions)\n                              \n\n                               Retrieves data about international transactions (balance of payments) accounts, which include all transactions between U.S. and foreign residents.\n                              \n\n\n\n                               Multinational Enterprises (MNEs)\n                              \n\n                               Retrieves data about operations and finances of U.S. parent enterprises and their foreign affiliates and U.S. affiliates of foreign MNEs.\n                              \n\n\n\n                               NI Underlying Detail\n                              \n\n                               Retrieves detailed estimate data from underlying NIPA series that appear in the national income and product account (NIPA) tables as published in the Survey of Current Business.\n                              \n\n\n\n                               NIPA (National Income and Product Accounts)\n                              \n\n                               Retrives data from the standard set of NIPA tables as published in the Survey of Current Business.\n                              \n\n\n\n                               Regional Income (Regional Income and Employment Datasets)\n                              \n\n                               Retrieves income and employment estimates from the Regional Economic Accounts by state, county, and metropolitan area.\n                              \n\n\n\n                               Regional Product (State and MSA Product Datasets)\n                              \n\n                               Retrives Gross Domestic Product (GDP) estimates from the Regional Economic Accounts by state and metropolitan area.\n                              \n\n\n\n                               Underlying GDP by Industry\n                              \n\n                               Retrieves underlying GDP data by industry in both current and chained (real) dollars.\n                              \n\n\n\n\n\n\n\n                           Industry\n                          \n\n                           Select all industries you want to retrieve data for.\n                          \n\n\n\n                           Country\n                          \n\n                           Select all countries you want to retrieve data for.\n                          \n\n\n\n                           Direction of Investment\n                          \n\n                           Select a direction of investment option in the menu.\n                          \n\n\n\n                           Classification\n                          \n\n                           Select a classification option in the menu.\n                          \n\n\n\n                           Year(s)\n                          \n\n                           Select all years you want to retrieve data for.\n                          \n\n\n\n                           Table(s)/Table Name\n                          \n\n                           Select the table(s) you want to pull into your report.\n                          \n\n\n\n                           Frequency\n                          \n\n                           Select how you want data in the report to be broken down. For example, if you select\n                           \n                            Annual\n                           \n                           , data will be broken down by year.\n                          \n\n\n\n                           Component\n                          \n\n                           Select all components you want to retrieve data for.\n                          \n\n\n\n                           Types of Investment\n                          \n\n                           Select all types of investment you want to retrieve data for.\n                          \n\n\n\n                           Area or Country\n                          \n\n                           Select all areas or countries you want to retrieve data for.\n                          \n\n\n\n                           Affiliation\n                          \n\n                           Select all trade affiliations you want to retrieve data for.\n                          \n\n\n\n                           Trade Direction\n                          \n\n                           Select all trade directions you want to retrieve data for.\n                          \n\n\n\n                           Type of Services\n                          \n\n                           Select all service types you want to retrieve data for.\n                          \n\n\n\n                           Indicator\n                          \n\n                           Select all indicators you want to retrieve data for.\n                          \n\n\n\n                           Ownership Level\n                          \n\n                           Select an ownership level option in the menu.\n                          \n\n\n\n                           Non-Bank Affiliates Only\n                          \n\n                           Select whether you want your report to return data for non-bank affiliates only.\n                          \n\n\n\n                           Show Millions\n                          \n\n                           Select whether a million-dollar detail level should be shown.\n                          \n\n\n\n                           Geo FIPS\n                          \n\n                           Select all GEO FIPS locations you want to retrieve data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        How often can the data be updated?\n                       \n\n                        Datasets can be updated as often as once an hour, though should be decreased if rate limit errors are encountered.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        BEA limits users to 1000 API calls per minute.", "Preview Article": "Click here to preview", "URL Name": "360043432753", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003626", "Archived Date": "", "Language": "English", "Primary Version": "Bureau of Economic Analysis (BEA) Connector", "Article Total View Count": "2,366", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Bureau of Economic Analysis (BEA) Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}