{"file_path": "../../raw_kb_v2\\article\\360042928734\\index.html", "content": {"title": "\n\n\n Google BigQuery Connector\n\n\n", "article_body": "\n\n\n**Important:**\n\nDue to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. All pre-existing DataSets will continue to run normally. Current Connectors that rely on Google OAuth authentication will no longer be able to power up new DataSets. These connectors include the following:\n * Google BigQuery\n* Google Adwords via BigQuery\n* DoubleClick Campaign Manager via Google Cloud Storage (DTV2)\n* Google Cloud Storage\n* Google Contacts\n* Google Drive\n* Google Gmail\n* Google Admin SDK Reports\n\nIf you need to change a pre-existing Google OAuth DataSet, please use the corresponding Service Account connector. The following Service Account connectors are now available:\n\n Google BigQuery Service\n* Google Ads (fomerly AdWords) via BigQuery Service\n* Google Drive Service\n* Google Cloud Storage Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Admin SDK Reports Service\n\nAll other equivalent Google Service Account connectors are currently in development. Domo will communicate when these connectors become available. You will need to look for the Service Account equivalent connector in Data Center or the App Store and use that connector to get their data.\n\n\n Domo recommends that you proactively repower existing Google connections by creating new DataSets utilizing the new Service Account Key connectors as the connectors become available.  Domo will notify you if any further migration changes should arise.\n\n\n Intro\n-------\n\nGoogle BigQuery is a cloud-based big data analytics web service for processing very large read-only data sets. Domo's Google BigQuery connector leverages standard SQL and legacy SQL queries to extract data and ingest it into Domo. BigQuery queries are written using a variation of the standard SQL\n **Select**\n statement. To learn more about the BigQuery API, go to\n\nhttps://cloud.google.com/bigquery/docs/reference/v2/\n\n.\n\n\n The Google BigQuery connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n This topic discusses the fields and menus that are specific to the Google BigQuery connector user interface. For general information about adding DataSets, setting update schedules, and editing DataSet information, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Any situations in which you need to extract data from Google BigQuery.\n  |\n|\n**Primary Metrics**\n |\n DFP data\n  |\n|\n**Primary Company Roles**\n | * Marketing roles\n* Finance roles\n |\n|\n**Average Implementation Time**\n |\n This depends on how many queries need to be written. Having someone who understands the BigQuery database structure and knows how to build the queries will greatly cut down on deployment time.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 5\n  |\n\nBest Practices\n----------------\n\n\n* Structuring your queries to be optimized so you are pre-aggregating data\n *before*\n pulling it into Domo will significantly improve performance.\n* Getting your data closely structured to support the visualizations prior to ingestion will save time by potentially eliminating the ETL process in Domo.\n\nPrerequisites\n---------------\n\nTo connect to BigQuery,\n\nyou must have your Google credentials (email address and password). Your Google account must have permissions to access the tables and data needed for the query.\n\nConnecting to Your BigQuery Account\n-------------------------------------\n\nThis section enumerates the options in the\n\nCredentials\n\nand\n\nDetails\n\npanes in the Google BigQuery Connector page. The components of the other panes in this page,\n\nScheduling\n\nand\n\nName & Describe Your DataSet\n\n, are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google BigQuery connector uses OAuth to connect to BigQuery. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing BigQuery accounts in Domo) to open the Google OAuth screen where you can select the account you want to connect to. After selecting an account, specify the password for that account. After you have entered a valid password, you can use the same account in Domo any time you create a BigQuery DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of the currently active Google account.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields and menus you can use to configure your report.\n\n\n**Tip:**\n Use the \"Table Information\" report to get the DataSet ID, Project ID, table name, etc. This can help you create and form your queries.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the BigQuery report type to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Query\n  |\n Lets you enter a query and configure the parameters.\n  |\n|\n Table Information\n  |\n Lets you pull data for a selected BigQuery project, dataset, and table.\n  |\n\n|\n|\n What Query Type Would You Like to Use?\n  |\n Select whether your query is to be written using LegacySQL or StandardSQL.\n  |\n|\n Query\n  |\n Enter a fully qualified BigQuery query. The query language you use must match what you have selected in the\n **What Query Type Would You Like to Use?**\n menu.\n\n\n For full documentation about writing BigQuery queries, see\n\nhttps://cloud.google.com/bigquery/query-reference\n\n. For more information about setting a query prefix, see\n\nhttps://cloud.google.com/bigquery/docs/reference/standard-sql/enabling-standard-sql\n\n.\n  |\n|\n Project ID\n  |\n Enter the ID for the project you want to retrieve data for.\n\n*Note:**\n Only one Project ID can be entered. If you want to pull multiple Project ID's, then multiple DataSets will need to be created.\n\n\n |\n|\n Expect Large Results\n  |\n Select whether you expect a large resulting DataSet from this query. If you select\n **Yes**\n , a temporary table will be created and then deleted when the job is finished. You will need to enter a DataSet ID in the\n **DataSet ID**\n field for the table to be created.\n  |\n|\n DataSet ID\n  |\n Enter the ID of the dataset you are pulling into Domo.\n\n*Note**\n**:**\n Only one DataSet ID can be entered. If you want to pull multiple DataSet ID's, then multiple DataSets will need to be created.\n\n\n |\n|\n Projects\n  |\n Select the project you want to pull data from.\n  |\n|\n DataSets\n  |\n Select the dataset you want to pull data from.\n  |\n|\n Tables\n  |\n Select the table you want to pull data from.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Ensure that the credentials have the proper access to the query the tables needed.\n* Make sure the queries are correct and calling the correctly named data sources.\n\nFAQs\n------\n\n\n####\n When should I use this connector?\n\nThis connector has been deprecated and cannot be used to power up any new datasets.\n\n###\n What kind of credentials do I need to power up the Google BigQuery connector?\n\nYou need Google account credentials with permissions to access the tables and data needed for the query.\n\n###\n How do I know my Google account credentials are secure?\n\nDomo's Google BigQuery connector uses OAuth, which authenticates the account with Google, without Domo ever having access to your Google account credentials.\n\n###\n How frequently will my data update?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNo\n\n###\n Can I use the same Google BigQuery account for multiple DataSets?\n\nYes\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928734\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003949\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle BigQuery Connector\n\n", "article_total_view_count": "\n\n\n 5,360\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_bigquery_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}