{"file_path": "../../raw_kb_v2\\article\\360043431193\\index.html", "content": {"title": "\n\n\n Engine Ready Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nEngine Ready provides custom online marketing solutions for businesses and is an industry leader in SEO and PPC. You connect to your Engine Ready account in the Data Center. This topic discusses the fields and menus that are specific to the Engine Ready connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Engine Ready account and create a DataSet, you must have your Engine Ready username and password.\n\n\n Connecting to Your Engine Ready Account\n-----------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Engine Ready Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Engine Ready account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter your Engine Ready username.\n  |\n|\n Password\n  |\n Enter your Engine Ready password.\n  |\n\n\n Once you have entered valid Engine Ready credentials, you can use the same account any time you go to create a new Engine Ready DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Engine Ready report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account - Account List\n  |\n Returns the list containing account information for the parent account and all client accounts associated with the current user.\n  |\n|\n Account - Account Membership List\n  |\n Returns the list containing account membership information for the specified user.\n  |\n|\n Account - Category of Specified Account\n  |\n Returns the category of the specified account.\n  |\n|\n Account - Scheduled Report List\n  |\n Returns the information about all scheduled reports for the specified account and, optionally, information about scheduled reports for client accounts.\n  |\n|\n Ad Campaigns - Ad List All\n  |\n Returns the list of ad campaigns associated with the specified parent account, optionally constrained by a specified search filter.\n  |\n|\n Ad Campaigns - Dispo List\n  |\n Returns the list of tags for the specified campaign.\n  |\n|\n Ad Campaigns - List by Group\n  |\n Returns the list of the ad campaigns associated with the specified ad group.\n  |\n|\n Ad Campaigns - Time Zone List\n  |\n Returns the list of valid time zones.\n  |\n|\n Ad Group - Group List\n  |\n Returns the list of of ad groups associated with the specified account.\n  |\n|\n Call Forwarding - Entries\n  |\n Returns the list of call forwarding entries for the specified ad campaign.\n  |\n|\n Call Recordings - Call Search\n  |\n Returns all calls logged for an account.\n  |\n|\n Click-to-Call and Form to Phone Entries\n  |\n Returns the list of call log entries of click-to-call calls for the specified click-to-call ad campaign.\n  |\n|\n Image List\n  |\n Returns the list of the images for the specified account.\n  |\n|\n Image Replace List\n  |\n Returns the proxy image replacement rules for the specified ad campaign.\n  |\n|\n Phone Numbers - Available Numbers\n  |\n Returns the available telephone numbers in the number pool for the specified account.\n  |\n|\n Phone Numbers - Numbers List\n  |\n Returns the list of phone numbers associated with the specified account.\n  |\n|\n Phone Numbers - Pending Number Orders List\n  |\n Returns the list of pending number orders for the specified account.\n  |\n|\n Playfiles - Get Playfiles List\n  |\n Returns the list of playfiles for the specified ad campaign.\n  |\n|\n Proxy List\n  |\n Returns the proxies associated with the specified account.\n  |\n|\n Rewrite Rules and JavaScript Rewrites\n  |\n Returns the proxy rewrite list of the specified click-to-call ad campaign.\n  |\n|\n Voice XML App List\n  |\n Returns the list of the VoiceXML application entries associated with the specified account.\n  |\n|\n Voice XML Call List\n  |\n Returns the list of the calls handled by a VoiceXML application that occurred between the specified start and end date and times for the specified account.\n  |\n\n|\n|\n Account Name\n  |\n Select the account you want to retrieve information for.\n  |\n|\n Campaign ID\n  |\n Select the campaign you want to retrieve information for.\n  |\n|\n Group ID\n  |\n Select the group you want to retrieve information for.\n  |\n|\n User ID\n  |\n Select the user you want to retrieve information for.\n  |\n|\n Start Date\n  |\n Select the start date for your report.\n  |\n|\n End Date\n  |\n Select the end date for your report.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQ\n-----\n\n\n####\n Can I use the same account to create multiple DataSets?\n\nYes.\n\n###\n How often can the data be updated?\n\nTry to limit the number of concurrent DataSet executions.\n\n###\n Are there any API limits I should be aware of?\n\nThere are API limits that might cause slowdowns if multiple DataSets are running concurrently.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043431193\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003766\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nEngine Ready Connector\n\n", "article_total_view_count": "\n\n\n 2,357\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:15 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "engine_ready_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}