{"file_path": "../../raw_kb_v2\\article\\360042928194\\index.html", "content": {"title": "\n\n\n HireVue Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nHireVue is an online video recruiting software suite with a focus on technology to hire the best talent faster. To learn more about the HireVue API, visit their page (\n\nhttps://www.hirevue.com/why-hirevue/partners\n\n).\n\n\n You connect to your HireVue account in the Data Center. This topic discusses the fields and menus that are specific to the HireVue connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\na DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your HireVue account and create a DataSet, you must have the following:\n\n The email address associated with your HireVue account.\n* Your HireVue API key. If you do not have an API key, reach out to your HireVue account manager.\n* The domain for your HireVue account. For example, if you log in to your account at\n\nhttps://domo.hirevue.com\n\n, you would enter \"\n\ndomo.hirevue.com\n\n\" here. The standard domain is\n\n\n app.hirevue.com\n\n\n , but this could vary depending on your account.\n\nConnecting to Your HireVue Account\n------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the HireVue Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your HireVue account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Username\n  |\n Enter the email address associated with your HireVue account.\n  |\n|\n API Key\n  |\n Enter your HireVue API key.\n  |\n|\n Domain\n  |\n Enter your HireVue company domain.\n  |\n\nFor information about obtaining these credentials, see \"Prerequisites,\" above.\n\nOnce you have entered valid HireVue credentials, you can use the same account any time you go to create a new HireVue DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the HireVue report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Evaluations\n  |\n Returns interview evaluations for a given position.\n  |\n|\n Interviews\n  |\n Returns interview data according to your selected filters.\n  |\n|\n Positions\n  |\n Returns data about positions according to your selected filters.\n  |\n|\n Questions\n  |\n Returns interview questions for a given position.\n  |\n|\n Teams\n  |\n Returns team and user data.\n  |\n\n|\n|\n Status\n  |\n Select the interview status you want to filter your results by.\n  |\n|\n Include Positions in Archived State\n  |\n Select whether you want to include archived positions in your results.\n  |\n|\n Include Positions in Draft State\n  |\n Select whether you want to include positions in draft state in your results.\n  |\n|\n Date Type (for \"Evaluations,\" \"Questions,\" and \"Positions\" reports)\n  |\n Select whether to filter on Created Date or Position Due Date. \"Evaluations\" and \"Questions\" reports are filtered based on the dates of the positions they relate to. Note that if no Position Due Date has been set on a position, no data will be returned when filtering on Position Due Date.\n  |\n|\n Date Type (for \"Interviews\" report)\n  |\n Select whether to filter on the Created Date or Taken Date.\n  |\n|\n Sub Report\n  |\n Select a subreport to include with your report, if desired. If you do not want to include a subreport, select\n **None**\n .\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n **End Date**\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n **Start Date**\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n **Days Back to End At**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n **Days Back to Start From**\n to create a range of represented days.\n\n\n For example, if you entered\n\n10\n\nfor\n **Days Back to Start From**\n and\n\n5\n\nfor\n **Days Back to End At**\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\na DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n Why is my DataSet missing \"positions\"?\n\nDepending on the filters you select, you may be unintentionally excluding positions. For example, if you use \"due date\" as your date filter, but your position does not have a \"due date\" assigned, the position will never be returned, no matter what range you select in the date selector. You must also specifically request that archived and draft positions be returned using the available checkboxes in the UI.\n\n####\n How do the filters work for the \"Evaluations\" and \"Questions\" reports?\n\nYou may find these filters a bit confusing because you aren't actually filtering the evaluations or questions. In this case, Domo requests positions for the criteria you select and we return the evaluations or questions that apply to each position that matches the filter criteria.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042928194\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003645\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nHireVue Connector\n\n", "article_total_view_count": "\n\n\n 2,348\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "hirevue_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}