{"file_path": "../../raw_kb_v2\\article\\360043429573\\index.html", "content": {"Title": "Table Chart", "Article Body": "Intro\n                       \n\n                        Most Domo chart types require certain columns from your DataSet to be built—usually columns with category, value, and series data. For more information, see the\n                        \n                         Chart Types\n                        \n                        topic in our knowledge base.\n                       \n\n                        However, with a table, you can include any DataSet columns you want in the table. You can also change the order of the columns to suit your needs.\n                       \n\n                        This article describes tables in Domo in the following topics:\n                       \n\n\n\n                          Types of tables\n                         \n\n\n\n                          Power tables\n                         \n\n\n\n                          Customize tables\n                         \n\n\n\n                          Specify column labels\n                         \n\n\n\n                          Set formatting for individual columns\n                         \n\n\n\n                          Table calculations\n                         \n\n\n\n                          Set total and subtotal options for individual columns\n                         \n\n\n\n                          Set a custom table size\n                         \n\n\n\n                          Understanding row limits\n                         \n\n\n\n                          FAQ\n                         \n\n\n\n\n\n                        Types of Tables\n                       \n\n                        For Visualization Cards in Domo, several different types of tables are available:\n                       \n\n\n\n                          HTML Tables\n                         \n                         are basic tables that can contain up to 10,000 cells.\n                        \n\n\n                          Heat Map Tables\n                         \n                         are almost the same as HTML Tables; the only difference is that, in a Heat Map Table, values in a `Values` column are shaded different colors depending on where they fall in the given range. The image below shows an example of a Heat Map Table.\n                         \n\n\n\n\n\n\n                          Mega Tables\n                         \n                         provide the same functionality as HTML Tables and Heat Map Tables but include much more. They can have up to 25,000 rows and contain HTML links and images. You can also collapse and expand, sort, and scroll through Mega Tables on a Dashboard.\n                        \n\n\n                        All of the above tables are built in the same way and are discussed in this article. Domo also includes two other types of tables, which are discussed in their own articles:\n                       \n\n\n\n                          Flex Tables\n                         \n                         display different rows for each series of a chart, with all series shown as individual Spark Line or Spark Bar charts. For more information, see our\n                         \n                          Flex Table\n                         \n                         article.\n                        \n\n\n                          Pivot Tables\n                         \n                         allow you to efficiently summarize large quantities of data from a DataSet and explore data by different dimensions and measures. For more information, see our\n                         \n                          Pivot Table\n                         \n                         article.\n                        \n\n\n                        You can also create Pivot Tables using Domo's Sumo Card functionality. Unlike other types of tables, Sumo Cards are not considered chart types for Visualization Cards but are a separate class of cards. For more information about Sumo Tables, see our article about\n                        \n                         Understanding Cards\n                        \n                        .\n                       \n\n                        For information about adding Filters to your chart, see our article about\n                        \n                         Adding Filters to Your Chart\n                        \n                        , and for information about configuring deep linking with Filters in Table Cards, see\n                        \n                         Sample Beast Mode Calculations: Miscellaneous Transforms\n                        \n                        .\n                       \n\n                        Drill Paths work the same in tables as they do in other chart types. For more information, see our article about\n                        \n                         Adding a Drill Path to Your Chart\n                        \n                        .\n                       \n\n\n\n                        Power Tables\n                       \n\n                        Unlike with other chart types—where you must drag columns of a specific data type into specific fields in the\n                        \n                         Columns\n                        \n                        region above the chart—you create tables by dragging columns into any `Columns\n                        \n                         `\n                        \n                        fields you want. The order in which you arrange the columns is the order in which they display in the table.\n                       \n\n                        For example, if you drag the `Order Date` column into the first field, the `Customer Name` column into the second field, and the `Amount` column into the third field, the columns display in the table in that order. You can drag and drop column fields to rearrange them as needed.\n                       \n\n                        The following table shows the relationship between field order and table column order:\n                        \n\n\n\n\n                        Columns retain their unique data types even after you drop them into a field. As with other chart types, you can select a column in the\n                        \n                         Columns\n                        \n                        region to access additional options, such as aggregation, formatting, and so on. The specific options that are available depend on the data type.\n                       \n\n                        Columns from the\n                        \n                         Categories\n                        \n                        region on the left side of the screen only allow you to set basic aggregation options and a\n                        \n                         Details\n                        \n                        >\n                        \n                         Table View\n                        \n                        label. Columns from the\n                        \n                         Values\n                        \n                        region provide more aggregation options, a label setting option, and number formatting options. For more information about aggregation, see our article about\n                        \n                         Formatting Values in Your Chart\n                        \n                        .\n                       \n\n                        For information about value, category, and series data, see our article about\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        In Analyzer, you choose the columns containing the data for your table. For more information about Analyzer, see our\n                        \n                         Analyzer Layout\n                        \n                        article.\n                       \n\n                        For more information about choosing data columns, see our article about\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n\n\n                        Customize Tables\n                       \n\n                        You can customize the appearance of a table in several ways, many of which are possible with the\n                        \n                         Chart Properties\n                        \n                        tool. For information about the chart properties, see our\n                        \n                         Chart Properties\n                        \n                        article.\n                       \n\n                        Table Properties\n                       \n\n                        This section describes the unique properties of tables. Unless otherwise noted, all properties apply to HTML Tables, Heat Map Tables, and Mega Tables.\n                       \n\n                        General Properties\n                       \n\n\n\n                          Font Color\n                         \n                         — Allows you to change the font color used for all text in the table.\n                        \n\n\n                          Allow Text to Wrap\n                         \n                         — When enabled, text in columns is wrapped instead of disappearing from the right side of the column.\n                         \n                          The example below shows an HTML Table with text wrapping enabled.\n                          \n\n\n\n\n\n\n\n\n                          Row Height\n                         \n                         — Allows you to specify the size of the padding in the cells. This property can be applied only to Mega Tables.\n                        \n\n\n                          Financial Style Negatives\n                         \n                         — When this checkbox is selected, negative numbers are enclosed in parentheses; otherwise, a minus sign is used.\n                        \n\n\n                          Show Negative Numbers in Red\n                         \n                         — When this checkbox is selected, negative numbers display in red.\n                        \n\n\n                          Set Column Widths\n                         \n                         — Allows you to set the widths, in pixels, for all table columns as percentages. Do this by entering the widths as a comma-separated list.\n                         \n\n                         In the example below, the column widths are 20, 20, 40, 20.\n                         \n\n\n\n\n\n\n\n\n                          Number of Locked Columns\n                         \n                         — Allows you to specify how many columns are locked on the left side of the table. When columns are locked, they always display in the table, even when you scroll to the right. This property can be applied only to Mega Tables.\n                        \n\n\n                          Hide Columns\n                         \n                         — Allows you to hide columns in a table by entering the column numbers in a comma-separated list. The column numbers are based on the order of the columns in the table, from left to right. For example, the third column from the left would be column 3.\n                        \n\n\n                          Hide Alternating Row Colors\n                         \n                         — Turns off the default alternating row colors in the table, so all rows display with a white background (except when you hover over a column, in which case all cells in that column and the current row are blue). This property is only available for Mega Tables.\n                        \n\n\n                          Apply Color Rules to Totals and Subtotals\n                         \n                         — Applies any color rules you've set using the\n                         \n                          Colors\n                         \n                         property to the total and subtotal rows in your table. This property can be applied only to Mega Tables.\n                        \n\n\n                          Apply Color Rules to Headers\n                         \n                         — Applies any color rules you've set with the\n                         \n                          Colors\n                         \n                         property to header rows in your table. This property can be applied only to Mega Tables.\n                        \n\n\n                          Transpose\n                         \n                         — Transposes your table so that rows become tables and tables become rows. This property can be applied only to Mega Tables.\n                        \n\n\n                          Allow HTML Links and Images\n                         \n                         — Displays HTML-encoded links and images in your table. You must enclose URLs in <a> tags and enclose images in <div> tags. This property can be applied only to Mega Tables.\n                         \n                          The following code is an example URL tag that converts to a working email address for a user named Sam MacGregor:\n                         \n<a href=\"mailto: sam.macgregor@yankuna.com\">sam.macgregor@yankuna.com </a>\n\n\n                          The following code is an example image tag that converts to an image named bruce.png, which is stored on\n                          \n                           knowledge.domo.com\n                          \n                          :\n                         \n<div style=\"text-align:center\"><img height=\"80px\" src=\"https://knowledge.domo.com/@api/deki/files/7627/bruce.png?origin=mt-web\"></div>;\n\n\n                          The example below shows a table in which both URLs and images are enabled.\n                          \n\n\n\n\n\n\n\n\n                          HTML Image Size\n                         \n                         — Allows you to set a size limit for HTML images. You can set any size between 10 and 500 pixels. The default is 64. This property can be applied only to Mega Tables.\n                        \n\n\n                        Header Row Properties\n                       \n\n\n\n                          Header Row Fill Color\n                         \n                         — Allows you to select a background color for the header row of your table. If you select\n                         \n                          Default\n                         \n                         , no color is used.\n                         \n\n\n\n\n\n\n\n\n                           Header Row Font Color\n                          \n                          —  Allows you to select the text color for the column names in your header row. This color overrides the table font color set in\n                          \n                           General\n                          \n                          >\n                          \n                           Font Color\n                          \n                          .\n                         \n\n                          For example, if you set the general font color to blue and the header row font color to red, the header row font color displays as red instead of blue. If you then select\n                          \n                           Default\n                          \n                          , the header row color reverts to blue.\n                          \n\n\n\n\n\n\n\n\n                          Header Row Alignment\n                         \n                         — Allows you to select the alignment (left, center, or right) for the column names in the header row. The default setting is\n                         \n                          Left\n                         \n                         .\n                         \n                          In the example below, the column names are centered.\n                          \n\n\n\n\n\n\n\n\n                          Header Row Font Style\n                         \n                         — Allows you to select the font style (bold, italic, or bold-italic) for the column names in the header row. The default setting is\n                         \n                          Bold\n                         \n                         .\n                         \n                          In the example below, the font style is\n                          \n                           Bold-Italic\n                          \n                          .\n                          \n\n\n\n\n\n\n\n\n                        Total Row Properties\n                       \n\n\n\n                          Show Total Row\n                         \n                         — Adds a\n                         \n                          Grand Total\n                         \n                         row to the bottom of your table. This row sums all value columns and counts all string and date/time columns.\n                         \n                          Note that the label displays at the bottom of the first column, replacing any totals that would otherwise display there. We do not recommend making the column you want to total the first column.\n                          \n\n\n\n\n\n\n\n\n                          Hide Counts\n                         \n                         — Hides count summations for non-value columns in the total row. This property can be applied only to Mega Tables.\n                        \n\n\n                          Label\n                         \n                         — Replaces the\n                         \n                          Grand Total\n                         \n                         text in your total row with custom text. This property is available only when the\n                         \n                          Total Row\n                         \n                         >\n                         \n                          Show Total Row\n                         \n                         checkbox is selected.\n                        \n\n\n                          Fill Color\n                         \n                         — Allows you to select a background color for the total row in your table. If you select\n                         \n                          Default\n                         \n                         , no color is used. This property is available only when the\n                         \n                          Total Row\n                         \n                         >\n                         \n                          Show Total Row\n                         \n                         checkbox is selected.\n                         \n\n\n\n\n\n\n\n\n                          Font Color\n                         \n                         — Allows you to select the text color for the content in your total row. This color overrides the table font color set in\n                         \n                          General\n                         \n                         >\n                         \n                          Font Color\n                         \n                         . This property is available only when the\n                         \n                          Total Row\n                         \n                         >\n                         \n                          Show Total Row\n                         \n                         checkbox is selected.\n                         \n                          For example, if you set the general font color to blue and the total row font color to red, the total row font color displays as red instead of blue. If you then select\n                          \n                           Default\n                          \n                          , the total row color reverts to blue.\n                          \n\n\n\n\n\n\n\n\n                          Font Style\n                         \n                         — Allows you to select the font style (bold, italic, bold-italic, or underline) for the column names in the total row. The default setting is\n                         \n                          Bold\n                         \n                         , and this property is available only when the\n                         \n                          Total Row\n                         \n                         >\n                         \n                          Show Total Row\n                         \n                         checkbox is selected.\n                         \n                          In the example below, the font style is\n                          \n                           Bold-Italic\n                          \n                          .\n                          \n\n\n\n\n\n\n\n\n                          Position\n                         \n                         — Allows you to specify whether your total row displays at the end of the table (default) or at the beginning. This property can be applied only to Mega Tables.\n                        \n\n\n                          Padding\n                         \n                         — Allows you to add padding, in pixels, between the content in the total row and the upper border. This property can be applied only to Mega Tables.\n                         \n                          In the example below, this value is 25.\n                          \n\n\n\n\n\n\n\n\n                        Subtotal Row Properties\n                       \n\n\n\n                          Show Subtotal Rows\n                         \n                         — Adds subtotal rows per group within the first column of your table. The subtotal row sums all value columns and counts all string and date/time columns.\n                         \n                          In the example below, the first column contains state names that are sorted alphabetically. There are three rows for New Mexico. Therefore, a subtotal column displays after the New Mexico rows, providing subtotals only for the New Mexico data.\n                          \n\n\n\n\n\n\n\n\n                          Show All Group Names\n                         \n                         — When this checkbox is selected, names of unaggregated data display for all individual items within a category. When it is not selected, the category name is used only once (aside from the subtotal row), and blank cells display under that name for all remaining values in the category. This property can be applied only to Mega Tables.\n                         \n                          The first example below shows a table in which the customer name displays each time a value is listed for that customer. The second example shows the same table, but the customer name is listed only once, and all subsequent values for that customer have a blank customer name.\n                          \n\n\n\n\n\n\n\n\n\n\n\n                          Subtotal Row Padding\n                         \n                         — Adds padding, in pixels, between the content in the subtotal row and the lower border.\n                         \n                          In the example below, this value is 25.\n                          \n\n\n\n\n\n\n\n\n                          Show as Percent of Total\n                         \n                         — When this checkbox is selected, subtotals display as a percentage of the total values for the entire column instead of the usual subtotals. This property is available only when the\n                         \n                          Subtotal Row\n                         \n                         >\n                         \n                          Show Subtotal Rows\n                         \n                         checkbox is selected.\n                         \n\n\n\n\n\n\n\n\n                          Hide Counts\n                         \n                         — Hides count summations for non-value columns in subtotal rows. This property can be applied only to Mega Tables.\n                        \n\n\n                          Label\n                         \n                         — Allows you to customize the label text for your subtotal rows. Note that your custom text replaces only the word \"Total,\" not the name of the group of similar values on which the subtotal is based.\n                         \n                          For example, if the group of similar values is \"Minnesota\" and you enter \"Summary\" as the label text, the label reads \"Minnesota Summary.\" You can specify whether your custom label displays before or after the group name using the\n                          \n                           Subtotal Row\n                          \n                          >\n                          \n                           Label Position\n                          \n                          option.\n                         \n\n                          This property is available only when the\n                          \n                           Subtotal Row\n                          \n                          >\n                          \n                           Show Subtotal Rows\n                          \n                          checkbox is selected.\n                         \n\n\n\n                          Label Position\n                         \n                         — Specifies whether the word \"Total\" (or your custom label, if you specified one in\n                         \n                          Subtotals Row\n                         \n                         >\n                         \n                          Label\n                         \n                         ) comes before or after the name of the group of similar values on which the subtotals row is based. The default setting is\n                         \n                          After\n                         \n                         .\n                         \n                          For example, if the group name is \"Minnesota,\" the default label is \"Minnesota Total.\" If you then select\n                          \n                           Before\n                          \n                          , the label becomes \"Total Minnesota.\"\n                         \n\n                          This property is available only when the\n                          \n                           Subtotal Row\n                          \n                          >\n                          \n                           Show Subtotal Rows\n                          \n                          checkbox is selected.\n                         \n\n\n\n                          Fill Color\n                         \n                         — Allows you to select a background color for the subtotal rows in your table. If you select\n                         \n                          Default\n                         \n                         , no color is used. This property is available only when the\n                         \n                          Subtotal Row\n                         \n                         >\n                         \n                          Show Subtotal Rows\n                         \n                         checkbox is selected.\n                         \n\n\n\n\n\n\n\n\n                          Font Color\n                         \n                         — Allows you to select the text color for the content in your subtotal rows. This color overrides the table font color set in\n                         \n                          General\n                         \n                         >\n                         \n                          Font Color\n                         \n                         .\n                         \n                          For example, if you set the general font color to blue and the subtotal row font color to red, the subtotal row font color displays as red instead of blue. If you then select\n                          \n                           Default\n                          \n                          , the subtotal row color reverts to blue.\n                         \n\n                          This property is available only when the\n                          \n                           Subtotal Row\n                          \n                          >\n                          \n                           Show Subtotal Rows\n                          \n                          checkbox is selected.\n                          \n\n\n\n\n\n\n\n\n                          Font Style\n                         \n                         — Allows you to select the font style (bold, italic, bold-italic, or underline) for the text in the subtotal rows. The default setting is\n                         \n                          Bold\n                         \n                         , and this property is available only when the\n                         \n                          Subtotal Row\n                         \n                         >\n                         \n                          Show Subtotal Rows\n                         \n                         checkbox is selected.\n                         \n                          In the example below, the font style is\n                          \n                           Bold-Italic\n                          \n                          .\n                          \n\n\n\n\n\n\n\n\n                          Position\n                         \n                         — Allows you to specify whether your subtotal rows display after the rows to which they apply (default) or before them. This property can be applied only to Mega Tables.\n                        \n\n\n                          Show Subheader Rows\n                         \n                         — Adds subheader rows above the groupings in your unaggregated data rows. If you plan to include subheader rows in your table, we recommend that you set them apart using the\n                         \n                          Subheader Fill Color\n                         \n                         ,\n                         \n                          Font Color\n                         \n                         , and/or\n                         \n                          Font Style\n                         \n                         properties so that users can easily see them. This property can be applied only to Mega Tables.\n                        \n\n\n                          Subheader Fill Color\n                         \n                         — Allows you to select a background color for your subheader rows. For this to be available, you must enable subheader rows by selecting the\n                         \n                          Subtotal Row\n                         \n                         >\n                         \n                          Show Subheader Rows\n                         \n                         checkbox. By default, no background color is used. This property can be applied only to Mega Tables.\n                         \n                          In the example below, the subheader rows display with an orange background.\n                          \n\n\n\n\n\n\n\n\n                          Subheader Font Color\n                         \n                         — Allows you to select a color for the text in your subheader rows. For this to be available, you must enable subheader rows by selecting the\n                         \n                          Subtotal Row\n                         \n                         >\n                         \n                          Show Subheader Rows\n                         \n                         checkbox. The default color is black. This property can be applied only to Mega Tables.\n                         \n                          In the example below, the subheader rows display in red text.\n                          \n\n\n\n\n\n\n\n\n                          Subheader Font Style\n                         \n                         — Allows you to select a style (bold, italic, or both) for the text in your subheader rows. For this to be available, you must enable subheader rows by selecting the\n                         \n                          Subtotal Row\n                         \n                         >\n                         \n                          Show Subheader Rows\n                         \n                         checkbox. By default, no style is applied. This property can be applied only to Mega Tables.\n                         \n                          In the example below, the subheader rows display in bold and italic styling.\n                          \n\n\n\n\n\n\n\n\n                          Suppress Single Items Subtotals\n                         \n                         — Allows you to choose whether to hide subtotals when there is only one item in a group. This property can be applied only to Mega Tables.\n                        \n\n\n                        Alignment Properties\n                       \n\n\n\n                          Column 1-16\n                         \n                         — Allows you to select the text alignment (left, center, or right) for all desired columns in your table. We do not recommend using this property.\n                         \n                          Column numbers are based on the order of the table columns from left to right. For example, the third column from the left would be column 3.\n                         \n\n                          In the example below, the columns are centered.\n                          \n\n\n\n\n\n\n\n\n                        Attribute Properties\n                       \n\n\n\n                          Column 1-16\n                         \n                         — Allows you to select the font style (bold, italic, bold-italic, or underline) for all desired columns in your table. We do not recommend using this property.\n                         \n                          This property does not affect text in header rows. Column numbers are based on the order of the table columns from left to right. For example, the third column from the left would be column 3.\n                         \n\n                          In the example below, the two value columns display in italic styling.\n                          \n\n\n\n\n\n\n\n\n                        Theme Properties\n                       \n\n                        The following properties can be applied only to Mega Tables:\n                       \n\n\n\n                          Theme\n                         \n                         — Allows you to change the color theme for the values column in a Heat Map Table. For more information about configuring colors, see our article about\n                         \n                          Changing the Default Colors in Your Chart\n                         \n                         .\n                        \n\n\n                        Scale Properties\n                       \n\n                        The following properties can be applied only to Mega Tables:\n                       \n\n\n\n                          Use Log Scale\n                         \n                         — Uses a logarithmic scale for the ranges in a Heat Map Table.\n                        \n\n\n                          Independent Column Ranges\n                         \n                         — Applies ranges separately to each column in a Heat Map Table.\n                        \n\n\n                        Heat Map Properties\n                       \n\n                        The following properties can be applied only to Mega Tables:\n                       \n\n\n\n                          Color as Heat Map\n                         \n                         — Applies Heat Map coloring to the value cells in your table. Lighter or darker shades are applied based on where a particular value falls in the entire value range of a given column or across the entire chart (depending on the settings of other\n                         \n                          Heat Map Options\n                         \n                         properties).\n                         \n\n\n\n\n\n\n\n\n                          Theme\n                         \n                         — Allows you to change the color theme used when heat map coloring is enabled in your table. For more information about configuring colors, see our article about\n                         \n                          Changing the Default Colors in Your Chart\n                         \n                         .\n                        \n\n\n                          Independent Column Ranges\n                         \n                         — Allows you to specify whether the heat map coloring for columns is based on the entire range of values in the table (unchecked by default), or whether each column's range of values is considered separate from the others.\n                        \n\n\n                          Apply Heat Map to Columns\n                         \n                         — Allows you to specify which numeric columns in your table have heat map coloring. You specify the columns by their number in the table from left to right. You can use commas to indicate different columns or hyphens to indicate ranges of columns.\n                         \n                          For example, if you enter 2, 4-6 in this field, columns 2, 4, 5, and 6 have heat map coloring.\n                         \n\n\n\n                          Use Log Scale\n                         \n                         — Uses a logarithmic scale for Heat Map ranges.\n                        \n\n\n\n                         Video: Apply Formatting, Totals, and Subtotals to Table Cards\n                        \n\n\n\n\n\n\n\n\n                        Specify Column Labels\n                       \n\n                        You can change the label that displays for any column in your table.\n                       \n\n                        To change a column label, follow these steps:\n                       \n\n\n                         Select the column field in the\n                         \n                          Column\n                         \n                         region above the chart.\n                        \n\n                         In the\n                         \n                          Label\n                         \n                         field, enter your desired label.\n                        \n\n\n\n\n                        Set Formatting for Individual Columns\n                       \n\n                        In the column menus above your chart preview, you can customize the formatting for individual columns. Formatting options include:\n                       \n\n\n\n                          Justification\n                         \n                         — Choose left, center, or right justification for the text in a column.\n                        \n\n\n                          Style\n                         \n                         — Choose regular, bold, italic, or bold-italic text styling.\n                        \n\n\n                          Display As\n                         \n                         — Choose to display numerical values as plain numbers (default), currency, or percentages. If you choose\n                         \n                          Currency,\n                         \n                         you can select from four commonly used currency symbols, the number of decimal places, and whether to use a thousands separator. If you choose\n                         \n                          Percentage\n                         \n                         , you can specify the number of decimal places, whether to multiply values by 100, and whether to use a thousands separator.\n                        \n\n\n                          Date Format\n                         \n                         — Choose a predefined date format for a date column (date shorthand, full date, or YYYY-MM-DD) or create your own custom format by entering it in the\n                         \n                          Custom Format\n                         \n                         field. Both the\n                         \n                          Date Shorthand\n                         \n                         and\n                         \n                          Full Date\n                         \n                         options take your locale into account when they are used.\n                         \n                          For example, if your locale is Japan, a Japanese date format is automatically applied when you select one of these options. For a list of accepted date format specifiers, see the Macros section of our article about\n                          \n                           Changing the Date Format in Your Chart\n                          \n                          .\n                         \n\n\n\n                        To set column formatting, follow these steps:\n                       \n\n\n                         Select the column field in the\n                         \n                          Column\n                         \n                         region above the chart.\n                        \n\n                         Select\n                         \n                          Format\n                         \n                         , then set options as described above.\n                        \n\n\n\n\n                        Table Calculations\n                       \n\n                        Table calculations allow you to display a value in the table as a percent of column total, part of a running total, or how it ranks against other values in the column, all without using Beast Mode calculations or DataFlows. You can bring the same column of data to the top of the chart multiple times to compare the calculated values side by side.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Table calculations are only available for Mega Tables and Pivot Tables and are performed at the display time of the table.\n                          \n\n\n\n\n                        To use table calculations, select the column you want to configure above the chart preview to display the column menu.\n                        \n\n\n\n\n\n                        In the column menu, select the\n                        \n                         Show value as\n                        \n                        field to display the list options. They are as follows:\n                       \n\n\n\n                          Actual value (default) —\n                         \n                         Displays the values in the column as their actual values. This is the default setting.\n                        \n\n\n                          % of column total —\n                         \n                         Displays the values for each record as the percentage of the column total, with all values adding up to 100 percent.\n                        \n\n\n                          Running total —\n                         \n                         Displays the values for each record as the running total of values in the record, with the final count for all values in the column in the final record.\n                        \n\n\n                          Ranks large to small —\n                         \n                         Gives each record in the column a relative rank compared with all values in the DataSet from large to small.\n                        \n\n\n                          Ranks small to large —\n                         \n                         Gives each record in the column a relative rank compared with all values in the DataSet from small to large.\n                        \n\n\n\n\n\n\n                        Set Total and Subtotal Options for Individual Columns\n                       \n\n                        In the column menus above your chart preview, you can set options for totals and subtotals cells for a given column. The options that you can set include:\n                       \n\n\n\n\n                           Total/Subtotal Aggregation\n                          \n                          — You can choose how the values in your selected column are calculated to produce total and/or subtotal values. By default, the values are summed. You can also choose from\n                          \n                           Minimum\n                          \n                          (takes the lowest value from the column),\n                          \n                           Maximum\n                          \n                          (takes the highest value),\n                          \n                           Average\n                          \n                          (averages all of the values in the column),\n                          \n                           Count\n                          \n                          (counts the number of values in the column),\n                          \n                           Median\n                          \n                          (the value in the middle of the column) and\n                          \n                           Std.Deviation\n                          \n                          (the average amount of variability in the column).\n                         \n\n\n\n\n                           Data Label\n                          \n                          — Enter the label for your column in this field.\n                         \n\n\n\n\n                           Show value as\n                          \n                          — You can choose how the values in your column display. By default, the\n                          \n                           Actual value\n                          \n                          is shown.\n                         \n\n\n\n\n\n                       To set totals and subtotals options for a column, follow these steps:\n                       \n\n                         Select the column field in the\n                         \n                          Column\n                         \n                         region above the chart.\n                        \n\n                         Select\n                         \n                          Subtotal/Total\n                         \n                         , then set options as described below:\n                         \n\n\n                            Hide Total —\n                           \n                           When you select this checkbox, the cells for the column in all total rows are left blank.\n                          \n\n\n                            Hide Subtotal —\n                           \n                           When you select this checkbox, the cells for the column in all subtotal rows are left blank.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you use Beast Mode calculations in a Table Card that contains either COUNT (DISTINCT), SUM (DISTINCT), or division calculations, the subtotal/total rows will not necessarily match the SUM of those same values in the card for that Beast Mode column. This is because Beast Mode calculations are performed on a row-by-row basis, whereas subtotal rows are calculated on the entire grouping and totals rows are calculated on the entire DataSet.\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Set a Custom Table Size\n                       \n\n\n\n                          Video: Custom Table Sizing\n                         \n\n\n\n\n\n\n\n\n                        For more information about customizing the size of charts, see our article about\n                        \n                         Changing the Size of Cards on a Dashboard\n                        \n                        .\n                       \n\n\n\n                          Video: Apply Formatting, Totals, and Subtotals to Table Cards\n                         \n\n\n\n\n\n\n\n\n\n                        Understanding Row Limits\n                       \n\n                        The maximum number of rows visible in a Table Card depends on how many columns are selected. See the table below for examples.\n                       \n\n\n\n\n                           Number of columns selected\n                          \n\n                           Number of visible rows\n                          \n\n\n\n\n\n                           1\n                          \n\n                           5000\n                          \n\n\n\n                           2\n                          \n\n                           4999\n                          \n\n\n\n                           3\n                          \n\n                           3333\n                          \n\n\n\n\n                        Your version of Excel may also limit the number of rows and columns you can import from Domo.\n                       \n\n\n                         If you are using Excel 2003, the limits are 65,536 rows and 256 columns.\n                        \n\n                         If you are using Excel 2007 or later, the limits are 1,048,576 rows and 16,384 columns.\n                        \n\n\n                        Excel cannot handle more than 1,048,576 rows and 16,384 columns; this is the maximum you can have in a worksheet, whether it is Excel or CSV data.\n                       \n\n                        If an export from Domo exceeds the above number of rows, not all of your data will transfer to Excel. This is a limitation set by Excel, and regardless of this limitation or row size, Domo will export everything you have. It is then up to you to find a program that will allow you to open or view this data.\n                       \n\n\n\n                        FAQ\n                       \n\n\n                         Data in my table is missing or does not match the summary number.\n                        \n\n\n                        You may have a card where the summary number for the sum of the \"Value1\" column is 7, but your table has only 3 rows with values totaling 6. Why is there a difference?\n                       \n\n                        This is most likely due to the formatting of certain columns. If you have an aggregated column, every other non-aggregated column must have a \"Group by\" applied to it to get the correct result. If there are duplicate rows, they are omitted because of the grouping. However, the summary number does not take these groupings into account, which is why the number is different.\n                       \n\n                        To align the values, you must separate the aggregated columns OR aggregate the column in the table that is the same column from which the summary number is derived.\n                       \n\n\n                         What is the maximum number of columns I can add to my table?\n                        \n\n\n                        The maximum number of columns you can add to a Table Card is 100.", "Preview Article": "Click here to preview", "URL Name": "360043429573", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004669", "Archived Date": "", "Language": "English", "Primary Version": "Table Chart", "Article Total View Count": "8,207", "": "", "Article Created Date": "10/24/2022, 10:20 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Table Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}