{"file_path": "../../raw_kb_v2\\article\\360043439713\\index.html", "content": {"title": "\n\n\n August 2018 Release Notes\n\n\n", "article_body": "\n\n\n New Features and Enhancements\n--------------------------------\n\nFeatures and enhancements in this release include the following:\n\n##\n Updated Buzz\n\nTurn conversations into action with the updated Buzz. Experience a simpler and cleaner way to communicate about data with a clear focus on moving conversations into action. Collaborate on data with every necessary person, no matter his or her device or location. Turn conversations and data into tasks and track them to completion. Flag messages for follow-up when you’re ready. And thanks to focused and clear notifications, never miss out on a conversation you care about or a decision you need to make.\n\n\n The latest release of Buzz includes all of the following:\n\n A simplified navigation menu for quickly locating recent conversations as well as those you have added as Favorites.\n\n\n* The ability to flag important messages for later, then open them in a special pane so you can take action on them.\n* A new\n **Discover**\n pane that shows you trending topics, online users, messages that have had the most reactions, and recent conversations.\n* A greatly improved keyword search that identifies results based on conversation title, member name, or message content.\n\nFor more information about the layout of the new Buzz, see\n\nChatting in Buzz\n\n.\n\n##\n Data Tab in Data Center\n\nA new\n **Data**\n tab is available when you open the details page for a DataSet in the Data Center. This tab empowers you to view and manipulate your DataSet data in ways you never could before, including reordering columns, viewing Domo-generated metrics about your DataSet usage, searching and filtering columns, and more.\n\n\n The\n **Data**\n tab consists of three subtabs, as follows:\n\n The\n **Table**\n subtab lets you see all of the columns in your DataSet. Options are available for searching, sorting, and filtering so you can find the data you need.\n* The\n **Schema**\n subtab lets you reorder the columns in your DataSet, add descriptions and tags, etc.\n* The\n **Stats**\n subtab lets you view Domo-generated statistics for the columns in your DataSet (i.e. DataSet Metrics). For numeric and date/date-time columns, you can correlate the columns against other numeric columns in the DataSet, and for text columns, you can see the highest aggregated values for the sum or count of any selected column.\n\nFor more information about the\n **Data**\n tab, see\n\nData Center Layout\n\n.\n\n##\n Ability to Add an Existing Card to a Page\n\nYou can now add any existing card to a page from that page, without leaving the page. With the new\n **Add Card**\n menu option, you can save time building your page and prevent multiple versions of the same card. Under the\n **Add Card**\n menu option, you can select\n **Add Card > Existing**\n to search for a Card from anywhere in Domo and immediately add it to your page.\n\n\n For more information, see\n\nAdding an Existing Card to a Page\n\n.\n\n##\n Mobile Table Cell Wrapping\n\nDomo's Mobile team has added support for text wrapping in tables while on the go from your iOS device.\n\n\n Connector API Change Announcements\n------------------------------------\n\nOther items our users should know about are as follows.\n\n##\n Google AdWords and DoubleClick Campaign Manager API Update\n\nTo our valued customers,\n\n\n**What is happening?**\n\n\n At Domo, we take pride in providing the industry leading, best time to value solution with an eco-system of over 500 connectors. We regularly review our connector offerings and make enhancements to provide a more robust experience for our customers. Today we are pleased to announce upcoming API updates to the Google AdWords and DoubleClick Campaign Manager connectors.\n\n\n**When will it happen?**\n\n\n August 20th.\n\n\n**How does this impact me?**\n\n\n You will be able to enjoy a better experience with these connectors.\n\n\n**What do I have to do?**\n\n\n There should be nothing you would need to do to take advantage of these enhancements. Nevertheless, please verify all your DataSets are working properly and reach out to us if you have any questions.\n\n##\n Salesforce API Change\n\nDue to Salesforce's changing API, on August 1st, Domo will be releasing new Salesforce and Salesforce Advanced connectors. These connectors will work in conjunction with a Salesforce managed package installed via the Salesforce App Store. The new version will enable Salesforce administrators to control who can use the Domo Salesforce connectors inside Salesforce, providing ease of administration and enhanced security.\n\n\n**Will my current DataSets continue to work?**\n\n\n Current Salesforce and Salesforce Advanced connector DataSets do not work in conjunction with the Salesforce managed package, and no dependencies need to be installed for the connector to function. Existing DataSets will continue to run until September 1st.\n\n\n**I want to create a new Salesforce DataSet. What should I do?**\n\n\n Beginning August 1st, any new DataSets created will require you to download the Salesforce managed package via the Salesforce App Store to properly function.\n\n\n**What will happen if I don't install the Salesforce managed package before September 1st?**\n\n\n Any Salesforce instance bringing data into Domo via the Salesforce or Salesforce Advanced connector will stop running until the Salesforce managed package is installed.\n\n\n For more information on how to download and install the Salesforce managed package, see\n\nInstalling Salesforce's Domo Connector Package\n\n.\n\n##\n Facebook API Change\n\nFacebook recently made a number of major changes to its API due to security issues. Our development team is doing all it can to address issues caused by these changes. If you run into any problems with your Facebook DataSets, please open a case with Domo Support.\n\n\n Getting Help\n--------------\n\nYou can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n\n***> Help Center****\n .\n\n\n If you have questions about Domo,\n\n search for a topic in the Help Center\n* train in Domo University at\n\nhttp://university.domo.com\n* search for training apps in the Appstore\n* get answers in the Domo Community at\n\nhttps://dojo.domo.com\n* contact Technical Support by entering a help ticket in the Domo Support Portal or by sending a Buzz message to\n\n/support\n\n.\n* reach out to your Domo Customer Success Manager or Technical Consultant\n\nIf you have feedback, please send it from within Domo (\n\n***> Feedback****\n ). Or send an email to\n\nproduct.feedback@domo.com\n\n.\n\n\n For more information about getting help, see\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043439713\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004429\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAugust 2018 Release Notes\n\n", "article_total_view_count": "\n\n\n 4,673\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:09 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "august_2018_release_notes", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "release_notes", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "archived_feature_release_notes", "url": "/s/topic/0TO5w000000Zan7GAC"}]}