{"file_path": "../../raw_kb_v2\\article\\360043427493\\index.html", "content": {"title": "\n\n\n FAQs\n\n\n", "article_body": "\n\n\n###\n General FAQs\n\nThis section contains general Domo FAQs and responses.\n\n####\n How do I reactivate Domo when my free trial period expires?\n\nPlease contact Sales at (\n\n801) 805-9500\n\nto get Domo reactivated.\n\n####\n How can I turn off daily alert summaries?\n\nDaily alert summaries include information about alerts for which you have opted to receive daily notifications, as well as updates about cards added as Favorites. You can turn off summaries for both of these in the Manage Notifications & Alerts screen. Access this screen by clicking your profile picture in the top right corner of Domo and selecting My Settings.\n\n\n To turn off summaries for favorited cards, uncheck the checkbox next to “Include updates about your favorite cards.”\n\n\n To turn off summaries for individual alerts, click\n **Notify Me**\n for the alert and uncheck\n **Daily**\n . If you want to turn off daily alert summaries entirely, you will need to uncheck this box for each alert with\n **Daily**\n enabled.\n\n\n For more information, see\n\nConfiguring Notification and Alert Settings\n\n.\n\n####\n Is there an ISO 27001 certification?\n\nWe have both the ISO/IEC 27001 and ISO/IEC 27018 certificates for information security management. See the\n\npress release\n\nfor more information.\n\n####\n How do Enhancement Requests progress?\n\nWhen an Enhancement Request is created, it is entered into a backlog of items for our dev team until it is chosen to be worked on for inclusion in an update. Prioritization of backlog items is based on a number of factors, including the perceived value that the enhancement would provide to a customer, and how many of our customers would likely utilize the added value. We do our best to be fair and give priority to items that will provide the greatest value to the greatest number of our customers.\n\n\n If you would like to submit an Enhancement Request to Domo, you can do so by selecting\n **Feedback**\n in the\n **More**\n menu and entering your request.\n\n####\n Why aren't my output DataSets from a DataFlow appearing as updated after I run the DataFlow?\n\n\n This is usually because the data has not actually changed—no update has occurred. Therefore, the DataSets do not show as updated.\n\n\n#####\n\n\n Where can I find documentation on using MySQL or Redshift Query Languages?\n\nA lot of our clients are novices with these languages, and they search our Knowledge Base for documentation on how to use each one.\n\n\n MySQL query language was developed by a company called MySQL AB. Documentation is provided here:\n\nhttp://dev.mysql.com/doc/refman/5.7/en/\n\nRedshift query language was developed by Amazon. Documentation is provided here:\n\nhttp://docs.aws.amazon.com/redshift/latest/dg/c\\_redshift-sql.html\n\n\n#####\n Is there a way to automate updating of my workplace hierarchy in Domo?\n\nOur public user API doesn't yet contain the attributes needed yet to build out the hierarchy, but we do have a utility we've used for many customers that could get you what you need.  In order to make this work, we need a DataSet that has the mapping of manager to employee.  If you are interested in acquiring that utility, please reach out to your CSM for more information.\n\n\n For information about the Org Explorer in Domo, see\n\nViewing and Entering Peers in Your Company Org Chart\n\n.\n\n##\n Specific FAQs\n\nUse these links to access FAQs for specific features in Domo.\n\nCard Building FAQs\n\n\n Beast Mode FAQs\n\n\n Sharing Content in Domo FAQs\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043427493\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004374\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFAQs\n\n", "article_total_view_count": "\n\n\n 5,483\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:45 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "faqs", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "getting_to_know_domo", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "support_resources", "url": "/s/topic/0TO5w000000ZaoIGAS"}]}