{"file_path": "../../raw_kb_v2\\article\\1500011337961\\index.html", "content": {"title": "\n\n\n Google BigQuery OAuth Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nGoogle BigQuery is a serverless, highly scalable, and cost-effective cloud data warehouse designed to help you make informed decisions quickly, so you can transform your business with ease. It's a cloud-based big data analytics web service for processing very large read-only data sets. Use Domo's Google BigQuery OAuth Writeback connector to securely export your data from a Domo DataSet into a BigQuery table. To learn more about the BigQuery API, go to\n\nhttps://cloud.google.com/bigquery/docs/reference/v2/\n\n.\n\n\n You export data to BigQuery in the Data Center. This topic discusses the fields and menus that are specific to the Google BigQuery OAuth Writeback connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nPrerequisites\n---------------\n\nTo configure this connector, you will need your Google account credentials (username and password).\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nConfiguring the Connection\n----------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Domo's Google BigQuery OAuth Writeback Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google BigQuery OAuth Writeback connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google accounts in Domo) to open the Google OAuth screen where you can enter your Google credentials. Once you have entered valid Google credentials, you can use the same account any time you go to set up a new Domo-Google BigQuery connection. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of the logged in Google account.\n\n\n###\n Details Pane\n\n\n This pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n|\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n BigQuery Project\n  |\n Select a project from the available list of projects.\n  |\n|\n BigQuery DataSet\n  |\n Select the BigQuery DataSet Name. Datasets are top-level containers that are used to organize and control access to your tables and views. A table or view must belong to a dataset, so you need to create at least one dataset before loading data into BigQuery.\n  |\n|\n BigQuery Table Name\n\n|\n Enter the BigQuery table name you want to send Domo data to. The table you indicate will be deleted and recreated with each run with the name entered here.\n  |\n|\n Input Domo DataSet ID\n  |\n\nEnter your Domo dataset ID (GUID) located in the dataset URL.\n\n\n Example:\n\nhttps://customer.domo.com/datasources/\n\n*aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee**\n /details/settings\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n When should I use this connector?\n\nThis connector will allow you to write data from Domo to BigQuery. It connects via a Domo defined Google app to support OAuth connections, so you'll need a valid username and password that has access to BigQuery. Once connected, you'll specify the location of the BigQuery Project and Table to write to.\n\n###\n What kind of credentials do I need to power up this connector?\n\nYou need your Google credentials (email address and password). Your Google account must have permissions to access the tables and data needed for the query.\n\n###\n How do I know that my login credentials are secure?\n\nThe login process uses the OAuth process, so your Google credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n How often can the data be updated?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nNone\n\n###\n How do I find the Input Dataset ID?\n\nYour Domo input dataset id is in the URL of the dataset you are exporting data from.\n\n\n Example:\n\nhttps://customer.domo.com/datasources/\n\n*aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee**\n /details/settings\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500011337961\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003998\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle BigQuery OAuth Writeback Connector\n\n", "article_total_view_count": "\n\n\n 4,720\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "google_bigquery_oauth_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}