{"file_path": "../../raw_kb_v2\\article\\000005059\\index.html", "content": {"Title": "Domo Sandbox: Linked Repositories", "Article Body": "Intro\n                       \n\n                        In Domo Sandbox, linked repositories allow you to migrate existing production dashboards and DataFlows to a development instance without making changes in production. Once in place, you can make changes in a controlled development location and then promote the changes to update production. Creating a linked repository is intended to be a one-time process for moving production content into a development environment. After you create a linked repository, we recommend only promoting from development to production.\n                        \n\n                        For more general information about Sandbox, see\n                        \n                         Domo Sandbox.\n                        \n\n\n                        Key Terms\n                       \n\n\n\n\n\n                            Term\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Production Instance\n                           \n\n\n\n                            The destination instance where the dashboards and/or DataFlows currently exist.\n                           \n\n\n\n\n\n                            Development Instance\n                           \n\n\n\n                            The source instance where the dashboards and/or DataFlows are populated and used as a source of Sandbox.\n                           \n\n\n\n\n\n                        Creating a Linked Repository\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Before creating a linked repository, ensure that relationships between instances are established. This is necessary when two instances are involved. To learn how to create instance relationships, see\n                           \n                            Domo Sandbox.\n                           \n\n\n\n\n\n\n\n                        1. Log into your production instance. In the navigation header, select\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                        \n                        The\n                        \n                         Admin Settings\n                        \n                        displays.\n                       \n\n                        2. Under\n                        \n                         Governance\n                        \n                        , select\n                        \n                         Sandbox\n                        \n                        .\n                       \n\n                        3. In the\n                        \n                         My Repositories\n                        \n                        tab, select\n                        \n                         + New Repository.\n                        \n\n\n\n\n                        4. Configure the repository:\n                       \n\n\n                         Name the repository.\n                        \n\n                         Select the\n                         \n                          Create as Linked Repository\n                         \n                         box.\n                         \n\n\n\n\n                         Select the\n                         \n                          Object Type\n                         \n                         being versioned.\n                        \n\n                         Choose the items you want to include in the repository\n                        \n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           By default,\n                           \n                            Create initial commit\n                           \n                           is selected. When the repository is saved, the first version is committed.\n                          \n\n\n\n\n                        5. Select\n                        \n                         Save Repository\n                        \n                        .\n                        \n                        The\n                        \n                         Share Access\n                        \n                        modal displays. You can share the linked repository with the development instance during this step or later. For more information, see the Instance Sharing heading of\n                        \n                         Domo Sandbox\n                        \n                        .\n                       \n\n                        6. In the list of\n                        \n                         Instances Without Access\n                        \n                        , find your development instance and change the permissions from\n                        \n                         No Access\n                        \n                        to\n                        \n                         Can Promote.\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Only instances with pre-configured relationships display. For information on inviting instances, see the Instance Relationships heading of\n                           \n                            Domo Sandbox.\n                           \n\n\n\n\n\n                        7. Select\n                        \n                         Close.\n                        \n\n                        The repository is stored in Sandbox in the\n                        \n                         My Repositories\n                        \n                        tab, and access is shared with the development instance.\n                       \n\n                        Committing the Linked Repository\n                       \n\n                        The initial commit occurs if specified while creating the repository.\n                       \n\n                        If no committed version exists, complete these steps after creating the repository:\n                       \n\n                        1. Log into your production instance. In the navigation header, select\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                        \n                        The\n                        \n                         Admin Settings\n                        \n                        displays.\n                       \n\n                        2. Under\n                        \n                         Governance\n                        \n                        , select\n                        \n                         Sandbox.\n                        \n\n\n                        3. Go to\n                        \n                         Repositories > My Repositories.\n                        \n\n\n\n\n\n                        4. Locate the repository and select\n                        \n                         Commit.\n                        \n\n\n                        5. Enter a description for the new version. By default, the new version is promoted. If you don't want the new version to be immediately available for promotion, uncheck the\n                        \n                         Allow this commit to be promoted\n                        \n                        box.\n                       \n\n\n\n\n                        6. Select\n                        \n                         Save\n                        \n                        .\n                        \n                        The process to capture and store the new version is initiated.\n                       \n\n                        Promoting and Linking the Repository\n                       \n\n                        1. Log into your development instance. In the navigation header, select\n                        \n                         More\n                        \n                        >\n                        \n                         Admin\n                        \n                        .\n                        \n                        The\n                        \n                         Admin Settings\n                        \n                        displays.\n                       \n\n                        2. Under\n                        \n                         Governance\n                        \n                        , select\n                        \n                         Sandbox\n                        \n                        .\n                       \n\n                        3. In the\n                        \n                         Shared Repositories\n                        \n                        tab, locate the linked repository. Select\n                        \n                         Assign Owner\n                        \n                        .\n                        \n                        The\n                        \n                         Assign Owner\n                        \n                        modal displays.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Linked repositories are indicated with\n                           \n                           next to the Repository Name.\n                          \n\n\n\n\n\n\n\n\n\n                        4. Enter the name of the owner. They can promote, delete, and share the repository.\n                       \n\n                        5. Select\n                        \n                         Save\n                        \n                        .\n                        \n                        After an owner has been assigned to the repository in the development instance, the\n                        \n                         Assign Owner\n                        \n                        button will be replaced with\n                        \n                         Promote.\n                        \n\n\n                        6. Locate the linked repository and select\n                        \n                         Promote.\n                        \n\n                        The repository's details display.\n                       \n\n                        7. (Conditional) Perform any necessary mappings and apply advanced settings, if applicable.\n                       \n\n                        8. Select\n                        \n                         Promote and Link.\n                        \n\n\n                        9. Enter a new repository name and review the information in the modal below.\n                       \n\n\n\n\n                        10. Select\n                        \n                         Promote and Link.\n                        \n\n\n                        This final step does the following:\n                       \n\n\n                         Promotes the repository in the development instance. This creates the objects in the development.\n                        \n\n                         Creates a new repository in the development instance with the name entered in Step 5. The new repository includes the objects created during the promotion and commits this new repository.\n                        \n\n                         Shares this repository with the production instance and allows production to promote this new repository.\n                        \n\n                         Maps this new repository to the existing production objects. This step is critical because it causes the production objects to be updated by this new repository.\n                        \n\n\n                        Verifying Success\n                       \n\n                        1. In the development instance, confirm that the newly created repository exists in the\n                        \n                         My Repositories\n                        \n                        tab.\n                       \n\n                        2. Confirm that the objects were promoted successfully. You may need to refresh your browser to load newly created objects.\n                       \n\n                        3. Ensure that the new repository was committed successfully.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           If there is an error in the process, Sandbox will undo any completed steps from the promotion and link, and you should not see a new repository.\n                          \n\n\n\n\n                        4. (Optional) Delete the original linked repository. Ongoing changes should be made in the development instance and promoted to production.\n                       \n                       5. Go back into the production instance and promote the repository that was created in the development instance. This does not create duplicate content as a typical repository would. Instead, it promotes on top of the original content since the content in development is mapped to the content in production.", "Preview Article": "Click here to preview", "URL Name": "000005059", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005059", "Archived Date": "", "Language": "English", "Primary Version": "Domo Sandbox: Linked Repositories", "Article Total View Count": "2,804", "": "", "Article Created Date": "11/14/2022, 8:13 PM", "First Published Date": "11/14/2022, 8:33 PM"}, "title": "\n              Domo Sandbox: Linked Repositories\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Governance Tools\n              \n", "url": "/s/topic/0TO5w000000ZannGAC"}]}