{"file_path": "../../raw_kb_v2\\article\\000005155\\index.html", "content": {"Title": "Circular Sankey Chart", "Article Body": "Intro\n                       \n\n                        The Sankey chart—often called a flow diagram—is a great way to illustrate flows, including flows of energy, materials, and web page paths. In addition to the flow of an item, the Sankey chart captures the relative size of the flow itself by changing the line width from node to node. For more information, see our\n                        \n                         Sankey Chart\n                        \n                        article.\n                       \n\n                        Sankey charts consist of nodes, or end points, and colored arrows or lines. See below for a simple Sankey chart.\n                       \n\n\n\n\n                        The original Sankey chart is ideal for physical flows that go to a destination once per flow, like energy and materials. However, it's not ideal for recursive concepts like web traffic, where flows need to circle back to previous nodes and require special treatment to display properly. To meet these needs, Domo has created the circular Sankey chart.\n                       \n\n                        The following image emphasizes the chart's circular reference:\n                       \n\n\n\n\n                        Powering Circular Sankey Charts\n                       \n\n                        A circular Sankey chart requires each of the following:\n                       \n\n\n\n                          A `From` dimension\n                         \n                         — The source of the flow.\n                        \n\n\n                          A `To` dimension\n                         \n                         — The destination of the flow.\n                        \n\n\n                          A value\n                         \n                         — The size of the flow.\n                        \n\n                       For information about value, category, and series data, see our\n                       \n                        Understanding Chart Data\n                       \n                       article.\n                       \n                        In Analyzer, you can choose the columns containing the data for your circular Sankey chart. For more information about choosing data columns, see our article about\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        The following image shows how data from a typical column-based spreadsheet is converted into a circular Sankey chart:\n                       \n\n\n\n\n                        Customizing Circular Sankey Charts\n                       \n\n                        You can customize the appearance of a circular Sankey chart in several ways, many of which are possible with the\n                        \n                         Chart Properties\n                        \n                        tool. For more information, see our\n                        \n                         Chart Properties\n                        \n                        article.\n                       \n\n                        Some unique properties of circular Sankey charts are shown in the following table:\n                       \n\n\n\n\n\n                            Property\n                           \n\n\n\n                            Description\n                           \n\n\n\n                            Example\n                           \n\n\n\n\n\n\n\n                            General > Value Format\n                           \n\n\n\n                            Determines whether currency symbols are appended to values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Percent Value Decimal Places\n                           \n\n\n\n                            Determines the number of decimal places in percent values.\n                           \n\n\n\n                            —\n                           \n\n\n\n\n\n                            General > Layout method\n                           \n\n\n\n                            Allows you to select different layouts for your Sankey data. You can see which one works best for your data.\n                           \n\n\n\n\n\n\n\n\n\n\n                            General > Hide Circular\n                           \n\n\n\n                            Allows you to hide circular references in the chart.\n                           \n\n                            When you select this checkbox, the chart handles recursion but doesn't display the loops back.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Node Options\n                           \n\n\n\n                            Allows you to set the fill and border colors for nodes.\n                           \n\n\n\n\n\n\n\n\n\n\n                            Flow Options\n                           \n\n\n\n                            Allows you to set the fill and border colors for flows.", "Preview Article": "Click here to preview", "URL Name": "000005155", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005155", "Archived Date": "", "Language": "English", "Primary Version": "Circular Sankey Chart", "Article Total View Count": "1,117", "": "", "Article Created Date": "3/13/2023, 6:55 PM", "First Published Date": "3/13/2023, 7:42 PM"}, "title": "\n              Circular Sankey Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}