{"file_path": "../../raw_kb_v2\\article\\4409045382935\\index.html", "content": {"Title": "July 2021 Release Notes", "Article Body": "New features and enhancements\n                       \n\n                        Features and enhancements in this release include the following:\n                       \n\n                        DataSet Views\n                       \n\n                        Improvements and new additions have been added to the DataSet Views feature.\n                       \n\n                        Unions in Views\n                       \n\n                        DataSet Views now has the option of doing a Union with your data, not just a Join. This makes it easy to explore, wrangle, and combine your data in a simple interface. For more information, see\n                        \n                         DataSet Views\n                        \n                        .\n                       \n\n\n\n\n                        Views in Analyzer\n                       \n\n                        DataSet Views have been integrated inside of Analyzer, allowing for light-weight ETL data changes while visualizing the data. You can now do the following, all without leaving Analyzer:\n                       \n\n\n                         Join another DataSet.\n                        \n\n                         Clean up the data by renaming columns, removing columns, and changing the data type.\n                        \n\n                         Create nested Beast Modes.\n                        \n\n\n                        For more information, see\n                        \n                         Analyzer and DataSet Views Integration\n                        \n                        .\n                       \n\n\n\n\n                        Advanced Tools Launch Center\n                       \n\n                        With the Advanced Tools Launch Center, you are now able to explore all the data tools Domo has to offer in one convenient place. Each tool has a link to more information and where to get started in the product. For more information, see\n                        \n                         Advanced Tools Launch Center\n                        \n                        .\n                       \n\n\n\n\n                        Workbench 5.1 Enhancements\n                       \n\n                        New and exciting features have been added to Workbench 5.1.\n                       \n\n                        Workbench Partition Support\n                       \n\n                        Workbench 5.1 now offers partition support. Partitions uniquely identify sections of data, and each section can be replaced with a new version. This is a faster and cleaner way to update the data. For more information, see\n                        \n                         Workbench 5.1 Partition Support\n                        \n                        .\n                       \n\n\n\n\n                        Enhanced Schema Protection in Workbench\n                       \n\n                        In Workbench 5.1 we have added enhanced schema protections in that have more flexible options, letting you choose when to allow schema changes and on which columns, or to block all schema changes completely. These new updates give you confidence and peace of mind that schema changes will only happen when you want them to. For more information, see\n                        \n                         Workbench 5.1\n                        \n                        .\n                       \n\n\n\n\n                        Bulk Actions in Workbench\n                       \n\n                        Workbench 5.1 now allows you to perform bulk actions which make it possible to do actions on multiple jobs at the same time. Examples include:\n                       \n\n\n                         Executing multiple jobs.\n                        \n\n                         Bulk exporting jobs.\n                        \n\n                         Updating credentials on multiple jobs connecting to the same database.\n                        \n\n                         Saving edits when you have been editing multiple jobs at a time.\n                        \n\n\n                        For more information, see\n                        \n                         Workbench 5.1\n                        \n                        .\n                       \n\n                        Take over Connector DataSets with Workbench\n                       \n\n                        Workbench 5.1 allows Workbench to take over and begin updating DataSets that were originally created by a Connector. For more information, see\n                        \n                         Workbench 5.1\n                        \n                        .\n                       \n\n                        Local Workbench Scheduling\n                       \n\n                        In Workbench 5.1 you can now schedule your Workbench job to trigger based on the local time of your server/Workbench machine. When the local time on your machine changes for Daylight Savings, the Workbench job schedule will automatically sync with the time on your machine. For more information, see\n                        \n                         Workbench 5.1\n                        \n                        .\n                       \n\n\n\n\n                        Database specific plugins in Workbench\n                       \n\n                        In Workbench 5.1, Workbench will read data types directly from the source system for specific databases. This eliminates any inconsistency between the two, and any chance the data type will change in Workbench after the schema has been set unless the type changes in the source system. For more information, see\n                        \n                         Workbench 5.1\n                        \n                        .\n                       \n\n\n\n\n                        Python and R SDK enhancements\n                       \n\n                        The R and Python SDK's have been updated to use the same function naming for both languages and to have the same functions available in each. For more information, visit\n                        \n                         https://developer.domo.com/docs/domo-sdks/sdks\n                        \n                        .\n                       \n\n                        Filter Views\n                       \n\n                        Filter Views allow you to customize a single Dashboard to meet the needs of all audiences.\n                       \n\n                        With Filter Views you can:\n                       \n\n\n                         Save personalized Views that only you see.\n                        \n\n                         Curate and share important Views to create alignment on a specific perspective.\n                        \n\n                         Provide any number of personalized data stories for any person in any role.\n                        \n\n                         Designate which saved Filter View is the “default” for a Dashboard.\n                        \n\n\n                        For more information, see\n                        \n                         Applying Page Level-Filters and Filter Views\n                        \n                        .\n                       \n\n\n\n\n                        Dashboard Filter enhancements\n                       \n\n                        New features have been added to help you control how your users view the data.\n                       \n\n                        Filter exclusions on Stories\n                       \n\n                        With Filter exclusions, you now have the option to exclude certain Filters from affecting a particular Card. For more information, see\n                        \n                         Applying Page-Level Filters with Filter Views\n                        \n                        .\n                        \n\n\n\n\n                        Aggregations in Filters\n                       \n\n                        With the addition of Aggregated Filters, you are now able to filter on an aggregated column value. Aggregated Filters are available to be used everywhere Filters are applied: inside the Analyzer, as a Quick Filter, on the Card Details page, and on a Dashboard. For more information, see\n                        \n                         Aggregated Filters\n                        \n                        .\n                       \n\n\n\n\n                        Dynamic Date Dashboard Filters\n                       \n\n                        Dynamic Date Range Filters allow you to adjust the date range window for all the Cards on a Page. Dynamic Date Range Filters can be a huge time-saver, since users do not need to manually apply Filters to see data for a given date or time range. Also, with Dynamic Date Range Filters, the date range data for your Cards automatically \"rolls over\" when the current period ends. For more information, see\n                        \n                         Applying Page-Level Filters with Filter Views\n                        \n                        .\n                       \n\n\n\n\n                        Page Filter settings\n                       \n\n                        With Page Filter settings, you can now customize how your users interact with Cards on your Dashboard. You can toggle off\n                        \n                         Allow adding of new filters\n                        \n                        to have users only use Card interactions to filter. You can also turn off Date Filters if your Dashboard is built to look at a specific time frame. For more information, see\n                        \n                         Applying Page Level-Filters and Filter Views\n                        \n                        .\n                        \n\n\n\n\n                        Segments\n                       \n\n                        The Segments feature allows you to create better comparisons of a Segment versus another group. It also allows you to dynamically filter one item and not have the filter impact the Segment so that you can compare the two results. You can add a Segment to any multi-series chart, period over period chart, or multi-value chart. You can also add Segments to the Card Details view of a Card and to Dashboards. For more information, see\n                        \n                         Creating Segments in Analyzer\n                        \n                        .\n                       \n\n\n\n\n                        Portuguese and Dutch language support\n                       \n\n                        Domo has added Portuguese and Dutch language support for your instance. This can be done in both the Company Settings and in the individual User Settings. For more information on setting this feature at the Company level, see\n                        \n                         Setting Your Time Zone and Regional Formatting\n                        \n                        .\n                       \n\n\n\n\n                        Mobile pfilter support within the app\n                       \n\n                        Pfilters are now supported inside of the Domo Mobile app. Supported pfilter examples are:\n                       \n\n\n                         Custom Apps that have pfilters.\n                        \n\n                         CONCAT Beast Modes with links.\n                        \n\n                         Custom Card interactions with links.\n                        \n\n                         Links that originate from outside of the Domo app will now open the Domo app with the Filters applied.\n                        \n\n\n                        For more information, see\n                        \n                         Sample Beast Mode Calculations: Miscellaneous Transforms\n                        \n                        .\n                       \n\n                        New Chart Properties\n                       \n\n                        We have added new Chart Properties to make your visualizations even more dynamic.\n                       \n\n                        Multi-Dimension Tree Maps\n                       \n\n                        Treemaps now have more dimensions to analyze your business. Instead of just having an item and a value, you can have nested Tree Maps in a Tree Map. For example, now you can see not only products and their associated sales in a Tree Map but visualize product sales by category and by division in a three-level nested Tree Map. For more information, see\n                        \n                         Tree Map\n                        \n                        .\n                        \n\n\n\n\n                        Color Rules on Line Charts\n                       \n\n                        You can now create Line charts that apply Color Rules to each point on the line individually. You can set it to change the color when it is above, below, or between certain thresholds. This makes it a breeze to see the data and understand the performance at a glance. For more information, see\n                        \n                         Line Chart\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You must have Symbols enabled on your chart for the Color Rules to apply.\n                          \n\n\n\n\n\n\n\n                        Right to Left Bar Charts\n                       \n\n                        In Horizontal Bar charts, you can now position the bars on the right side of the chart. Selecting the right side orientation adjusts the labels, bars, and annotations to be aligned on the right side of the chart. This gives you a powerful combination when you want to layout your custom story with some charts aligned to the right side and can easily be coupled with left side oriented charts for new visual insights. For more information, see\n                        \n                         Bar Chart\n                        \n                        .\n                        \n\n\n\n\n\n\n                        Asset Library Redesign\n                       \n\n                        The Asset Library page has been enhanced with new navigational features that allow users to find applications and view information more efficiently. For more information, see\n                        \n                         Asset Library\n                        \n                        .\n                        \n\n\n\n\n                        Group Ownership of Cards and Pages\n                       \n\n                        With group ownership of Cards and Pages, you can now create a group of users you would like to be able to edit a Card/Page and add the group as an owner of the Card/Page. Then, when you lock the Card/Page, only the users in the group will be able to edit it. For more information on Group ownership of Cards, see\n                        \n                         Managing Pages\n                        \n                        .\n                       \n\n\n\n\n                        Group Ownership DomoStats Report\n                       \n\n                        With the new Group Ownership of Pages functionality, we have added the new\n                        \n                         Pages with Multiple Owners\n                        \n                        report in our DomoStats Connector. This allows you to see the information about the Page, broken out by each owner. For more information, see\n                        \n                         DomoStats Connector\n                        \n                        .\n                       \n\n                        Enterprise People Management\n                       \n\n                        With enterprise people management, you can now view all users and their profile information on a single page. You can also bulk update attributes for all users. For more information, see\n                        \n                         Admin Settings Layout\n                        \n                        .\n                        \n\n\n\n\n                        Premium features\n                       \n\n                        These features are available on demand and paid. To request these features be enabled, reach out to your Domo Customer Success Manager, Technical Consultant, or Account Executive. If you do not have contact information for your CSM, TC, or AE, contact Technical Support. For information on how to contact Support, please see\n                        \n                         Getting Help\n                        \n                        . Depending on the feature, you may be required to complete training before you can use the feature.\n                       \n\n                        Left Nav in Publication Groups\n                       \n\n                        Publication Groups will now display the same navigation that is currently displayed in the regular instance of Domo. They will now have the collapsible menu that prioritizes Dashboard content and improved UI for quickly navigating between Dashboards. This allows for consistent UI navigation no matter where you use Domo. For more information, see\n                        \n                         New Navigation Announcement\n                        \n                        .\n                        \n\n\n\n\n                        Domo Everywhere\n                       \n\n                        We have added new features to the Domo Everywhere experience.\n                       \n\n                        Page Filters in Dashboard Embed\n                       \n\n                        With Page Filters in Dashboard Embed, you are now able to add the same filters you use in your Domo instance inside of your embedded Dashboard. For more information, see\n                        \n                         Page Filters in Dashboard Embed\n                        \n                        .\n                       \n\n\n\n\n                        Domo Everywhere Launch Center\n                       \n\n                        With the Domo Everywhere Launch Center, you can quickly learn how leading customers are using each version of Domo Everywhere. This allows you to choose the right Domo Everywhere product for your needs. For more information, see\n                        \n                         Domo Everywhere Launch Center\n                        \n                        .\n                       \n\n\n\n\n                        Getting help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n                        in the top navigation bar.\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://domo.com/university/\n                          \n\n\n\n\n                          search for training apps in the Appstore\n                         \n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n                         More\n                        \n\n\n                          > Feedback\n                         \n\n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "4409045382935", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004417", "Archived Date": "", "Language": "English", "Primary Version": "July 2021 Release Notes", "Article Total View Count": "11,686", "": "", "Article Created Date": "10/24/2022, 9:48 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              July 2021 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}