{"file_path": "../../raw_kb_v2\\article\\360043428713\\index.html", "content": {"title": "\n\n\n Applying DataSet Columns to Your Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe most important task in constructing a chart is selecting category (dimension), value (metrics), and series data from columns in a DataSet to power that chart. All chart types except tables, heat map tables, calendars, and Gantt charts require value (or numerical) data, and most require category and series data. For more information about these data types, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, all columns in the DataSet are divided into two groups:\n **Dimensions**\n and\n **Measures**\n . For any given chart type, one or more fields appear. These fields contain the names of regions or elements within the chart. For the chart to be powered up, data columns must be applied to the appropriate fields. To apply a column to your chart, you drag it from its group to the desired field in the chart. For example, a percent of total chart is accompanied by two fields—\n **Bar Name**\n and\n **Bar Value.**\n To power up this chart, you would drag a category (dimension) column into the\n **Bar Name**\n field and a value (measure) column into the\n **Bar Value**\n field.\n\n\n The number of required fields differs between chart types. Some chart types have only two, while others may have seven or more. Many chart types also have optional fields. For example, single bar charts do not require a series column, but you can add one if you want (in which case, the chart is no longer a single bar chart, but a multi-bar chart such as a grouped or stacked bar chart). For tables and heat map tables, only one column is required but you can add as many as you want, without regard to data type.\n\n\n Many chart types allow you to add additional series beyond what is required for the chart if the columns are aggregated. This produces a \"trellis chart,\" in which additional dimensions are represented as boxes in the chart. You can also do this with date columns using \"Tiered Dates\"—this allows you to incorporate multiple time periods in a single view.\n\n\n A preview of the chart appears when appropriate columns have been dragged into each field. If you change a column in a field, the preview changes accordingly.\n\n\n When you power a new Card, Domo builds an initial chart, depending on your data, by automatically selecting a chart type, filling in the required fields, and choosing a date grain (if available). For example, if your DataSet contained a value column, a category column, and a series column, Domo might initially build a preview of a vertical stacked bar chart. You can change these automatic selections if you want.\n\n\n When you drop a column name in a field, a panel opens with additional options you can apply to the data in the associated column. The options available for a column depends on the data type of the column and the chart type. For example, a value column in a stacked bar chart opens a pane with options for changing the goal, label, and number format, whereas a category column shows only the label option.\n\n\n If you drag a column onto a field that already contains a column, the new column replaces the old one.\n\n\n If you apply a column with PDP restrictions to a chart, you see only data permitted by your policy. However, if you were to save the chart, a viewer not restricted by that policy would see all of the data. For more information about PDP, see\n\nCreating and Deleting PDP Policies\n\n.\n\n\n For more information about the Analyzer, see\n\nAnalyzer Layout\n\n.\n\n\n For more information about the specific requirements for each chart type, see\n\nChart Types\n\n.\n\n\n Choosing a category column\n----------------------------\n\nCategory data is the data being measured in your chart. To apply category data to your chart, you drag a column from the\n **Dimensions**\n group into the desired field.\n\n\n**Tip:**\n If the column names in the left-hand pane are too long to read, you can expand them by clicking and dragging the border on the right side of the pane.\n\n\n For example, in the chart below, the creator wanted to measure the rental prices of five condominium complexes, so she dragged the\n **Condominium Park**\n column into the\n **X Axis**\n field. These items are then represented along the horizontal axis.\n\nIn charts where information is recorded over time, the column with the date and/or time data is usually applied as the category.\n\n\n You typically apply category columns to a chart by dragging them into the\n **X Axis**\n field. However, in some chart types, the fields into which you typically drag category columns have different names:\n\n\n Chart type\n  |\n Field where category data is usually applied\n  |\n| --- | --- |\n|\n Most vertical bar charts, all horizontal line charts, all vertical area charts, all vertical lollipop charts, stream, vertical symbol, vertical symbol overlay\n  |\n**X Axis**\n |\n|\n Most horizontal bar charts, all vertical line charts, all horizontal area charts, all horizontal lollipop charts, category scatter, stream funnel\n  |\n**Y Axis**\n |\n|\n Vertical percent of total, horizontal percent of total\n  |\n**Bar Name**\n |\n|\n Pie, nautilus\n  |\n**Pie Name**\n |\n|\n Funnel, folded funnel, funnel bar\n  |\n**Funnel Section Name**\n |\n|\n Donut, nautilus donut\n  |\n**Donut Slice Name**\n |\n|\n Pareto\n  |\n**Pareto Name**\n |\n|\n Radar, histogram\n  |\n**Category Names**\n |\n|\n Vertical bullet, horizontal bullet\n  |\n**Names**\n |\n|\n US map, Australia map, Germany map, Austria map, Brazil map, India map, Malaysia map, Nigeria map\n  |\n**State Name**\n |\n|\n Japan map\n  |\n**Prefecture Name**\n |\n|\n Canada map, China map, Indonesia map, Panama map, South Korea map, Spain map\n  |\n**Province Name**\n |\n|\n New Zealand map, United Kingdom map\n  |\n**Division Name**\n |\n|\n Chile map, France map, Ghana map, Italy map\n  |\n**Region Name**\n |\n|\n Peru map\n  | **Department Name**  |\n|\n Portugal map\n  | **District Name**  |\n|\n Switzerland map\n  | **Canton Name**  |\n|\n UAE map\n  | **Emirate Name**  |\n|\n Mexico map\n  | **State Code/Name**  |\n|\n World map, all continental and regional maps\n  |\n**Country Code/Name**\n |\n|\n Heat map\n  |\n**Category 1**\n*and*\n**Category 2**\n (Heat maps require two category columns)\n  |\n|\n TreeMap\n  |\n**TreeMap Name**\n |\n|\n Radial gauge, filled gauge, face gauge, progress bar gauge\n  |\n**Gauge Name**\n |\n|\n Word cloud\n  |\n**Word Names**\n |\n|\n Gantt, candlestick, high low\n  |\n**Category**\n (\n *optional*\n*in Gantt charts*\n )\n  |\n|\n Vertical waterfall, Horizontal waterfall\n  |\n**Summary Group**\n*and*\n**Item Names**\n (Waterfall charts require two category columns)\n  |\n|\n Vertical box plot, Horizontal box plot\n  | **Category Names**  |\n|\n All data science charts, table, heat map table\n  |\n None\n  |\n\nChoosing a value column\n-------------------------\n\nThe specific measurements or metrics in your chart constitute value data. To apply value data to your chart, you drag a column from the\n **Measures**\n group into the desired field above the chart.\n\n\n**Tip:**\n If the column names in the left-hand pane are too long to read, you can expand them by clicking and dragging the border on the right side of the pane.\n\n\n For example, in the Monthly Rental Prices chart, the creator wanted to assign the monthly rental prices as the values, so she dragged the \"Price per Month\" column into the\n **Y**\n**Axis**\n field. These items are then represented along the vertical axis.\n\nYou usually apply value columns to a chart by dragging them into the\n **Y Axis**\n field. However, in some chart types, the fields into which you typically drag category columns have different names:\n\n\n Chart type\n  |\n Menu with value data\n  |\n| --- | --- |\n|\n Most horizontal bar charts, all vertical line charts, all horizontal area charts, all horizontal lollipop charts, category scatter, stream funnel\n  |\n**X Axis**\n |\n|\n Most vertical bar charts, all horizontal line charts, all vertical area charts, all vertical lollipop charts, stream, vertical symbol, vertical symbol overlay\n  |\n**Y Axis**\n |\n|\n Vertical percent of total, horizontal percent of total\n  |\n**Bar Value**\n |\n|\n Pie, nautilus\n  |\n**Pie Value**\n |\n|\n Funnel, folded funnel, funnel bar\n  |\n**Funnel Section Value**\n |\n|\n Donut, nautilus donut\n  |\n**Donut Slice Value**\n |\n|\n Pareto\n  |\n**Pareto Value**\n |\n|\n Radar\n  |\n**Radar Values**\n |\n|\n Vertical bullet, horizontal bullet\n  |\n**Actual Value**\n |\n|\n US map, Australia map, Germany map, Austria map, Brazil map, India map, Malaysia map, Nigeria map\n  |\n**State Value**\n |\n|\n Japan map\n  |\n**Prefecture Value**\n |\n|\n Canada map, China map, Indonesia map, Panama map, South Korea map, Spain map\n  |\n**Province Value**\n |\n|\n New Zealand map, United Kingdom map\n  |\n**Division Value**\n |\n|\n Chile map, France map, Ghana map, Italy map\n  |\n**Region Value**\n |\n|\n Peru map\n  | **Department Name**  |\n|\n Portugal map\n  | **District Name**  |\n|\n Switzerland map\n  | **Canton Name**  |\n|\n UAE map\n  | **Emirate Name**  |\n|\n Mexico map\n  | **State Code/Name**  |\n|\n World map, all continental and regional maps\n  |\n**Country Value**\n |\n|\n Heat map, vertical and horizontal waterfall\n  |\n**Value**\n |\n|\n TreeMap\n  |\n**TreeMap Value**\n |\n|\n Radial gauge, filled gauge, face gauge, progress bar gauge\n  |\n**Gauge Value**\n |\n|\n All data science chart types\n  |\n**X Axis**\n*and*\n**Y Axis**\n (these chart types have two value scales)\n  |\n|\n Word cloud\n  |\n**Word Values**\n |\n|\n Table, heat map table, Gantt, box plot\n  |\n None\n  |\n\nChoosing a series column or row\n---------------------------------\n\nA data series is a component in a category. Most chart types require series data. For example, in a vertical grouped bar chart, each \"set\" of bars is a category, and each bar in a set is a series. Series in a chart are often represented in a legend. Typically, to apply a series you drag textual (non-date-time) columns from the\n **Dimensions**\n grouping into the\n **Series**\n field. However, you can set date-time and value columns as series if you want. This is discussed in more detail in the next section.\n\n\n In the Monthly Rental Prices chart, the prices for the condominium parks are broken down by unit type, so the user dragged the \"Unit Type\n **\"**\n column into the\n **Series**\n field.\n\nVertical bar charts, horizontal bar charts, and line charts do not require series data, but for each of these chart types you can add a series if you want. You do this by simply dragging and dropping a column into the Series field.\n\n\n For example, the following simple vertical bar chart lacks a series:\n\nAfter adding a series that breaks down the categories into \"Product\" and \"Service,\" the following displays:\n\nLikewise, this basic line chart has no series:\n\nAfter adding the same series as before, two separate line charts appear in one chart, each one for a different type, as follows:\n\nAdding value and date columns as series\n-----------------------------------------\n\nYou can also apply a column containing value or date data as a series. However, to add multiple series that contain value or date data, these columns must be aggregated (applying a count to the column). This functionality makes it possible to have multiple values or date columns represented as series in your chart.\n\n\n For example, to add an additional column in your series field,\n\n. Drag and drop a column in the\n **Series**\n field\n2. Click the\n **Aggregation**\n drop-down and select the appropriate aggregation\n3. Another Series field becomes available\n\nAdding additional categories as series (\"trellis chart\")\n----------------------------------------------------------\n\nIn most kinds of charts that include series data, you can add up to two additional dimensions besides the required series. The additional dimensions are represented using boxes overlaid on top of each grouping (sometimes referred to as a \"trellis chart\"). The following screenshot shows an example of this, in which an additional dimension has been added to show the lead source.\n\nTo add an additional dimension, you must first turn on the Trellis feature by navigating to the chart properties and clicking\n **Trellis/Tiered Date Settings**\n . Then, select\n **Trellis Categories**\n from the\n **Show As**\n drop-down (If this chart property isn't available, then the trellis functionality is not available on that chart type.) Drag the desired category from the\n **Dimensions**\n grouping into the\n **Category 2**\n field above the chart preview area. When you do this, another field,\n **Category 3**\n , appears. If you want a second additional dimension in the chart, you can include it by dragging another category into this field.\n\n\n Note that the above functionality is recommended only for\n *string*\n columns. When you add date columns as additional categories in this way, your dates may appear out of order. If you want to show multiple levels of dates in a chart, it is recommended that you use \"Tiered Dates,\" which are described in the next section.\n\n\n Adding additional date categories\n-----------------------------------\n\nTiered Dates provide for greater ease of understanding by presenting multiple time periods in a single view. For example, you can show weekly data that is also grouped by month and by quarter—all on the same chart. This provides a view similar to that of the \"trellis chart\" as described above. For any chart, you can choose up to 3 date tiers.\n\nThe process for adding Tiered Dates is different from that of adding a trellis chart, as you must do so using the Chart Properties rather than dragging columns into fields over the chart. To add Tiered Dates, navigate to the Chart Properties, click\n **Trellis/Tiered Date Settings**\n , and choose\n **Tiered Dates**\n in the\n **Show As**\n drop-down. Then, select the desired number of tiers in the\n **Tiered Date Levels**\n drop-down.\n\n\n Aggregating your data\n-----------------------\n\nWhen you drop a column in a value or series field, a menu appears with options you can select to aggregate your data.\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n No Aggregation\n  |\n The chart shows the final value for each category in the DataSet.\n  |\n|\n Sum\n  |\n The chart shows the sum of all values for each category in the DataSet.\n  |\n|\n Minimum\n  |\n The chart shows the smallest value for each category in the DataSet.\n  |\n|\n Maximum\n  |\n The chart shows the largest value for each category in the DataSet.\n  |\n|\n Average\n  |\n The chart shows the average value for each category in the DataSet.\n  |\n|\n Count\n  |\n The chart shows the number of values for each category in the DataSet.\n  |\n\nFor value columns, all options are available. For series columns, typically only\n **No Aggregation**\n and\n **Count**\n are available. However, if you add a value or date column as a series, then all the options are available.\n\n\n For information about changing the aggregation type for your summary number, see\n\nConfiguring Your Chart Summary Number\n\n.\n\n\n For information about building each specific chart type by plugging in data, see\n\nBuilding Each Chart Type\n\n.\n\n*Video - Aggregating Columns in Analyzer**\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428713\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004623\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nApplying DataSet Columns to Your Chart\n\n", "article_total_view_count": "\n\n\n 13,495\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "applying_dataset_columns_to_your_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "analyzer", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}