{"file_path": "../../raw_kb_v2\\article\\360043428653\\index.html", "content": {"title": "\n\n\n Using Card Interaction Tools in a Card Details View\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo provides many tools for performing in-depth analysis on your business data. This topic discusses most of these tools, including the chart type picker, legend item toggle, chart zoom, and quick sort. A few other analysis tools are discussed in their own topics, including\n\ndata projection\n\n.\n\n*Video - Domo Interface - Card Details**\n\nChart Type Picker\n-------------------\n\nYou can change the chart type for most charts right in the Details page instead of having to first open the Analyzer. You do this by clicking\n\nthen selecting the new chart. In contrast to the chart type picker in Analyzer, which only shows icons for each chart type, the Details view chart type picker shows you actual thumbnail versions of each available chart type\n *with your chart data applied*\n . So, for example, if you opened the Details page for the following Vertical Stacked Bar chart...\n\n...you could then open the chart type picker and selectable thumbnails of your chart, all powered by your chart data, would appear, as follows:\n\nThe original chart type for your chart is always shown in the top left corner of the chart type picker with a gray curved arrow. If you want to switch back to that chart type, you can do so quickly by clicking this thumbnail.\n\n\n The chart type picker only displays thumbnails for chart types that are compatible with your data. In the previous example, \"Scatter Plot\" is not suggested as a chart type because Scatter Plots have a different data structure than Vertical Stacked Bars (i.e. two value columns instead of one). If your chart has a chart type not compatible with any other charts (such as a Calendar chart), the\n\nicon is grayed out.\n\n\n The chart type picker is\n *not*\n available for Maps.\n\n\n For information about chart types, see\n\nAvailable Chart Types\n\n.\n\nLegend Item Toggle\n---------------------\n\nIn most chart types with legends (excluding Maps), you can click on a legend item to hide or show the corresponding data in the chart. Referring to the \"Amusement Park Profits\" example again...\n\n...clicking \"Black Hole Blaster\" item in the legend causes the data for \"Black Hole Blaster\" (represented as dark green bars) to be hidden from the chart.\n\nIn addition, the square next to the \"Black Hole Blaster\" legend item turns white to indicate that the item is hidden. You can click it again to show the bars as before.\n\n\n You can also toggle legend items in Pie-type charts. Legend toggling works a bit differently for these charts. In this case, when you click a legend item, it disappears from the legend (there is no empty square to indicate that the item is hidden). However, you can then click the\n\nicon next to the chart to reset it to normal.\n\nChart Zoom\n-------------\n\nYou can click and drag over a portion of a chart to \"zoom in\" on that portion. This works on most chart types, excluding pie-type charts, maps, gauges, Radar graphs, and a few others.\n\n\n Referring to the same example as previously...\n\n...you could click and drag over the bars from \"16\" to \"19,\" and the chart would zoom to show you just the data for those bars, as shown here:\n\nYou could then click the\n\nicon next to the chart to zoom back out to the normal version.\n\n\n You can zoom in on a chart in the Analyzer as well as in the chart preview.\n\nQuick Sort\n-------------\n\nFor most Bar and Line graphs, you can quickly change the sort method just by clicking an icon, without having to open the Analyzer. This icon appears when you mouse over either the x- or y-axis of the chart. Five versions of this icon appear in a cycle; clicking any version sorts the graph accordingly, and the icon changes to the next version in the cycle.\n\n\n The following table lists and describes the sort methods associated with each version of the icon:\n\n\n Icon\n  |\n Description\n  |\n| --- | --- |\n|  |\n Sorts the data items in the graph using the default sort (i.e. the same way they were sorted when the graph was created).\n  |\n|  |\n Sorts the data items in the chart in order of ascending values.\n  |\n|  |\n Sorts the data items in the chart in order of descending values.\n  |\n|  |\n Sorts the data items in the chart in ascending alphanumeric category order.\n  |\n|  |\n Sorts the data items in the chart in descending alphanumeric category order.\n  |\n\nThese sort options are also available for the chart in the Analyzer.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428653\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004759\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nUsing Card Interaction Tools in a Card Details View\n\n", "article_total_view_count": "\n\n\n 4,250\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:29 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "using_card_interaction_tools_in_a_card_details_view", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "visualization_card_details_view_actions", "url": "/s/topic/0TO5w000000ZapOGAS"}]}