{"file_path": "../../raw_kb_v2\\article\\9645646505111\\index.html", "content": {"Title": "July 2022 Release Notes", "Article Body": "New Features and Enhancements\n                       \n\n                        The following enhancements are part of the July 2022 release:\n                       \n\n\n                         String filter values in dashboards and card visualizations are now displayed in numeric descending order.\n                         \n\n\n\n                         You can edit card titles at the dashboard level by entering the edit dashboard mode, selecting\n                         \n                          Edit Content\n                         \n                         for the card you want to edit, and then selecting\n                         \n                          Edit Card title and description\n                         \n                         .\n                         \n\n\n\n                         Date ranges are now available in drill views.\n                        \n\n\n                        The following features are part of the July 2022 release:\n                       \n\n                        FIXED Functions\n                       \n\n                        With FIXED Functions, you can create subquery calculations for more flexible data grouping, joining, and comparisons. You can access FIXED Functions alongside other available functions in the Beast Mode Editor. FIXED Functions are only available for non-federated DataSets.\n                       \n\n                        For more information, see\n                        \n                         Beast Mode FIXED Functions\n                        \n                        .\n                       \n\n                        Community Built Connectors\n                       \n\n                        Community Built Connectors enable Connector builders to create, update, and support Connectors in Domo. If a Connector has been published as Community Built, the code is available to all customers in the Appstore. Any Domo user with access to the Appstore and Connectors can copy code to the IDE to create a Connector from a Community Built Connector.\n                       \n\n                        For more information, see\n                        \n                         Community Built Connectors\n                        \n                        .\n                       \n\n\n\n\n                        Dashboards: \"Go to Card details\" Interaction\n                       \n\n                        With the new \"Go to Card details\" interaction option for Dashboards, you can prioritize a larger view of certain cards or data apps that are configured to always use the full screen. The mobile experience can now be configured independently from the desktop so that the web experience is unaffected.\n                       \n\n                        For more information, see\n                        \n                         Edit the Mobile Layout\n                        \n                        .\n                       \n\n                        New DDX Bricks\n                       \n\n                        New DDX bricks allow you to build your custom solutions quickly. Find these new DDX Bricks in the Appstore.\n                       \n\n\n                         DDX D3 Venn Diagram\n                        \n\n                         DDX Filtered Single Image\n                        \n\n                         DDX Form and DataSet\n                        \n\n                         DDX HTML Table Header\n                        \n\n                         DDX HTML Table with Nested Charts\n                        \n\n                         DDX Ten DataSets\n                        \n\n                         DDX Top 10 Images\n                        \n\n                         DDX Phoenix Cumulative Percentile\n                        \n\n                         DDX Phoenix Gradient Single Bar\n                        \n\n                         DDX Phoenix Percentile\n                        \n\n\n                        For more information, see\n                        \n                         DDX Bricks\n                        \n                        .\n                       \n\n\n\n\n                        Finance App Updates\n                       \n\n                        In the Domo Finance App, you can now show the most recent data on the left, instead of requiring users to scroll all the way to the right to see the most recent data.\n                       \n\n                        The column name \"Ratio\" is now \"% of [column]\". This allows users to more easily see what the ratio is calculating against based on the app's configuration.\n                       \n\n\n                         Default Views\n                        \n\n\n                        With Default Views, Admins can expand different sections, set up filters and date ranges, and save that view as the default each time a user opens the app.\n                       \n\n\n                         Nonstandard Calendars\n                        \n\n\n                        With Nonstandard Calendars, you can toggle \"Numerical Periods,\" which replaces month names with period numbers, allowing for any variants of non-standard calendars, and for users to configure those periods using ETL. This feature also allows calculated trends in the DataSet, permitting you to view average trends, rather than sum trends.\n                       \n\n                        For more information, see\n                        \n                         Domo Finance\n                        \n                        .\n                       \n\n                        Product Feedback Process\n                       \n\n                        You can now communicate feedback more clearly in the Dojo's Ideas Exchange by adding multimedia. You can see whether another user has already submitted the same feedback. Domo's Product Team can respond directly to the feedback. The new process also allows other Domo users to view your feedback, provide insights, and upvote good ideas. This community collaboration helps drive Domo's development roadmap.\n                       \n\n                        To access the feature, go to the Domo navigation header: select\n                        \n                         More\n                        \n                        >\n                        \n                         Feedback\n                        \n                        . In the modal that displays, choose\n                        \n                         Product feedback\n                        \n                        .\n                       \n\n                        New Chart Types\n                       \n\n                        Find these new chart types in the chart picker in Analyzer:\n                       \n\n                        Bump Chart\n                       \n\n                        With Bump Charts, you can quickly see changes in rank over time. The change in rank is emphasized rather than the numeric changes in values.\n                       \n\n                        For more information, see\n                        \n                         Bump Chart\n                        \n                        .\n                       \n\n\n\n\n                        Risk Heat Map\n                       \n\n                        With Risk Heat Maps, you can evaluate the likelihood and potential impact of identified risks and then view the risks displayed in a fixed color grid.\n                       \n\n                        For more information, see\n                        \n                         Risk Heat Map\n                        \n                        .\n                       \n\n\n\n\n                        Faceted Bar Chart\n                       \n\n                        With the additional dimensions available with Faceted Bar Charts, you can combine many charts to create one, saving space by not replicating the X-axis.\n                       \n\n                        For more information, see\n                        \n                         Faceted Bar Chart\n                        \n                        .\n                       \n\n\n\n\n                        Beta Features\n                       \n\n                        If you are interested in joining the Beta for a specific feature, please reach out to your Domo Customer Success Manager (CSM), Technical Consultant (TC), or Account Executive (AE). If you do not have contact information for your representative, contact Technical Support by email at\n                        \n                         support@domo.com\n                        \n                        .\n                       \n\n\n                         Note:\n                        \n                        Depending on the feature, you may be required to complete training before you can use this feature.\n                       \n\n                        Password Blocklist\n                       \n\n                        With Password Blocklist, you can protect against unauthorized and leaked credential usage. You can also limit the number of training, testing, and demo passwords in production and specify passwords or password elements that cannot be used in your instance of Domo.\n                       \n\n                        For more information, see\n                        \n                         Setting Password Requirements.\n                        \n\n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n                        in the top navigation bar.\n                       \n\n                        If you need help with Domo, access the following resources:\n                       \n\n\n\n                          Search for a topic in the\n                          \n                           Help Center\n                          \n                          .\n                         \n\n\n\n                          Train in\n                          \n                           Domo University\n                          \n                          .\n                         \n\n\n\n                          Search for training apps in the\n                          \n                           Appstore\n                          \n                          .\n                         \n\n\n\n                          Get answers from the Domo Community in the\n                          \n                           Dojo\n                          \n                          .\n                         \n\n\n\n                          Contact Technical Support by entering a help ticket in the\n                          \n                           Domo Support Portal.\n                          \n\n\n\n\n                          Reach out to your Domo Customer Success Manager or Technical Consultant.\n                         \n\n\n\n                        If you have feedback, please send it from within Domo by going to the navigationA header: select\n                        \n                         More\n                        \n                        >\n                        \n                         Feedback\n                        \n                        . In the modal that displays, choose\n                        \n                         Product feedback\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .\n                       \n\n                        A", "Preview Article": "Click here to preview", "URL Name": "9645646505111", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004985", "Archived Date": "", "Language": "English", "Primary Version": "July 2022 Release Notes", "Article Total View Count": "2,599", "": "", "Article Created Date": "11/1/2022, 11:18 PM", "First Published Date": "11/1/2022, 11:23 PM"}, "title": "\n              July 2022 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}