{"file_path": "../../raw_kb_v2\\article\\360043435513\\index.html", "content": {"Title": "Pocket Connector", "Article Body": "Intro\n                       \n\n\n\n\n\n                            Pocket, previously known as Read It Later, is an application and service for managing a reading list of articles from the Internet. To learn more about the Pocket API, visit their page (\n                            \n                             https://getpocket.com/developer/\n                            \n                            ).\n                           \n\n\n\n\n\n                        You connect to your Pocket account in the Data Center. This topic discusses the fields and menus that are specific to the Pocket connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Pocket account and create a DataSet, you must have credentials for a Pocket account. Any of the following types of credentials will work:\n                       \n\n\n\n                          A Pocket username and password\n                         \n\n\n\n                          Google or Firefox credentials you have used to sign into Pocket\n                         \n\n\n\n                        Connecting to Your Pocket Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Pocket Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Pocket connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Pocket accounts in Domo) to open the Pocket OAuth screen where you can enter your Pocket credentials. You can enter a Pocket username and password, or, if you signed up for Pocket through Google or Firefox, you can use those to log in. Once you have entered valid credentials, you can use the same account any time you go to create a new Pocket DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Pocket when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Pocket.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Pocket report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Get Article Data\n                              \n\n                               Returns a list of articles in your Pocket account.\n                              \n\n\n\n                               Get Image Data\n                              \n\n                               Returns a list of images associated with articles in your Pocket account.\n                              \n\n\n\n                               Get Video Data\n                              \n\n                               Returns a list of videos associated with articles in your Pocket account.\n                              \n\n\n\n\n\n\n\n                           State\n                          \n\n                           Lets you select whether to retrieve data for all articles or only those that are archived or unread.\n                          \n\n\n\n                           Detail Type\n                          \n\n                           Select the level of detail you want your report to contain. If you select\n                           \n                            Simple\n                           \n                           , basic information such as title, URL, and status is returned. If you select\n                           \n                            Detailed\n                           \n                           , all data is returned, including tags, images, authors, videos, etc.\n                          \n\n\n\n                           Tag (Optional)\n                          \n\n                           Enter a search tag to retrieve data for.\n                          \n\n\n\n                           Date Since\n                          \n\n                           Select whether you want to retrieve data for a specific date or for a relative number of days back.\n                          \n\n\n\n                           Specific Date\n                          \n\n                           Select the date you want to retrieve data for.\n                          \n\n\n\n                           Days Back\n                          \n\n                           Enter the number of days back you want to retrieve data for.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043435513", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003374", "Archived Date": "", "Language": "English", "Primary Version": "Pocket Connector", "Article Total View Count": "2,357", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Pocket Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}