{"file_path": "../../raw_kb_v2\\article\\360043435793\\index.html", "content": {"Title": "Neurio Connector", "Article Body": "Intro\n                       \n\n                        Neurio is a residential electricity usage monitoring service. Using smart devices installed in the home, Neurio can report your energy usage through a web-based dashboard. To learn more about the Neurio API, visit their page (\n                        \n                         https://api-docs.neur.io/\n                        \n                        ).\n                       \n\n                        You connect to your Neurio account in the Data Center. This topic discusses the fields and menus that are specific to the Neurio connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Neurio account and create a DataSet, you must have the email address and password you use to log into Neurio.\n                       \n\n                        Connecting to Your Neurio Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Neurio Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Neurio connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Neurio accounts in Domo) to open the Neurio OAuth screen where you can enter your Neurio credentials. Once you have entered valid Neurio credentials, you can use the same account any time you go to create a new Neurio DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Neurio when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Neurio.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Neurio report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Appliances\n                               \n\n\n\n                                Returns data about Neurio appliances for a specified location.\n                               \n\n\n\n\n\n                                Appliance Events\n                               \n\n\n\n                                Returns data about Neurio appliance events for a specified location.\n                               \n\n\n\n\n\n                                Appliance Statistics for a Specific Appliance\n                               \n\n\n\n                                Returns statistical data for a specific Neurio appliance within a given time range.\n                               \n\n\n\n\n\n                                Appliance Statistics by Location\n                               \n\n\n\n                                Returns statistical data for appliances in a specified location within a given time range.\n                               \n\n\n\n\n\n                                Energy Statistics\n                               \n\n\n\n                                Returns statistics for energy consumed within a given time interval.\n                               \n\n\n\n\n\n                                Last Sample\n                               \n\n\n\n                                Returns the last sample returned by a given sensor.\n                               \n\n\n\n\n\n                                Recent Appliance Events\n                               \n\n\n\n                                Returns data about appliance events created or updated after a specified time.\n                               \n\n\n\n\n\n                                Recent Samples\n                               \n\n\n\n                                Returns recent samples, one sample per second for up to the last 2 minutes.\n                               \n\n\n\n\n\n                                Samples\n                               \n\n\n\n                                Returns a given sensor's samples for a specified time period.\n                               \n\n\n\n\n\n                                Specific Appliance\n                               \n\n\n\n                                Returns data about a specified Neurio appliance.\n                               \n\n\n\n\n\n\n\n\n\n                            Location ID\n                           \n\n\n\n                            Enter the ID for the location you want to retrieve data for.\n                           \n\n\n\n\n\n                            Sensor ID\n                           \n\n\n\n                            Select the sensor you want to retrieve data for.\n                           \n\n\n\n\n\n                            Appliance ID\n                           \n\n\n\n                            Select the appliance you want to retrieve data for.\n                           \n\n\n\n\n\n                            Granularity\n                           \n\n\n\n                            Select how you want the data in your report to be broken down. For example, if you choose\n                            \n                             Days\n                            \n                            , the data will be broken down by day.\n                           \n\n\n\n\n\n                            Frequency\n                           \n\n\n\n                            Enter the frequency of the sampled data. This should be a multiple of 5 when using\n                            \n                             Minutes\n                            \n                            granularity.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043435793", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003333", "Archived Date": "", "Language": "English", "Primary Version": "Neurio Connector", "Article Total View Count": "2,365", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Neurio Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}