{"file_path": "../../raw_kb_v2\\article\\360043430373\\index.html", "content": {"Title": "Alert Center Layout", "Article Body": "Intro\n                       \n\n                        In Domo, you can configure Alerts to set thresholds on metrics and receive notifications when there are important changes to your business. With Domo Alerts, you can take action when they arrive, and rest easy when they don't.\n                       \n\n                        In the Alert Center, you can do all of the following:\n                       \n\n\n\n                          View Alerts in a variety of categories—triggered, subscribed, owned by you, needs attention, and suggested.\n                         \n\n\n\n                          Share Alerts with other users in your Domo instance.\n                         \n\n\n\n                          Subscribe to suggested Alerts created by other users or unsubscribe from Alerts.\n                         \n\n\n\n                          See the trigger history for any Alert.\n                         \n\n\n\n                          Delete any Alert.\n                         \n\n\n\n                          Change the rule (i.e. the criteria that must be met for the Alert to trigger) and messaging for your Alerts.\n                         \n\n\n\n                          Change your Alert Notification settings.\n                         \n\n\n\n                          Open the\n                          \n                           Discover\n                          \n                          tool for Alerts.\n                         \n\n\n\n                        You can access the Alert Center from any Page or Subpage by clicking\n                        \n\n                          Alerts\n                         \n\n                        in the Page navigation bar at the top of the screen.\n                       \n\n\n\n\n                        Parts of the Alert Center\n                       \n\n                        The Alert Center is made up of 3 main screens, which you can switch between using the navigation bar on the left side of the screen. These screens—and the icons you click on to access them—are as follows:\n                       \n\n\n\n\n\n                            Icon\n                           \n\n\n\n                            Screen\n                           \n\n\n\n\n\n\n\n\n\n\n\n                             Alerts\n                            \n                            screen. This is the \"main\" screen of the Alert Center, in which you can view and manage Alerts.\n                           \n\n\n\n\n\n\n\n\n\n\n\n                             Discover\n                            \n                            screen. The Discover tool provides an active view of all of the activity happening in your Domo instance.\n                           \n\n\n\n\n\n\n\n\n\n\n\n                             Settings\n                            \n                            screen. In this screen, you can configure when and how Notifications are sent for your Alerts.\n                           \n\n\n\n\n\n                        The navigation bar also contains the\n                        \n                        icon, which shows or hides the names of the various screens next to the icons.\n                       \n\n                        The rest of this article discusses each of the above screens in detail.\n                       \n\n                        Alerts screen\n                       \n\n                        The following screenshot points out the main components of the Alerts screen in the Alert Center:\n                       \n\n\n\n\n                        You can use the following table to find out more about each of these components:\n                       \n\n\n\n\n                           Component\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Quick Filters\n                          \n\n\n                            Let you switch between different categories of Alerts available in your Domo instance. These Alert categories are as follows:\n                           \n\n\n\n\n\n                                All Alerts\n                               \n\n\n\n                                Shows all Alerts in your Domo instance.\n                               \n\n\n\n\n\n                                Triggered\n                               \n\n\n\n                                Shows all Alerts you are subscribed to that have been triggered.\n                               \n\n\n\n\n\n                                Subscribed\n                               \n\n\n\n                                Shows all Alerts you have subscribed to that have not been triggered. (This includes Alerts that you own.)\n                               \n\n\n\n\n\n                                Owned by you\n                               \n\n\n\n                                Shows all Alerts you are the owner of.\n                               \n\n\n\n\n\n                                Needs attention\n                               \n\n\n\n                                Shows all Alerts you own that are broken.\n                               \n\n\n\n\n\n                                Suggested\n                               \n\n\n\n                                Shows Alerts you are not following that are recommended by Domo based on your metadata.\n                               \n\n\n\n\n\n\n\n\n                           Search/Filter bar\n                          \n\n                           Lets you search for Alerts by keyword as well as apply a filter to your search (\n                           \n                            Owned by\n                           \n                           ,\n                           \n                            Created Date\n                           \n                           ,\n                           \n                            Subscribed to by\n                           \n                           , or\n                           \n                            Disabled\n                           \n                           ).\n                           \n                            Owned by\n                           \n                           lets you filter to show Alerts owned by (or not owned by) a specified user.\n                           \n                            Created Date\n                           \n                           lets you filter to show Alerts created on a certain date or within a certain range; various custom filters are available to help you customize your range.\n                           \n                            Subscribed to by\n                           \n                           lets you filter to show Alerts that a specified user is subscribed to (or not subscribed to).\n                           \n                            Disabled\n                           \n                           lets you filter to show Alerts that are disabled or not disabled.\n                          \n\n\n\n                           Alert cards\n                          \n\n\n                            Provide information and options for individual Alerts. Information in an Alert card includes the name of the Alert, the Card where it is found, the owner of the Alert, subscribers (followers) of the Alert, and the trigger frequency. If you click an Alert card, a panel appears with additional options. This panel is discussed in more detail later.\n                           \n\n                            If the name of an Alert appears in\n                            \n                             orange\n                            \n                            , this indicates the Alert is in a triggered state.\n                           \n\n\n\n\n                           Share icon\n                          \n\n                           Lets you share this Alert with other users. For more information, see\n                           \n                            Sharing the Alert\n                           \n                           .\n                          \n\n\n\n                           Subscribe button\n                          \n\n                           Lets you subscribe to (follow) this Alert. You can choose whether you want to receive Notifications via text, email, push notifications, or phone call. You can also choose whether to add Notifications for the Alert to your Daily or Weekly summary email. For more information, see\n                           \n                            Receiving and Viewing Notifications\n                           \n                           .\n                          \n\n\n\n\n                        Alert information panel\n                       \n\n                        If you click on any Alert card in the\n                        \n                         Alerts\n                        \n                        screen, a panel appears with additional information and options for this Alert. The following screenshot points out the most important parts of this panel.\n                        \n\n\n\n\n\n\n                        You can use the following table to find out more about each of these components:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Alert name\n                           \n\n\n\n                            The name of this Alert. You can rename an Alert by clicking the pencil icon to the right of the name.\n                           \n\n\n\n\n\n                            Trigger status\n                           \n\n\n\n                            Shows whether this Alert is currently in a triggered state. If it is, the status message tells you the current value of the Alert.\n                           \n\n\n\n\n\n                            Alert rule\n                           \n\n\n\n                            Shows the rule, i.e. the conditions that must be met for this Alert to be triggered. You can click the\n                            \n                             Edit\n                            \n                            button to edit the Alert rule. For more information about creating and editing Alert rules, see\n                            \n                             Setting up Your Alert rule\n                            \n                            .\n                           \n\n\n\n\n\n                            Alert message preview\n                           \n\n\n\n                            Shows a preview of the message that will be delivered when the Alert is triggered. You can click the\n                            \n                             Edit\n                            \n                            button to edit the message. For more information about creating and editing Alert messages, see\n                            \n                             Customizing your Alert message\n                            \n                            .\n                           \n\n\n\n\n\n                            Mr. Roboto analysis\n                           \n\n\n\n                            Displays an analysis of the trigger history for this Alert, automatically generated by Mr. Roboto, Domo's native AI tool.\n                           \n\n\n\n\n\n                            History view toggle\n                           \n\n\n\n                            Lets you toggle the history view for this Alert. You can choose to show the history as a line chart (by clicking\n                            \n                            ) or a chronological listing (by clicking\n                            \n                            ).\n                           \n\n\n\n\n\n                            Owner avatar\n                           \n\n\n\n                            Shows the owner of this Alert. If you click the photo, a panel will pop up with information about this user, along with options for\n                            \n                             sending him/her a Buzz message\n                            \n                            .\n                           \n\n\n\n\n\n                            Share button\n                           \n\n\n\n                            Lets you share this Alert with other users. For more information, see\n                            \n                             Sharing the Alert\n                            \n                            .\n                           \n\n\n\n\n\n                            Card\n                           \n\n\n\n                            Shows the name of the Card in which this Alert is found. You can click on the Card name to open that Card.\n                           \n\n\n\n\n\n                            Alert History area\n                           \n\n\n\n                            Shows the trigger history for this Alert. This history appears as either a trendline or a chronological listing of trigger events, depending on the view toggle you have selected (for more information, see \"History view toggle\" in this table).\n                           \n\n\n\n\n\n                            Subscribe button\n                           \n\n\n\n                            Lets you subscribe to (follow) this Alert. You can choose whether you want to receive Notifications via text, email, push notifications, or phone call. You can also choose whether to add Notifications for the Alert to your Daily or Weekly summary email. For more information, see\n                            \n                             Receiving and Viewing Notifications\n                            \n                            .\n                           \n\n\n\n\n\n                            Delete icon\n                           \n\n\n\n                            Lets you delete this Alert.\n                           \n\n\n\n\n\n                        Settings screen\n                       \n\n                        In the\n                        \n                         Settings\n                        \n                        screen, you can configure settings for your Alerts. The options in this screen are the same as those in the\n                        \n                         Instant Alerts\n                        \n                        ,\n                        \n                         Daily Alerts\n                        \n                        , and\n                        \n                         Weekly Alerts\n                        \n                        tabs in the global\n                        \n                         Settings\n                        \n                        screen, which you access by clicking on your user photo in the top right corner of Domo then clicking\n                        \n                        . For more information about these tabs, see\n                        \n                         Configuring Notification and Alert Settings -- Alerts\n                        \n                        .\n                       \n\n                        Discover tool\n                       \n\n                        The Alert Discover tool helps business leaders keep a pulse on all the important things happening in their business. Imagine a central command center with updates about opportunities being pushed from this month’s pipeline, unusual spikes in cost per conversion, trending hot topics in your organization, or important obstacles as simple as data connection failures. All of these updates and more live side-by-side in the Discover tool, where you can then take action as a team to capitalize on the most valuable opportunities.\n                       \n\n                        Discover brings all of the important information into a central location where you can discover and interact with new content. Domo intelligently organizes all the activity into a rich set of topics that users can explore. Subscribe to your boss’s Alert. Share a card with someone on your team. Start a new conversation with an old friend who logged into Domo for the first time.\n                       \n\n\n\n                          Video - Alerts Overview\n                         \n\n\n\n\n\n\n\n\n\n                        Parts of Discover\n                       \n\n                        The following screenshot points out the most important parts of the Discover tool:\n                       \n\n\n\n\n                        You can refer to the following table to find out more about these components:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Topics\n                           \n\n\n\n                            Allow you to find out more about the Alerts in your Domo. Mousing over a category \"freezes\" the hopper/heat map, allowing you to more easily see the number of Alerts in that category as a percentage of all Alerts in the heat map. Clicking on a category opens the card carousel for that category (see below).\n                           \n\n                            Alerts are divided into a number of topic categories, as follows:\n                           \n\n\n\n\n                               Say hello to new people\n                              \n                              . Shows the number of new people in your Domo instance.\n                             \n\n\n\n\n                               Subscribe to these Alerts\n                              \n                              . Shows the number of suggested Alerts in your Domo.\n                             \n\n\n\n\n                               Everyone views these cards\n                              \n                              . Shows the number of trending (most viewed) cards in your Domo.\n                             \n\n\n\n\n                               Alerts you follow\n                              \n                              . Shows the number of Alerts you are following.\n                             \n\n\n\n\n                               Recently shared with you\n                              \n                              . Shows the number of cards that have been shared with you recently.\n                             \n\n\n\n\n                               Cards you should be following\n                              \n                              . Shows the number of cards Domo recommends you follow.\n                             \n\n\n\n\n                               Recently discussed cards\n                              \n                              . Shows cards that have been discussed recently in Buzz conversations.\n                             \n\n\n\n\n\n\n\n                            Search\n                           \n\n\n\n                            Lets you search Discover for an Alert in any of the four topic categories.\n                           \n\n                            When you enter a search term without pressing Enter, any topics in which the search term is found filter down to show the number of Alerts that include that search term, while topics without the search term are grayed out.\n                           \n\n                            The heat map also freezes when you enter a search term. Any Alerts in the heat map that include the search term appear in their usual colors, and all other Alerts are grayed out. This makes it easy to pinpoint and open the desired Alerts in the card carousel (see below).\n                           \n\n                            If you enter a search term and press Enter, the card carousel opens and shows cards for all Alerts corresponding to the search term.\n                           \n\n                            The following screenshot shows an example of using search. The user has searched for the term \"mark.\" Three results are returned. Two of these are for new people (both named \"Mark\") and one is for a trending card called \"Marketing Inquiries.\" All three are shown in the heat map—two are green (those corresponding to new people) and one is purple (the one corresponding to the trending card).\n                           \n\n\n\n\n\n\n\n\n                            Heat map\n                           \n\n\n\n                            Provides a dynamic, ever-changing visual representation of your Domo Alerts. The heat map continually updates as new Alerts fly in from the hopper. There are a number of colors of Alerts, each of which corresponds to a topic category. For example, \"New people\" Alerts appear green; \"Suggested\" and \"Subscribed\" Alerts appear orange; and \"Trending\" Alerts appear purple.\n                           \n\n                            If you mouse over a square in the heat map, the action freezes and all squares belonging to that category appear colorized, while squares in all other categories are grayed out. This is shown in the following screenshot, in which the user has moused over a green square:\n                           \n\n\n\n\n                            If you click a square in the heat map, the Alerts in that category open in the card carousel (see below).\n                           \n\n\n\n\n\n                            Hopper\n                           \n\n\n\n                            Shows new Alerts in your Domo instance as they fly into the heat map.\n                           \n\n                            There are a number of colors of Alerts, each of which corresponds to a topic category. For example, \"New people\" Alerts appear green; \"Suggested\" and \"Subscribed\" Alerts appear orange; and \"Trending\" Alerts appear purple.\n                           \n\n                            If you mouse over an Alert in the hopper, the action freezes and all squares in the heat map belonging to that category appear colorized, while squares in all other categories are grayed out.\n                           \n\n                            If you click an Alert in the hopper, the Alerts in that category open in the card carousel (see below).\n                           \n\n\n\n\n\n                        Card Carousel\n                       \n\n                        When you click a topic category, heat map square, or hopper Alert, or when you perform a search, the card carousel opens. Usually this displays cards for all Alerts pertaining to the given category. The exception to this is when you perform a search, in which case the card carousel shows cards for all Alerts that include your search term. All Alert cards have options, such as subscribing to an Alert, adding a trending cards as a favorite, and so on. The specific options available for an Alert card depend on the topic category.\n                       \n\n                        In the following example, the user has clicked on an orange \"Suggested Alert\" square in the heat map. The card carousel opens to show cards for all suggested Alerts, with the Alert the user clicked on appearing in the center and the others flanking it.\n                       \n\n\n\n\n                        Note that although options appear on all cards in the carousel, they are only clickable in the center card.\n                       \n\n                        You can navigate through Alerts in the carousel by clicking the left and right navigation arrows on either end of the carousel, or close the carousel by clicking the \"x\" in the top right corner.\n                       \n\n                        Options available for each topic category are as follows:\n                       \n\n\n\n\n                           Topic Category\n                          \n\n                           Available Options\n                          \n\n\n\n\n\n                           New People\n                          \n\n\n\n\n\n                               View Profile\n                              \n                              . Opens the Profile Page for this user. For more information, see\n                              \n                               Profile Page\n                              \n                              .\n                             \n\n\n\n\n                               Say Hello\n                              \n                              . Lets you send a Buzz message to this user. For more information, see\n                              \n                               Chatting in Buzz\n                              \n                              .\n                             \n\n\n\n\n\n\n                           Suggested Alerts/Subscribed Alerts\n                          \n\n\n\n\n\n                               Subscribe\n                              \n                              . Lets you subscribe to (follow) this Alert. For more information, see\n                              \n                               Following or unfollowing an Alert\n                              \n                              .\n                             \n\n\n\n\n                               View\n                              \n                              . Opens the options dialog for this Alert. For more information, see\n                              \n                               Managing Custom Alerts\n                              \n                              .\n                             \n\n\n\n\n\n\n                           Most Viewed (Trending) Cards/Recently Shared with You/Cards You Should Be Following\n                          \n\n\n\n\n\n                               Favorite\n                              \n                              . Lets you add this card as a Favorite. For more information, see\n                              \n                               Adding Cards as Favorites\n                              \n                              .\n                             \n\n\n\n\n                               Share\n                              \n                              . Lets you share this card with users inside or outside your Domo. For more information, see\n                              \n                               Sharing Content in Domo\n                              \n                              .\n                             \n\n\n\n\n                               View\n                              \n                              . Displays this card in a pop-over view.\n                             \n\n\n\n\n\n\n                           Recently Discussed Cards\n                          \n\n\n\n\n\n                               View Card\n                              \n                              . Displays this card in a pop-over view.\n                             \n\n\n\n\n                               Buzz\n                              \n                              . Opens the Buzz conversation around this card so you can read or join in the conversation.", "Preview Article": "Click here to preview", "URL Name": "360043430373", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004350", "Archived Date": "", "Language": "English", "Primary Version": "Alert Center Layout", "Article Total View Count": "12,198", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Alert Center Layout\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Notifications And Alerts\n              \n", "url": "/s/topic/0TO5w000000ZanxGAC"}]}