{"file_path": "../../raw_kb_v2\\article\\360043433173\\index.html", "content": {"Title": "Cisco Prime Connector", "Article Body": "Intro\n                       \n\n                        Cisco Prime is a network management software suite that simplifies the management of wireless and wired networks.   To learn more about the Cisco Prime API, visit their page (\n                        \n                         https://developer.cisco.com/site/prime-infrastructure/documents/api-reference/rest-api-v3-0/\n                        \n                        ).\n                       \n\n                        You connect to your Cisco Prime account in the Data Center. This topic discusses the fields and menus that are specific to the Cisco Prime connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Cisco Prime account and create a DataSet, you must have the following:\n                       \n\n\n\n                          The username and password for your Cisco Prime account\n                         \n\n\n\n                          The hostname or IP address of the Cisco Prime instance\n                         \n\n\n\n                        Connecting to Your Cisco Prime Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Cisco Prime Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Cisco Prime account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Host\n                           \n\n\n\n                            Enter the hostname or IP address for the Cisco Prime instance.\n                           \n\n\n\n\n\n                            Username\n                           \n\n\n\n                            Enter the username for your Cisco Prime account.\n                           \n\n\n\n\n\n                            Password\n                           \n\n\n\n                            Enter the password for your Cisco Prime account.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Cisco Prime credentials, you can use the same account any time you go to create a new Cisco Prime DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Cisco Prime report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Access Points\n                               \n\n\n\n                                Returns data about wireless access points, both unified and autonomous. Provides device attributes such as type, version, association controller, number of associated clients, etc.\n                               \n\n\n\n\n\n                                Access Point Details\n                               \n\n\n\n                                Returns details about wireless access points. Provides basic attributes, inventory, CDP, client and other information.\n                               \n\n\n\n\n\n                                Alarms\n                               \n\n\n\n                                Returns a list of alarms—representations of a fault or change of state that occurred in the managed system.\n                               \n\n\n\n\n\n                                API Calls per Client\n                               \n\n\n\n                                Returns the IP addresses of all clients using either all services or the specified service over the last 24 hours.\n                               \n\n\n\n\n\n                                API Health Records\n                               \n\n\n\n                                Returns API performance and diagnostic information.\n                               \n\n\n\n\n\n                                API Response Time Summary\n                               \n\n\n\n                                Returns summarized information about response times for each service.\n                               \n\n\n\n\n\n                                Client Counts\n                               \n\n\n\n                                Returns the number of clients counted during the last polling cycle.\n                               \n\n\n\n\n\n                                Client Details\n                               \n\n\n\n                                Returns the detail view of a given client. It provides attributes of client device, security information, connected device, traffic and session information. All information is collected in the current or last session.\n                               \n\n\n\n\n\n                                Client Historical Statistics\n                               \n\n\n\n                                Returns client statistics collected in the last 24 hours with a 15- minute (default) interval.\n                               \n\n\n\n\n\n                                Clients\n                               \n\n\n\n                                Returns client data with information about the end points such as MAC address, IP address, username, and status.\n                               \n\n\n\n\n\n                                Client Sessions\n                               \n\n\n\n                                Returns details about client sessions. It provides device- and session-related attributes including security, connected device, session time, traffic, etc.\n                               \n\n\n\n\n\n                                Client Statistics\n                               \n\n\n\n                                Returns client statistics data collected during the last polling cycle.\n                               \n\n\n\n\n\n                                Client Traffic\n                               \n\n\n\n                                Returns a client's traffic information collected during the last polling cycle.\n                               \n\n\n\n\n\n                                CLI Templates\n                               \n\n\n\n                                Returns CLI configuration templates.\n                               \n\n\n\n\n\n                                CLI Template Configuration Folders\n                               \n\n\n\n                                Returns a list of CLI template configuration folders.\n                               \n\n\n\n\n\n                                Device Availabilty\n                               \n\n\n\n                                Returns device availability data for a given IP address.\n                               \n\n\n\n\n\n                                Device Availability Summary\n                               \n\n\n\n                                Returns a device availability summary.\n                               \n\n\n\n\n\n                                Device Health Information\n                               \n\n\n\n                                Returns health information for a given device.\n                               \n\n\n\n\n\n                                Device Reachability Status\n                               \n\n\n\n                                Returns the reachability status for a given device.\n                               \n\n\n\n\n\n                                Devices\n                               \n\n\n\n                                Returns device view data with information about the managed network elements.\n                               \n\n\n\n\n\n                                Device Types\n                               \n\n\n\n                                Returns the list of device types you can specify for a CLI template.\n                               \n\n\n\n\n\n                                Disk Information\n                               \n\n\n\n                                Returns capacity and usage information for the volumes present on the application's server.\n                               \n\n\n\n\n\n                                Events\n                               \n\n\n\n                                Returns a \"normalized\" record of an occurrence reported by the network (or any system capable of notifying of such an occurrence).\n                               \n\n\n\n\n\n                                Generate Report from Template\n                               \n\n\n\n                                Lets you pull a Cisco Prime report from a saved template.\n                               \n\n\n\n\n\n                                Group Sites\n                               \n\n\n\n                                Returns list of locations, including the count of alarms of each severity for each group. Also includes counts of devices, APIs and clients associated with the location, and location information regarding the location.\n                               \n\n\n\n\n\n                                Historical Client Counts\n                               \n\n\n\n                                Returns client counts collected in the last 24 hours with a 5-minute (default) interval.\n                               \n\n\n\n\n\n                                Historical Client Traffic\n                               \n\n\n\n                                Returns client traffic information collected in the last 24 hours with a 15-minute (default) interval.\n                               \n\n\n\n\n\n                                Interface Utilization Summary\n                               \n\n\n\n                                Returns the interface utilization summary.\n                               \n\n\n\n\n\n                                Number of Users\n                               \n\n\n\n                                Returns the number of users for an application.\n                               \n\n\n\n\n\n                                Report Templates\n                               \n\n\n\n                                Returns saved report templates.\n                               \n\n\n\n\n\n                                Request Count Thread\n                               \n\n\n\n                                Returns the number of requests, grouped by day and HTTP status, for all services or a given service if specified, over the last seven days.\n                               \n\n\n\n\n\n                                Response Time Trend\n                               \n\n\n\n                                Returns the data for each request over the last 24 hours, showing the response time and the time the request was received, either for all services or for the specified service.\n                               \n\n\n\n\n\n                                Service Name List\n                               \n\n\n\n                                Returns the list of services for which there are ApiHealthRecords.\n                               \n\n\n\n\n\n                                System Logs\n                               \n\n\n\n                                Returns syslog data. Syslogs are the standard method for logging messages such as system events in an IP network.\n                               \n\n\n\n\n\n                                System Health Statistics\n                               \n\n\n\n                                Returns system health statistics.\n                               \n\n\n\n\n\n                                System Information Statistics\n                               \n\n\n\n                                Returns system information statistics.\n                               \n\n\n\n\n\n                                Traffic Analysis\n                               \n\n\n\n                                Returns the traffic analysis for a given application.\n                               \n\n\n\n\n\n                                Uptime Information\n                               \n\n\n\n                                Returns uptime information as well as information about the application and the server it runs on.\n                               \n\n\n\n\n\n                                User Defined Groups\n                               \n\n\n\n                                Returns the list of user-defined groups for both Network Device Groups and Port Groups, including the count of alarms of each severity for each group.\n                               \n\n\n\n\n\n                                WLC Utilizations\n                               \n\n\n\n                                Returns the latest CPU and memory utilization collected from a WLAN controller.\n                               \n\n\n\n\n\n\n\n\n\n                            IP Address\n                           \n\n\n\n                            Enter the IP address of the device you want to retrieve information for.\n                           \n\n\n\n\n\n                            Report Template\n                           \n\n\n\n                            Select the saved report template you want to generate a DataSet from.\n                           \n\n\n\n\n\n                            Type\n                           \n\n\n\n                            Select the type of statistics you want to retrieve, either simple or detailed.\n                           \n\n\n\n\n\n                            Date Type\n                           \n\n\n\n                            Select whether you want to retrieve data for a single date or a date range.\n                           \n\n\n\n\n\n                            Date\n                           \n\n\n\n                            Select the date you want to pull information for.\n                           \n\n\n\n\n\n                            Date Offset\n                           \n\n\n\n                            Enter the number of days back you want to pull data for each time this report is run.\n                           \n\n\n\n\n\n                            Date From\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Date From Offset\n                           \n\n\n\n                            Enter the number of days back from the first date in your date range you want to pull data for each time this report is run.\n                           \n\n\n\n\n\n                            Date To\n                           \n\n\n\n                            Select the last date in your date range.\n                           \n\n\n\n\n\n                            Date To Offset\n                           \n\n\n\n                            Enter the number of days back from the last date in your date range you want to pull data for each time this report is run.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector", "Preview Article": "Click here to preview", "URL Name": "360043433173", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003591", "Archived Date": "", "Language": "English", "Primary Version": "Cisco Prime Connector", "Article Total View Count": "2,365", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Cisco Prime Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}