{"file_path": "../../raw_kb_v2\\article\\360042934054\\index.html", "content": {"Title": "QuickBooks Online Reports QuickStart App", "Article Body": "Important:\n                            \n\n\n\n\n                            What is happening?\n                           \n\n                           Quickbooks will be deprecating their OAuth 1.0 authentication on December 17. After this change, the Domo Quickbooks Online Connectors will no longer be able to authenticate to your Quickbooks Online Accounts. To prepare for this change, Domo is updating the Quickbook Connectors to support the newest version of OAuth that will be ready on December 9.\n                           \n\n\n                            How will this change affect me?\n                           \n\n                           From December 9 onward, you will need to re-authenticate your Quickbooks Online accounts. Your DataSets will continue updating through December 17.\n                           \n\n\n                            What do I need to do to prepare?\n                           \n\n                           After the updated Connector is released on December 9, you will not be able to see which Accounts were authenticated for which DataSet. Between today and December 9, please take the time to note which Credential Account your QuickBooks connectors are using.\n                           \n\n\n                            Before December 9\n                           \n\n                           We recommend adding the account number to the name of each Quickbooks DataSet so you will be able to choose the correct account to authenticate to after the change on December 9. The account number can be found in the account name.\n                           \n\n\n\n                           You can find all of your QuickBooks Accounts and the DataSets they power in the Accounts section in the Data Center.\n                           \n\n\n                            Between December 9 and December 17\n                           \n\n                           When you open the DataSet settings on December 9, the credentials section will state that you do not have access to the account that powers the DataSet. You will need to go to each DataSet and click\n                           \n                            Use a different account\n                           \n                           and then re-authenticate your account by selecting the appropriate one from the drop down or selecting\n                           \n                            Add account\n                           \n                           to authenticate the one that needs to be used.\n                           \n\n\n                            After December 17th\n                           \n\n                           Because QuickBooks is deprecating OAuth 1.0 on December 17, if you have not reauthenticated your account by December 17, there is a high probability that your DataSets will not continue updating. Please reauthenticate your account as soon as possible.\n                           \n\n\n                            FAQs\n                           \n\n\n                            What if I don't know which account was authenticated to my DataSet?\n                           \n\n                           You will need to figure out which account it is based on the data in the Connector.\n                           \n\n\n                            What if I haven't updated my account and my DataSet stops working before December 17?\n                           \n\n                           Domo is using the cached AccessToken from the OAuth 1.0 which lasts 180 days. If your token expires between December 9 and December 17, your DataSets will stop running. In this case, you simply need to reauthenticate your account for the DataSets to update.\n                           \n\n\n                            How do I found the unique Account ID on QuickBooks Online?\n                           \n\n                           To find your unique Account ID in QuickBooks Online, log into your account and select the settings gear. Navigate to\n                           \n                            Account and Settings\n                           \n                           and select the\n                           \n                            Billing\n                           \n                           area where you will see the Company ID\n                          \n\n\n\n\n                        Intro\n                       \n\n\n                         QuickBooks Online is a leading online accounting software. With the QuickBooks Online QuickStart, you have quick access to balance sheet details, PL performance, and important financial ratios like gross profit margin, return on sales, current ratio, and more.\n                        \n\n\n                        Usage\n                       \n\n\n\n\n                           Business questions that can be answered:\n                          \n\n\n\n\n\n                             What is the current state of my assets and liabilities?\n                            \n\n\n\n\n\n                             How are my revenue and expenses changing over time?\n                            \n\n\n\n\n\n                             What is my gross profit margin?\n                            \n\n\n\n\n\n                             What is my return on sales?\n                            \n\n\n\n\n\n                             What is my current debt ratio?\n                            \n\n\n\n\n\n\n\n                           Metrics included in the app:\n                          \n\n\n\n\n\n                             Net Income\n                            \n\n\n\n\n\n                             Cash Flows\n                            \n\n\n\n\n\n                             Top Customers\n                            \n\n\n\n\n\n                             Top Products/Services\n                            \n\n\n\n\n\n                             Working Capital\n                            \n\n\n\n\n\n                             Accounts Receivable Aging\n                            \n\n\n\n\n\n                             Accounts Payable Aging\n                            \n\n\n\n\n\n                             Current Assets\n                            \n\n\n\n\n\n                             Fixed Assets\n                            \n\n\n\n\n\n                             Other Assets\n                            \n\n\n\n\n\n                             Current Liabilities\n                            \n\n\n\n\n\n                             Long-Term Liabilities\n                            \n\n\n\n\n\n                             Top Vendor Expenses\n                            \n\n\n\n\n\n                             Income\n                            \n\n\n\n\n\n                             Costs of Goods Sold\n                            \n\n\n\n\n\n                             Gross Profit\n                            \n\n\n\n\n\n                             Operating Expenses\n                            \n\n\n\n\n\n                             EBITDA\n                            \n\n\n\n\n\n                             Other Income\n                            \n\n\n\n\n\n                             Other Expenses\n                            \n\n\n\n\n\n                             Gross Profit Margin\n                            \n\n\n\n\n\n                             Return on Sales\n                            \n\n\n\n\n\n                             Current Ratio\n                            \n\n\n\n\n\n                             Debt Ratio\n                            \n\n\n\n\n\n\n                        Authentication\n                       \n\n\n\n                          QuickBooks Email or User ID\n                         \n\n\n\n                          QuickBooks password\n                         \n\n\n\n\n                         Reports\n                        \n\n\n                        For report descriptions, see\n                        \n                         QuickBooks Online Reports Connector\n                        \n                        .\n                       \n\n                        QuickStart Data\n                       \n\n\n                         The QuickBooks Online QuickStart will provide the following data collections and cards:\n                        \n\n\n\n\n\n\n\n                             Collection\n                            \n\n\n\n\n\n\n\n                             Card\n                            \n\n\n\n\n\n                             Card Description\n                            \n\n\n\n\n\n                             Data Name\n                            \n\n\n\n\n\n\n\n\n\n                             Executive Pulse: 5 financial metrics to check daily.\n                            \n\n\n\n\n\n                             Net Income\n                            \n\n\n\n\n\n                             Also referred to as the bottom line, net profit, or net earnings, is a measure of the profitability of a venture after accounting for all costs. Consider reducing COGS and looking for areas to grow revenue.\n                            \n\n\n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Executive Pulse: 5 financial metrics to check daily.\n                            \n\n\n\n\n\n                             Cash Flows\n                            \n\n\n\n\n\n                             Shows the total amount of cash moving into and out of the company. Monitor balances and ensure that the company has enough cash to run its operations.\n                            \n\n\n\n\n\n\n\n                             Statement of Cash Flows\n                            \n\n\n\n\n\n\n\n                             Executive Pulse: 5 financial metrics to check daily.\n                            \n\n\n\n\n\n                             Top Customers\n                            \n\n\n\n\n\n                             Displays the customers that contribute the most to the company's income. Take measures to maintain good relationships and to retain these customers.\n                            \n\n\n\n\n\n\n\n                             Income by Customer Detail\n                            \n\n\n\n\n\n\n\n\n\n                             Executive Pulse: 5 financial metrics to check daily.\n                            \n\n\n\n\n\n                             Top Products/ Services\n                            \n\n\n\n\n\n\n\n                             Displays the company's most profitable products/services. Use this information to help guide product, pricing and promotional decisions.\n                            \n\n\n\n\n\n\n\n\n\n                             Sales by Product/Service Summary\n                            \n\n\n\n\n\n\n\n                             Executive Pulse: 5 financial metrics to check daily.\n                            \n\n\n\n\n\n                             Bank Accounts\n                            \n\n\n\n\n\n                             Shows the running balance of all bank accounts, by account. Consider investing in new opportunities with excess cash.\n                            \n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Collection\n                            \n\n\n\n\n\n\n\n                             Card\n                            \n\n\n\n\n\n                             Card Description\n                            \n\n\n\n\n\n                             Data Name\n                            \n\n\n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Working Capital\n                            \n\n\n\n\n\n                             Measures the amount of liquid assets the company has available to build its business. Take measures to ensure that the company maintains a healthy debt load.\n                            \n\n\n\n                             CALCULATION: Working Capital = Current Assets - Current Liabilities\n                            \n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Accounts Receivable Aging\n                            \n\n\n\n\n\n                             Categorizes open accounts receivable according to the length of time an invoice has been outstanding (e.g., current, 1-30, 31-60, 61-90, and over 90 days). If necessary, consider taking measures to reduce the average length of time it takes to collect receivables.\n                            \n\n\n\n\n\n\n\n                             A/R Aging Detail\n                            \n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Accounts Payable Aging\n                            \n\n\n\n\n\n                             Categorizes open accounts payable according to the length of time an invoice has been outstanding (e.g., current, 1-30, 31-60, 61-90, and over 90 days). Prioritize payment plans to maintain positive relations among suppliers.\n                            \n\n\n\n\n\n\n\n                             A/R Aging Detail\n                            \n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Current Assets\n                            \n\n\n\n\n\n                             Displays the value of all assets that are expected to be converted into cash within one year. Improve asset allocation and A/R collection efficiency to maximize profitability.\n                            \n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Fixed Assets\n                            \n\n\n\n\n\n                             Tracks assets that are not expected to be converted into cash within the next year by account. Consider investing in additional property, plants or equipment, depending on the company’s growth strategy.\n                            \n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Other Assets\n                            \n\n\n\n\n\n                             Shows the balance of other assets. Consider making additional investments or selling existing assets, as needed.\n                            \n\n\n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Current Liabilities\n                            \n\n\n\n\n\n                             Displays the value of all debts or obligations that are due within one year by account. Consider reducing spending or liquidating assets in order to meet obligations, as necessary.\n                            \n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n                             Balance Sheet: Gain perspective on assets, equity and liabilities.\n                            \n\n\n\n\n\n                             Long-Term Liabilities\n                            \n\n\n\n\n\n                             Displays the value of all debts or obligations, by account, that are not due within one year. Take measures to ensure that the company maintains a healthy debt load.\n                            \n\n\n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Collection\n                            \n\n\n\n\n\n\n\n                             Card\n                            \n\n\n\n\n\n                             Card Description\n                            \n\n\n\n\n\n                             Data Name\n                            \n\n\n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             Top Vendor Expenses\n                            \n\n\n\n\n\n                             Displays the company's top 20 vendor expenses. Use this information to determine what expenses can be reduced without adversely affecting the company.\n                            \n\n\n\n\n\n\n\n\n\n                             Expenses by Vendor\n                            \n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             Income\n                            \n\n\n\n\n\n\n\n\n\n\n\n                             Shows the income received from the direct sale of goods, broken down by account. Use this information to understand where revenue is being generated and what areas could use improvement.\n                            \n\n\n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             Costs of Goods Sold\n                            \n\n\n\n\n\n                             Tracks direct costs attributable to the production of goods sold by the company. This information can be used to provide insight into the company's gross margin.\n                            \n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             Gross Profit\n                            \n\n\n\n\n\n                             Measures the difference between revenue and the cost of making a product or providing a service, before deducting overhead, payroll, taxation, and interest payments. This information can help the company determine the value of incremental sales and guide pricing and promotion decisions.\n                            \n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             Operating Expenses\n                            \n\n\n\n\n\n                             Tracks the company's operating expenses (costs from the company's normal business operations). Expenses should be monitored and controlled to ensure that cost cutting strategies do not negatively impact the quality of the business or damage the company.\n                            \n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             EBITDA\n                            \n\n\n\n\n\n                             Measures earnings before interest, taxes, depreciation and amortization (EBITDA). Use this information to gain insight into the profitability of the company's operations.\n                            \n\n\n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             Other Income\n                            \n\n\n\n\n\n                             Shows the income received from sources other than the direct sale of goods. Use this information to understand additional revenue streams of the business.\n                            \n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Profit & Loss: Monitor revenue and expenses over time.\n                            \n\n\n\n\n\n                             Other Expenses\n                            \n\n\n\n\n\n                             Tracks the company's other expenses (non-operating costs). Expenses should be monitored and controlled to ensure that cost cutting strategies do not negatively impact the quality of the business or damage the company.\n                            \n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Collection\n                            \n\n\n\n\n\n\n\n                             Card\n                            \n\n\n\n\n\n                             Card Description\n                            \n\n\n\n\n\n                             Data Name\n                            \n\n\n\n\n\n\n\n\n\n                             Ratios: Gain perspective on financial status and prospects for the future.\n                            \n\n\n\n\n\n                             Gross Profit Margin\n                            \n\n\n\n\n\n                             Measures the difference between revenue and the cost of making a product or providing a service, before deducting overhead, payroll, taxation, and interest payments. Consider making changes to product pricing and production costs to improve margins.\n                            \n\n\n\n                             CALCULATION: Gross Profit Margin = Income - Cost of Goods Sold / Income\n                            \n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Ratios: Gain perspective on financial status and prospects for the future.\n                            \n\n\n\n\n\n                             Return on Sales\n                            \n\n\n\n\n\n\n\n\n\n\n\n                             Measures the company's operational efficiency. Consider making changes to product pricing, production costs and operational efficiencies to improve margins.\n                            \n\n\n\n                             CALCULATION: Return on Sales = Net Income / Sales\n                            \n\n\n\n\n\n\n\n                             Profit and Loss Detail\n                            \n\n\n\n\n\n\n\n                             Ratios: Gain perspective on financial status and prospects for the future.\n                            \n\n\n\n\n\n                             Current Ratio\n                            \n\n\n\n\n\n                             Measures the company's liquidity and ability to pay short-term obligations. Take measures to ensure that the company maintains a healthy debt load.\n                            \n\n\n\n                             CALCULATION: Current Ratio = Current Assets / Current Liabilities\n                            \n\n\n\n\n\n\n\n                             Balance Sheet\n                            \n\n\n\n\n\n\n\n                             Ratios: Gain perspective on financial status and prospects for the future.\n                            \n\n\n\n\n\n                             Debt Ratio\n                            \n\n\n\n\n\n                             Measures the company's debt relative to its assets. Take measures to ensure that the company maintains a healthy debt load.\n                             \n\n                             CALCULATION: Debt Ratio = Total Liabilities / Total Assets\n                            \n\n\n\n\n\n\n\n\n\n                             Balance Sheet", "Preview Article": "Click here to preview", "URL Name": "360042934054", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004182", "Archived Date": "", "Language": "English", "Primary Version": "QuickBooks Online Reports QuickStart App", "Article Total View Count": "2,395", "": "", "Article Created Date": "10/24/2022, 9:26 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              QuickBooks Online Reports QuickStart App\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}