{"file_path": "../../raw_kb_v2\\article\\360042929914\\index.html", "content": {"Title": "Pinterest Connector", "Article Body": "Important:\n                            \n                            As of March 2018, this connector is disabled while we negotiate our contract with Pinterest. Any DataSets built through this connector are no longer editable, and any cards powered by Pinterest DataSets will not update. If you want to import Pinterest data into Domo, you will need to use an alternate method such as\n                            \n                             DataSet via Email connector\n                            \n                            .\n                           \n\n\n\n\n\n                        Intro\n                       \n\n\n                         Pinterest is a content sharing service that allows members to \"pin\" images, videos and other objects to their pinboard.\n                        \n                        Use Domo's Pinterest connector to retrieve data about followers, pins, likes, and many other Pinterest entities. To learn more about the Pinterest API, visit their page (\n                        \n                         https://developers.pinterest.com/\n                        \n                        ).\n                       \n\n\n\n\n\n\n                             Primary Use Cases\n                            \n\n\n\n\n                            This connector is appropriate for pulling Pinterest data such as pins, likes, and so on.\n                           \n\n\n\n\n\n\n                             Primary Metrics\n                            \n\n\n\n\n\n\n                              Pinterest follower counts\n                             \n\n\n\n                              Engagement as measured by likes\n                             \n\n\n\n                              Number of pins\n                             \n\n\n\n\n\n\n\n\n                             Primary Company Roles\n                            \n\n\n\n\n\n\n                              Organic social media manager\n                             \n\n\n\n                              CMO\n                             \n\n\n\n\n\n\n\n\n                             Average Implementation Time\n                            \n\n\n\n\n                            10 minutes or less\n                           \n\n\n\n\n\n\n                             Ease of Use (on a 1-to-10 scale with 1 being easiest)\n                            \n\n\n\n\n                            2\n                           \n\n\n\n\n\n                        You connect to your Pinterest account in the Data Center. This topic discusses the fields and menus that are specific to the Pinterest connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Pinterest account and create a DataSet, you must have credentials for the account (the email address you use to log into Pinterest and your Pinterest password) OR Facebook or Google credentials.\n                       \n\n                        Connecting to Your Pinterest Account\n                       \n\n                        This section enumerates the options in the\n                        \n\n                          Credentials\n                         \n\n                        and\n                        \n\n                          Details\n                         \n\n                        panes in the Pinterest Connector page. The components of the other panes in this page,\n                        \n\n                          Scheduling\n                         \n\n                        and\n                        \n\n                          Name & Describe Your DataSet\n                         \n                         ,\n                        \n                        are universal across most connector types and are discussed in greater length in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Credentials Pane\n                       \n\n                        The Domo Pinterest connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Pinterest accounts in Domo) to open the Pinterest OAuth screen where you can enter the email address you use to log into Pinterest along with your Pinterest password. Alternatively, you can choose to enter Facebook or Google credentials. Once you have entered valid credentials, you can use the same account any time you go to create a new Pinterest DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Pinterest when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Pinterest.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Pinterest report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Account\n                              \n\n                               Returns the first and last name, ID, and URL of the authenticated user.\n                              \n\n\n\n                               Boards\n                              \n\n                               Returns a list of the authenticated user's public boards, including the URL, ID, and name.\n                              \n\n\n\n                               Board Pins\n                              \n\n                               Returns a list of Pins on the board with their IDs, URLs, links, and descriptions.\n                              \n\n\n\n                               Followers\n                              \n\n                               Returns the users who follow the authenticated user. The default response returns the first and last name, ID, and URL of the users.\n                              \n\n\n\n                               Following Boards\n                              \n\n                               Returns the boards that the authenticated user follows. The default response returns the ID, name and URL of the board.\n                              \n\n\n\n                               Following Interests\n                              \n\n                               Returns the topics that the authenticated user follows. The default response returns the ID and name of the topic.\n                              \n\n\n\n                               Following Users\n                              \n\n                               Returns the users that the authenticated user follows. The default response returns the first and last name, ID and URL of the users.\n                              \n\n\n\n                               Likes\n                              \n\n                               Returns the ID, link, URL and description of the Pins the authenticated user has liked.\n                              \n\n\n\n                               Pins\n                              \n\n                               Returns the ID, link, URL and descriptions of the authenticated user's Pins.\n                              \n\n\n\n                               Search Boards\n                              \n\n                               Searches the authenticated user's board names (but not Pins on boards). An empty response indicates that nothing was found that matched your search terms. The default response returns the ID, name and URL of boards matching your query.\n                              \n\n\n\n                               Search Pins\n                              \n\n                               Searches the authenticated user's Pin descriptions. An empty response indicates that nothing was found that matched your search terms. The default response returns the ID, link, URL and description of Pins matching your query.\n                              \n\n\n\n\n\n\n\n                           Board Pins\n                          \n\n                           Enter the ID of the board you want to retrieve pins for.\n                          \n\n\n\n                           Search Query\n                          \n\n                           Enter a term to search for.\n                          \n\n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Troubleshooting\n                       \n\n                        Be aware that Follower results are often truncated (shortened). For example, you might have 9,700 followers but your DataSet would show this as \"9.7.\" It takes logic to analyze and adjust to the correct number.", "Preview Article": "Click here to preview", "URL Name": "360042929914", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003461", "Archived Date": "", "Language": "English", "Primary Version": "Pinterest Connector", "Article Total View Count": "4,677", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Pinterest Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}