{"file_path": "../../raw_kb_v2\\article\\360042931494\\index.html", "content": {"Title": "JSON Webhook Connector", "Article Body": "Intro\n                       \n\n                        Domo's JSON Webhook connector allows you to connect to data sources that push JSON-formatted data, such as IFTTT, Github, and Fitbit. Using JSON Webhooks, you can get access to real-time data from weather devices, vending machines, wearables, and more. The Webhook link includes a long-living single use token so anyone with the link can publish data to your DataSet.\n                       \n\n                        You set up your JSON Webhook connection by configuring options in the Data Center as well as in the third-party application, as described in continuation.\n                       \n\n\n                         Video - Creating a JSON Webhook DataSet\n                        \n\n\n\n\n\n\n                        Setting up a JSON Webhook Connection\n                       \n\n\n                         This section explains how to set up a JSON Webhook connection in Domo and in the third-party application. Once you have set up a successful connection, you can use the same account any time you go to create a new JSON Webhook DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n\n                         To set up a JSON Webhook connection,\n                        \n\n\n\n\n                          Select\n                          \n                           Appstore\n                          \n                          from the top navigation pane.\n                         \n\n\n\n                          Search for \"JSON Webhook,\" then click the tile when it appears.\n                         \n\n\n\n                          Click\n                          \n                           Get the Data\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Copy Link\n                          \n                          .\n                         \n\n\n\n                          Paste the link you just copied into the appropriate location in your third-party application.\n                          \n\n                          The following screenshot comes from Github:\n                          \n\n\n\n\n                          This location will\n                          \n                           usually\n                          \n                          be a field with a name like \"Payload URL,\" like in the above screenshot. However, there are exceptions. Please refer to the third-party application's documentation if you are not sure.\n                          \n\n                          Also, be sure to follow the third-party application's requirements for pasting the URL. In some applications, the token (the piece after the last backslash) must be pasted on a different line.\n                         \n\n\n\n                          Also in the third-party application, be sure to set the content type to \"application/json.\"\n                          \n\n\n\n\n\n\n                          Configure other settings in the third-party application as necessary then save the webhook.\n                         \n\n\n\n                          Return to the JSON Webhook connector interface in Domo.\n                         \n\n\n\n                          (Optional) Enter a\n                          \n                           Webhook Secret\n                          \n                          if desired.\n                          \n\n                          If a Webhook Secret is specified, Domo will expect a X-Hub-Signature header with every post. The value of the X-Hub-Signature is the HMAC (hash-based message authentication code) of the request body using the Webhook Secret and either SHA1, SHA256 or SHA512 hash algorithms.\n                         \n\n\n\n                          (Optional) If you want to include metadata in the DataSet, such as IP and timestamp, select\n                          \n                           Yes\n                          \n                          in the last menu in the\n                          \n                           Details\n                          \n                          view; otherwise leave this set to\n                          \n                           No\n                          \n                          .\n                         \n\n\n\n                          (Optional) If you want to use \"Replace\" instead of \"Append\" when the DataSet is updated, click\n                          \n                           Change update settings\n                          \n                          , select\n                          \n                           Replace\n                          \n                          in the menu, then click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Enter a DataSet name and description (optional) in the correct fields.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        You should now have a functional connector that collects data continuously from the third-party application and updates to Domo every 15 minutes.\n                       \n\n                        FAQs\n                       \n\n                        What type of data do I need to push to this Connector?\n                       \n\n                        JSON-formatted data.\n                       \n\n                        What does it mean if my data includes blank fields?\n                       \n\n                        Because the connector creates a record for each row, if a row does not include data, that row will appear blank in your DataSet.\n                       \n\n                        Who can push data into my Webhook DataSet?\n                       \n\n                        The Webhook link includes a long-living single use token, so anyone with the link can publish data to your DataSet.\n                       \n\n                        Can anyone with the Webhook link see the data in my DataSet?\n                       \n\n                        The Webhook link will push the data but will not show or expose any data.\n                       \n\n                        What is the rate limit for this Connector?\n                       \n\n                        25 calls per second.\n                       \n\n                        Is there a size limit for a single call?\n                       \n\n                        Yes, the Webhook accepts up to 100KB of data in a single call.", "Preview Article": "Click here to preview", "URL Name": "360042931494", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003317", "Archived Date": "", "Language": "English", "Primary Version": "JSON Webhook Connector", "Article Total View Count": "5,475", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              JSON Webhook Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}