{"file_path": "../../raw_kb_v2\\article\\360043429973\\index.html", "content": {"Title": "Buzz Layout", "Article Body": "Intro\n                        \n\n\n\n                        Buzz consists of the following panes:\n                       \n\n\n\n                          A navigation pane that lists all of your conversations and provides access to different options.\n                         \n\n\n\n                          A conversation pane in which the selected conversation appears.\n                         \n\n\n\n                          A details pane where you can view information about the selected conversation and configure settings.\n                         \n\n\n\n                          A \"Flag for follow-up\" pane in which you can view all conversations you have flagged for further review.\n                         \n\n\n\n                          A \"Discover\" pane that shows trending topics, online users, recent conversations, etc.\n                         \n\n\n\n                        By default, only one pane appears on the right side of the screen when you open Domo; however, you can toggle the full-screen mode for Buzz by doing any of the following:\n                       \n\n\n\n                          Entering Ctrl + Alt + x on your keyboard.\n                         \n\n\n\n                          Selecting\n                          \n                           Toggle Fullscreen\n                          \n                          in the\n                          \n                           Buzz\n                          \n                          menu at the top of Buzz.\n                         \n\n\n\n                        In this mode, the conversation and Buzz menu panes are both open by default. You can also open the details pane by clicking\n                        \n                        in the conversation pane.\n                       \n\n                        You can also enlarge the Buzz panel view by dragging the left edge of the panel as wide as you want.\n                       \n\n                        The main interface components of Buzz are the same in the web and desktop versions. The only difference is that the desktop version includes additional options in a toolbar. For more information, see\n                        \n                         Desktop version toolbar options\n                        \n                        .\n                       \n\n\n\n                          Video - Buzz Overview\n                         \n\n\n\n\n\n\n\n                        Buzz Menu, Status, and Universal Compose\n                       \n\n                        In the black bar at the top of Buzz, you can access the\n                        \n                         Buzz\n                        \n                        menu, which includes a number of general-purpose settings options, as well as the Universal Compose icon. This bar is available in every pane in Buzz, so you can take advantage of these options no matter where you are.\n                       \n\n\n\n\n\n\n                        Buzz Menu\n                       \n\n                        In the Buzz menu, you have access to the following options:\n                       \n\n\n\n                          Update your status.\n                         \n                         Set your status to Available, Busy, Away, or Out of office. You can also add a custom message to your status when you are unavailable.\n                        \n\n\n\n                           Toggle Fullscreen\n                          \n                          . Toggles full-screen mode for Buzz. In this view, all three panels are displayed at once across the screen. You can also toggle full-screen mode by entering Ctrl + Alt + x on your keyboard.\n                         \n\n\n\n\n                           Mark All as Read.\n                          \n                          This lets you mark all messages as read, thereby removing all notifications for unread messages.\n                         \n\n\n\n\n                           Manage Settings\n                          \n                          . Opens your\n                          \n                           Notification Settings\n                          \n                          .\n                         \n\n\n\n\n                           Show Keyboard Shortcuts\n                          \n                          . Opens a list of keyboard shortcuts for use in Buzz.\n                         \n\n\n\n\n                           Email to Buzz\n                          \n                          . Lets you convert an email message into a Buzz conversation. For more information, see\n                          \n                           Importing an Email Thread into Buzz\n                          \n                          .\n                         \n\n\n\n\n                           Download the Buzz App\n                          \n                          . Lets you download the desktop version of Buzz to your computer. For more information, see\n                          \n                           Downloading and Running the Buzz Desktop Version\n                          \n                          .\n                         \n\n\n\n                        Status\n                       \n\n                        Update your status on web or mobile to\n                        \n                         Available\n                        \n                        ,\n                        \n                         Busy\n                        \n                        ,\n                        \n                         Away\n                        \n                        , or\n                        \n                         Out of the office\n                        \n                        . When someone sends you a 1:1 message or @mentions you in a conversation and your status is set to something other than Available, they will see a warning message that states you are unavailable. You can add custom messaging to your status message when you are unavailable as well as assign a delegate when you are\n                        \n                         Out of office\n                        \n                        . An icon on your avatar indicates your current status. When your status is set to\n                        \n                         Available\n                        \n                        , a colored dot will show on your avatar, Green indicates you are Available and have been interacting with Domo. Yellow indicates that you Available, but have not been active within Domo recently. Gray means you are logged out of Domo. These colors are automatically updated by the system based on your activity inside of Domo.\n                        \n\n\n\n\n\n\n\n                        Universal Compose\n                       \n\n                        Universal Compose lets you compose a Buzz message from anywhere in Buzz without first having to locate and open a conversation. You can start a conversation from scratch by searching for the people or groups you want to message. Or, you can add a message onto an existing conversation by searching for the conversation.\n                       \n\n                        This dialog opens when you click the\n                        \n                        icon that appears over any pane in Buzz OR when you click\n                        \n                        icon in the\n                        \n                         Conversations\n                        \n                        area in the navigation pane. Here you can initiate a public or private conversation with select individuals or groups or open an existing conversation you are already included in and contribute to it.\n                       \n\n                        The following screenshot points out the most important parts of this dialog:\n                        \n\n\n\n\n\n\n                        You can learn more about these components in the following table:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Conversation search box\n                           \n\n\n\n                            Lets you search for a person or group to start a new conversation with, or an existing conversation to join.\n                           \n\n\n\n\n\n                            New topic toggle\n                           \n\n\n\n                            Lets you specify whether the topic you want to add to is new or already exists. If the topic is new, you are prompted to enter a name for the topic as well as set the privacy.\n                           \n\n\n\n\n\n                            Message field\n                           \n\n\n\n                            Lets you enter your message.\n                           \n\n\n\n\n\n\n\n                        Navigation Pane\n                       \n\n                        In the navigation pane, you can locate the conversation you want to view or contribute to. You can also open the Flag for Follow-up and Discover panes, as well as invite team members to Buzz. In full-screen mode, this is the pane that appears on the left. The following screenshot points out the most important features of the navigation pane:\n                       \n\n\n\n\n\n\n\n                        You can learn more about these components in the following table:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Search box\n                           \n\n\n\n                            Lets you filter conversations in Buzz by entering a keyword. When you click in the field, a\n                            \n                             Search Buzz\n                            \n                            pane opens. Here you can enter your search term. Results display with conversation names, conversation types, and the number of member users. You can sort search results by relevance, by creation date, or by last updated date.\n                           \n\n                            The Buzz search can locate conversations by participant, name, or message content.\n                           \n\n\n\n\n\n                            Conversation toggle\n                           \n\n\n\n                            Lets you use the arrows to move back and forth through conversations as you viewed them.\n                           \n\n\n\n\n\n                            \"Flag for follow-up\" link\n                           \n\n\n\n                            Opens the\n                            \n                             Flag for follow-up\n                            \n                            pane, which shows you all of the Buzz messages you have flagged, allowing you to quickly follow up on your action items. A gray numeral to the right of the link indicates the number of flagged messages.\n                           \n\n\n\n\n\n                            \"Discover\" link\n                           \n\n\n\n                            Opens the\n                            \n                             Discover\n                            \n                            pane, in which you can see trending topics, online users, messages with the most reactions, and recent conversations.\n                           \n\n\n\n\n\n                            Favorited conversations\n                           \n\n\n\n                            Lists conversations you have added as Favorites (by going into the Details view for the conversation and clicking\n                            \n                             Add to Favorites\n                            \n                            ). You can move conversations up or down in the list by clicking the plus icon then using the three-bar icons to drag conversations to where you want them.\n                           \n\n\n\n\n\n                            Conversations\n                           \n\n\n\n                            Provide access to given conversations within Buzz. A numeral to the right of a conversation name indicates that there is this number of unread messages in the conversation. You can remove a conversation with unread messages from the list by mousing over it and clicking the \"x\" button that appears.\n                           \n\n                            If a conversation has threads, these appear under the conversation name and are referred to as \"Thread message.\" If you click the \"Thread message\" text for a conversation, the thread opens directly in the conversation pane.\n                           \n\n                            Conversations are divided into a number of different types, each of which is indicated using a different icon. These icons are as follows:\n                           \n\n\n\n\n\n                                Icon\n                               \n\n\n\n                                Conversation Type\n                               \n\n\n\n\n\n\n\n\n\n\n\n\n\n                                 Public conversation\n                                \n                                . All users in your Domo instance are automatically members of public conversations and can view and contribute to them.\n                               \n\n\n\n\n\n\n\n\n\n\n\n                                 Group conversation\n                                \n                                . A conversation limited to specified members. You must be a member of the group to view or contribute to the conversation.\n                               \n\n\n\n\n\n\n\n\n\n\n\n                                 One-on-one conversation\n                                \n                                . A conversation between you and one other person. If you invite another user to a one-on-one conversation, it becomes a group conversation.\n                               \n\n                                If the dot appears yellow, it indicates that the other person in the conversation is online. Otherwise, the dot appears gray.\n                               \n\n\n\n\n\n\n\n\n\n\n\n                                 Page conversation\n                                \n                                . A conversation centered around a page. Only users with access to the page can see or contribute to the conversation.\n                               \n\n\n\n\n\n\n\n\n\n\n\n                                 Card conversation\n                                \n                                . A conversation centered around a card. Only users with access to the card can see or contribute to the conversation.\n                               \n\n\n\n\n\n\n\n\n\n\n\n                                 Project conversation\n                                \n                                . A conversation centered around a project. Only users with access to the project can see or contribute to the conversation.\n                               \n\n\n\n\n\n                            If you click the plus button to the right of the \"Conversations\" text, the Universal Compose pane opens, allowing you to start a new conversation. For more information, see\n                            \n                             Buzz Menu and Universal Compose\n                            \n                            .\n                           \n\n\n\n\n\n                            Conversations list\n                           \n\n\n\n                            Displays conversations that you have recently opened or that contain unread messages (indicated by a numeral to the right).\n                           \n\n\n\n\n\n                        Flag for Follow-Up Pane\n                       \n\n                        You can access the\n                        \n                         Flag for follow-up\n                        \n                        pane by clicking\n                        \n                         Flag for follow-up\n                        \n                        in the navigation pane. This pane displays all messages you have flagged (by mousing over the message, clicking the ellipsis icon, and selecting\n                        \n                         Flag for follow-up\n                        \n                        ). You can click a message to open it in the conversation pane so you can take action on it. Or, if you have already taken the necessary action, you can unflag it by clicking its \"x\" icon (causing it to be removed from the\n                        \n                         Flag for follow-up\n                        \n                        pane).\n                       \n\n\n\n\n                        Discover Pane\n                       \n\n                        You can access the\n                        \n                         Discover\n                        \n                        pane by clicking\n                        \n                         Discover\n                        \n                        in the navigation pane. This pane auto-populates with information based on Buzz conversations happening in your company. In the pane, you can find all of the following:\n                       \n\n\n\n\n                           Trending Topics\n                          \n                          . Frequent topics of conversation within your company's Buzz appear here in a Word Cloud chart. You can click any word in the chart to filter to show conversations containing that word. For example, if you clicked \"Facebook,\" all conversations containing the word \"Facebook\" would open in the conversations pane.\n                         \n\n\n\n\n                           Online Now\n                          \n                          . Here you can view all users who are currently logged into your Domo instance.\n                         \n\n\n\n\n                           Most Reacted Messages\n                          \n                          . Here you can see messages that have had the most reactions (based on the number of emojis clicked). Only one message is shown here at a time; you can see additional messages by clicking\n                          \n                           Next\n                          \n                          or\n                          \n                           Previous\n                          \n                          .\n                         \n\n\n\n\n                           Recent Conversations\n                          \n                          . All of your recent conversations appear here.\n                         \n\n\n\n\n\n\n                        Search Buzz Pane\n                       \n\n                        In the\n                        \n                         Search\n                        \n\n                         Buzz pane\n                        \n                        , you can\n                        \n\n                        filter conversations in Buzz by entering a keyword. You open this pane by clicking in the\n                        \n                         Search\n                        \n                        box in the navigation pane. Results display with conversation names, conversation types, and the number of member users. You can sort search results by relevance, by creation date, or by last updated date.\n                       \n\n                        The Buzz search can locate conversations by participant, name, or message content.\n                       \n\n\n\n\n                        Conversation Pane\n                       \n\n                        The conversation pane is the heart of Buzz. Here you can engage in conversations with the individuals and groups you choose.\n                       \n\n                        The following screenshot points out the most important features of the conversation pane. In full-screen mode, this is the pane that appears in the center.\n                        \n\n\n\n\n\n\n                        You can learn more about these components in the following table:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Conversation name\n                           \n\n\n\n                            The name of this conversation. Conversations based around people (rather than cards, pages, etc.) take the name of the people and/or groups included in the conversation, while data conversations based around data elements such as pages and cards take the name of the elements (card, page, project, etc.) they are tied to.\n                           \n\n\n\n\n\n                            Back button\n                           \n\n\n\n                            Opens the\n                            \n                             Buzz menu\n                            \n                            . In full-screen mode this icon does not appear.\n                           \n\n\n\n\n\n                            Favorite icon\n                           \n\n\n\n                            Lets you add this conversation as a favorite. You can then access it quickly under the\n                            \n                             Favorites\n                            \n                            filter in your Buzz menu.\n                           \n\n\n\n\n\n                            Participating users\n                           \n\n\n\n                            Indicates the number of users who are included in this conversation. Click to see the names of all of the included users.\n                           \n\n\n\n\n\n                            Video chat icon\n                           \n\n\n\n                            Lets you start a video chat with the users in the conversation. For more information, see\n                            \n                             Using Video Chat in Buzz\n                            \n                            .\n                           \n\n\n\n\n\n                            Threads toggle\n                           \n\n\n\n                            Shows all of the threads (side conversations) for this conversation. You can click a thread to open just that thread in the conversation pane.\n                           \n\n\n\n\n\n                            Details icon\n                           \n\n\n\n                            Opens the Conversation Details for the conversation.\n                           \n\n\n\n\n\n                            Channel type\n                           \n\n\n\n                            Indicates the type of conversation. Conversation types include the following:\n                           \n\n\n\n                              Public Channel — The conversation is open to all users in your Domo.\n                             \n\n\n\n                              1 on 1 — The conversation is between two people.\n                             \n\n\n\n                              Group Conversation — The conversation is between three or more people (Domo groups may or may not be included).\n                             \n\n\n\n                              Page Channel — The conversation is associated with a specific page.\n                             \n\n\n\n                              Card Channel — The conversation is associated with a specific card.\n                             \n\n\n\n                              Project Channel — The conversation is associated with a specific project.\n                             \n\n\n\n                            Furthermore, each of these can have \"threads\"—side conversations that break off of the original conversation. If anyone from the original conversation can view the thread, it is simply called a \"thread.\" If the thread is limited to certain people, it is called a \"private thread.\"\n                           \n\n\n\n\n\n                            Bot message\n                           \n\n\n\n                            Indicates a message that has appeared automatically in this conversation as a result of a connected Bot. For more information about Bots, see\n                            \n                             Adding a Bot to Buzz\n                            \n                            .\n                           \n\n\n\n\n\n                            Emoji\n                           \n\n\n\n                            Shows user reactions to this message. You can add an emoji after a message by mousing over the message, clicking\n                            \n                            , then selecting the desired emoji. You can also \"agree\" with an existing emoji by clicking on it. This raises the value of the emoji by 1. If you click an emoji a second time, your \"agreement\" is cancelled and the value decreases by 1.\n                           \n\n\n\n\n\n                            Timestamp\n                           \n\n\n\n                            Shows when a comment was added to this conversation.\n                           \n\n\n\n\n\n                            Quoted message\n                           \n\n\n\n                            Indicates a message from earlier in this conversation that has been \"re-quoted.\" You can quote a message in a conversation by mousing over the conversation and clicking\n                            \n                            .\n                           \n\n\n\n\n\n                            Conversation\n                           \n\n\n\n                            Displays the selected conversation. Comments are sorted chronologically, with the most recent comments appearing at the bottom of the list. Comments for a given day are grouped within that day.\n                           \n\n                            When you mouse over a post in a conversation, an options panel appears:\n                           \n\n\n\n\n                            The three most commonly used options appear here; you can also click the ellipsis icon (...) to view several more. The following table describes the available options:\n                           \n\n\n\n\n\n                                Option\n                               \n\n\n\n                                Description\n                               \n\n\n\n\n\n\n\n                                Like icon\n                                \n\n\n\n\n                                Lets you \"like\" this message. If the message has not yet been liked, a \"like\" emoji appears and the value is set to 1. If the message has already been liked, the emoji's value is raised by 1.\n                               \n\n\n\n\n\n                                Quote icon\n                                \n\n\n\n\n                                Lets you quote this message in your reply. This is useful when you want to reply to an earlier message in a thread but don't have the proper context because of more recent messages.\n                               \n\n\n\n\n\n                                Reaction icon\n                                \n\n\n\n\n                                Lets you insert a reaction emoji after this message and sets the value to 1. Other viewers can then click the emoji to raise the value by 1. This allows you have other emojis besides the standard \"like\" icon. For example, if a user found a thread amusing, he could insert a \"laughing\" face emoji. Other users who agreed could then click on the emoji to raise the value.\n                               \n\n\n\n\n\n\n                                 Favorite\n                                \n                                menu option\n                               \n\n\n\n                                Lets you add a message as a Favorite. Favorited messages appear in the\n                                \n                                 Favorited Messages\n                                \n                                section of the\n                                \n                                 Details\n                                \n                                pane for this conversation.\n                               \n\n\n\n\n\n\n                                 Flag for follow-up\n                                \n                                menu option\n                               \n\n\n\n                                Lets you flag this message for follow-up. When you do this, the message appears in the\n                                \n                                 Flag for Follow-up\n                                \n                                pane so you can easily find it later and take the necessary action. A blue flag icon also appears next to the message in the original conversation so you know it has been flagged.\n                               \n\n\n\n\n\n\n                                 Create thread\n                                \n                                menu option\n                               \n\n\n\n                                Lets you create a thread within this conversation using this message as the starting point.\n                               \n\n\n\n\n\n\n                                 Create task\n                                \n                                menu option\n                               \n\n\n\n                                Lets you create and assign a task based on this message. For more information, see\n                                \n                                 Creating and assigning a task in Buzz\n                                \n                                .\n                               \n\n\n\n\n\n\n                                 Edit\n                                \n                                menu option\n                               \n\n\n\n                                Lets you edit a message you have already posted. When you edit a message, the word \"Edited\" appears next to it to indicate that it has been modified.\n                               \n\n\n\n\n\n\n                                 Delete\n                                \n                                menu option\n                               \n\n\n\n                                Deletes this message. When you delete a message, it is replaced by the text \"This message has been deleted\" so viewers know there is a piece of the conversation missing. This option is only available if you wrote the post to be deleted or you have an \"Admin\" default security profile or a custom role with the \"Edit Conversations and Messages\" privilege enabled.\n                               \n\n\n\n\n\n\n\n\n\n                            @-mentioned user\n                           \n\n\n\n                            Indicates a user who has been specifically referenced in this message.\n                           \n\n\n\n\n\n                            Attachment\n                           \n\n\n\n                            A thumbnail for an attached file or referenced card.\n                           \n\n                            If the thumbnail is for a file, you can click it to open a larger preview. From there you can\n                            \n                             open it in the reading view\n                            \n                            . You can hide file attachments by clicking the\n                            \n                             Hide\n                            \n                            option next to the filename.\n                           \n\n                            If the thumbnail is for a referenced card, you can click it to show a preview of the card. From there you can\n                            \n                             open its Details view\n                            \n                            , add it to a card page, or\n                            \n                             add it as a Favorite\n                            \n                            . You cannot hide cards as you can file attachments.\n                           \n\n\n\n\n\n                            Thread\n                           \n\n\n\n                            Indicates a break-off thread within this conversation. You can create a thread from a message by mousing over the message, clicking the ellipsis, and clicking\n                            \n                            . In the main conversation view, only the most recent message in a thread is shown, but you can click\n                            \n                             View Thread\n                            \n                            to open it in its own view, in which all messages in the thread are shown. From there, you can open the details view for the thread.\n                           \n\n                            You can change a private thread to public by opening the details view for the thread then clicking\n                            \n                             Make Public\n                            \n                            . You can only do this if you started the thread or you have an \"Admin\" default security profile or a custom role with the \"Edit Conversations and Messages\" privilege enabled. For more information about default security roles, see\n                            \n                             Default Security Role Reference\n                            \n                            . For more information about custom roles, see\n                            \n                             Managing Roles\n                            \n                            .\n                           \n\n                            You can show all threads in a conversation by clicking\n                            \n                            at the top of the conversation pane. This opens a pane that shows entries for all threads in the conversation. You can then click an entry to open the thread in its entirety.\n                           \n\n\n\n\n\n                            New message field\n                           \n\n\n\n                            Lets you enter a new message in this conversation. You can add attachments to the message by clicking the\n                            \n                            icon or emojis by clicking the\n                            \n                            icon. You can also reference users, groups, cards, pages, or projects within your message by inserting @ then entering the name of the item you want to reference.\n                           \n\n                            You can also start a side thread from the message by clicking\n                            \n                            .\n                           \n\n\n\n\n\n                            Attachment icon\n                           \n\n\n\n\n\n\n                            Lets you upload an attachment to this message, either a file from your computer or network or a Domo card.\n                           \n\n\n\n\n\n                            New thread icon\n                           \n\n\n\n\n\n\n                            Lets you start a side thread in the conversation with this message as the initial message in the conversation. Threads can be set to private (default) or public. Private threads can only be viewed by their creators and anyone @-mentioned in the message or invited in the conversation details view. Public threads are visible to all members of the conversation.\n                           \n\n\n\n\n\n                            Emoji icon\n                           \n\n\n\n\n\n\n                            Lets you add an emoji to this conversation.\n                           \n\n\n\n\n\n                        Details Pane\n                       \n\n                        In the details pane for a conversation you can view and edit details for the conversation such as the name, description, attachments, invited users, and so on. The following screenshot points out the main components of this pane:\n                       \n\n\n\n\n                        You can learn more about these components in the following table:\n                       \n\n\n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Details section\n                           \n\n\n\n                            Shows basic information about this conversation, including the title, description, and start date. The options that appear here differ depending on whether you are in the details view for a main conversation or a thread as well as the privacy status. For example, the\n                            \n                             Make Public\n                            \n                            option is only available for private threads.\n                           \n\n                            You can change the title of a people-centered conversation (which takes as its title the names of its primary participants) by clicking and editing. You\n                            \n                             cannot\n                            \n                            change the name of a  data-centered conversation (i.e. a conversation around a card, page, or project) here. The only way to change the name of a data-centered conversation is to change the name of its element. For example, to change the name of a page conversation, you would need to change the name of the page.\n                           \n\n\n\n\n\n                            Shareable URL link\n                           \n\n\n\n                            Generates a URL you can then copy and send to other users. Those users can then follow this URL to open this conversation in Buzz.\n                           \n\n\n\n\n\n                            Add as Favorite/Unfavorite link\n                           \n\n\n\n                            Lets you add this conversation to or remove it from your\n                            \n                             Favorites\n                            \n                            list in the navigation pane.\n                           \n\n\n\n\n\n                            Follow/Unfollow link\n                           \n\n\n\n                            Lets you follow or unfollow this conversation. If you follow a conversation, it is considered active and appears in your\n                            \n                             Conversations\n                            \n                            menu in the navigation pane If you unfollow a conversation, it is removed from your\n                            \n                             Conversations\n                            \n                            menu. However, you can return to it by searching for it in the navigation pane.\n                           \n\n\n\n\n\n                            Import Email option (not shown)\n                           \n\n\n\n                            Lets you import an existing email thread into this Buzz conversation. For more information, see\n                            \n                             Importing an Email Thread into Buzz\n                            \n                            .\n                           \n\n\n\n\n\n                            Make Public option (private threads only)\n                           \n\n\n\n                            Makes a thread visible to all members of the channel. Be aware that once you make a thread public, you cannot change it back to private.\n                           \n\n\n\n\n\n                            Delete (private threads only)\n                           \n\n\n\n                            Deletes this thread from the conversation.\n                           \n\n\n\n\n\n                            Notification Settings\n                           \n\n\n\n                            Lets you configure Notification Settings for this conversation. You can configure whether notifications are sent via email\n                            \n                            , Domo Mobile\n                            \n                            , SMS\n                            \n                            , or push notifications on your computer\n                            \n                            . For each of these, you can indicate whether notifications are sent when you are @ mentioned in the conversation, when any activity occurs in the conversation, or not at all. All of these settings inherit from the global Notification Settings for your Domo. For more information, see\n                            \n                             Configuring Notification and Alert Settings\n                            \n                            .\n                           \n\n\n\n\n\n                            Attachments section\n                           \n\n\n\n                            Lists all files that have been attached to this conversation. Click a file to open a preview of it as well as download it to your computer.\n                           \n\n\n\n\n\n                            Bots section\n                           \n\n\n\n                            Lets you add \"Bots\"—integrations with various third-party connectors—to your Buzz. For more information, see\n                            \n                             Adding a Bot to Buzz\n                            \n                            .\n                           \n\n\n\n\n\n\n\n                            Favorited messages\n                           \n\n\n\n                            Displays all messages you have added as favorites by clicking the\n                            \n                            icon.\n                           \n\n\n\n\n\n                            Related conversations (not shown)\n                           \n\n\n\n                            Displays conversations with related content.\n                           \n\n\n\n\n\n                            Invite button\n                           \n\n\n\n                            Lets you invite users to a conversation. Users invited to a conversation receive notifications for the conversation even if they are not yet following it.\n                           \n\n\n\n\n\n                            People section\n                           \n\n\n\n                            Shows all people and groups active in the conversation. A yellow circle next to a person's picture indicates that person is currently online. A gray circle indicates that the person is not online at the moment.\n                           \n\n\n\n\n\n                        Desktop Version Toolbar Options\n                       \n\n                        The desktop version of Buzz is the same as the web version in almost all respects, so all of the above user interface information applies to both versions. The major difference in the desktop version is the addition of a number of toolbar options in the top left corner. The following tables describes these options:\n                       \n\n\n\n                          Edit Menu\n                         \n\n\n\n\n\n\n                           Option\n                          \n\n                           Description\n                          \n\n\n\n\n\n\n\n\n                            Undo\n                           \n\n\n\n\n\n\n\n                            Undoes your most recent action (the same as pressing Ctrl+Z)\n                           \n\n\n\n\n\n\n\n\n\n                            Redo\n                           \n\n\n\n\n\n\n\n                            Redoes an action you have undone (the same as pressing Ctrl+Y)\n                           \n\n\n\n\n\n\n\n\n\n                            Cut\n                           \n\n\n\n\n\n\n\n                            Cuts a selection of text (the same as pressing Ctrl+X)\n                           \n\n\n\n\n\n\n\n\n\n                            Copy\n                           \n\n\n\n\n\n\n\n                            Copies a selection of text (the same as pressing Ctrl+C)\n                           \n\n\n\n\n\n\n\n\n\n                            Paste\n                           \n\n\n\n\n\n\n\n                            Pastes a selection of text (the same as pressing Ctrl+V)\n                           \n\n\n\n\n\n\n\n\n\n                            Select All\n                           \n\n\n\n\n\n\n\n                            Selects all text in any given field (e.g. when writing a message, editing a channel name, etc.) (the same as pressing Ctrl+A)\n                           \n\n\n\n\n\n\n\n\n\n                            Find\n                           \n\n\n\n\n\n\n\n                            Opens the search screen, in which you can search for Buzz conversations containing the specified name or keyword.\n                           \n\n\n\n\n\n\n\n\n\n\n\n                          Settings Menu\n                         \n\n\n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n                            Start on Login\n                           \n\n\n\n\n\n\n\n                            When turned on, Buzz opens automatically when you log into your computer.\n                           \n\n\n\n\n\n\n\n\n\n                            Mute All Notifications\n                           \n\n\n\n\n\n\n\n                            Turns off notifications for all channels and chats you have joined. For more information about notifications, see\n                            \n                             Configuring Notification and Alert Settings\n                            \n                            .\n                           \n\n\n\n\n\n\n                           Disable Icon Flashing\n                          \n\n                           Turns off icon flashing.\n                          \n\n\n\n\n\n\n                            Logout of Domo\n                           \n\n\n\n\n\n\n\n                            Logs you out of Buzz and returns you to the login screen.\n                           \n\n\n\n\n\n\n\n\n\n\n\n                          View Menu\n                         \n\n\n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n                            Reload\n                           \n\n\n\n\n\n                            Refreshes Buzz.\n                           \n\n\n\n\n\n                            Zoom In\n                           \n\n\n\n                            Zooms in one level closer.\n                           \n\n\n\n\n\n                            Reset Zoom\n                           \n\n\n\n                            Returns to the default zoom settings.\n                           \n\n\n\n\n\n                            Zoom Out\n                           \n\n\n\n                            Zooms out one level.\n                           \n\n\n\n\n\n\n\n\n\n                          Team Menu\n                         \n\n\n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n                            [Team Name radio buttons]\n                           \n\n\n\n\n\n\n\n                            Lists all of the different Domo instances you have logged into in Buzz Desktop. Click the button for a different instance to switch over to the version of Buzz that instance.\n                           \n\n\n\n\n\n\n\n                            Previous Team\n                           \n\n\n\n                            Opens Buzz Desktop for the previous instance, if you have authenticated to more than one.\n                           \n\n\n\n\n\n                            Next Team\n                           \n\n\n\n                            Opens Buzz Desktop for the next instance, if you have authenticated to more than one.\n                           \n\n\n\n\n\n                            Add Team\n                           \n\n\n\n                            Switches you over to the company login screen so you can add a new team to your Buzz Desktop instance.\n                           \n\n\n\n\n\n\n\n\n\n                          Actions Menu\n                         \n\n\n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n\n                            Add Conversation\n                           \n\n\n\n\n\n\n\n                            Opens the\n                            \n\n                              Start a Conversation or Find an Existing One\n                             \n\n                            dialog, as described above.\n                           \n\n\n\n\n\n\n\n                            Browse Card and Page Conversations\n                           \n\n\n\n                            Opens the\n                            \n\n                              Browse the Card Conversations\n                             \n\n                            dialog, as described above.\n                           \n\n\n\n\n\n                            Move to the Previous Conversation\n                           \n\n\n\n                            Opens the conversation above your currently open conversation in the list.\n                           \n\n\n\n\n\n                            Move to the Next Conversation\n                           \n\n\n\n                            Opens the conversation below your currently open conversation in the list.\n                           \n\n\n\n\n\n\n\n\n\n                          Help Menu\n                         \n\n\n\n\n\n\n                           Option\n                          \n\n                           Description\n                          \n\n\n\n\n\n\n                            Report a Problem\n                           \n\n\n\n                            Opens a dialog in which you can enter feedback and then send to Domo Support.\n                           \n\n\n\n\n\n\n\n                            About Buzz\n                           \n\n\n\n\n\n\n\n                            Tells you which version of Buzz you are using.\n                           \n\n\n\n\n\n\n\n                            Check for Updates\n                           \n\n\n\n                            Looks to see whether you are due for any Buzz Desktop updates; if so, these are downloaded and installed automatically.", "Preview Article": "Click here to preview", "URL Name": "360043429973", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004311", "Archived Date": "", "Language": "English", "Primary Version": "Buzz Layout", "Article Total View Count": "5,028", "": "", "Article Created Date": "10/24/2022, 9:36 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Buzz Layout\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Buzz\n              \n", "url": "/s/topic/0TO5w000000ZanCGAS"}]}