{"file_path": "../../raw_kb_v2\\article\\000005121\\index.html", "content": {"Title": "Geocoder User Guide", "Article Body": "Intro\n                       \n\n                        Geocoder is a premium\n                        \n\n                        app that allows you to add geocoded data to any DataSet in your Domo instance. Select a DataSet, specify the address column, then set the update interval and method. The DataSet is then geocoded\n                        \n                         ,\n                        \n                        and the results are written to a new DataSet.\n                        \n\n\n\n                        You can find Geocoder in the Appstore.\n                        \n\n                        This article describes the app and how to perform various tasks within it in the following topics:\n                       \n\n\n\n                          Landing page\n                         \n\n\n\n                          Job list\n                         \n\n\n\n                          Usage meter\n                         \n\n\n\n                          Job Details view\n                         \n\n\n\n                          Output DataSet\n                         \n\n\n\n                          Overview tab\n                         \n\n\n\n                          Editing a job\n                         \n\n\n\n                          Deleting a job\n                         \n\n\n\n                          Schedule tab\n                         \n\n\n\n                          History tab\n                         \n\n\n\n                          Creating a new job\n                         \n\n\n\n\n\n                        Landing Page\n                       \n\n                        When you open the app, the landing page displays. The landing page includes a list of Geocoder jobs, a search bar, a usage meter, and controls to create a new job and refresh. When you select\n                        \n                         Refresh\n                        \n                        , the entire list of jobs refreshes with the latest details and statuses.\n                        \n\n                        See\n                        \n                         Creating a New Job\n                        \n                        for instructions for creating a new job.\n                       \n\n\n\n\n\n\n                        Job List\n                       \n\n                        The job list displays information about each existing job. This information includes the job's name, creator, rows, input DataSet, output DataSet, last status update, and status.\n                       \n\n                        The following actions can be performed in the job list:\n                       \n\n\n\n                          Search for a job —\n                         \n                         Enter keywords into the search bar to filter the list by name.\n                        \n\n\n                          Change order of list —\n                         \n                         Select the\n                         \n\n                          F\n                         \n\n                          ilter Menu\n                         \n                         at the top of the list to change the sort order of the list.\n                        \n\n\n                          View/edit a job —\n                         \n                         Select a job in the list to view its details and make edits.\n                        \n\n\n\n\n                        Usage Meter\n                       \n\n\n\n\n                        On the landing page, the usage meter displays the limit of monthly individual geocoding requests and how many requests have been made in the current month. Each job creates multiple requests. If the monthly limit is reached, jobs continue running and the excess bill is calculated at the end of the period. Below the usage meter, you can see when your package limit resets.\n                       \n\n                        If you need to upgrade your limit, contact your Customer Success Manager (CSM).\n                       \n\n\n\n                        Job Details View\n                       \n\n                        When you select a job from the list on the landing page, the job Details view displays. If the job has executed at least one time, the job Details view displays a link to the\n                        \n                         output DataSet\n                        \n                        for the job.\n                       \n\n\n\n\n                        Select\n                        \n\n                         Back\n                        \n                        to return to the landing page.\n                       \n\n                        In the job Details view, you can select\n                        \n                         Run Now\n                        \n                        to manually run the current job. Running the job adds an entry to its history, which you can view in the\n                        \n                         History\n                        \n                        tab.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can manually run your job even if it has a set update interval. Running a job manually does not affect the update schedule; the job will run at the end of the next update interval.\n                          \n\n\n\n\n                        Select\n                        \n                         Delete Job\n                        \n                        to delete the current job.\n                       \n\n                        Admins can select\n                        \n                         Claim Ownership\n                        \n                        to claim ownership of the current job. This action is not reversible. A dialog displays to confirm the change of ownership. Select\n                        \n                         Cancel\n                        \n                        to cancel this action or\n                        \n                         Claim\n                        \n                        to proceed.\n                       \n\n\n\n                        Output DataSet\n                       \n\n                        The output DataSet appends the following columns of geocoded data to the original input DataSet:\n                        \n\n\n\n\n\n\n                            Column\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            _DCG_Status\n                           \n\n\n\n                            The possible result of the geocoding process.\n                            \n\n                            Possible values include:\n                           \n\n\n                             OK\n                            \n\n                             ACCESS_NOT_CONFIGURED\n                            \n\n                             MAX_ELEMENTS_EXCEEDED\n                            \n\n                             NOT_FOUND\n                            \n\n                             ZERO_RESULTS\n                            \n\n                             OVER_DAILY_LIMIT\n                            \n\n                             OVER_QUERY_LIMIT\n                            \n\n                             REQUEST_DENIED\n                            \n\n                             INVALID_REQUEST\n                            \n\n                             UNKNOWN_ERROR\n                            \n\n\n\n\n\n\n                            _DCG_Message\n                            \n\n\n\n\n\n\n\n\n\n                            The resulting message of the geocoding process.\n                           \n\n\n\n\n\n                            _DCG_From Cache\n                           \n\n\n\n                            This field indicates whether we use the DOMO database result instead of the provider endpoint.\n                            \n                             TRUE\n                            \n                            for local results and\n                            \n                             FALSE\n                            \n                            for provider results.\n                           \n\n\n\n\n\n                            _DCG_Place Id\n                           \n\n\n\n                            Contains the unique ID for each result; a feature may have a commonly used identifier, either a unique string or number.\n                           \n\n\n\n\n\n                            _DCG_Latitude\n                           \n\n\n\n                            Contains the geocoded latitude.\n                            \n                            This field is typically one of the most important for normal address lookups.\n                           \n\n\n\n\n\n                            _DCG_Longitude\n                           \n\n\n\n                            Contains the geocoded longitude.\n                            \n                            This field is typically one of the most important for normal address lookups.\n                           \n\n\n\n\n                           _DCG_Location Type\n                          \n\n                           A list of feature types describing the feature. Most features have only one type, but if the feature has multiple types (for example, Vatican City is a country, region, and place), all applicable types are listed.\n                          \n\n\n\n                           _DCG_Formatted Address\n                          \n\n                           The house number for the returned address feature.\n                          \n\n\n\n                           _DCG_Landmark\n                          \n\n                           Specifies whether the feature is in the poi.landmark data type.\n                           \n                           This data type is deprecated, and this property is present on all poi features for backwards compatibility reasons but is always\n                           \n                            TRUE\n                           \n                           .\n                          \n\n\n\n                           _DCG_Text\n                          \n\n                           A string representing the feature in the requested language, if specified.\n                          \n\n\n\n                           _DCG_Category\n                          \n\n                           Comma-separated categories for the returned poi feature. Points of interest can include restaurants, stores, concert venues, parks, museums, and more.\n                          \n\n\n\n                           _DCG_Neighborhood\n                          \n\n                           Colloquial sub-city features often referred to in local parlance. Unlike locality features, these typically lack official status and may lack universally agreed-upon boundaries.\n                          \n\n\n\n                           _DCG_Region\n                          \n\n                           Top-level sub-national administrative features, such as states in the United States or provinces in Canada or China.\n                          \n\n\n\n                           _DCG_Country\n                          \n\n                           Limits results to one or more countries. Permitted values are country names separated by commas.\n                          \n\n\n\n                           _DCG_Country Short Code\n                          \n\n                           Limits results to one or more countries. Permitted values are\n                           \n                            ISO 3166 alpha 2\n                           \n                           country codes separated by commas.\n                          \n\n\n\n                           _DCG_Postcode\n                          \n\n                           Postal codes used in country-specific national addressing systems.\n                          \n\n\n\n                           _DCG_Place\n                          \n\n                           Typically, these are cities, villages, municipalities, and so on. They’re usually features used in postal addressing, and are suitable for display in ambient end-user applications where current-location context is needed (for example, in weather displays).\n                          \n\n\n\n                           _DCG_Place Name\n                          \n\n                           Contains a detailed description of the place. Typically includes the city's name and country, depending on the feature type.\n                          \n\n\n\n\n\n\n\n                        Overview Tab\n                       \n\n                        In the\n                        \n                         Overview\n                        \n                        tab of the job Details view, a label indicates the last time the current job ran successfully. A full historical log of all the executions for the current job can be accessed in the\n                        \n                         History\n                        \n                        tab.\n                       \n\n\n\n\n\n\n                        Editing a Job\n                       \n\n                        In the\n                        \n                         Overview\n                        \n                        tab of the job Details view, the job owner can edit the job name, change the input DataSet, and update the address column. An app admin can view all jobs but needs to claim ownership of a job before being able to edit it.\n                       \n\n\n\n                        Deleting a Job\n                       \n\n                        In the job Details view for a job, the job owner can delete the job by selecting\n                        \n                         Delete Job\n                        \n                        . An app admin can view all jobs but needs to claim ownership of a job before being able to delete it.\n                       \n\n\n\n                        Schedule Tab\n                       \n\n                        In the\n                        \n                         Schedule\n                        \n                        tab of the job Details view, you can edit the update interval for the job.\n                       \n\n\n\n                        History Tab\n                       \n\n                        In the\n                        \n                         History\n                        \n                        tab of the job Details view, you can access a historical log of the last 100 executions of the current job.\n                       \n\n                        You can view the following details for each entry:\n                       \n\n\n                         Started on\n                        \n\n                         Completed on\n                        \n\n                         Result\n                        \n\n                         Message\n                        \n\n\n\n\n                        Creating a New Job\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can only create a job with DataSets that you have access to. The output DataSet copies the permissions (PDP) from the input DataSet. This means that only those who have access to the input DataSet for a job have access to the output DataSet of that job.\n                          \n\n\n\n\n\n\n\n\n                         Select\n                         \n                          New Job\n                         \n                         at the bottom right corner of the landing page.\n                         \n                         The\n                         \n                          Save New Job\n                         \n                         modal displays.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             New jobs are added to the list in alphabetical order.\n                            \n\n\n\n\n\n\n\n\n\n\n                         Enter a custom name to identify this job in the\n                         \n                          Job name\n                         \n                         field.\n                        \n\n                         In the\n                         \n                          Dataset\n                         \n                         field, search for the target DataSet by name. Then select the DataSet from the list of results.\n                        \n\n                         In the\n                         \n                          Address column\n                         \n                         field, search for and select a column from within the target DataSet. The data in this column is what is geocoded when the job runs.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             After you select a DataSet, you can switch to a different one by selecting the\n                             \n                              (change)\n                             \n                             link that displays next to the DataSet label. This also de-selects the current address column, if any was selected.\n                            \n\n\n\n\n\n\n\n\n\n\n                         Select an update interval from the list of options. The options are detailed below.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Apart from Manual, all of the interval options are automated. When you configure jobs to be automated, they run as long as the geocoding service is available. This means that on rare occasions, there could be a small delay before the job triggers.\n                            \n\n\n\n\n\n\n                            Manual —\n                           \n                           If you select\n                           \n                            Manual\n                           \n\n                            , you must run the job manually. It never runs automatically.\n                           \n\n\n\n\n\n                            Every hour —\n                           \n                           This option automatically runs the job every hour. If you want to restrict the window of time in which the job runs, select the\n                           \n                            Active hours\n                           \n\n                            checkbox to configure the start and end times.\n                            \n\n\n\n\n\n\n\n                            Every day —\n                           \n                           This option automatically runs the job once a day, seven days a week. Use the\n                           \n                            Start between\n                           \n\n                            menu to select the time at which you want the job to run.\n                           \n\n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               If when the job tries to run, the geocoding service is initially busy, an end time marks the window of time during which the job can run.\n                              \n\n\n\n\n\n\n                            Every weekday —\n                           \n                           This option automatically runs the job once a day, but only Monday through Friday. The same\n                           \n                            Start between\n                           \n\n                            criteria applies as with the\n                           \n\n                            Every day\n                           \n\n                            option above.\n                           \n\n\n\n\n                            Every week —\n                           \n                           This option automatically runs the job once a week. Use the\n                           \n                            On this day\n                           \n\n\n\n                            menu to select the day of the week on which you want the job to run. The same\n                           \n\n                            Start between\n                           \n\n                            criteria applies as with the\n                           \n\n                            Every day\n                           \n\n                            option above.\n                            \n\n\n\n\n\n\n\n                            Every month —\n                           \n                           This option automatically runs the job once a month on the same day(s) every month. The\n                           \n                            On this day\n                           \n\n                            menu allows you to select whether the job should run on the 1st, on the 1st\n                           \n\n                            and\n                           \n\n                            15th, or on the last day of the month.\n                           \n                           The same\n                           \n                            Start between\n                           \n\n                            criteria applies as with the\n                           \n\n                            Every day\n                           \n\n                            option above.\n                            \n\n\n\n\n\n\n\n                         Select\n                         \n                          Save\n                         \n                         to create the new job.", "Preview Article": "Click here to preview", "URL Name": "000005121", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005121", "Archived Date": "", "Language": "English", "Primary Version": "Geocoder User Guide", "Article Total View Count": "1,682", "": "", "Article Created Date": "2/9/2023, 4:58 PM", "First Published Date": "2/9/2023, 4:58 PM"}, "title": "\n              Geocoder User Guide\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}