{"file_path": "../../raw_kb_v2\\article\\360042925194\\index.html", "content": {"title": "\n\n\n Adding Scale Markers to Your Charts\n\n\n", "article_body": "\n\nIntro\n-------\n\nDomo provides the ability to set scale markers on most chart types, either as single lines set on specific values or as ranges between two values. In the following example, a scale marker range has been set between the values of 225 and 1000. This in\n\n\n dicates the \"normal\" range of data. Any value that falls within this range is considered \"expected\" and should not require further scrutiny. However, several data points—one at January 5, one for January 11-13, and one at January 14—fall outside this normal range of data. Using the scale marker range, you can spot such outliers and make any necessary business decisions.\n\nYou add scale marker ranges to charts in the\n **Chart Properties**\n .\n\n*Video - Dynamic Scale Markers**\n\nAvailable properties\n----------------------\n\nThe following table lists and describes all properties of scale marker ranges available in the\n **Chart Properties**\n :\n\n\n**Note:**\n Properties relating to percentiles, percentages, standard deviations, and quantiles are currently available\n *only*\n for single-series Bar charts and basic single-series and multiple-series Line charts.\n\n\n Property\n  |\n Description\n  |\n Required?\n  |\n| --- | --- | --- |\n|\n Text\n  |\n Lets you specify text to replace the default word \"GOAL\" that normally appears above the top left corner of the chart when a scale marker has been set. If the chart contains a legend, an item for the scale marker is added to the legend with this text (unless you hide it by checking the\n **Scale Marker > Hide in Legend**\n box).\n  |\n No\n  |\n|\n Scale\n  |\n In dual-scale charts, lets you specify whether the goal in the chart is associated with the left or right scale.\n  |\n Yes (for dual-scale charts)\n  |\n|\n Type\n  |\n Lets you specify whether the scale marker is a line or a range of values.\n  |\n Yes\n  |\n|\n Value Type\n  |\n Lets you determine how the scale marker line is calculated. A range of options is available, such as minimum and maximum, average, standard deviation, and more. If you select\n **Manual**\n (the default), you enter the desired value in the\n **Value**\n field. Otherwise the value is calculated from the data in the chart.\n  |\n Yes\n  |\n|\n Value\n  |\n Lets you specify the value of your scale marker line when you have selected\n **Manual**\n (or\n **Default)**\n for\n **Value Type**\n . This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n  |\n Yes (for Line markers)\n  |\n|\n Percentile Value\n  |\n Lets you calculate the value of your line based on a specified percentile value between 0 and 100. This option is available only when you select\n **Line**\n in the\n **Type**\n menu and\n **Percentile**\n in the\n **Value Type**\n menu.\n  |\n Yes (for Line markers when\n **Percentile**\n is selected)\n  |\n|\n Percentage Of\n  |\n Lets you specify whether your percentage is derived from the maximum, minimum, average, or median value of the chart. This option is available only when you select\n **Line**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Value Type**\n menu.\n  |\n Yes (for Line markers when\n **Percentage**\n is selected)\n  |\n|\n Percentage Value\n  |\n Lets you specify the percentage value calculated from the maximum, minimum, average, or median value of the chart (as selected in the\n **Percentage Of**\n field). This option is available only when you select\n **Line**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Value Type**\n menu.\n  |\n Yes (for Line markers when\n **Percentage**\n is selected)\n  |\n|\n Standard Deviations\n  |\n Lets you calculate your scale marker value based on a specified number of standard deviations from the mean. If you enter a positive value, your scale marker value will be above the mean. If you enter a negative value, your scale marker value will be below the mean. This option is available only when you select\n **Line**\n in the\n **Type**\n menu and\n **Standard Deviations**\n in the\n **Value Type**\n menu.\n  |\n Yes (for Line markers when\n **Standard Deviations**\n is selected)\n  |\n|\n Color\n  |\n Lets you specify the color of your scale marker line, together with the color of the goal value that appears above the top left corner of the chart. If you do not select a color, your line defaults to black. This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Width\n  |\n Lets you specify the width of your scale marker line—either\n **Thin**\n (the default),\n **Medium**\n , and\n **Thick**\n . This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Style\n  |\n Lets you select whether your scale marker line appears solid (default) or dashed. This option is only available when you select\n **Line**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Upper Value Type\n  |\n Lets you determine how the upper boundary of your scale marker range is calculated. A range of options is available, such as minimum and maximum, average, standard deviation, and more. If you select\n **Manual**\n (the default), you enter the desired value in the\n **Upper Value**\n field. Otherwise the value is calculated from the data in the chart.\n  |\n Yes (for Range markers)\n  |\n|\n Upper Value\n  |\n Lets you select the value for the upper line in your scale marker range. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n Yes (for Range markers)\n  |\n|\n Upper Percentile Value\n  |\n Lets you calculate the value of your range's upper boundary based on a specified percentile value between 0 and 100. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentile**\n in the\n **Upper**\n**Value Type**\n menu.\n  |\n Yes (for Range markers when\n **Percentile**\n is selected)\n  |\n|\n Upper Percentage Of\n  |\n Lets you specify whether the percentage for your range's upper boundary is derived from the maximum, minimum, average, or median value of the chart. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Upper**\n**Value Type**\n menu.\n  |\n Yes (for Range markers when\n **Percentage**\n is selected)\n  |\n|\n Upper Percentage Value\n  |\n Lets you specify the percentage value for your range's upper boundary calculated from the maximum, minimum, average, or median value of the chart (as selected in the\n **Upper**\n**Percentage Of**\n field). This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Upper**\n**Value Type**\n menu.\n  |\n Yes (for Range markers when\n **Percentage**\n is selected)\n  |\n|\n Upper Standard Deviations\n  |\n Lets you calculate your upper range boundary's value based on a specified number of standard deviations from the mean. If you enter a positive value, your scale marker value will be above the mean. If you enter a negative value, your scale marker value will be below the mean.\n  |\n Yes (for Range markers when\n **Standard Deviations**\n is selected)\n  |\n|\n Lower Value\n  |\n Lets you select the value for the lower line in your scale marker range. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n Yes (for Range markers)\n  |\n|\n Lower Percentile Value\n  |\n Lets you calculate the value of your range's lower boundary based on a specified percentile value between 0 and 100. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentile**\n in the\n **Lower**\n**Value Type**\n menu.\n  |\n Yes (for Range markers when\n **Percentile**\n is selected)\n  |\n|\n Lower Percentage Of\n  |\n Lets you specify whether the percentage for your range's lower boundary is derived from the maximum, minimum, average, or median value of the chart. This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Lower**\n**Value Type**\n menu.\n  |\n Yes (for Range markers when\n **Percentage**\n is selected)\n  |\n|\n Lower Percentage Value\n  |\n Lets you specify the percentage value for your range's lower boundary calculated from the maximum, minimum, average, or median value of the chart (as selected in the\n **Lower**\n**Percentage Of**\n field). This option is available only when you select\n **Range**\n in the\n **Type**\n menu and\n **Percentage**\n in the\n **Lower**\n**Value Type**\n menu.\n  |\n Yes (for Range markers when\n **Percentage**\n is selected)\n  |\n|\n Lower Standard Deviations\n  |\n Lets you calculate your lower range boundary's value based on a specified number of standard deviations from the mean. If you enter a positive value, your scale marker value will be above the mean. If you enter a negative value, your scale marker value will be below the mean.\n  |\n Yes (for Range markers when\n **Standard Deviations**\n is selected)\n  |\n|\n Fill Color\n  |\n Lets you select the fill color for your scale marker range. If you do not select a fill color, a default gray color is used. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Fill Transparency Percent\n  |\n Lets you enter an transparency percentage for the fill in your scale marker range. This should be a value between 0 and 100. The higher the value, the more transparent the fill. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Border Color\n  |\n Lets you select the border color for your scale marker range. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Border Style\n  |\n Lets you select whether the borders of your scale marker range appear solid (default) or dashed. This option is only available when you select\n **Range**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Number of Quantiles\n  |\n Lets you specify the number of quantiles that appear in your chart. You can specify any number between 3 and 10. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n Yes (when you select\n **Quantiles**\n in the\n **Type**\n menu)\n  |\n|\n Quantile Line Color\n  |\n Lets you specify the color for your quantiles. The default is gray. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Quantile Line Style\n  |\n Lets you specify whether your quantiles are solid (default) or dashed. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Quantile Fill Color\n  |\n Lets you select a fill color for the spaces between your quantiles. If you select\n **Default**\n , no fill color is applied. This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Quantile Fill Transparency Percent Start\n  |\n Lets you select the transparency for the upper portion of your quantiles. You can enter a value from 0 (totally opaque) to 100 (totally transparent). This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Quantile Fill Transparency Percent End\n  |\n Lets you select the transparency for the lower portion of your quantiles. You can enter a value from 0 (totally opaque) to 100 (totally transparent). This option is only available when you select\n **Quantiles**\n in the\n **Type**\n menu.\n  |\n No\n  |\n|\n Decimal Places\n  |\n Lets you specify the number of decimal places in the goal value, both in the title as well as in the hover text.\n  |\n No\n  |\n|\n Value Abbreviation\n  |\n Lets you specify whether values are abbreviated based on the scale marker abbreviation (default) or 3 significant digits.\n  |\n No\n  |\n|\n Hide in Legend\n  |\n Lets you prevent a scale marker item from being added to the legend (if the chart contains a legend).\n  |\n No\n  |\n|\n Hide Title\n  |\n Hides the goal text and value that normally appear over the top left corner of the chart.\n  |\n No\n  |\n\nUnderstanding scale marker types\n----------------------------------\n\nScale markers in Domo charts can be broken down into the following types:\n\n **Line markers.**\n These are scale markers that consist of a single line.\n* **Range markers.**\n These are scale markers that consist of two lines and the space between them.\n* **Quantile markers.**\n These are scale markers that divide the area between your chart's minimum and maximum values into equally-spaced quantiles.\n\nLine and range markers can be broken down further depending on whether they are based on static or dynamic values. (Quantile markers by nature are dynamic.) By default, when you select\n **Line**\n or\n **Range**\n in the\n **Type**\n menu, you are asked to enter a value or values for the line or range. Scale markers based on these values are static; they will not change when the chart data changes. If you select any option other than\n **Default**\n or\n **Manual**\n in the\n **Value Type**\n menu (or\n **Upper Value Type/Lower Value**\n**Type**\n menus for a range), however, your scale markers become dynamic; they update based on changes in your chart data. These dynamic value types are described in more detail in the following section.\n\n##\n Value types for line and range markers\n\nThis section describes all of the options available in the\n **Scale Marker >**\n**Value Type/Upper Value Type/Lower Value Type**\n menus in Chart Properties. All of the examples provided here are for line markers but apply to range markers as well.\n\n###\n Manual\n\nThis is the default setting. When you select\n **Manual**\n for your value type, you are asked to enter a static value for your marker or markers. Markers entered in this way do not change when your chart data changes.\n\n###\n Minimum\n\nWhen you select\n **Minimum**\n as the value type for a scale marker, the marker line corresponds to the minimum value in the chart.\n\n\n####\n Maximum\n\nWhen you select\n **Maximum**\n as the value type for a scale marker, the marker line corresponds to the maximum value in the chart.\n\n\n####\n Average\n\nWhen you select\n **Average**\n as the value type for a scale marker, the marker line corresponds to the average value in the chart.\n\n\n####\n Median\n\nWhen you select\n **Median**\n as the value type for a scale marker, the marker line corresponds to the median value in the chart.\n\n\n####\n Percentile\n\nWhen you select\n **Percentile**\n as the value type for a scale marker, the marker line corresponds to a given percentile value, which you specify in the\n **Percentile Value**\n field for a line marker and the\n **Lower Percentile Value**\n /\n **Upper Percentile Value**\n fields for a range marker. In the example below, the percentile value has been set to\n\n85\n\n.\n\n\n####\n Percentage\n\nWhen you select\n **Percentage**\n as the value type for a scale marker, you are asked to enter a percentage value (in the\n **Percentage Value**\n field for a line marker or the\n **Lower Percentage Value**\n /\n **Upper Percentage**\n**Value**\n fields for a range marker) as well as select whether the percentage is derived from the maximum (default), minimum, average, or median value of the chart (in the\n **Percentage Of**\n dropdown menu for a line marker or the\n **Lower Percentage Of**\n /\n **Upper Percentage Of**\n\nmenus for a range marker).\n\n\n In the example below, the user entered\n\n50\n\nfor the\n **Percentage Value**\n and selected\n **Average**\n in the\n **Percentage Of**\n menu, so the chart shows the scale marker on the line corresponding to 50% of the average value of the chart.\n\n\n####\n Standard deviation\n\nWhen you select\n **Standard Deviation**\n as the value type for a scale marker, you are asked to enter the number of standard deviations from the mean (in the\n **Standard Deviations**\n field for a line marker or the\n **Lower Standard Deviations**\n /\n **Upper Standard Deviations**\n\nfields for a range marker). If you enter a positive number, your marker appears above the mean; if you enter a negative number, your marker appears below the mean.\n\n\n In the example below, the user entered -3 in the\n **Standard Deviations**\n field, so the marker corresponds to the line 3 standard deviations below the median.\n\n\n###\n Quantile markers\n\nQuantiles divide the area between your chart's minimum and maximum values into regions of equal value, depending on the data in the chart. In the below example, the user has chosen to include 5 quantiles (quintiles). This divides the chart into 5 regions, with the 3 regions closest to average appearing shaded.\n\nAs with all of the non-default value types for line and range scale markers, quantiles are dynamic and will update when your chart data updates.\n\n\n To add a basic set of quantiles as scale markers to your chart, you simply go into Chart Properties for your chart and select\n **Scale Marker > Type**\n**> Quantiles**\n . Then choose the desired number of quantiles in the\n **Number of Quantiles**\n menu. There are a number of other properties you can use to customize your quantiles, all optional. To learn more about these, see\n\nAvailable Properties\n\n, above.\n\n\n Quantiles are currently available only for\n\nsingle-series bar charts and basic single-series and multiple-series line charts.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042925194\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000005034\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAdding Scale Markers to Your Charts\n\n", "article_total_view_count": "\n\n\n 2,932\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 11/2/2022, 9:00 PM\n\n\n", "first_published_date": "\n\n\n 11/2/2022, 9:04 PM\n\n\n"}, "title": "adding_scale_markers_to_your_charts", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_properties", "url": "/s/topic/0TO5w000000ZaodGAC"}]}