{"file_path": "../../raw_kb_v2\\article\\4492108625687\\index.html", "content": {"Title": "Exporting Embedded Content", "Article Body": "Intro\n                       \n\n                        Users viewing embedded content have the option to export the content in a variety of file types depending on the content that is embedded.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you do not see the option to export content, please ensure the\n                           \n                            Allow export\n                           \n                           box is checked in the embed settings modal when setting up the content to be embedded.\n                          \n\n\n\n\n                        Embedded Card\n                       \n\n                        The following section contains information on how to export a Card that has been embedded.\n                       \n\n                        Card export\n                       \n\n                        You can export the Card as an Excel file, CSV, or PowerPoint.\n                       \n\n\n                         Click the export icon in the top right-hand corner of the Card.\n                         \n\n\n\n\n\n\n                         Select the desired export method:\n                         \n                          Excel\n                         \n                         ,\n                         \n                          CSV\n                         \n                         , or\n                         \n                          PowerPoint\n                         \n                         .\n                         \n\n\n\n\n\n                        Embedded Dashboard\n                       \n\n                        The following sections contain information on how to export a Card that is part of a Dashboard and how to export an entire Dashboard.\n                       \n\n                        Card hover export\n                       \n\n                        Using the Card hover export, you can quickly download your file as a CSV.\n                       \n\n\n                         Hover over the Card you want to export to CSV.\n                        \n\n                         Click the export icon that appears in the top right-hand corner of the Card.\n                         \n\n\n\n\n\n\n                         The file automatically downloads as a CSV.\n                        \n\n\n                        Maximization view export\n                       \n\n                        In the Maximization view of a Card, you can choose to export your Card as a CSV, PDF, PowerPoint, or Excel file.\n                       \n\n\n                         Hover over the Card you want to export.\n                        \n\n                         Click the Maximize icon that appears in the top right-hand corner of the Card.\n                         \n\n\n\n\n\n\n                         In the modal that opens, click on the export icon in the top right-hand corner.\n                         \n\n\n\n\n\n\n                         Select the desired export method:\n                         \n                          CSV\n                         \n                         ,\n                         \n                          Print\n                         \n                         ,\n                         \n                          PowerPoint\n                         \n                         ,\n                         \n                          Excel\n                         \n                         .\n                         \n\n\n\n\n\n                        Dashboard export\n                       \n\n                        You can export your Dashboard as a PowerPoint or PDF.\n                       \n\n\n                         Click the export\n                         \n                         icon in the top right-hand corner of the Dashboard.\n                        \n\n                         Select the desired export method.\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Depending on the number of Cards on the Dashboard, it may take a few minutes to download. To avoid multiple downloads, only select the export option once, even if it appears that it is not downloading.", "Preview Article": "Click here to preview", "URL Name": "4492108625687", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004248", "Archived Date": "", "Language": "English", "Primary Version": "Exporting Embedded Content", "Article Total View Count": "5,013", "": "", "Article Created Date": "10/24/2022, 9:35 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Exporting Embedded Content\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Domo Everywhere\n              \n", "url": "/s/topic/0TO5w000000ZanbGAC"}]}