{"file_path": "../../raw_kb_v2\\article\\360042925674\\index.html", "content": {"Title": "Adding a Sumo Card", "Article Body": "Intro\n                       \n\n                        In a Sumo Card, users can view table data in either of two different formats: a standard column-based format or a more powerful pivot table format. In the Sumo builder view, you can lay out this table data in either or both of these formats. In the builder view, you have access to two sub-views:\n                        \n                         Column View\n                        \n                        , in which you can build a column-based table, and\n                        \n                         Pivot View\n                        \n                        , in which you can build a pivot table similar to that found in Microsoft Excel. Both sub-views contain various options for hiding and showing columns; aggregating and filtering data; and so on. You can manipulate tables in each view independently. The view that is selected when you save your table is the view that appears in this Sumo Card in the Page view.\n                       \n\n                        This topic lays out the overall steps for creating a Sumo Card in both views and discusses many of the options in more detail (such as sorting, filtering, etc.).\n                       \n\n                        For information about the interface components of the edit view for a Sumo Card, including a discussion of both the column and pivot views, see\n                        \n                         Sumo Editor Layout\n                        \n                        .\n                       \n\n                        Creating a Sumo Card\n                       \n\n                        You can create a Sumo Card in the standard Column view or the more complex Pivot view.\n                       \n\n\n\n                          Video - How to Create a Sumo Card\n                         \n\n\n\n\n\n\n\n\n\n\n                           Video - Building a Sumo Pivot Table\n                          \n\n\n\n\n\n\n\n\n\n\n                        Creating a Sumo Card in Column View\n                       \n\n                        The most straightforward way to create a Sumo Card is building a column-based version in\n                        \n                         Column View\n                        \n                        .\n                       \n\n\n                         To create a Sumo Card in Column View,\n                        \n\n\n\n\n                          Navigate to the Page where you want the Sumo Card to appear.\n                         \n\n\n\n                          Click\n                          \n                          in the upper right corner of the Page.\n                         \n\n\n\n                          Select\n                          \n                           Create new Card\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Card\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Select\n                          \n                           Sumo\n                          \n                          .\n                          \n\n                          The edit view appears, with\n                          \n                           Column View\n                          \n                          selected by default.\n                         \n\n\n\n                          (Optional) Enter a name for this Sumo Card by clicking in the title text field and typing in the name you want.\n                         \n\n\n\n                          (Optional) Enter a description for this Sumo Card by clicking in the \"Add Card Description\" text and typing in the description you want.\n                         \n\n\n\n                          Select the DataSet that will power up this Sumo Card by doing the following:\n                         \n\n\n\n                            Click\n                            \n                             Select DataSet\n                            \n                            .\n                           \n\n\n\n                            Select the connector type for this DataSet.\n                           \n\n\n\n                            Select the DataSet.\n                            \n\n                             Column View\n                            \n                            for this DataSet appears, with a number of columns from the DataSet applied to your table by default (including\n                            \n                             Beast Mode\n                            \n                            columns that have been attached to this DataSet).\n                           \n\n\n\n\n\n                          (Optional) Add or remove columns to/from your table by clicking the names in the panel on the left side of the screen.\n                          \n                          Columns that have been applied appear in green in the panel on the left side of the screen; columns that have not been applied appear in gray.\n                         \n\n\n\n                          (Optional) Rearrange columns by clicking and dragging them into the desired order in the panel on the left side of the screen.\n                         \n\n\n\n                          (Optional) Apply sorts, filters, and formatting to a column by mousing over the column header, clicking\n                          \n                          , then selecting the desired option from the list that pops up.\n                          \n                          These options are described in greater detail in\n                          \n                           Applying sorts, filters, and aggregrations\n                          \n                          .\n                         \n\n\n\n                          (Conditional/Optional) In aggregated columns, an indicator for the aggregation type (such as \"Sum,\" \"Unique,\" etc.) appears under the column headers. You can change the aggregation type for a column by clicking its aggregation indicator and selecting the desired aggregation type from the list that pops up.\n                         \n\n\n\n                          (Optional) Change the aggregation types in the \"Total\" cells at the bottom of the table if you want. By default, the \"Total\" cell for a column displays either \"Sum\" (for value columns) or \"Unique\" (for string and date columns). You can change the total aggregation type for a column by clicking its aggregation indicator and selecting the desired aggregation type from the list that pops up. If the column itself has already been aggregated (because of a grouping or date grain being applied to the table), changing the total aggregation type changes the aggregation type for the entire column.\n                         \n\n\n\n                          (Optional) Hide the \"Total\" row if desired by clicking\n                          \n                          in the vertical bar on the left side of the screen.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        The Sumo Card is added to the current Page, and the image representing your Sumo data in the Card appears as a standard column-based table. If you want the image in the Card view to appear as a pivot table instead, you need to click\n                        \n                         Save\n                        \n                        when\n                        \n                         Pivot View\n                        \n                        is the active view.\n                       \n\n                        Creating a Sumo Card in Pivot View\n                       \n\n                        In\n                        \n                         Pivot View\n                        \n                        , you are not limited to having a standard column-based view; you can allocate your data columns wherever you want in your table.\n                       \n\n\n                         To create a Sumo Card in Pivot View,\n                        \n\n\n\n\n                          Navigate to the Page where you want the Sumo Card to appear.\n                         \n\n\n\n                          Click\n                          \n                          in the upper right corner of the Page.\n                         \n\n\n\n                          Select\n                          \n                           Create new Card\n                          \n                          .\n                         \n\n\n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open this dialog from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Card\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Select\n                          \n                           Sumo\n                          \n                          .\n                          \n\n                          The edit view appears, with\n                          \n                           Column View\n                          \n                          selected by default.\n                         \n\n\n\n                          (Optional) Enter a name for this Sumo Card by clicking in the title text field and typing in the name you want.\n                         \n\n\n\n                          (Optional) Enter a description for this Sumo Card by clicking in the \"Add Card Description\" text and typing in the description you want.\n                         \n\n\n\n                          Select the DataSet that will power up this Sumo Card by doing the following:\n                         \n\n\n\n                            Click\n                            \n                             Select DataSet\n                            \n                            .\n                           \n\n\n\n                            Select the connector type for this DataSet.\n                           \n\n\n\n                            Select the DataSet.\n                            \n\n                             Column View\n                            \n                            for this DataSet appears, with a number of columns from the DataSet applied to your table by default (including\n                            \n                             Beast Mode\n                            \n                            columns that have been attached to this DataSet).\n                           \n\n\n\n\n\n                          Click\n                          \n                          .\n                          \n\n                           Pivot View\n                          \n                          for this table appears. This view contains the names of all columns in your DataSet (including any\n                          \n                           Beast Mode\n                          \n                          columns that have been attached to this DataSet) and an empty template table with regions where you can drag and drop column names. No pivot table appears at this point.\n                         \n\n\n\n                          Drag and drop column names from the\n                          \n                           Categories\n                          \n                          and\n                          \n                           Values\n                          \n                          listings into the desired regions in the empty template table on the left side of the screen.\n                          \n                          As you drop column names into the table, the pivot table on the right side of the screen fills in with the data from those columns.\n                          \n                          For a more detailed discussion of moving columns to create a pivot table in this view, see\n                          \n                           Adding and removing columns in a Sumo pivot table\n                          \n                          .\n                         \n\n\n\n                          (Optional) Apply aggregations, filters, sorts, and formatting to a column by clicking the column heading in the pivot table and selecting the desired options.\n                          \n                          The options available for any given column depend on the column type. A value column contains more options than a category column. These options are described in greater detail in the next section.\n                          \n                          You can also filter a column by clicking the column name in the table on the left side of the screen and choosing the desired options from the dialog.\n                         \n\n\n\n                          (Optional) Remove any unwanted columns from the pivot table by clicking the column and selecting\n                          \n                          in the pop-up menu.\n                         \n\n\n\n                          (Optional) If you want to make additional changes to your data in\n                          \n                           Column View\n                          \n                          , click\n                          \n                          to open\n                          \n                           Column View\n                          \n                          then make your changes.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        The Sumo Card is added to the current Page, and the image representing your Sumo data in the Card appears as a pivot table. If you want the image in the Card to appear as a column table, you need to click\n                        \n                         Save\n                        \n                        when\n                        \n                         Column View\n                        \n                        is the active view.\n                       \n\n                        Applying sorts, filters, and aggregations\n                       \n\n                        In\n                        \n                         Column View\n                        \n                        and\n                        \n                         Pivot View\n                        \n                        , you can select various options for changing how the data in a column appears. The specific options available depend on both the view and the data type of the particular column. For example, the\n                        \n                         Date Grain\n                        \n                        option is available only for columns with a \"date\" data type, while the\n                        \n                         Group\n                        \n                        option can be applied only to a column in\n                        \n                         Column View\n                        \n                        .\n                       \n\n                        All of these options are also available when you use the Analyzer option in the Details view for a Sumo Card. For more information about the Details view, see Sumo Card Details layout and Analyzing Data.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           The information provided in this section is pertinent for creating a Sumo Card, making permanent edits to an existing Sumo Card in the Edit view or making temporary edits to an existing Sumo Card using the Analyzer functionality in the Details view. For more information about the Sumo Edit view, see\n                           \n                            Sumo Card Details layout\n                           \n                           .\n                          \n\n\n\n\n                        Adding and removing columns in a Sumo pivot table\n                       \n\n                        In Sumo\n                        \n                         Pivot View\n                        \n                        , you create a pivot table by dragging names of source columns from a pool of column name listings into the desired locations in a template table, or by double-clicking a column name to add it to the table automatically. The following screenshot shows you how both of these elements might appear in a typical Sumo\n                        \n                         Pivot View\n                        \n                        .\n                       \n\n\n\n\n                        When you first enter\n                        \n                         Pivot View\n                        \n                        while creating a Sumo table, no pivot table appears yet—the right side of the screen is initially blank. As you add column names to the template table, data from those columns appears in the pivot table area in the appropriate location (for example, when you drag the name of a values column into the\n                        \n                         Drag Values Here\n                        \n                        region of the template table, all of the values from that column appear in the values region of the pivot table). Likewise, when you remove column names from the template table, the data for those columns is removed from the pivot table area. For more information about these and other components of this view, see\n                        \n                         Sumo Editor Layout\n                        \n                        .\n                       \n\n                        After you have added a column name to any region of the template table, you can drag it to any other position you want. This updates the pivot table accordingly. You can also remove a column name from the template table by clicking the \"x\" to the right of the name. You can also remove columns from the pivot table by clicking the column and selecting\n                        \n                        in the pop-up menu.\n                       \n\n                        In most circumstances, you will move values columns into the\n                        \n                         Drag Values Here\n                        \n                        region of the template table and category columns into the\n                        \n                         Drag Categories Here\n                        \n                        regions. However, you are not obligated to do so. If you want, you can move values columns into the category regions and vice versa.\n                       \n\n                        If you double-click a column name, it is added automatically to the most appropriate region of the template table. For example, if your template table contained two column names in the \"Rows\" region but only one column name in the \"Columns\" region, any category column name you double-clicked would be added to the \"Columns\" region.\n                       \n\n                        You can drag multiple column names into any of the three positions in the template table, and the pivot table populates with the data from all of those columns.\n                       \n\n                        There is no limit to the number of columns you can apply to a Sumo Card. However, because each new column makes your table bigger and more difficult to read, you might want to set a limit of four or five columns in a table.\n                       \n\n\n\n                          Example\n                         \n\n\n\n                        The following example shows how a user might build a typical pivot table showing profits gained from customers. The user wants to show customer names in the rows, so he drags the \"Cust\" column name from the\n                        \n                         Categories\n                        \n                        listing into the left-side\n                        \n                         Drag Categories Here\n                        \n                        region of the template table, as shown below:\n                       \n\n\n\n\n                        The rows region of the pivot table then fills in with the names of all of the customers found in this column.\n                       \n\n\n\n\n                        The user then drags the \"Amount\" column into the values region of the template table. The pivot table shows the profits gained from each customer:\n                       \n\n\n\n\n                        The user now drops the \"Region\" column name into the upper categories region of the template table, which expands the pivot table as follows:\n                       \n\n\n\n\n                        You are not limited, however, to having only one column name per region. By dropping a second column (that is, \"Type\") into the upper categories region of the template table, the user expands the pivot table even further to divide purchases by type:\n                       \n\n\n\n\n\n\n\n\n                        Changing the aggregation type in a Sumo table\n                       \n\n                        After you have aggregated Sumo data in\n                        \n                         Column View\n                        \n                        or\n                        \n                         Pivot View\n                        \n                        , you can change the aggregation type. Changing the aggregation type for a column in\n                        \n                         Column View\n                        \n                        affects just that column; changing the aggregation type in\n                        \n                         Pivot View\n                        \n                        affects the entire table. For more information about these and other components of this view, see\n                        \n                         Sumo Editor Layout\n                        \n                        .\n                       \n\n                        Aggregating data in a column or pivot table\n                       \n\n                        You can aggregate Sumo data by doing any of the following:\n                       \n\n\n\n                          Selecting\n                          \n                           Group\n                          \n                          for a column in\n                          \n                           Column View\n                          \n                          .\n                          \n                          All columns except the grouped column are aggregated (using either \"Unique\" or \"Sum\").\n                         \n\n\n\n                          Applying a value column to a pivot table in\n                          \n                           Pivot View\n                          \n                          .\n                          \n                          The value data is aggregated automatically in this case. If you switch back to\n                          \n                           Column View\n                          \n                          after applying a value column in\n                          \n                           Pivot View\n                          \n                          , the aggregated value data persists.\n                         \n\n\n\n                        Changing how data in a column or pivot table is aggregated\n                       \n\n                        In\n                        \n                         Column View\n                        \n                        , when a column has been aggregated, an indicator for the aggregation appears under the column heading. You can click the indicator to pop up a list of available aggregation types.\n                       \n\n\n\n\n                        In\n                        \n                         Pivot View\n                        \n                        , this option is available only for value columns. To change the aggregation, click a value column header in the pivot table, select\n                        \n                         Change Aggregate\n                        \n                        , then choose the desired aggregation type. When you apply an aggregation in\n                        \n                         Pivot View\n                        \n                        , the totals reflect the aggregation you have applied, not just the sum of a row or column. For example, if you select\n                        \n                         Average\n                        \n                        as your aggregation, the total for each row and column is the average of all the averages in that row or column.\n                       \n\n                        Available aggregations include the following:\n                       \n\n\n\n\n\n                            Aggregation\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Sum\n                           \n\n\n\n                            Shows the sum of each set of grouped rows for a column. This is the default aggregation that is applied to value columns when you choose\n                            \n                             Group\n                            \n                            in\n                            \n                             Column View\n                            \n                            and to all values in your table in\n                            \n                             Pivot View\n                            \n                            .\n                           \n\n\n\n\n\n                            Average\n                           \n\n\n\n                            Shows the average value for each set of grouped rows for a column.\n                           \n\n\n\n\n\n                            Unique\n                           \n\n\n\n                            Shows the number of unique items in each set of grouped rows for a column. This is the default aggregation that is applied to non-value columns when you choose\n                            \n                             Group\n                            \n                            in\n                            \n                             Column View\n                            \n                            .\n                           \n\n\n\n\n\n                            Count\n                           \n\n\n\n                            Shows the number of all items in each set of grouped rows for a column.\n                           \n\n\n\n\n\n                            Min\n                           \n\n\n\n                            Shows the smallest value in each set of grouped rows for a column. If you select this option for a non-value column, each cell shows the first item alphabetically for this set of rows in your DataSet.\n                           \n\n\n\n\n\n                            Max\n                           \n\n\n\n                            Shows the largest value in each set of grouped rows for a column. If you select this option for a non-value column, each cell shows the last item alphabetically for this set of rows in your DataSet.\n                           \n\n\n\n\n\n\n\n                          Aggregation examples\n                         \n\n\n\n                        The following image shows the changes in a typical table in\n                        \n                         Column View\n                        \n                        as a user first groups the rows and then applies an aggregation to the value column.\n                       \n\n\n\n\n                        The following image shows changes in\n                        \n                         Pivot View\n                        \n                        as the user applies an aggregation. (Because rows are grouped by default in this view, no\n                        \n                         Group\n                        \n                        option is required.)\n                       \n\n\n\n\n\n                         To change the aggregation for a column in Column View,\n                        \n\n\n\n\n                          Do either of the following:\n                         \n\n\n\n                            Click the aggregation name in the column header (such as \"Unique,\" \"Sum,\" etc.), then select the aggregation type.\n                           \n\n\n\n                            Mouse over the column header, click\n                            \n                            , then select\n                            \n                             Change Aggregate\n                            \n                            .\n                            \n                            Your table must contain at least one set of grouped rows for this option to appear.\n                           \n\n\n\n\n\n\n                         To change the aggregation type for the table in Pivot View,\n                        \n\n\n\n\n                          In the pivot table, click the header of the value column you want to change.\n                         \n\n\n\n                          Select\n                          \n                           Change Aggregate\n                          \n                          .\n                         \n\n\n\n                          Select the aggregation you want to apply.\n                         \n\n\n\n                        Changing the total aggregation type in Column View\n                       \n\n                        You can also change how your column totals are aggregated in\n                        \n                         Column View\n                        \n                        . Each column in this view includes a \"TOTAL\" cell at the bottom. By default, totals for numeric columns are calculated by summing all of the values in the columns, and totals for string and date/date-time values are determined by counting all of the unique values in the columns. You can click the aggregation indicator in a total cell to pop up a list of alternate aggregation types. If you change the total aggregation type for a column that has itself been aggregated (by applying a \"Group\" or \"Date Grain\" to the table), the aggregation type for the column is also changed. Otherwise, changing the aggregation type affects only the total for the column.\n                       \n\n                        In the following example, the user has grouped the \"Cust\" column and applied a monthly date grain to the \"Invoice Date\" column. By default, all of the values in the \"Amount\" column are summed to yield a total value of \"1,620,327.\"\n                       \n\n\n\n\n                        The user then changes the total aggregation for the \"Amount\" column to \"Average.\" This changes all of the values in the column to averages then calculates the overall average for the column total, as follows:\n                       \n\n\n\n\n\n                         To change the total aggregation for a column in Column View,\n                        \n\n\n\n\n                          Click on the aggregation indicator in the total cell at the bottom of the column (such as \"Sum,\" \"Unique,\" etc.).\n                          \n                          This pops up a list of alternate aggregation types. The specific aggregations in the list differ depending on the data type for the column (that is, whether it is a value, string, or date/date-time column).\n                         \n\n\n\n                          Select an aggregation type.\n                         \n\n\n\n                        The total (and the values in the cells, if the column has been aggregated) updates to reflect the new aggregation type.\n                       \n\n                        Changing the date grain of a Sumo table\n                       \n\n                        You can specify whether dates in a Sumo table are shown by day, week, month, quarter, etc. This changes the aggregation of any values associated with a particular date. In Domo, this ability to \"zoom\" on a date range is called a \"date grain.\" For more information about date grains and date filtering in general, see\n                        \n                         Filtering dates\n                        \n                        .\n                       \n\n                        You can add a date grain to a Sumo Card in either\n                        \n                         Column View\n                        \n                        or\n                        \n                         Pivot View\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n                              In\n                              \n                               Column View\n                              \n                              , you can have only one date column with a date grain applied at any time. So, for example, if you added a date column and set a date grain on it, then added a second date column, this new column would automatically have an aggregation of \"Count.\" If you then applied a date grain to the second column, the first column would switch to a \"Count\" aggregation.\n                             \n\n\n\n                              In\n                              \n                               Pivot View\n                              \n                              , as with\n                              \n                               Column View\n                              \n                              , you  can only have one date column with a grain applied,\n                              \n                               but\n                              \n                              you can group by the other date column. The second column is not grained but will group all the rows that have the same date/time stamp into one row.\n                             \n\n\n\n\n\n\n\n\n\n                        The following example shows the original view of a DataSet. Data is arranged by date, and on each date a single specific sales amount was earned.\n                       \n\n\n\n\n                        The user then adds a \"Weekly\" date grain. This consolidates all the individual date rows into their corresponding weeks. In addition, the daily sales amounts are aggregated into larger amounts representing earnings for entire weeks.\n                       \n\n\n\n\n\n                         To add or remove a date grain to/from a table in Column View,\n                        \n\n\n\n\n                          Mouse over the date column header.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Click\n                            \n                            .\n                           \n\n\n\n                            Click\n                            \n                            then select\n                            \n                             Date Grain\n                            \n                            .\n                           \n\n\n\n\n\n                          (Conditional) To add a date grain or change the current date grain, select the desired date grain. To remove a date grain, select\n                          \n                           Remove Date Grain\n                          \n                          .\n                         \n\n\n\n\n                         To add or remove a date grain to/from a column in Pivot View,\n                        \n\n\n\n\n                          Click the date column header in the pivot table.\n                         \n\n\n\n                          Select\n                          \n                           Date Grain\n                          \n                          .\n                         \n\n\n\n                          (Conditional) To add a date grain or change the current date grain, select the desired date grain. To remove a date grain, select\n                          \n                           Remove Date Grain\n                          \n                          .\n                         \n\n\n\n                        Filtering columns in a Sumo table\n                       \n\n                        In a Sumo table, you can apply filters to columns so that only the most important data from those columns appears in your table. You do this using the\n                        \n                         Filter\n                        \n                        menu item, which is available in all columns in both\n                        \n                         Column View\n                        \n                        and\n                        \n                         Pivot View\n                        \n                        . Filters applied in\n                        \n                         Column View\n                        \n                        are sticky in\n                        \n                         Pivot View\n                        \n                        and vice-versa.\n                       \n\n\n                         To apply a filter,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            (Conditional) If you are in\n                            \n                             Column View\n                            \n                            , click\n                            \n                            at the top of the column you want to filter then click\n                            \n                             Filter\n                            \n                            OR click the\n                            \n                            icon.\n                           \n\n\n\n                            (Conditional) If you are in\n                            \n                             Pivot View\n                            \n                            , click the header for the column or row you want to filter in the pivot table then select\n                            \n                             Filter\n                            \n                            OR click the column name in the template table or unused columns pool.\n                            \n                            A different dialog appears, depending on whether the column or row you selected contains series, amount, or date data.\n                           \n\n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            (Conditional) If the selected column or row contains series data,\n                            \n\n\n\n\n\n\n\n                            Select the checkboxes for the rows you want to appear in the table.\n                            \n                            You can filter the series that appear in the list by entering a keyword in the\n                            \n                             Search options\n                            \n                            field.\n                           \n\n\n\n                            Specify whether the items you have checked appear or do not appear in your chart by selecting\n                            \n                             Include checked items\n                            \n                            or\n                            \n                             Exclude checked items\n                            \n                            from the menu at the top of the dialog.\n                           \n\n\n\n                            Click\n                            \n                             Apply\n                            \n                            .\n                           \n\n\n\n\n\n                            (Conditional) If the selected column or row contains amount data,\n                            \n\n\n\n\n\n\n\n                            Select a condition statement from the menu.\n                           \n\n\n\n                            Enter the desired amount in the field.\n                            \n                            For example, if you wanted the table to show only data greater than $50,000, you would select\n                            \n                             is less than\n                            \n                            from the menu then enter \"50,000\" in the field.\n                           \n\n\n\n                            Click\n                            \n                             Apply\n                            \n                            .\n                           \n\n\n\n\n\n                            (Conditional) If the selected column or row contains date data,\n                            \n\n\n\n\n\n\n\n                            In the menu, select the date range you want\n                           \n\n\n\n                            Click\n                            \n                             Apply\n                            \n                            .\n                           \n\n\n\n\n\n                        Your chart updates with the new filter(s) applied. If you now export the data from this Sumo table, the filters are applied in the exported data. For more information about exporting Sumo data, see\n                        \n                         Exporting Sumo Data\n                        \n                        .\n                       \n\n                        Formatting numbers in a Sumo table\n                       \n\n                        In a Sumo table, you can set number formatting for values columns and date and time formatting for date-time columns in the\n                        \n                         Formatting\n                        \n                        dialog. The options available in this dialog depend on the data type of the column.\n                       \n\n                        Also, for any value or string column, you can set rules (aka\n                        \n                         conditional formatting\n                        \n                        ) so that certain values or strings in that column appear in a different color depending on whether those rules or met. For example, you could use color to draw viewers' attention to values that fall above or below a certain threshold.\n                       \n\n                        For more information about these and other components of this view, see\n                        \n                         Sumo Editor Layout\n                        \n                        .\n                       \n\n                        Formatting numbers\n                       \n\n                        For a value column, you can format the appearance of numbers in your Sumo table using options in the\n                        \n                         Formatting\n                        \n                        menu.\n                       \n\n\n\n\n\n                            Option\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Type menu\n                           \n\n\n\n                            Lets you select a value type, either\n                            \n                             Number\n                            \n                            ,\n                            \n                             Currency\n                            \n                            , or\n                            \n                             Percentage\n                            \n                            .\n                            \n                             Currency\n                            \n                            values have a \"$\" affixed to the front, and\n                            \n                             Percentage\n                            \n                            values have a percent symbol affixed to the end.\n                            \n                             Number\n                            \n                            values have no special characters affixed.\n                           \n\n\n\n\n\n                            Decimals menu\n                           \n\n\n\n                            Lets you select the number of decimal places that appear in values.\n                           \n\n\n\n\n\n                            Financial style\n                           \n\n\n\n                            When this box is checked, negative numbers are enclosed in parentheses; otherwise a minus sign is used.\n                           \n\n\n\n\n\n                            Use thousands separator\n                           \n\n\n\n                            When this box is checked, commas are used to separate thousands.\n                           \n\n\n\n\n\n                            Show negative numbers in red\n                           \n\n\n\n                            When this box is checked, negative numbers appear in red.\n                           \n\n\n\n\n\n                            Abbreviate\n                           \n\n\n\n                            When this box is checked, long numbers are abbreviated using letters, such as \"K\" for 1000, \"M\" for 1,000,000, etc. For example, the number \"904,634\" becomes \"904K.\"\n                           \n\n\n\n\n\n\n                         To apply formatting to a value column,\n                        \n\n\n\n\n                          (Conditional) If you are in\n                          \n                           Column View\n                          \n                          , mouse over the value column then click\n                          \n                          . If you are in\n                          \n                           Pivot View\n                          \n                          , click the value column header in the pivot table.\n                         \n\n\n\n                          Click\n                          \n                           Formatting\n                          \n                          .\n                         \n\n\n\n                          Select the options you want in the menu.\n                         \n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          .\n                         \n\n\n\n                        Formatting dates and times\n                       \n\n                        For a date column, you can format the appearance of dates in your Sumo table.\n                       \n\n                        Available formats differ depending on your selected date grain. For example, if you have a daily date grain, options include different formats for showing days of the year, such as \"1/15/2013,\" \"2013-01-15,\" and so on. If you had a monthly date grain, however, available options would include formats for months, such as \"Jan 2013,\" \"01/13,\" and so on. For more information about setting date grains, see\n                        \n                         Date grain\n                        \n                        .\n                       \n\n                        For a date-time column (for example, \"1-15-13 12:00\"), you can format the appearance of the date and time.\n                       \n\n\n                         To apply formatting to a date column,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            (Conditional) If using\n                            \n                             Column View\n                            \n                            , mouse over the date column then click\n                            \n                            .\n                           \n\n\n\n                            (Conditional) If using\n                            \n                             Pivot View\n                            \n                            , click the date column header in the pivot table.\n                           \n\n\n\n\n\n                          Click\n                          \n                           Formatting\n                          \n                          .\n                         \n\n\n\n                          Select the date or date-time format you want in the menu.\n                         \n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          .\n                         \n\n\n\n                        Adding rules for conditional formatting\n                       \n\n                        For value or string columns, you can set rules so that certain values or strings in that column appear in a different color depending on whether those rules or met.\n                       \n\n\n\n\n\n                            Column Type\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Value\n                           \n\n\n\n                            You can set rules for values that meet specified mathematical conditions. For example, you could create a rule for a column stating that all values above $100,000 appear green. Domo provides a number of conditional statements, such as \"greater than,\" \"less than,\" \"between,\" and so on.\n                           \n\n\n\n\n\n                            String\n                           \n\n\n\n                            You can set rules for strings that contain or do not contain certain text. For example, in a Sumo table that compares information on certain companies, you could create a rule for a column stating that all values containing the name of your primary competitor appear red. Domo provides a number of conditions for strings, such as \"contains,\" \"starts with,\" and so on.\n                           \n\n\n\n\n\n                            Date\n                           \n\n\n\n                            Conditional formatting is\n                            \n                             not\n                            \n                            available for date columns.\n                           \n\n\n\n\n\n                        You can set multiple rules for a single column. For example, if you wanted to call out strings that contain the word \"Texas\" but\n                        \n                         not\n                        \n                        the word \"Austin,\" you could do so by setting a \"Contains\" rule for the word \"Texas\" and a \"Does not contain\" rule for the word \"Austin.\"\n                       \n\n\n                         To set conditional formatting for a column,\n                        \n\n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            (Conditional) If using\n                            \n                             Column View\n                            \n                            , mouse over the column then click\n                            \n                            .\n                           \n\n\n\n                            (Conditional) If using\n                            \n                             Pivot View\n                            \n                            , click the column header in the pivot table.\n                           \n\n\n\n\n\n                          Select\n                          \n                           Conditional Formatting\n                          \n                          , then select a conditional statement.\n                         \n\n\n\n                          In the\n                          \n                           Number\n                          \n                          or\n                          \n                           Text\n                          \n                          field, enter the number or text that completes the conditional statement.\n                         \n\n\n\n                          In the pane on the right side of the dialog, select the desired text color and background.\n                         \n\n\n\n                          (Optional) Add another rule by clicking\n                          \n                           Add Rule\n                          \n                          , then repeating the above steps.\n                         \n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          .\n                         \n\n\n\n                        The color changes for all values or strings in this column that meet the criteria you set.\n                       \n\n                        Grouping and ungrouping columns in a Sumo table\n                       \n\n                        In\n                        \n                         Column View\n                        \n                        for a Sumo table, you can group the rows in any column except for date columns. This combines all rows with like headings and aggregates the data in those rows. You can also ungroup columns, which restores them to their original states. The\n                        \n                         Group\n                        \n                        and\n                        \n                         Ungroup\n                        \n                        options are not available in\n                        \n                         Pivot View\n                        \n                        because all columns you add to your table in this view are grouped automatically.\n                       \n\n                        Grouping columns\n                       \n\n                        The following screenshot shows a typical DataSet as it might appear before the\n                        \n                         Group\n                        \n                        option is applied:\n                       \n\n\n\n\n                        In the next screenshot, the user has grouped the \"Cust\" column.\n                       \n\n\n\n\n                        This combines all of the rows with like headings and the data in those rows. Also, the column you grouped turns blue, and an ascending sort is applied automatically. The five instances of \"GL Electronics\" are combined, and the amounts in the \"Amount\" columns for all of those instances are totaled to yield a single value of \"1,050,028.\" Cells in columns that cannot be aggregated display a value of \"Unique\" by default, which is a count of all unique items within that column. For example, if a column with salesperson names contained five instances of the name \"Bob Jones,\" that name would only be counted once in the \"Unique\" aggregation. You can change the aggregation type for any column except the column you grouped. This option is described in more detail in\n                        \n                         Changing the aggregation type in a Sumo table\n                        \n                        .\n                       \n\n\n                         To group a column,\n                        \n\n\n\n\n                          In\n                          \n                           Column View\n                          \n                          , mouse over the column you want to group.\n                         \n\n\n\n                          Do either of the following:\n                         \n\n\n\n                            Click the\n                            \n                            icon that appears.\n                           \n\n\n\n                            Click\n                            \n                            then select\n                            \n                             Group\n                            \n                            .\n                           \n\n\n\n\n\n                        You can also group multiple columns. In the next screenshot, the user has opened the Sumo table shown in the previous example and grouped the \"Region\" column. This combines the groupings for both \"Cust\" and \"Region,\" in effect \"unzipping\" all unique \"Cust\"-\"Region\" pairings. Because all three instances of \"Accumsan\" have a corresponding region of \"Americas,\" no unzipping need occur, and all columns corresponding to \"Accumsan\" retain the same aggregations as before. In the case of \"Augue,\" however, two different regions are represented—\"Americas\" and \"EMEA\"—so two separate rows are shown, each of which has distinct aggregated values.\n                       \n\n\n\n\n                        Ungrouping columns\n                       \n\n                        You can \"ungroup\" any column that has been grouped, which restores it to its previous setting.\n                       \n\n\n                         To ungroup a column,\n                        \n\n\n\n\n                          In\n                          \n                           Column View\n                          \n                          , mouse over the column you want to ungroup.\n                         \n\n\n\n                          Do either of the following:\n                         \n\n\n\n                            Click the\n                            \n                            icon that appears.\n                           \n\n\n\n                            Click\n                            \n                            then select\n                            \n                             Ungroup\n                            \n                            .\n                           \n\n\n\n\n\n                        Sorting data in a Sumo table\n                       \n\n                        In a Sumo table, you can apply ascending or descending sorts to any data column. Sorting is available in both\n                        \n                         Column View\n                        \n                        and\n                        \n                         Pivot View\n                        \n                        . For more information about these views and their components, see\n                        \n                         Sumo Editor Layout\n                        \n                        .\n                       \n\n                        Column View sorting\n                       \n\n                        In\n                        \n                         Column View\n                        \n                        , you can have only one sorted column in a given instance. For example, you could not sort by date and then have a separate sort for your values column for each represented date.\n                       \n\n\n                         To apply a sort to a column in Column View,\n                        \n\n\n\n\n                          Mouse over the header of the column you want to sort.\n                         \n\n\n\n                          Do either of the following:\n                         \n\n\n\n                            Click\n                            \n                            once to apply an ascending sort or twice to apply a descending sort.\n                           \n\n\n\n                            Click\n                            \n                            then select\n                            \n                             Sort Ascending\n                            \n                            or\n                            \n                             Sort Descending\n                            \n                            .\n                           \n\n\n\n\n\n                        Pivot View sorting\n                       \n\n                        In\n                        \n                         Pivot View\n                        \n                        , you can apply multiple sorts to your table\n                        \n                         so long as you sort only series and date columns\n                        \n                        . For example, you could have a descending sort in your date column (so that the most recent date would appear at the top) and an ascending (alphabetical) sort in your series column.\n                       \n\n                        When you sort by a values column, other columns are sorted accordingly to match the order of the values. In the following example, the user has applied an ascending sort to the \"Amount\" column. The \"Region\" and \"Cust\" columns are both sorted individually to match the sorting of the values within them. For each \"Region\"-\"Cust\" pairing, an individual total is given, and subtotals are provided for both regions.\n                       \n\n\n\n\n                        This \"nesting\" of values allows viewers to quickly see the highest or lowest series in a table without having to scrutinize the values themselves. In the above screenshot, for example, the viewer can immediately see that the \"Americas\" region has had stronger sales than the \"APAC\" region. He can also see that within the \"Americas\" region, \"GL Electronics\" has been the highest-paying customer. The viewer can then look at the actual values on the right if he wants to see more specific details.\n                       \n\n\n                         To apply a sort to a column in Pivot View,\n                        \n\n\n\n\n                          In the pivot table, click the header of the column or row you want to sort.\n                         \n\n\n\n                          Click\n                          \n                           Sort Ascending\n                          \n                          or\n                          \n                           Sort Descending\n                          \n                          .\n                         \n\n\n\n                        Understanding the relationship between views\n                       \n\n                        Because you can switch between the two views in the edit view, it is helpful to understand how making changes in one view may affect what you see in the other. The following is a list of some of these changes and how they affect your data:\n                       \n\n\n\n                          When you add or remove rows in\n                          \n                           Pivot View\n                          \n                          , those changes are reflected in\n                          \n                           Column View\n                          \n                          . However, adding or removing columns in\n                          \n                           Column View\n                          \n                          does\n                          \n                           not\n                          \n                          affect your table layout in\n                          \n                           Pivot View\n                          \n                          .\n                         \n\n\n\n                          Hiding and showing columns in\n                          \n                           Column View\n                          \n                          has no impact on the layout of your table in\n                          \n                           Pivot View\n                          \n                          .\n                         \n\n\n\n                          Changes you make using the dropdown options in either view persist when you navigate to the other view. For example, if you change the number format to\n                          \n                           Currency\n                          \n                          in\n                          \n                           Column View\n                          \n                          , those formatting changes are applied when you go to\n                          \n                           Pivot View\n                          \n                          .\n                         \n\n\n\n                          Because aggregations are applied automatically in\n                          \n                           Pivot View\n                          \n                          , those aggregations persist when you go back to\n                          \n                           Column View\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360042925674", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004117", "Archived Date": "", "Language": "English", "Primary Version": "Adding a Sumo Card", "Article Total View Count": "12,623", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Adding a Sumo Card\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Sumo Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoHGAS"}]}