{"file_path": "../../raw_kb_v2\\article\\360043436373\\index.html", "content": {"title": "\n\n\n Amazon S3 AssumeRole Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAmazon S3 is an online file storage web service offered by Amazon Web Services that you can use to store and retrieve any amount of data, at any time, from anywhere on the web. Domo's AmazonS3 AssumeRole Connector allows you to pull data from S3 bucket using AssumeRole authentication. To learn more about the Amazon S3 API, visit their page (\n\nhttp://docs.aws.amazon.com/AmazonS3/...I/Welcome.html\n\n).\n\n\n The Amazon S3 AssumeRole connector is a \"File\" connector, meaning it retrieves files and outputs them to Domo. In the Data Center, you can access the connector page for this and other File connectors by clicking\n **File**\n in the toolbar at the top of the window.\n\n\n You connect to your Amazon S3 account in the Data Center. This topic discusses the fields and menus that are specific to the Amazon S3 connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n This connector is an excellent choice for retrieving flat files when APIs are not an option.\n  |\n|\n**Primary Metrics**\n |\n N/A\n  |\n|\n**Primary Company Roles**\n | * Data specialists\n* Marketing roles\n* Finance roles\n* Anyone who has data stored in S3\n |\n|\n**Average Implementation Time**\n |\n Less than an hour if you have the correct file types in S3.\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 4\n  |\n\nBest Practices\n----------------\n\nUnderstanding the data stored in S3 and its relation to other S3 databases will be a huge asset in using this connector.\n\n\n Prerequisites\n---------------\n\nTo connect to your Amazon S3 account and create a DataSet, you must have the following:\n\n The Amazon Resource Name (ARN) of the role to assume.\n* The identifier for the assumed role session. You will need to set up a trust policy. This is described in continuation.\n* The unique identifier used by third parties when assuming roles in their customers' accounts.\n* The name of the Amazon S3 bucket you want to pull data from.\n\n\n###\n Trust policy configuration\n\nThe trust policy for the role session identifier should look as follows:\n\n\n`{\n\n\n \"Effect\": \"Allow\",\n\n\n \"Principal\": {\n\n\n \"AWS\": \"arn:aws:iam::*accountId*:root\"\n\n\n },\n\n\n \"Action\": \"sts:AssumeRole\",\n\n\n \"Condition\": {\n\n\n \"StringEquals\": {\n\n\n \"sts:ExternalId\": \"*customer externalID*\"\n\n\n }\n\n\n }\n\n\n }`\n\n\n Account IDs for Domo environments are as follows:\n\n US: 339405024189\n* AU: 010251424122\n* EMEA: 687132894031\n* JP: 622384692065\n* CA:\n\n710710207408\n\nSo if you wanted to grant access to Australia-based user \"myIAMuser123,\" who has an account ID of \"46822464880681,\" the trust policy would look like this:\n\n\n`{\n\n\n \"Effect\": \"Allow\",\n\n\n \"Principal\": {\n\n\n \"AWS\": \" arn:aws:iam::46822464880681:user/myIAMuser123 \"\n\n\n },\n\n\n \"Action\": \"sts:AssumeRole\",\n\n\n \"Condition\": {\n\n\n \"StringEquals\": {\n\n\n \"sts:ExternalId\": \"010251424122\"\n\n\n }\n\n\n }\n\n\n }`\n\n\n Connecting to an Amazon S3 Bucket\n-----------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Amazon S3 AssumedRole Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to an Amazon S3 bucket. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n Role ARN\n  |\n Enter the Amazon Resource Name (ARN) of the role you want to assume.\n  |\n|\n Role Session Name\n  |\n Enter the identifier for the assumed role session.\n  |\n|\n External ID\n  |\n Enter the unique identifier used by third parties when assuming roles in their customers' accounts.\n  |\n|\n Bucket\n  |\n Enter the Amazon S3 Bucket you want to pull files from.\n  |\n|\n Region\n  |\n Select the S3 Bucket Region where your file is located.\n  |\n\n\n Once you have entered valid Amazon S3 credentials, you can use the same account any time you go to create a new Amazon S3 AssumedRole DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains various menus for locating and configuring the file you want to pull into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n File Type to Import\n  |\n Select the type of file you want to import into Domo, either CSV, JSON, TSV, TXT, XML, XLS, or XLSX.\n  |\n|\n Does Your Filename Have an Extension?\n  |\n Select\n **Yes**\n if the filename ends with the supported file type extension; otherwise select\n **No**\n .\n  |\n|\n How Would You Like to Choose Your Filename?\n  |\n Select how you want Domo to identify your file. Options are as follows:\n\n\n|  |  |\n| --- | --- |\n|\n Complete Filename\n  |\n You enter the complete path to the file.\n  |\n|\n Partial Filename\n  |\n You enter a partial file name and specify whether the file to retrieve starts with or contains the name you have entered.\n  |\n|\n FilesDiscovery\n  |\n A list of files in the selected bucket appears and you choose the one you want. This option is available\n *only*\n when your selected S3 bucket contains fewer than 100 files.\n  |\n\n|\n|\n Enter Complete Filepath\n  |\n Enter the complete path for the desired file.\n  |\n|\n List of Files from Amazon S3 Bucket\n  |\n Select the file you want to retrieve.\n  |\n|\n Prefix (Optional)\n  |\n Enter a prefix to filter results by. A prefix limits results to only those keys that begin with the given prefix.\n  |\n|\n File Name\n  |\n Enter the name of the file you want to import, with or without the file path. For example:\n\nfolder\\_name/file\\_name*\n\n|\n|\n File Name Match Type\n  |\n Specify whether the file you want to retrieve starts with or contains the text you entered under\n **File Name**\n .\n  |\n|\n File Compression Type\n  |\n Select the compression type for the file you want to retrieve. If the file is not compressed, select\n **None**\n .\n  |\n|\n Select a File from ZIP Archive\n  |\n Select the ZIP file you want to import.\n  |\n|\n Add FileName Column\n  |\n Select\n **Yes**\n if you want a \"\\_BATCH\\_FILE\\_NAME\\_\" column to be added to your output data; otherwise select\n **No**\n .\n  |\n|\n Select the Delimiting Character\n  |\n Select the delimiter used in the CSV file you want to retrieve. If your delimiter is not listed, select\n **Other**\n .\n  |\n|\n Specify Your Delimiter (Conditional)\n  |\n Enter the character used to delimit your CSV text.\n  |\n|\n Quote Character\n  |\n Select a quote character to parse the CSV file you want to retrieve. A double quote (\") is the CSV standard. If your desired quote character is not in the list, select\n **Other**\n .\n  |\n|\n Custom Quote Character (Conditional)\n  |\n Enter the desired quote character.\n  |\n|\n Escape Character\n  |\n Select an escape character to parse the CSV file you want to retrieve. A backslash (\\) is the CSV standard. If your desired escape character is not in the list, select\n **Other**\n .\n  |\n|\n Custom Escape Character (Conditional)\n  |\n Enter the desired escape character.\n  |\n|\n Are Headers Present in CSV File?\n  |\n Select\n **Yes**\n if the CSV file you are importing contains headers; otherwise select\n **No**\n .\n  |\n|\n Enter Your Header Tag (Conditional)\n  |\n Enter the tag for the header in your JSON file.\n  |\n|\n Does Your JSON Text Require a Line Reader?\n  |\n Specify whether the text in your JSON file includes multiple lines that should be read.\n  |\n|\n Should the Backslash be Escaped?\n  |\n Specify whether the text in your JSON file contains backslash characters that should be escaped.\n  |\n|\n Enter your Sublist to Flatten (Optional)\n  |\n Enter the comma-separated sublists you want to flatten in your data.\n  |\n|\n Enter XPath Expression (Optional)\n  |\n Enter your XPath expression.\n  |\n|\n Do You Require Attributes in Data?\n  |\n Specify whether you require attributes values as part of your XML data.\n  |\n|\n Enter Your Data Tag (Optional)\n  |\n Enter the tag for the data in your JSON or XML file.\n  |\n|\n Enter Fields to Exclude (Optional)\n  |\n Provide a comma-separated list of fields to exclude in your JSON/XML import.\n  |\n|\n Sheet Name (Optional)\n  |\n Enter the sheet name you want to import from the specified Excel spreadsheet. Be sure to check the name for accidental spaces. If this field is left blank, the first sheet of the workbook will be used.\n  |\n|\n File Password (Conditional)\n  |\n If your Excel file is password-protected, enter the file password.\n  |\n|\n Layout\n  |\n Select the layout of your Excel file. The following options are available:\n * **Column as Header**\n . Indicates that your Excel data uses a column-based layout (i.e. each column has a header).\n* **Row as Header**\n . Indicates that your Excel data uses a row-based layout (i.e. each row has a header).\n* **Cross Tab**\n . Indicates that your Excel data uses a cross-tab (pivot) layout.\n* **Raw**\n . Indicates that your Excel data is raw (unformatted).\n* **Advanced**\n . Use this option if you want to configure advanced layout options such as header and data start rows, footer rows to skip, date format, etc.\n |\n|\n Mode\n  |\n Select how the cell range of your Excel data will be determined. If you select\n **Auto**\n , the range is determined automatically. If you select\n **Manual**\n , you will be asked to enter the column header and data ranges manually.\n  |\n|\n Enable Parsing for Large JSON Files?\n  |\n Specify whether parsing is enabled for large JSON files.\n  |\n|\n Column Header Range\n  |\n Enter the range for the column headers in your Excel sheet. For example:\n\nA2:F8\n\n|\n|\n Row Header Range\n  |\n Enter the range for the row headers in your Excel sheet. For example:\n\nA2:A8\n\n|\n|\n Data Range\n  |\n Enter the range for the data (non-header) cells in your Excel sheet. For example:\n\nA3:F20\n\n|\n|\n Header Start Row (Advanced only) (optional)\n  |\n Enter the header row number. If you do not enter a number, the first row is considered the header row.\n  |\n|\n Data Start Row (Advanced only) (optional)\n  |\n Enter the starting data row number. If you do not enter a number, the first row after the header row is considered the starting row.\n  |\n|\n Footer Rows to Skip (Advanced only) (optional)\n  |\n If there are one or more rows at the bottom of the file you do not want to import, enter the number of rows to skip.\n  |\n|\n Date Format (Advanced only) (optional)\n  |\n Select the date format used in the Excel data. If you want dates to be represented as text, select\n **Show Dates as Strings**\n .\n  |\n|\n Blank Rows (Advanced only) (optional)\n  |\n Select the desired outcome if blank rows are encountered in the Excel file. If you select\n **Skip blank rows**\n , the file is processed as normal without the blank rows. If you select\n **Stop at the first blank row**\n , everything is pulled up until the first blank row.\n  |\n|\n Empty Column Headers (Advanced only) (optional)\n  |\n Select the desired outcome if empty column headers are encountered in the Excel. If you select\n **Add**\n**blank columns**\n , new columns are generated with default names applied. If you select\n **Stop at the first blank column**\n , everything is pulled up until the first column with an empty header.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Ensure that the file is present in the S3 bucket and that the correct file type is specified in the connector settings.\n* NULL columns\n *must*\n be removed before the connector can successfully retrieve data.\n* An unescaped character in the data file could cause the \"Failed to execute import successfully\" error. If your dataset has this error, you should check that the Quote Character in the Details section is correct.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043436373\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003950\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon S3 AssumeRole Connector\n\n", "article_total_view_count": "\n\n\n 4,966\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "amazon_s3_assumerole_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}