{"file_path": "../../raw_kb_v2\\article\\360042931974\\index.html", "content": {"title": "\n\n\n Dropbox File Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nDropbox is a personal cloud storage service frequently used for file sharing and collaboration. You can use Domo's Dropbox File connector to retrieve CSV, XLS, and XLSX files from a selected Dropbox account. To learn more about the Dropbox API, go to (\n\nhttps://www.dropbox.com/developers\n\n).\n\n\n You connect to your Dropbox account in the Data Center. This topic discusses the fields and menus that are specific to the Dropbox File connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Dropbox account and create a Dropbox File DataSet, you must have the following:\n\n The email address you enter to access your Dropbox account.\n* Your Dropbox password.\n\nConnecting to Your Dropbox Account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Dropbox File Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Dropbox File connector uses OAuth to connect. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Dropbox File accounts in Domo) to open the Dropbox OAuth screen where you can enter the email address associated with your Dropbox account and your Dropbox password. Once you have entered valid Dropbox credentials, you can use the same account any time you go to create a new Dropbox File DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Dropbox when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Dropbox.\n\n\n###\n Details Pane\n\nIn this pane, you specify the file name and file type of the Dropbox file you want to import into Domo.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n File Type\n  |\n Select the file type for the file you want to import. In the standard version of the connector, only CSV, XLS, and XLSX files can be imported. If you want to import other file types such as JSON, XML, and ZIP files, use the\n\nDropbox File Advanced\n\nconnector.\n  |\n|\n File Name\n  |\n Enter the name of the file you want to import from Dropbox into Domo.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n#####\n How do I know my Dropbox credentials are secure?\n\nThe login process uses OAuth, so your Dropbox credentials are never seen or stored by Domo. You can revoke Domo's access to your account at any time.\n\n####\n Can I use the same account to create multiple DataSets?\n\nYes.\n\n####\n How often can the data be updated?\n\nAs often as needed.\n\n####\n What's the difference between this connector and the advanced version?\n\nThe Dropbox File connector imports only CSV, XLS and XLSX files, whereas the Dropbox File Advanced connector also imports JSON, XML and ZIP files. The Dropbox File Advanced connector also provides some advanced filters to import the data from the file.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042931974\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003939\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDropbox File Connector\n\n", "article_total_view_count": "\n\n\n 4,720\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "dropbox_file_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "file_connectors", "url": "/s/topic/0TO5w000000ZaowGAC"}]}