{"file_path": "../../raw_kb_v2\\article\\360042929994\\index.html", "content": {"title": "\n\n\n Stack Exchange Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nStack Exchange is a network of question and answer websites on diverse topics in many different fields, each site covering a specific topic, where questions, answers, and users are subject to a reputation award process. Use Domo's Stack Exchange connector to retrieve lists of questions and answers; user reputation information; earned badges; and so on. To learn more about the Stack Exchange API, visit their page (\n\nhttp://api.stackexchange.com/docs\n\n).\n\n\n You connect to your Stack Exchange account in the Data Center. This topic discusses the fields and menus that are specific to the Stack Exchange connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Stack Exchange account and create a DataSet, you must have credentials from one of the following social media networks:\n\n Stack Exchange\n* Google\n* Facebook\n* Yahoo\n\nConnecting to Your Stack Exchange Account\n-------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Stack Exchange Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Stack Exchange connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Stack Exchange accounts in Domo) to open the Stack Exchange OAuth screen where you can enter credentials from Stack Exchange, Google, Facebook, or Yahoo. Once you have entered valid credentials and connected to Stack Exchange, you can use the same account any time you go to create a new Stack Exchange DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Stack Exchange, Google, Facebook, or Yahoo when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of the social media website.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Stack Exchange report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Answers\n  |\n Returns a list of answers posted by the authenticated user.\n  |\n|\n Badges\n  |\n Returns a list of badges earned by the authenticated user.\n  |\n|\n Comments\n  |\n Returns a list of comments posted by the authenticated user.\n  |\n|\n Favorites\n  |\n Returns questions that have been favorited by the authenticated user.\n  |\n|\n Mentioned\n  |\n Returns a list of the authenticated user's mentions.\n  |\n|\n Posts\n  |\n Returns all posts (both questions and answers) by the authenticated user.\n  |\n|\n Privileges\n  |\n Returns a list of the authenticated user's privileges.\n  |\n|\n Questions\n  |\n Returns a list of questions asked by the authenticated user.\n  |\n|\n Questions Featured\n  |\n Returns a list of questions with active bounties.\n  |\n|\n Questions Unaccepted\n  |\n Returns a list of questions asked by the authenticated user which have not been adequately answered.\n  |\n|\n Questions Unanswered\n  |\n Returns a list of questions asked by the authenticated user with no answers.\n  |\n|\n Reputation\n  |\n Returns a subset of reputation changes experienced by the authenticated user.\n  |\n|\n Reputation History\n  |\n Returns a history of the authenticated user's reputation, excluding private events.\n  |\n|\n Tags\n  |\n Returns tags the authenticated user has been active in.\n  |\n|\n Timeline\n  |\n Returns a subset of actions taken by the authenticated user.\n  |\n|\n Write Permissions\n  |\n Returns the authenticated user's write access via the API.\n  |\n\n|\n|\n Site\n  |\n Enter the site you want to retrieve information for. For example:\n\n\n stackoverflow.com\n\n\n ,\n\n\n superuser.com\n\n\n |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042929994\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003463\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nStack Exchange Connector\n\n", "article_total_view_count": "\n\n\n 2,355\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "stack_exchange_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}