{"file_path": "../../raw_kb_v2\\article\\360042924454\\index.html", "content": {"Title": "Custom Charts", "Article Body": "Intro\n                       \n\n                        You can add custom charts via the following formats to your Domo instance in the Admin Settings or the Analyzer.\n                       \n\n\n\n                          SVG (Scalable Vector Graphics) -\n                         \n                         Are an XML-based markup language for describing two-dimensional based vector graphics.\n                        \n\n\n                          KML (Keyhole Markup Language) -\n                         \n                         Is a file format used to display geographic data in an Earth browser such as Google Earth.\n                        \n\n\n                          GeoJSON -\n                         \n                         Is an open standard format designed for representing simple geographical features, along with their non-spatial attributes.\n                        \n\n\n                          TopoJSON -\n                         \n                         Is an extension of GeoJSON that encodes geospatial topology and that typically provides smaller file sizes.\n                        \n\n\n                          Shape -\n                         \n                         ESRI standard file format. Includes geospatial vector data (import Google Earth and export as KML).\n                        \n\n\n                        Once you have added a chart, it becomes available for users to select in the \"Custom Charts\" menu in the\n                        \n                         Chart Picker in Analyzer\n                        \n                        . This allows your users to build visualizations pertinent to your business that are not available by default in Domo. Depending on the complexity of your charts, you may be able to upload charts without having to edit the SVG, or you may have to make extensive changes, which will most likely require a working knowledge of XML.\n                       \n\n                        You can also use the Custom Regions tool to upload a DataSet that includes a column for the new custom regions matched with the sub-regions within them. This is not as robust as building your own SVG files but does not require a knowledge of XML. For more information, see\n                        \n                         Creating a Map with Regions\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You must have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled to add custom charts to your Domo instance. For more information about default security roles, see\n                           \n                            Managing Custom Roles\n                           \n                           .\n                          \n\n\n\n\n                        As a simple example, let's say user JJ, an executive at a doll factory in Hong Kong, wants to build a card showing sales of a new line of dolls throughout all the districts of Hong Kong. With the set of preinstalled maps available in Domo, she would have no way to do this. However, with Domo's custom charts feature, all JJ has to do is go online, download an SVG map of Hong Kong, then add it to her Domo in the Admin Settings or in Analyzer. The map is now available for JJ to use as well as anyone else with card-building permissions. JJ creates her card in the same way she would create any other map card—by uploading the DataSet with her sales data, opening the Analyzer, selecting the \"Hong Kong\" map type, and plugging in the columns from the DataSet. The resulting map looks as follows:\n                       \n\n\n\n\n                        As a slightly more complex example, let's say user Rodrigo manages a number of time share properties in the United States. These properties are divided across five distinct regions—West, Southwest, Midwest, Southeast, and Northeast. Rodrigo wants to be able to see at a glance the revenue gained from each region. Again, Domo does not include a preinstalled map for regions of the United States (and if it did, the states in each grouping would probably not exactly correspond to the states in the regions in Rodrigo's company). In this case, because custom grouping of regions is required, Rodrigo will need to customize an SVG map of the United States to incorporate grouping. Luckily he has a basic knowledge of XML, so without too much trouble he is able to add the required grouping tags in order to divide up the map as needed:\n                       \n\n\n\n\n\n                        These are two relatively simplistic examples of how Domo users might implement custom charts. More complex examples might include non-geographical maps such as college campuses...\n                        \n\n\n\n\n                        ...layout charts for airplane seats...\n                        \n\n\n\n\n\n                        ...and even assembly instructions, like the ones for this car bumper:\n                        \n\n\n\n\n                        With custom charts, you are limited only by your imagination, expertise, and amount of free time. Be aware that charts like those shown in the previous three examples are extremely complex and will require an extensive knowledge of XML to build. Also be aware that some XML tags are not supported at this time. These will be listed later in this article.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n\n\n\n                            The maximum size of an SVG, KML, GeoJSON, TopoJSON, and Shape file\n                           \n\n                            that can be imported and converted is 25 MB\n                            \n                             .\n                            \n\n\n\n\n\n\n\n\n\n\n                          Video - Custom Maps and Charts\n                         \n\n\n\n\n\n\n\n\n\n                        Summary of steps\n                       \n\n                        In general, the process for adding custom charts to your Domo and building cards from them will go as follows:\n                       \n\n\n\n\n                           Obtain the chart you want to add.\n                          \n\n\n\n\n\n                           Edit the XML if necessary.\n                          \n\n\n\n\n\n                           Add the chart to Domo in Admin Settings or Analyzer.\n                          \n\n\n\n\n\n                           Build your chart card in Analyzer.\n                          \n\n\n\n\n                        Obtaining an SVG chart\n                       \n\n                        In most cases, you can obtain an SVG chart for use in Domo by either a) downloading it from the Internet, or b) building it yourself.\n                       \n\n                        If you want to install a map for a country not available in Domo, you can download it from any of a number of websites, such as\n                        \n                         http://www.amcharts.com/svg-maps/\n                        \n                        and\n                        \n                         https://simplemaps.com/resources/svg-maps\n                        \n                        . These sites also include maps for overseas territories such as French Guiana, Aruba, and so on. Once you have downloaded one of these maps, you can immediately upload it to Domo—there is no need to manipulate the XML (unless you are planning to divide it into subregions).\n                       \n\n                        If you want to build an SVG chart yourself, you can do so using any of a number of vector-based drawing applications such as\n                        \n                         Adobe Illustrator\n                        \n                        or\n                        \n                         Inkscape\n                        \n                        . For information about these or other applications, please refer to their documentation.\n                       \n\n                        Editing the XML for your chart\n                       \n\n                        If your SVG is not a simple regional map or requires any customization, you will need to edit the XML to incorporate the necessary changes. Based on the desired customizations and the complexity of the chart, these edits may be miniscule or extremely extensive. It is possible that you may attempt to upload an SVG chart to Domo and encounter an error; this is usually the result of unsupported tags in your XML. In this case you will need to either strip out the problematic tags or replace them with supported tags.\n                       \n\n                        This section provides lists of tags supported by Domo's SVG converter along with those that are not currently supported.\n                       \n\n                        Supported XML tags\n                       \n\n                        Supported shape tags\n                       \n\n                        The following shape tags are supported:\n                       \n\n\n\n\n                           path\n                          \n                          (all path commands are supported except rotating an arc)\n                         \n\n\n\n\n                           rect\n                          \n\n\n\n\n\n                           circle\n                          \n\n\n\n\n\n                           ellipse\n                          \n\n\n\n\n\n                           line\n                          \n\n\n\n\n\n                           polyline\n                          \n\n\n\n\n\n                           polygon\n                          \n\n\n\n\n                        Of these, you can include data for all except\n                        \n                         line\n                        \n                        and\n                        \n                         polyline\n                        \n                        .\n                       \n\n                        Supported style tags\n                       \n\n                        The following style tags are supported, either with a tag, in the\n                        \n                         style\n                        \n                        attribute, or from CSS embedded in the SVG. (These tags cannot include data.)\n                       \n\n\n\n\n                           fill\n                          \n\n\n\n\n\n                           stroke\n                          \n\n\n\n\n\n                           stroke-width\n                          \n\n\n\n\n\n                           fill-opacity\n                          \n\n\n\n\n\n                           stroke-opacity\n                          \n\n\n\n\n\n                           opacity\n                          \n\n\n\n\n                        Supported transforms\n                       \n\n                        Domo provides LIMITED support for the following transforms:\n                       \n\n\n\n\n                           matrix()\n                          \n\n\n\n\n\n                           translate()\n                          \n\n\n\n\n\n                           scale()\n                          \n\n\n\n\n\n                           rotate()\n                          \n\n\n\n\n                        Text tag\n                       \n\n                        The\n                        \n                         text\n                        \n                        tag has LIMITED support. You cannot set the font, but Domo will attempt to use whatever font color and size you specify.\n                       \n\n\n                         rotate()\n                        \n                        is supported with\n                        \n                         text\n                        \n                        tags. You can also use the\n                        \n                         matrix()\n                        \n                        transform to rotate a\n                        \n                         text\n                        \n                        tag.\n                       \n\n                        Unsupported XML tags\n                       \n\n                        Domo's SVG converter does\n                        \n                         not\n                        \n                        currently support any of the following:\n                       \n\n\n\n                          Gradient paints\n                         \n\n\n\n                          Patterns\n                         \n\n\n\n                          Filters\n                         \n\n\n\n                          Other complex fills\n                         \n\n\n\n                          Embedded images\n                         \n\n\n\n                        Understanding SVG file structure\n                       \n\n                        The following XML code was taken from an SVG file for a country map of Colombia. This shows the basic format for the file, with extraneous elements removed for simplicity and most path data elements condensed (indicated by ellipses). All of the tags used in this file are supported in Domo.\n                       \n\n\n\n\n\n                         path\n                        \n                        tags always include the\n                        \n                         d\n                        \n                        subtag, which indicates the path data elements for a particular region, along with at least one other subtag to indicate a unique ID or name for a region. In the above example, each region path includes an\n                        \n                         id\n                        \n                        and\n                        \n                         name\n                        \n                        subtag. These tags are important because they also correspond to the region columns in your DataSet. When you build a map in Analyzer, you do so by dragging a region column into the \"State Name\" field above your map preview. (For more information about applying columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .) So in this example, your DataSet would need to include at least one of the columns referenced above—either a column with region IDs or names—to match up with your SVG map.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If an attribute of\n                           \n                            data-name\n                           \n                           is found, this will be the name used to target data. If this attribute does not exist, the next in priority is\n                           \n                            name\n                           \n                           . If neither of this is specified,\n                           \n                            id\n                           \n                           will be used.\n                          \n\n\n\n\n                        You could also add other subtags as necessary to account for other possible names that may be used in a DataSet. For example, DataSets for most country maps include a column for ISO 3166 regional codes. So in the \"Colombia\" example above, the XML could include a third subtag with the code for each region. We can simply call this tag\n                        \n                         code\n                        \n                        . So under the\n                        \n                         name=\"Amazonas\"\n                        \n                        tag you could add something like\n                        \n                         code=\"01\"\n                        \n                        (because the ISO 3166 code for Amazonas is \"01\"), and then follow up in similar fashion with the other regions.\n                       \n\n                        The following example shows a simple DataSet with columns that correspond to the previous code example (with an \"ISO 3166\" column added as suggested in the preceding paragraph):\n                       \n\n\n\n\n                        If you want to combine regions in a map into larger regions, you can do so by grouping all\n                        \n                         <path>\n                        \n                        tags in your SVG file into their appropriate groups then enclosing each group within\n                        \n                         <g>\n                        \n                        and\n                        \n                         </g>\n                        \n                        tags. All\n                        \n                         <g>\n                        \n                        tags in your file must include an\n                        \n                         id\n                        \n                        and/or\n                        \n                         name\n                        \n                        attribute.\n                       \n\n                        The following code sample shows a portion of an SVG file with grouping included. This code is for a U.S. map divided into a number of different groups. Two of these groups, \"West\" and \"Southwest,\" are represented in this screenshot.\n                       \n\n\n\n\n                        To access the full code sample so you can start building USA region maps, click here:\n                        \n                         usa_regions.svg\n                        \n                        . Remember that you can customize regions as desired just by cutting and pasting\n                        \n                         <path>\n                        \n                        tags for states into the appropriate group. For example, this file places Oklahoma into the \"Southwest\" group, but if you wanted to move it into \"Midwest,\" you could do so just by copying and pasting into the group with the\n                        \n                         id\n                        \n                        of \"Midwest.\" You can also add or delete groups as necessary.\n                       \n\n                        Adding custom charts to Domo\n                       \n\n                        Once you have acquired the chart you want to add to your Domo instance—and edited the XML if necessary—the next step is to upload it to your Domo. You can do this in either of the following locations:\n                       \n\n\n\n                          In\n                          \n                           Admin Settings > Company Settings > Custom Charts\n                          \n                          . You cannot access\n                          \n                           Company Settings\n                          \n                          unless you have an \"Admin\" default security profile or a custom role with \"Manage All Company Settings\" enabled.\n                         \n\n\n\n                          In the Chart Picker in Analyzer, by choosing\n                          \n                           Custom Charts\n                          \n                          then clicking the \"+\" button at the bottom of the pane. This button does not appear unless you have an \"Admin\" security profile or a custom role with \"Manage All Cards and Pages\" enabled.\n                         \n\n\n\n                        For more information about default security profiles, see\n                        \n                         Managing Custom Roles\n                        \n                        .\n                       \n\n\n                         To add a custom chart to Domo in the Admin Settings,\n                        \n\n\n\n\n                          Navigate to\n                          \n                           More\n                          \n\n                           > Admin Settings > Company Settings > Custom Charts\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Add Chart\n                          \n                          .\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Drag and drop your file into the \"Drop file here\" field.\n                           \n\n\n\n                            Click\n                            \n                             Select File\n                            \n                            , navigate to the desired file, and select it.\n                            \n\n\n\n\n\n\n\n\n                          (Optional) Rename the file and enter a description if desired.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n\n                         To add a custom chart to Domo in the Analyzer,\n                        \n\n\n\n\n                          Open the Analyzer for a card.\n                         \n\n\n\n                          In the Chart Picker, select\n                          \n                           Custom Charts\n                          \n                          .\n                         \n\n\n\n                          Click the \"+\" button at the bottom of the\n                          \n                           Custom Charts\n                          \n                          pane.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            Drag and drop your file into the \"Drop file here\" field.\n                           \n\n\n\n                            Click\n                            \n                             Select File\n                            \n                            , navigate to the desired file, and select it.\n                           \n\n\n\n\n\n                          (Optional) Rename the file and enter a description if desired.\n                         \n\n\n\n                          Click\n                          \n                           Save\n                          \n                          .\n                         \n\n\n\n                        The chart is now available in the\n                        \n                         Custom Charts\n                        \n                        dropdown in the Chart Picker in Analyzer. If at any time you want to delete this chart from Domo, you can do so by going into\n                        \n                         Admin Settings > Company Settings > Custom Charts\n                        \n                        , selecting the chart, then choosing\n                        \n                         Delete\n                        \n                        from the wrench menu in the top right corner. Similarly, if you want to switch the file for a chart, you can do so by choosing\n                        \n                         Change file\n                        \n                        from this same menu.\n                       \n\n                        Building your chart in Analyzer\n                       \n\n                        After you upload your chart to Domo, you can build a card from it in Analyzer just as you would any country map. For instructions about building country maps, see\n                        \n                         Country Map\n                        \n                        . Note that these instructions hold true for any custom chart you upload into Domo, whether or not it is a geographical map.\n                       \n\n                        Chart properties for custom charts are the same as those used in most geographical maps. For a list of these properties, see\n                        \n                         Properties for Maps\n                        \n                        .\n                       \n\n                        Adding drill path to custom charts\n                       \n\n                        You can add drill path to custom charts so you can drill from one custom chart to another. You do this\n                        \n                         the same way as you would for any other chart\n                        \n                        . Note that for this to work, you must give the custom chart you are drilling to the\n                        \n                         same name\n                        \n                        as that of the group on the top chart you are drilling on. For example, if you had a custom regional map of America, and you wanted to drill to another custom chart on the \"Western Region,\" then the next custom map would need to be called \"Western Region.\"", "Preview Article": "Click here to preview", "URL Name": "360042924454", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004723", "Archived Date": "", "Language": "English", "Primary Version": "Custom Charts", "Article Total View Count": "6,534", "": "", "Article Created Date": "10/24/2022, 10:26 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Custom Charts\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}