{"file_path": "../../raw_kb_v2\\article\\1500001388361\\index.html", "content": {"title": "\n\n\n Amazon Redshift SSH Writeback Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nAmazon Redshift is a hosted data warehouse project that is part of the larger cloud computing platform Amazon Web Services. The Amazon Redshift SSH Writeback connector allows you to easily and securely export your data from a Domo DataSet to the provided Amazon Redshift database using SSH tunneling.\n\nFor more information about the Redshift API, visit their website. (\n\n\n http://docs.aws.amazon.com/redshift/...\\_commands.html\n\n\n )\n\nYou configure your Domo-Redshift connection in the Data Center. This topic discusses the fields and menus that are specific to the Amazon Redshift SSH Writeback Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n*Note:**\n The owner of a writeback dataset must also be an owner or co-owner of the input dataset.\n\nPrerequisites\n---------------\n\nTo configure this Connector, you must have the following:\n\n The hostname of the UNIX server you are SSH-tunneling through.\n* The SSH username and password for your UNIX account.\n* The SSH port number.\n* The SSH private key.\n* The Redshift database hostname or IP address.\n* The Redshift database name.\n* The username and password you use to log into your Redshift database.\n* The port number for the Redshift database.\n* Your AWS access key. It is available in the AWS Console in the Security Credentials section or under Users, if you are using IAM.\n* Your AWS secret key. It was provided when you created your Access Key. You can generate a new one in the AWS Console.\n* The name of the AWS S3 bucket.\n* The Client ID and Client Secret associated with your Domo Developer account.\n* The CA certificate text or URL path is required\n *only*\n if you select\n **Certificate String**\n or\n\n*URL Path**\n ,\n\nrespectively, in the\n **Certificate Format**\n menu.\n\n*Note: Domo does not support the SSH keys generated using ssh-keygen. The SSH keys need to be the DES or RSA keys (in PEM format) generated by OpenSSL.**\n\n###\n To create a Domo client ID and client secret:\n\n\n1. Log into the\n\nDomo developer account\n\n.\n2. In the top right corner under\n **My Account**\n click\n **New Client**\n .\n3. Enter the application name and description.\n4. Provide the application scope by selecting the checkboxes for\n **Data**\n and\n **User**\n .\n5. Click\n **Create**\n .\n6. Once you have created a client, you can manage the client by clicking on\n **Manage Client**\n .\n\nYour\n **Client Secret**\n will appear in the\n **Manage Client**\n section.\n\n\n Configuring the Connection\n----------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Amazon Redshift SSH Writeback Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Domo developer account as well as the Amazon Redshift database. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n SSH Server Hostname\n  |\n Enter the hostname of the UNIX server you are SSH-tunneling through.\n  |\n|\n SSH Username\n  |\n Enter the SSH username for your UNIX account.\n  |\n|\n SSH Password\n  |\n Enter the SSH password for your UNIX account.\n  |\n|\n SSH Port\n  |\n Enter the SSH port number.\n  |\n|\n SSH Private Key\n  |\n Enter the SSH private key.\n  |\n|\n Database Hostname\n  |\n Enter the Redshift database hostname or IP address.\n  |\n|\n Database Name\n  |\n Enter the Redshift database name.\n  |\n|\n Database Username\n  |\n Enter the username you use to log into your Redshift database.\n  |\n|\n Database Password\n  |\n Enter the password you use to log into your Redshift database.\n  |\n|\n Database Port\n  |\n Enter the port number for the Redshift database.\n  |\n|\n Certificate Format\n  |\n Select a certificate format. If you do not want to include a certificate, select\n **No certificate**\n . If you select Certificate text, you must paste the text for your certificate in the\n **Certificate**\n field. If you select\n **URL path**\n , you must enter the URL where your certificate is in the\n **Certificate**\n field.\n  |\n|\n Certificate\n  |\n Paste the text for your CA certificate or enter the URL where your certificate is located. This is optional. If you do not want to include a certificate, select\n **No certificate**\n in the\n **Certificate Type**\n menu.\n  |\n|\n Access Key\n  |\n Enter your AWS access key. It is available in the AWS Console in the Security Credentials section or under Users, if you are using IAM.\n  |\n|\n Secret Key\n  |\n Enter your AWS secret key. It was provided when you created your Access Key. You can generate a new one in the AWS Console.\n  |\n|\n Region\n  |\n Select your Amazon S3 region.\n  |\n|\n Bucket\n  |\n Enter the name of the AWS S3 bucket.\n  |\n|\n Domo Client ID\n  |\n Enter your Domo client ID.\n  |\n|\n Domo Client Secret\n  |\n Enter your Domo client secret.\n  |\n\n\n Once you have entered valid credentials, you can use the same account any time you go to set up a new Domo-Amazon Redshift SSH connection. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a number of fields for specifying your data and indicating where it's going.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Input DataSet ID\n  |\n Enter your Domo dataset ID(GUID) located in the dataset URL.\n\nYou can find the ID by opening the details view for the DataSet in the Data Center and looking at the portion of the URL following\n\ndatasources/\n\n. For example, in the URL\n\nhttps://mycompany.domo.com/datasources/845305d8-da3d-4107-a9d6-13ef3f86d4a4/details/overview\n\n, the DataSet ID is\n\n845305d8-da3d-4107-a9d6-13ef3f86d4a4.\n  |\n|\n Table Name Source\n  |\n Choose how you would like to name the Redshift table.\n * **DataSet ID**\n . The Redshift table name will be the number you entered for\n **DataSet ID**\n .\n* **DataSet Name**\n . The Redshift table name will be the same as that of the input DataSet.\n* **Custom Name**\n . You will give the Redshift table a custom name in the\n **Custom Table Name**\n field.\n |\n|\n Custom Table Name\n  |\n Enter the name for the Redshift table.\n  |\n|\n Schema Name\n  |\n Select the Schema to write the dataset data to.\n  |\n|\n Operation Type\n  |\n Select whether you want to create a new table or update an existing table.\n  |\n|\n Create New Table\n  |\n Select this option to create a new table for every execution. The table name will be the name specified in the Table Name Source field, plus a numeric counter.\n  |\n|\n Update an Existing Table\n  |\n Select this option to update an existing table only if the table name matches the existing one in the Redshift Server; otherwise, the connector will create a new table in the first run.\n  |\n|\n Append Or Overwrite\n  |\n Select how you like to update the database table.\n\n\n**Note**\n : The connector may create a new table if the table does not exist in the first run; then update the table as per the selected option in the subsequent execution/schedule run.\n  |\n|\n Append Data\n  |\n The connector will append the fetched data to the existing table.\n  |\n|\n Overwrite With New Data\n  |\n The connector will overwrite the existing data with newly fetched data to the existing table.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n\nWhat kind of credentials do I need to power up this Connector?\n\nYou need your Redshift SSH server hostname, port number, private key, username, and password as well as your database hostname, port number, database name, username, and password. You also need your AWS access key and secret key, AWS S3 bucket name, and your Domo Developer account credentials (client ID and Client secret).\n\n###\n Why can't I connect to my Redshift database?\n\nBefore you can connect to a Redshift database, you must also whitelist a number of IP addresses on your database server on the port you want to connect to. For the full list of IP addresses, see\n\nWhitelisting IP Addresses for Connectors.\n\n\n####\n Are there any API limits I should be aware of?\n\nLimits depend on your server configuration.\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500001388361\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003995\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nAmazon Redshift SSH Writeback Connector\n\n", "article_total_view_count": "\n\n\n 4,729\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "amazon_redshift_ssh_writeback_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "writeback_connectors", "url": "/s/topic/0TO5w000000ZapVGAS"}]}