{"file_path": "../../raw_kb_v2\\article\\360042932614\\index.html", "content": {"title": "\n\n\n Common Workbench 5 Errors\n\n\n", "article_body": "\n\nIntro\n-------\n\nThis is a troubleshooting guide for the most common errors that users encounter when using Workbench to import data into Domo.\n\n\n \"Job Cannot Change Schema Dynamically\"\n----------------------------------------\n\n\n####\n Cause\n\n\n* Occurs when a file that was previously uploaded has new columns added to it, one or more of the columns have been renamed, or the columns have been reordered in the original source. Jobs will also fail when the data type of a column is changed (e.g. from \"Date\" to \"Text\").\n* There is a setting called\n **Allow schema changes**\n available for jobs in Workbench. It is disabled by default, but when enabled, it allows dynamic schema changes to occur. To locate this option, click\n\nand choose a job in the list, click the\n **Configure**\n subtab, then scroll down to\n **Additional settings**\n at the bottom.\n\n\n####\n Notes and Recommendations\n\n\n* Adding new columns and reordering columns is generally safe, but Domo does not recommend deleting columns.\n* To ensure that cards and DataFlows based on the DataSet do not break, leave the schema the same.\n\n\n####\n Solution(s)\n\n\n* **Revert the changes.**\n If possible, revert any changes that were made to the original data source that caused the schema to change.\n* Manually running the job once via the Workbench UI updates the schema, regardless of the setting for\n **Allow schema changes**\n in\n **Configure > Additional settings**\n in Workbench.\n* If you are confident that your changes will not affect existing cards or DataFlows, you can change the option in\n **Additional settings**\n to allow the schema to be set dynamically. If you decide to enable it, Domo recommends disabling it once you fix the DataSet.\n\n\"Source File Doesn't Exist\"/\"File Not Found\"\n----------------------------------------------\n\n\n####\n Cause\n\nThe file does not exist in the location specified in the\n **Source**\n menu in the\n **Configure**\n subtab for the selected job in Workbench.\n\n###\n Solution\n\n\n* Update the file path in the\n **Source**\n menu in the\n **Configure**\n subtab for the selected job in Workbench with the correct file name and location.\n* Make sure the file is in the right location and has the name specified in Workbench.\n* If the file is not local to the machine, consider setting up impersonation with a user that has access to the file.\n\n\"504 Gateway Timeout\"\n-----------------------\n\n\n####\n Cause\n\nThis error occurs when there is a communication error between Workbench and your Domo instance.\n\n###\n Solution\n\n\n* If this is the first time you are attempting to use Workbench, you will need to make sure that the proxy settings in Workbench are configured properly. Proxy settings can be configured in Workbench in\n **Settings > Proxy**\n . To locate\n **Settings**\n , click\n\nin the left-hand icon bar.\n* Make sure your network is configured to allow access to Domo.\n* If your Domo Workbench jobs have worked previously, you may be able to resolve this by re-running the job.\n\n\"File Is In Use\"\n------------------\n\n\n####\n Cause\n\nThe file that Workbench is trying to import to Domo is in use by another application and/or the file is locked. This can happen if the file is in use, such as when the file is being copied when the Workbench job runs.\n\n###\n Solution\n\n\n* Ensure that the file is not in use when the Workbench job runs.\n* Change the schedule of the job so that the file won’t be in use when Workbench runs.\n\n\"Deadlock Victim\"\n-------------------\n\n\n####\n Cause\n\nThis is a SQL error that occurs when you are attempting to import data from a database. It often happens when different queries attempt to access a record at the same time. The database software decides which query is allowed to run and will block other queries.\n\n###\n Solution\n\n\n* Update the Workbench schedule for the job to run when other queries are not running against the database.\n* Review other queries that may be running at the same time and change when the queries run.\n* Consider using a non-locking query. Keep in mind that a change like this can give you dirty data if the data is actively being updated.\n\n\"Connection Login Timeout\" when using ODBC plugin\n---------------------------------------------------\n\n\n####\n Cause\n\nThis often occurs when the database is under a heavy load.\n\n###\n Solution\n\nRetry the Workbench job at a different time when the load on the database is lower.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042932614\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004837\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCommon Workbench 5 Errors\n\n", "article_total_view_count": "\n\n\n 5,411\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:31 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "common_workbench_5_errors", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_5", "url": "/s/topic/0TO5w000000ZapTGAS"}]}