{"file_path": "../../raw_kb_v2\\article\\360042934774\\index.html", "content": {"Title": "June 2017 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        New Global Search\n                       \n\n                        With a brand-new search engine and powerful filters, Domo’s new search and discovery tool provides multiple ways to search and discover valuable information inside Domo. New filters enable you to use information that you know about what you are searching for without requiring you to use a keyword. For instance, what if you are looking for a card and you can’t remember the card name, but you know it was created recently by a teammate? By filtering based on owner and creation date, you can quickly discover the latest cards created by your teammate in a matter of seconds.\n                       \n\n                        With a revamped search engine, keywords match not just on titles anymore; as you type, the engine goes deeper to match on descriptions, owner names, column names in DataSets, and even down to the content inside a document card.\n                       \n\n                        Also, when you open an item from the Search window, clicking the Back button returns you to the Search, making it easy to quickly view different items from the same search.\n                       \n\n                        Ultimately, you now have ways to find content in Domo when you need it, helping you get insights in real time and make smarter decisions.\n                       \n\n\n\n\n                        The new global search functionality is available in both the web and mobile versions of Domo.\n                       \n\n                        For more information, see\n                        \n                         Searching in Domo\n                        \n                        .\n                       \n\n                        New Alert Center\n                       \n\n                        Domo’s revamped Alert Center puts all of the interesting, important, and actionable insights from your data at your fingertips, resulting in faster responses to real opportunities. Effective business leaders manage their organizations using metrics and goals to help ensure consistent progress and optimized performance. Domo helps businesses draw insights from more data sources than ever before. As the volume of data businesses harvest continues to grow, an organization’s ability to properly analyze all of the complex relationships in their data diminishes, but as of today, Domo’s all-new Alert Center fills this essential gap.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Alert Center Layout\n                        \n                        .\n                       \n\n                        New Version of Getting Started with Domo App\n                       \n\n                        Domo has created a new and improved introductory training app called “Domo Basics: Getting Started with Domo.” The previous “Getting Started with Domo” app has been revised using a brand new learning interface and has been updated with the latest training content. The new version is designed to help new and existing Domo users learn the basics about using Domo to drive value within their organization and to introduce the steps that they need to take in order to execute against their desired outcomes.\n                       \n\n                        The new version of the app includes the following features:\n                       \n\n\n\n                          Navigation Pane\n                         \n                         . We’ve redesigned the navigation pane in order make it easier to jump from page to page.\n                         \n\n\n\n\n\n                          Interactive Learning\n                         \n                         . The training modules are no longer just videos, but include a variety of activities you can complete along the way.\n                         \n\n\n\n\n\n                          Quiz Time\n                         \n                         . We've added quizzes to test your knowledge and put you on the right path.\n                         \n\n\n\n\n\n                          Additional Resources:\n                         \n                         Direct links to the Knowledge Base provide you with more opportunities to deepen your expertise in specific areas.\n                         \n\n\n\n\n\n                        We encourage you to download the new app into your Domo instance and provide it to all new users as an introductory training course for using Domo. You can access the app by going to the Appstore and searching for \"Getting Started.”\n                       \n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            The previous version of “Getting Started with Domo” will be deprecated on July 15th. Please delete this version from your instance after you download the updated version.\n                           \n\n\n\n\n\n                        New Self-Service Connectors\n                       \n\n\n\n                          This month we have polished and released another 26 connectors that are now available to all customers in their Domo account. These connectors are self-service, so you no longer need to contact support to get help powering them up. Here are the new connectors:\n                         \n\n\n\n\n\n\n\n                            Connector\n                           \n\n\n\n                            Link to Knowledge Base article\n                           \n\n\n\n\n\n\n\n                            Agemni\n                           \n\n\n\n\n                             Agemni Connector\n                            \n\n\n\n\n\n\n                            Amazon Athena\n                           \n\n\n\n\n                             Amazon Athena Connector\n                            \n\n\n\n\n\n\n                            Amazon MWS\n                           \n\n\n\n\n                             Amazon MWS Connector\n                            \n\n\n\n\n\n\n                            Amazon Redshift SSH\n                           \n\n\n\n\n                             Amazon Redshift SSH Connector\n                            \n\n\n\n\n\n\n                            Bitly\n                           \n\n\n\n\n                             Bitly Connector\n                            \n\n\n\n\n\n\n                            Celtra\n                           \n\n\n\n\n                             Celtra Connector\n                            \n\n\n\n\n\n\n                            DataSet Copy\n                           \n\n\n\n\n                             DataSet Copy Connector\n                            \n\n\n\n\n\n\n                            District M\n                           \n\n\n\n\n                             District M Connector\n                            \n\n\n\n\n\n\n                            DoubleClick Campaign Manager\n                           \n\n\n\n\n                             DoubleClick Campaign Manager Connector\n                            \n\n\n\n\n\n\n                            Maropost\n                           \n\n\n\n\n                             Maropost Connector\n                            \n\n\n\n\n\n\n                            Microsoft Excel SFTP\n                           \n\n\n\n\n                             Microsoft Excel SFTP Connector\n                            \n\n\n\n\n\n\n                            NetSuite OpenAir\n                           \n\n\n\n\n                             NetSuite OpenAir Connector\n                            \n\n\n\n\n\n\n                            Open Exchange Rates Advanced\n                           \n\n\n\n\n                             Open Exchange Rates Advanced Connector\n                            \n\n\n\n\n\n\n                            Oracle CRM on Demand\n                           \n\n\n\n\n                             Oracle CRM on Demand Connector\n                            \n\n\n\n\n\n\n\n                             Outreach.io\n                            \n\n\n\n\n\n                             Outreach Connector\n                            \n\n\n\n\n\n\n                            Percolate\n                           \n\n\n\n\n                             Percolate Connector\n                            \n\n\n\n\n\n\n                            PestRoutes\n                           \n\n\n\n\n                             PestRoutes Connector\n                            \n\n\n\n\n\n\n                            Procore\n                           \n\n\n\n\n                             Procore Connector\n                            \n\n\n\n\n\n\n                            Rent Manager\n                           \n\n\n\n\n                             Rent Manager Connector\n                            \n\n\n\n\n\n\n                            Sailthru Advanced\n                           \n\n\n\n\n                             Sailthru Advanced Connector\n                            \n\n\n\n\n\n\n                            Saleshood\n                           \n\n\n\n\n                             Saleshood Connector\n                            \n\n\n\n\n\n\n\n                             Simpli.fi\n                            \n\n\n\n\n\n                             Simpli.fi Connector\n                            \n\n\n\n\n\n\n                            Spredfast\n                           \n\n\n\n                            Spredfast Connector\n                           \n\n\n\n\n\n\n                             Twitch.tv\n                            \n\n\n\n\n\n                             Twitch Connector\n                            \n\n\n\n\n\n\n                            VoiceStorm\n                           \n\n\n\n\n                             VoiceStorm Connector\n                            \n\n\n\n\n\n\n                            WordPress Self-Hosted\n                           \n\n\n\n\n                             WordPress Self-Hosted Connector\n                            \n\n\n\n\n\n\n                        Informatica Cloud Plugin\n                       \n\n                        You can now connect to Informatica Cloud data in Domo by configuring a source dataset, setting up a DataSet in Domo as a target object, then mapping fields from the source dataset to the target object as necessary.\n                       \n\n\n\n\n                        For detailed instructions on connecting to data using this plugin, see\n                        \n                         Connecting to Informatica Cloud in Domo\n                        \n                        .\n                       \n\n                        New Filtering Experience on Mobile\n                       \n\n\n                         We’re happy to release our brand-new card filtering experience on Mobile. With this update, when you launch card filtering from your iOS or Android device, applying filters and conducting your analysis is more intuitive than ever. We’ve focused our new experience on something for executives and analysts alike. Just open up your favorite chart, tap to add a filter and you’ll see our new friendly header as well as a live preview of the card as you filter. This will allow you to clearly understand how the filters are impacting your data.\n                        \n\n\n\n\n\n\n\n                        Advanced Deploy Phase 1\n                       \n\n                        With the completion of Phase 1 of our Advanced App Deploy initiative, Appstore users now have the ability to connect and replace DataSets in their App using a full schema map. This enables users to power up apps in a more user-friendly way, even if they are not connector-based.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Deploying Apps from the Appstore\n                        \n                        .\n                       \n\n                        Full Screen and Favorite Icons Moved\n                       \n\n                        In the card Details view, in the interest of preserving card space, the options for adding the card as a Favorite and opening the card in full-screen mode have been moved into the Wrench menu and are no longer available as icons.\n                       \n\n\n\n\n                        For more information about the Details view layout, see\n                        \n                         Card Details View Layout\n                        \n                        .\n                       \n\n                        Analyzer Name Change\n                       \n\n                        The Page Analyzer and Card Analyzer features have been renamed as \"Page Filters\" and \"Card Filters.\"\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042934774", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004441", "Archived Date": "", "Language": "English", "Primary Version": "June 2017 Release Notes", "Article Total View Count": "4,674", "": "", "Article Created Date": "10/24/2022, 10:11 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              June 2017 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}