{"file_path": "../../raw_kb_v2\\article\\360043433313\\index.html", "content": {"title": "\n\n\n Google Cloud Storage Connector\n\n\n", "article_body": "\n\n*Important:**\n\nDue to Google’s change in allowing Domo connectors to use OAuth authentication, all users must now use service account key authentication to create new data connections. All pre-existing DataSets will continue to run normally. Current Connectors that rely on Google OAuth authentication will no longer be able to power up new DataSets. These connectors include the following:\n * Google BigQuery\n* Google Adwords via Google BigQuery\n* DoubleClick Campaign Manager via Google Cloud Storage (DTV2)\n* Google Cloud Storage\n* Google Contacts\n* Google Drive\n* Google Gmail\n* Google Admin SDK Reports\n\nIf you need to change a pre-existing Google OAuth DataSet, please use the corresponding Service Account connector. The following Service Account connectors are now available:\n\n Google BigQuery Service\n* Google Ads (fomerly AdWords) via Google BigQuery Service\n* Google Drive Service\n* Google Cloud Storage Service\n* Google Contacts Service\n* Google Gmail Service\n* Google Admin SDK Reports Service\n\nAll other equivalent Google Service Account connectors are currently in development. Domo will communicate when these connectors become available. You will need to look for the Service Account equivalent connector in Data Center or the App Store and use that connector to get their data.\n\n\n Domo recommends that you proactively repower existing Google connections by creating new DataSets utilizing the new Service Account Key connectors as the connectors become available.  Domo will notify you if any further migration changes should arise.\n\n\n Intro\n-------\n\nGoogle Cloud Storage is an Internet service used to store data in Google's cloud. You can use Domo's Google Cloud Storage connector to get data about project buckets and objects in Google Cloud Storage. Buckets are general locations and destination for files to be stored. Projects organize the resources and permissions. Most people will use this connector to connect to the buckets that store their data.\n\n\n To find out more about the Google Cloud Storage API, visit\n\nhttps://cloud.google.com/storage/docs/json\\_api/\n\n.\n\n\n The Google Cloud Storage connector is a \"File\" connector, meaning it retrieves files and outputs them to Domo. In the Data Center, you can access the connector page for this and other File connectors by clicking\n **File**\n in the toolbar at the top of the window.\n\n\n You connect to your Google Cloud Storage account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the Google Cloud Storage connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n |\n Files of any size can be delivered to the Google Cloud Storage buckets. You can list the files in a bucket or retrieve individual files. You can also use this connector to pull details about the buckets and projects associated with the bucket or project name.\n  |\n|\n**Primary Metrics**\n |\n None. This connector is primarily used for grabbing files out of a cloud storage bucket.\n  |\n|\n**Primary Company Roles**\n | * Data specialists\n* Analysts\n* MajorDomos\n |\n|\n**Average Implementation Time**\n | * Entering credentials - 15 minutes or less\n* Configuring the connector - 20 minutes\n* Allowing the connector to run - Time varies depending on file size\n |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 3\n  |\n\nPrerequisites\n---------------\n\nTo connect to a Google account and create a Google Cloud Storage DataSet, you must have the password for the account you want to connect to.\n\n\n Connecting to Your Google Account\n-----------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Google Cloud Storage Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Google Cloud Storage connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Google accounts in Domo) to open the Google OAuth screen where you can select the account you want to connect to. After selecting an account, you are asked for the password for that account. Once you have entered a valid password, you can use the same account any time you go to create a new Google Cloud Storage DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into Google when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of the currently active Google account.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Report**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Storage Type\n  |\n Select whether the data you want to pull comes from a project or a bucket.\n  |\n|\n Report\n  |\n Select a Google Cloud Storage report. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Bucket Details\n  |\n Returns details about the specified bucket.\n  |\n|\n List Buckets (only available when\n **Projects**\n is selected as your\n **Storage Type**\n )\n  |\n Returns the list of buckets in the specified project.\n  |\n|\n List Objects\n  |\n Returns the list of objects in the specified bucket.\n  |\n|\n Get Object\n  |\n Lets you locate a specific bucket object to pull into Domo.\n  |\n\n|\n|\n Project ID\n  |\n Enter the API ID of the project you want to retrieve data for.\n  |\n|\n Projection\n  |\n Select the desired projection type, either\n **No ACL**\n or\n **Full**\n .\n  |\n|\n Prefix\n  |\n Enter the prefix of the Object or Bucket name you want to retrieve data for. For example, if the Bucket name was \"API-Bucket,\" you would enter\n\nAPI\n\nas the prefix. (The prefix is case-sensitive.)\n  |\n|\n Versions\n  |\n Select\n **True**\n if you want object versions to appear as results in your DataSet; otherwise select\n **False**\n .\n  |\n|\n Bucket Name\n  |\n Enter the name of the bucket containing the object you want to pull into Domo.\n  |\n|\n Object Name\n  |\n Enter the name of the object you want to pull into Domo. You can enter full names or regular expressions. You select the desired match type in the\n **Match Type**\n menu.\n  |\n|\n Match Type\n  |\n Select how you want to search for the object you've entered in\n **Object Name**\n .\n * Select\n **Object name contains the specified string**\n if you want to search for all objects containing the specified object name.\n* Select\n **Object name starts with the specified string**\n if you want to search only for objects starting with the string.\n* Select\n **Object name with regular expression**\n if you entered a regular expression in the\n **Object Name**\n field.\n |\n|\n File Type\n  |\n Select the file type for the object you want to pull into Domo.\n  |\n|\n Contains Header Row?\n  |\n Select\n **Yes**\n if the CSV file you are pulling into Domo contains a header row. If you select\n **No**\n , a header row will be generated in the new DataSet.\n  |\n|\n Select the Delimiting Character\n  |\n Select the delimiter for your CSV file.\n  |\n|\n File Name from Zip File\n  |\n Select the ZIP file you want to pull into Domo.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Troubleshooting\n-----------------\n\n\n* Check that you have the file name right and that you are matching on either a \"starts with\" or \"contains.\"\n* Ensure you have the right permissions with the project to get to the bucket you're interested in.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043433313\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003586\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Cloud Storage Connector\n\n", "article_total_view_count": "\n\n\n 4,732\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "google_cloud_storage_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}