{"file_path": "../../raw_kb_v2\\article\\360047553253\\index.html", "content": {"title": "\n\n\n Data Center Layout\n\n\n", "article_body": "\n\nIntro\n=======\n\nYou can manage DataSets and user accounts for connectors in the Data Center. If you have sufficient access rights, you can access this page by clicking\n **Data**\n in the main toolbar at the top of the screen.\n\n\n The Data Center is divided into four tabs. You can switch between the tabs by clicking the icons in the vertical navigation pane on the left side of the screen.\n\nThe following tabs are available:\n\n\n Tab\n  |\n Icon\n  |\n Description\n  |\n| --- | --- | --- |\n|\n Data Warehouse\n  |\n\n|\n S\n\nee a three-dimensional visual representation of all DataSets in your Domo broken down by connector.\n\n|\n|\n DataSets\n  |\n\n|\n View and manage DataSets added to Domo. For any DataSet, you can access a Details page that provides additional options.\n  |\n|\n DataFlows\n  |\n\n|\n Create and manage DataFlows, DataSets created by combining and transforming two or more input DataSets.\n  |\n|\n Accounts\n  |\n\n|\n Manage accounts used for connecting DataSets to Domo.\n  |\n|\n Beast Mode Manager\n  |\n\n|\n View and manage Beast Modes created on your Cards.\n  |\n|\n Data Science\n  |\n\n|\n View the Data Science Home Page to find the tools you need.\n  |\n|\n More\n  |\n\n|\n View additional options that are enabled in your instance.\n  |\n\nYou can click the\n\nicon to show the names of the above tabs.\n\n*Video - Data Center Overview**\n\nData Warehouse tab\n====================\n\nThe Data Warehouse in Domo provides a three-dimensional visual representation of all DataSets in your Domo, broken down by connector, along with data currently flowing into and between them. DataSets for each connector type are represented as stacks on a rotating palette. You can configure the order and height of the connector stacks to indicate different metrics. For example, you could sort the connector stacks by number of rows but have the height of the individual stacks represent the number of DataSets. For more information about The Data Warehouse, see\n\nUsing The Data Warehouse to Manage Data\n\n.\n\n\n In the Data Warehouse tab you have access to a toolbar that provides shortcuts for\n\nopening the DomoR installation page\n\n.\n\n\n DataSets and DataFlows tabs\n=============================\n\nThe\n **DataSets**\n and\n **DataFlows**\n tabs list DataSets and DataFlows, respectively, in your Domo instance. In these tabs you can\n\n view DataSets and DataFlows that have been added to Domo\n\n\n For a DataSet, you can view information about the DataSet, including the connector, the name, the owner, the number of rows and columns in the DataSet, the number of cards being powered by the DataSet, the total number of times these cards have been viewed, and the amount of time since the DataSet was last updated. You can also preview or delete a DataSet.\n\n\n For a DataFlow, you can view information about the DataFlow, including the name, owner, number of input and output DataSets, number of runs vs. success rate, and the amount of time since the DataFlow was last run.\n\n\n Both tabs include options for searching with or without filters, applying quick filters, saving favorite filters, and sorting the DataSets/DataFlows in the list.\n* add DataSets and DataFlows\n\n\n From either tab you can...\n\n+ add data into Domo from third-party systems\n\n , then transform the data to power up multiple cards without having to locate and re-upload that DataSet for each card.\n\t+ add Magic transforms of any kind—\n\n DataFusions\n\n .\n\t+ get information about and download\n\n Workbench\n\n .\n\t+ get information about installing the\n\n DomoR plugin\n\n .\n* visually identify DataSets needing attention\n\n\n DataSets with errors do\n *not*\n run as scheduled until errors are resolved.  Domo lets you know when a DataSet cannot run successfully by displaying the error on the DataSet in the Data Center and in the Accounts page, and by sending the owner of the DataSet an alert that describes the error and links to the DataSet.\n\nThe following screenshot points out the most important parts of the\n **DataFlows**\n and\n **DataSets**\n tabs. (This screenshot is specifically from the\n **DataFlows**\n tab, but the only difference between the two tabs is different information in the rows.)\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Search\n  |\n Lets you search for the desired DataSet/DataFlow in the list. This search draws from a variety of metadata, including name, connector, owner, tags, status, and more. You can refine your search by doing any of the following:\n * Clicking a recommended filter. These may appear when you enter a search term or part of search term in the field.\n* Adding a custom filter. You do this by clicking\n **Add Filter**\n , selecting the desired filter from the list, then entering the filter criteria as required. For example...\n\t+ If you selected\n\t **Owned**\n\t**By**\n\t , you would be prompted to enter the owner of the DataSet or DataFlow you wanted to view.\n\t+ If you selected\n\t **DataFlow Type**\n\t , you would be prompted to select the desired DataFlow type from a list.\n\t+ If you selected\n\t **Last Updated**\n\t , you would be prompted to specify whether the DataFlow or DataSet was last updated on, before, or after the given date, then select the date itself.\n* Changing the sort used in the list. You do this by clicking in the menu in the top right corner of your search results (shown as \"Relevance\" in the above screenshot) then choosing the desired sort type.\n\n\n For DataSets, you can sort by relevance, name, number of cards, number of rows, last run date, or status (broken DataSets are shown first).\n\n\n For DataFlows, you can sort by relevance, creation date, last modified date, name, status (broken DataFlows are shown first), success rate, or last run date.\n |\n|\n Add Filter\n  |\n Lets you filter the DataSets or DataFlows in the list. This option is described in more detail in the entry for \"Search,\" above.\n  |\n|\n Favorite Filter icon\n  |\n Lets you save the current filter configuration. When you click this icon, you are prompted to enter a unique name for the filter. When you save the new filter, the star icon turns gray and the filter appears under\n **Favorite Filters**\n in the panel on the left side of the screen. You can then click this filter anytime to apply it.\n\n\n You can remove a saved filter by clicking the gray star icon and then choosing\n **Remove**\n .\n\n\n You can also do a \"Save As\" on a saved filter. This is useful when you make changes to an existing filter and want to keep both filters. To do this, you click on the gray star icon, enter the new filter name in the name field, click\n **Update**\n , then select\n **Save As New Filter**\n .\n\n\n These options are also available via the\n **Favorite Filters**\n area in the panel on the left side of the screen. If you mouse over a filter here, a gear icon displays. Clicking this icon reveals the following options:\n * **Rename**\n . Lets you rename a saved filter.\n* **Duplicate**\n . Lets you do a \"Save As\" on the filter. When you save the filter in this way, a second version of the filter appears in the list, with the word \"copy\" appended to it. You can rename it if you want using the\n **Rename**\n option described above.\n* **Delete**\n . Removes the filter.\n |\n|\n Sort\n  |\n Lets you sort the DataSets or DataFlows in the list. This option is described in more detail in the entry for \"Search,\" above.\n  |\n|\n Quick Filters/Favorite Filters\n  |\n Lets you quickly apply any prebuilt filters (\n **Quick Filters**\n ) or saved filters (\n **Favorite Filters**\n ).\n\n\n Available Quick Filters include the following:\n * **All DataSets/All DataFlows**\n . Removes all filters from the list. This is a good way to \"reset\" the list after you have applied many filters.\n* **Recently run**\n . Filters to show only those DataSets/DataFlows that have been run in the last several days.\n* **Owned by you**\n . Filters to show only those DataSets/DataFlows you are the owner of.\n* **Needs attention**\n . Filters to show only those DataSets/DataFlows in a broken state (indicated by a red exclamation point on the DataSet/DataFlow in the list).\n\n\n Favorite Filters are those filter configurations you have saved. These are described in more detail in the entry for \"Favorite Filter icon,\" above.\n  |\n|\n DataSets/DataFlows\n  |\n Display information about each DataSet or DataFlow. For DataSets, this information includes the name, connector, owner profile picture, number of rows and columns, number of cards powered by the DataSet, any tags, and the last update time. For DataFlows, the information includes the name, owner, number of input and output DataSets, number of runs versus the success rate, any tags, and the last run time.\n\n\n For each DataSet or DataFlow, you can do the following:\n * Click the photo to open a user avatar card with information, including a list of groups to which the user belongs, card view statistics, and a\n **Follow**\n button so you can follow this user in Buzz.\n* Click the DataSet or DataFlow name to open the details view for the DataSet or DataFlow, which provides additional options. For example, for a DataSet, you can see a preview of the data, cards being powered by the DataSet, a run history, and so on.\n* Mouse over the row to reveal a wrench icon\n\nthat provides access to various options for interacting with this DataSet or DataFlow. These options are listed in the entry for \"Options,\" beow.\n* Add search tags to this DataSet or DataFlow so you can more easily find it later. This is described in more detail in the entry for \"Add Tag,\" below.\n* Take bulk actions on DataSets or DataFlows. You can select an initial DataSet or DataFlow to take action on by mousing over the row then clicking the checkbox that appears in the top left corner of that row. This pops up a blue bar along the top of the screen with new options. From here you can do all of the following:\n\n+ Select more DataSets/DataFlows by mousing over them and checking their checkboxes.\n\t+ Select all DataSets/DataFlows currently appearing in the list by clicking\n\t **Select All**\n\t in the blue bar.\n\t+ Tag selected DataSets/DataFlows by clicking the\n\n icon on the right side of the blue bar. For more information about tagging, see the entry for \"Add Tag\" in this table.\n\t+ Apply additional actions by clicking the\n\n icon on the right side of the blue bar then selecting the desired option:\n\n\t- **Run Now**\n\t\t . This executes all of the selected DataSets or DataFlows.\n\t\t- **Change Owner.**\n\t\t This allows you to select a new owner for the selected DataSets or DataFlows. For more information, see\n\n\t Changing the Owner of a DataFlow\n\n\t .\n\t\t- **Delete**\n\t\t . This allows you to delete all of the selected DataSets or DataFlows. To delete DataSets you must have an \"Admin\" security profile or be the DataSet owner. For more information, see\n\n\t Disabling or Deleting a DataFlow\n\n\t .\n\n\n For a DataFlow, you can also mouse over the \"Inputs/Outputs\" data to show all of the input and output DataSets for this DataFlow.\n  |\n|\n Add Tag\n  |\n Lets you add search tags to this DataSet or DataFlow so you can easily find it later by searching for those tags. When you click\n **Add tag**\n , a dialog appears with a list of existing tags. (If no tags have yet been added for your company, this list appears blank.)\n\nYou can then do either of the following:\n * Add\n *existing*\n tags to the DataSet or DataFlow by clicking them in the list. Any tags that have already been added appear blue. You can filter the tags in the list by entering the desired tag name in the\n **Search and add tags**\n field.\n* Add a\n *new*\n tag to the DataSet or DataFlow by entering the tag name in the\n **Search and add tags**\n field. If the tag does not yet exist, it appears alone in the list area with the \"Create new tag\" designation. You can then click it to add it to the DataSet or DataFlow.\n\n\n You can remove a tag from a DataSet or DataFlow by clicking the \"x\" next to the tag while in this dialog.\n\n\n You can also access the tagging functionality by doing any of the following:\n * Selecting\n **View Tags**\n in the options menu for a DataSet or DataFlow in the list view.\n* Selecting\n **Tags**\n in the options menu for a DataSet or DataFlow details view.\n* Clicking\n **Add tag**\n under the DataSet name in the details view (DataSets only).\n\n\n You can add tags to multiple DataSets or DataFlows at once by selecting the DataSets or DataFlows (by checking their checkboxes), clicking\n\nto open the tagging dialog, then adding tags as desired. For more information about this dialog, see the entry for \"Add Tag\" in this table.\n\n\n While in the list view for a DataSet or DataFlow, if you click a tag, the list filters to show only DataSets and DataFlows with that tag.\n  |\n|\n Options icon\n\n|\n Displays a menu of options for the DataSet or DataFlow. Appears when you mouse over the row for a DataSet or DataFlow.\n\n\n For a DataSet, available options are as follows:\n * **View Details**\n . Opens the Details view for this DataSet. In this view you can see an overview of the DataSet, previews of the cards powered by the DataSet, and a run history.\n* **View Tags**\n . Opens the tag dialog for this DataSet. For more information, see \"Add Tag\" in this table.\n* **Preview**\n . Opens a preview of the data in this DataSet.\n* **Delete**\n . Deletes this DataSet. You can delete DataSets owned by other users only if you have an \"Admin\" security role or a custom role with the \"Manage DataSets\" privilege enabled . For more information about security roles, see\n\nUnderstanding security roles\n\n. For information about custom roles, see\n\nManaging Roles\n\n.\n\n\n For a DataFlow, available options are as follows:\n * **Details**\n . Opens the Details view for this DataFlow. In this view you can set scheduling options, view input and output DataSets, see the run history, and access a list of previous versions of the DataFlow.\n* **Edit**\n . Opens the editor for the DataFlow. For more information about creating or editing a DataFlow, see\n\nMagic Transforms\n\n.\n* **View Tags**\n . Opens the tag dialog for this DataFlow. For more information, see \"Add Tag\" in this table.\n* **Run**\n . Runs this DataFlow, which updates the input and output DataSets. For more information, see\n\nRunning a DataFlow\n\n.\n* **Disable**\n . Disables the DataFlow, preventing DataSets powered by the DataFlow from running. For more information, see\n\nDisabling or Deleting a DataFlow\n\n.\n* **Notifications**\n . Lets you choose whether you want to receive email notifications when the DataFlow fails to update. For more information, see\n\nConfiguring Notifications for Failed DataFlows\n\n.\n* **Create Copy**\n . Does a \"Save As\" on this DataFlow.  Copied DataFlows can be renamed, edited, saved, and run independently of their original DataFlow. For more information, see\n\nCopying a DataFlow\n\n.\n* **Delete**\n . Deletes this DataFlow. You can delete DataFlows owned by other users only if you have an \"Admin\" security role or a custom role with the \"Manage DataFlows\" privilege enabled . For more information about security roles, see\n\nUnderstanding security roles\n\n. For information about custom roles, see\n\nDisabling or Deleting a DataFlow\n\n.\n\n*Important:**\n If you delete a DataSet that powers any cards, the cards display a \"Data not loading\" message.\n\n|\n\n\n**Tips:**\n* You can view DataSets for a specific third-party application or data provider from the Launcher page. For more information, see\n\nViewing Cards for Data Providers\n\n.\n* In the Profile page, you can view all of the DataSets owned by a user. For more information, see\n\nViewing a User's Owned DataSets\n\n.\n\n\n View Details\n---------------\n\nWhen you click the name of a DataSet or click\n\n*>**\n**View Details**\n , a page appears showing details for the DataSet. This page is divided into a number of tabs. Some of these tabs appear for every DataSet you view, while others only appear for specific user roles and connector types. These tabs are\n **Overview, C**\n**ards**\n ,\n **History**\n ,\n **Settings**\n ,\n **Data Lineage**\n , and\n **Personalized Data Permissions**\n .\n\n\n For more information, see\n\nConnecting to Data with Connectors\n\n.\n\n\n**Video - Domo Interface - DataSet Details**\n\n The\n **Overview**\n tab includes four tiles that show you the number of cards powered from this DataSet, the number of users it is being shared with, the number of DataSets built from the connector, and the number of DataFlows created from the DataSet. All of these tiles also provide \"jump-off points\" to other actions in Domo using this DataSet.\n* The\n **Cards**\n tab contains previews of cards powered by the DataSet.\n* The\n **History**\n tab shows the run history for the DataSet and only appears if the DataSet has run history data.\n* The\n **Settings**\n tab lets you change the connector configuration options for the DataSet. It only appears if you are the DataSet owner or have an \"Admin\" security role or a custom role with the \"Manage DataSets\" privilege enabled.\n* The\n **Data Lineage**\n tab shows you the lineage for this DataSet.\n* The\n **Personalized Data Permissions**\n tab allows you to set PDP policies on the DataSet and does not appear unless you are the DataSet owner or have an \"Admin\" security role or a custom role with the \"Manage DataSets\" privilege enabled.\n\nFor more information, see\n\nConnecting to Data with Connectors\n\n.\n\n##\n General options\n\nThe following screenshot shows the details view for a sample DataSet called \"College Enrollment.\" All of the options called out here are available in all tabs.\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Connector\n  |\n The connector for this DataSet. For more information about connectors, see\n\nConfiguring Each Connector\n\n.\n  |\n|\n DataSet description\n  |\n A description of this DataSet. You can add or change a description by selecting\n **Edit Name & Description**\n in the Options menu then entering the desired description.\n  |\n|\n DataSet name\n  |\n The name of this DataSet. You can add or change a name for a DataSet by selecting\n **Edit Name & Description**\n in the Options menu then entering the desired name.\n  |\n|\n Number of columns and rows\n  |\n A size indicator for the DataSet.\n  |\n|\n Add tag option\n  |\n Lets you add search tags to this DataSet. If any tags have already been added, they appear here. Adding tags is described in more detail in the previous table.\n  |\n|\n Most recent update time\n  |\n Indicates when this DataSet was last refreshed. For more information, see\n\nSetting the Expected Update Frequency for a DataSet\n\n.\n  |\n|\n Owner\n  |\n Shows who owns this DataSet. You can click a user's photo to see an avatar card with his or her basic information and a\n **Go To Profile**\n button that provides access to the Profile page. For more information about the Profile page, see\n\nProfile Page Layout\n\n.\n  |\n|\n DataSet Overview\n  |\n Shows how this DataSet is being used.\n  |\n|\n Tabs\n  |\n Let you switch between the tabs in the details page for the DataSet. Information about each tab is provided later in this section.\n  |\n|\n Edit Webform\n  |\n Edit Webform (Webforms only). Lets you edit the data for this Webform. For more information, see\n\nUploading a webform\n\n.\n  |\n|\n Open with menu\n  |\n Provides access to a number of options for the DataSet. Some options may not appear, depending on the Connector and your security role.\n * **Analyzer**\n . Opens this DataSet in Analyzer so you can create a KPI card around it. For more information, see\n\nAnalyzer Overview\n\n.\n* **Views Explorer**\n . Opens the DataSet Views editor. For more information, see\n\nDataSet Views\n\n.\n* **Magic ETL**\n . Opens the Magic ETL editor. For more information, see\n\nCreating a Magic ETL DataFlow\n\n.\n* **SQL DataFlow**\n . Opens the SQL DataFlow editor. For more information, see\n\nCreating a SQL DataFlow\n\n.\n |\n|\n Options icon\n  |\n Provides access to a number of options for the DataSet. Some options may not appear, depending on the Connector and your security role.\n * **Edit Name & Description.**\n Lets you open a dialog in which you can change the name and description of this DataSet.\n* **Tags**\n . Lets you add search tags to this DataSet. Adding tags is described in more detail in the previous table.\n* **Notifications**\n . Lets you subscribe to or unsubscribe from email notifications for the DataSet.\n* **Request certification**\n . Lets you request the DataSet be certified.\n* **Chart color rules**\n . Lets you apply color rules to the columns in this DataSet. For more information, see\n\nSetting Color Rules for a Chart\n\n.\n* **Share DataSet**\n . Lets you share the DataSet with users.\n* **Export data**\n . Lets you export this DataSet to an Excel or CSV file. For more information, see\n\nExporting DataSets\n\n.\n* **Run Now.**\n Updates the DataSet, causing any connected cards to be updated as well.\n* **Delete.**\n Deletes the DataSet. You can delete a DataSet only if you are the owner or have an \"Admin\" security profile or a custom role with the \"Manage DataSets\" privilege enabled. For more information about security profiles, see\n\nManaging Roles\n\n.\n |\n\n\n###\n Overview tab\n\nIn the\n **Overview**\n tab you can see how the DataSet is being used, the number of Cards powered from this DataSet, the number of users it is being shared with, the number of DataFlows created from the DataSet, and the number of Alerts on the DataSet. All of these tiles also provide \"jump-off points\" to other actions in Domo using this DataSet. The following screenshot shows an example of these tiles in the\n **Overview**\n tab for a typical DataSet.\n\n\"Jump-off points\" for these tiles are as follows:\n\n **View Full Impact**\n opens the Lineage tab for the DataSet.\n* **Create A Visualization**\n opens the Analyzer for this DataSet so you can build a chart or table from it. For more information about Analyzer, see\n\nAnalyzer Overview\n\n.\n* **Share This DataSet**\n opens the menu to share the DataSet with users.\n* **Tidy Up This DataSet**\n opens the interface for building an ETL DataFlow using this DataSet.\n* **Create A New Alert**\n opens the interface for creating an Alert on the DataSet.\n\n\n###\n Data tab\n\nIn the\n **Data**\n tab, you can do all of the following:\n\n View all of the rows in the DataSet, and sort and filter to show the data interests you.\n* See statistics for individual columns or for the entire DataSet.\n* Change the order of columns in the DataSet.\n* Rename columns in the DataSet.\n* Add or edit column descriptions.\n* Add search tags for columns.\n\nThe\n **Data**\n tab\n\nis made up of three subtabs —\n **Table**\n ,\n **Schema**\n , and\n **Stats**\n . You can switch between the subtabs by clicking the desired subtab name in the upper right corner of the\n **Data**\n tab.\n\nIn all three subtabs, you can search for and filter to a specific column or columns in the DataSet by entering the desired column name in the\n **Search**\n**Columns**\n field.\n\nYou can enlarge the column pane to fill the whole screen by clicking\n\nor restore it to its original size by clicking\n\n. You can\n **Show column statistics/Hide column statistics**\n by clicking\n\n. This allows you to show or hide the \"filter charts\" that appear at the top of the column pane in the\n **Table**\n subtab. Appears in the\n **Table**\n subtab only.\n\n###\n Table subtab\n\nIn the\n **Table**\n subtab, you can see all of the columns in your DataSet. Options are available for searching, sorting, and filtering so you can find the data you need. The following screenshot shows the components of the\n **Table**\n subtab:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Sort button\n\n|\n Lets you sort the values in a given field in ascending or descending alphanumerical order. Sorts are \"nested\" based on the order in which you apply them. The numeral beneath the sort icon tells you the priority of this column in your sort.\n\n\n For example, if a user first applied an ascending sort to the \"Transaction ID\" column, all of the rows in the DataSet would be ordered in numerical order. If he then applied an ascending sort to the \"SKU\" column, the groupings of rows for each SKU would be ordered numerically. If he finally applied a third sort, descending, to the \"Zip Code\" column, those values would be sorted in descending order for each transaction-SKU grouping.\n\n\n The following screenshot shows an example of this behavior:\n\n|\n|\n Info button\n\n|\n Shows the description for this column, if you have added one in the\n **Schema**\n subtab.\n  |\n|\n Data type icon\n  |\n Indicates the data type for this column.\n\nindicates a numeric (value) column,\n\nindicates a date or date-time column, and\n\nindicates a string column. For more information about data types, see\n\nUnderstanding Chart Data\n\n.\n  |\n|\n Filter chart\n  |\n Lets you filter the data in the DataSet based on the values in a given column. Different chart types appear for columns depending on the data type for that column.\n\n\n For text (string) columns, a horizontal bar appears, divided into segments for each unique name in the column. You can filter the data in the DataSet to a particular name by clicking on that section in the bar. (Names appear as hovers when you mouse over a section.) In the following example, the user could filter the DataSet to show only the data for \"Delivery Truck\" by clicking on the corresponding bar.\n\nFor date/date-time and value columns, a vertical bar chart with a horizontal slider appears. You can filter the data in the DataSet to show dates or values above or below a certain threshold by sliding the bar accordingly. In the following example, the user could filter the DataSet to show only values of .05 or higher by sliding the bar to \".05.\"\n\n|\n\n\n####\n\nSchema subtab\n\nIn the\n **Schema**\n subtab, you can reorder the columns in your DataSet, add descriptions and tags, etc. The following screenshot shows the components of the\n **Schema**\n subtab:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Search field\n  |\n Lets you search for and filter to a specific column or columns in the DataSet.\n  |\n|\n Reorder icon\n  |\n Lets you change the order of columns in this DataSet by clicking and dragging a column into the desired position. Note that this option is only available for the \"Index\" column, and only when sorting has been applied to that column. So, for example, you could not sort by column name and then click and drag to reorder columns.\n  |\n|\n Sort button\n  |\n Lets you apply an ascending or descending sort to the column. Note that this sort\n *only*\n changes the order of column names in the\n **Schema**\n subtab so you can more easily find what you're looking for. It does\n *not*\n change the actual order of columns in the DataSet. If you want to change the column order, use the Reorder icon.\n  |\n|\n Column description\n  |\n Lets you enter a description for a column or edit an existing description.\n  |\n|\n Column tags\n  |\n Lets you enter search tags for this column. For more information about tags, see the table under\n\nDataSets and DataFlows Tabs\n\n.\n  |\n\nStats subtab\n\n\n In the\n **Stats**\n subtab, you can see Domo-generated statistics for the columns in your DataSet. For numeric and date/date-time columns, you can correlate the columns against other numeric columns in the DataSet, and for text columns, you can see the highest aggregated values for the sum or count of any selected column. The following screenshot shows the components of the\n **Schema**\n subtab:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Search field\n  |\n Lets you search for and filter to a specific column or columns in the DataSet.\n  |\n|\n Column stats row\n  |\n Shows statistics for a given column.\n  |\n|\n Statistics for date/numeric column\n  |\n Shows automatically-generated statistics for a numeric or date/date-time column. Available statistics include minimum, maximum, average, median, upper and lower quartile, and standard deviation.\n  |\n|\n Statistics for string column\n  |\n Shows automatically-generated statistics for a string column. Available statistics include shortest string, longest string, and average length.\n  |\n|\n Correlations chart\n  |\n Shows correlations for numeric and date/date-time columns. For the given numeric or date/date-time column, you can select any other numeric column and see how the two columns correlate.\n  |\n|\n Aggregations chart\n  |\n Shows the five highest aggregated values of the given column from the selected column. If the selected column is numeric, the values are summed; otherwise the values are counted. For example, in the above screenshot, the user has chosen to view the five highest aggregated sales values for the \"Customer Name\" column. He does this by selecting \"Sales\" in the\n **Aggregations**\n dropdown for the \"Customer Name\" column.\n  |\n\n\n###\n\nCards tab\n\nThe following screenshot shows the components of the\n **Cards**\n tab:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Connected Cards\n  |\n All cards powered by this DataSet. You can click on a card to see the\n\nDetails view\n\nfor that Card.\n\n*Tip:**\n You can view Cards powered by a specific third-party application or data provider from the\n **Launcher**\n page. For more information, see\n\nViewing Cards for Data Providers\n\n.\n\n|\n|\n Switch cards to a different DataSet option\n  |\n Allows you to move all of the Cards powered by this DataSet to another DataSet. This option appears if you are the owner of the DataSet, depending on the DataSet type. For more information, see\n\nConnecting Cards to a Different DataSet\n\n.\n  |\n|\n Add Card option\n  |\n Lets you power up a Card using the DataSet. Select the DataSet from the list to use it in powering a card. By default, the Card is added to the Overview page in Domo. This option may not appear, depending on the DataSet type. For more information about this option, see\n\nPowering a Visualization Card with Data\n\n.\n  |\n\n\n###\n\nHistory tab\n\nIn the\n **History**\n tab, you can see a listing of all of the times this DataSet has been updated. This tab shows the start and end times for all updates, the amount of time the update took (duration), whether the update was scheduled or manual, and the result of the update (successful or failed). You can also see the amount of time that has transpired since the last successful run, the average update duration, and the overall success rate. Finally, for any history item, several actions are available by mousing over the row and clicking the wrench icon.\n\n\n The following screenshot shows an example of a\n **History**\n tab for a DataSet called \"Compensation Costs\":\n\nAction items available by clicking the wrench icon are as follows:\n\n **Preview updated rows**\n . Displays the rows in the DataSet that were changed when this update occurred.\n* **Download**\n . Downloads the data in this version of the DataSet as a flat text file that can be opened in an Internet browser or word processor.\n* **Delete this update**\n . Deletes this version of the DataSet from your history.\n* **Revert to this point**\n . Reverts the DataSet to this version.\n\nActions are available only for successful updates.\n\n##\n Settings tab\n\nIn the\n **Settings**\n tab for a DataSet, you have access to the options used to set up this DataSet, similar to the view that appears when you initially configure a connector DataSet. Click a row to open up the settings in that row for viewing and editing. Settings categories may differ between connectors. For more information about connector configuration options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n Data Lineage tab\n\nIn the Data Lineage tab for a DataSet, you can see the DataSets that have been combined and/or transformed through DataFlows or DataFusion to yield this DataSet. The Data Lineage interface in Data Center is the same as that used for a DataSet in Analyzer. For more information, see\n\nViewing the Lineage of a DataSet in Analyzer\n\n.\n\n##\n Personalized Data Permissions (PDP) tab\n\nPersonalized Data Permissions (PDP) allow you to create a customized experience for each Domo user through the definition of Entitlement Policies. Using Entitlement Policies, you can filter data in a DataSet for specified users and/or groups. For more information, see\n\nPersonalized Data Permissions (PDP)\n\n.\n\n\n The following screenshot points out the most important parts of the PDP tab:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Search field\n  |\n Lets you search for existing policies that have been added to this DataSet.\n  |\n|\n Policy row\n  |\n Shows information about a policy, including its name, the rows of data it provides access to, and the groups and users the policy has been applied to.\n  |\n|\n Enable PDP toggle\n  |\n Activates/deactivates this PDP policy.\n  |\n|\n Impact button\n  |\n Opens a list of cards and alerts that will be affected by PDP policies on this DataSet.\n  |\n|\n Add Policy button\n  |\n Lets you add a new PDP policy to this DataSet. For more information about adding a PDP policy, see\n\nCreating and Deleting PDP Policies\n\n.\n  |\n\n\n View Details (DataFlows)\n---------------------------\n\nWhen you click the name of a DataFlow or click\n\n>\n **View Details**\n , a page appears showing details for the DataFlow. This page is divided into tabs—​​\n **Settings**\n ,\n **DataSet**\n**s**\n ,\n **History**\n , and\n **Versions**\n . For more information about these tabs, see\n\nViewing DataFlow Details\n\n.\n\nEditor view (MySQL and Redshift DataFlows)\n---------------------------------------------\n\nThe following screenshot shows you the main components of the\n **Create**\n /\n **Edit DataFlow**\n view for a MySQL or Redshift DataFlow.\n\nYou can refer to the following table to learn more about each component:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n DataFlow Type & Info\n  |\n When collapsed, this panel displays the type of DataFlow and the schema.\n\n\n When expanded (by clicking\n\n), this panel displays information about the RDS instance for this DataFlow, including the host name, schema, user name, password, and port number. You can copy and paste this information into any SQL tool, including Workbench.\n  |\n|\n DataFlow Name & Description\n  |\n Allows you to specify a name and description for this DataFlow.\n  |\n|\n Input DataSets\n  |\n Allows you to select one or more existing DataSets for use in creating DataFlows. You can choose as many input DataSets as you want. For any given transform or output, you can use one, some, or all of the DataSets you select here. This is essentially a storage area for DataSets you may potentially use. You\n *cannot*\n manipulate data in the DataSets at this stage. You also cannot select the same input DataSet twice in the same DataFlow.\n\n*Note:**\n Input DataSets in a DataFlow\n *must*\n already exist in Domo; you cannot upload new DataSets in the\n **Create DataFlow**\n view. For information about uploading new DataSets to Domo, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\nYou can click an input DataSet you have added to see a preview of the DataSet.\n  |\n|\n Transforms\n  |\n Allows you to manipulate data in your input DataSets using SQL statements before you make your final manipulations in the Output DataSets stage. The Transforms stage is optional. All input DataSets you have selected are available for use in transforms.\n  |\n|\n Output DataSets\n  |\n Allows you to specify how your input DataSets are to be combined to produce one or more output DataSets. This interface is almost the same as that of Transforms. However, while adding transforms is optional, the Output DataSets stage is required; otherwise you cannot save your DataFlow. All input DataSets and transforms you have selected/created for this DataFlow are available to be used in your Output DataSet SQL.\n  |\n|\n Save buttons\n  |\n Allow you to save this DataFlow. Two separate buttons are available:\n **Save**\n and\n **Save and Run**\n .\n **Save**\n saves changes you have made to this DataFlow and adds it to the DataFlows listing in the Data Center but does\n *not*\n generate a DataSet (or, if you are editing an existing DataFlow, it does not update the output DataSets).\n **Save and Run**\n saves changes to the DataFlow and adds it to the DataFlows listing in the Data Center\n *and*\n runs the script for the DataFlow to output a DataSet (or update the output DataSets if it has already been created).\n  |\n\nFor more information about DataFlows, see\n\nSQL DataFlows\n\n.\n\n\n Editor view (Magic ETL DataFlows)\n-----------------------------------\n\nFor times when you need to transform your DataSets before you can make compelling visualizations, you can use Magic ETL DataFlows to transform multiple DataSets into a new DataSet that you can use to power up cards.\n\n*Tip:**\n ETL means\n *Extract, Transform, and Load,*\n which refers to a process in database warehousing for extracting data, transforming it into proper format or structure for querying and analyzing purposes, and loading it into the target data warehouse. In Magic ETL DataFlows, your DataSets are extracted and loaded automatically, and transformed based on actions in the Magic ETL DataFlow.\n\nMagic ETL DataFlows let you visually define and sequence operations to transform your Domo DataSets—without learning SQL or leaving Domo. For information about the Magic ETL DataFlow tiles, see all of the following:\n\n Creating a Magic ETL v2 DataFlow\n* Magic ETL v2 Tiles: DataSets\n* Magic ETL v2 Tiles: Text\n* Magic ETL v2 Tiles: Dates and Numbers\n* Magic ETL v2 Tiles: Utility\n* Magic ETL v2 Tiles: Filter\n* Magic ETL v2 Tiles: Combine Data\n* Magic ETL v2 Tiles: Aggregate\n* Magic ETL v2 Tiles: Pivot\n* Magic ETL v2 Tiles: Scripting\n* Magic ETL v2 Tiles: Data Science\n* Magic ETL v2 Tiles: Performance\n\n*ETL DataFlow Example**\n\nThe UI for ETL DataFlows consists of the following elements:\n\n\n Element\n  |\n Description\n  |\n| --- | --- |\n|\n Action pane\n  |\n Contains the transform tile you can drag and drop into the canvas to use in transforming data.\n\n\n For more information, see the following topics:\n * Creating a Magic ETL v2 DataFlow\n* Magic ETL v2 Tiles: DataSets\n* Magic ETL v2 Tiles: Text\n* Magic ETL v2 Tiles: Dates and Numbers\n* Magic ETL v2 Tiles: Utility\n* Magic ETL v2 Tiles: Filter\n* Magic ETL v2 Tiles: Combine Data\n* Magic ETL v2 Tiles: Aggregate\n* Magic ETL v2 Tiles: Pivot\n* Magic ETL v2 Tiles: Scripting\n* Magic ETL v2 Tiles: Data Science\n* Magic ETL v2 Tiles: Performance\n |\n|\n Canvas\n  |\n Contains your transformation flow—the sequence of tiles to perform on input DataSets to save as an output DataSet. You connect tiles to sequence them and select tiles to configure them.\n  |\n|\n\n|\n Lets you preview the transform tile.\n  |\n|\n\n|\n Lets you schedule the Magic ETL DataFlow to run whenever the specified input DataSets change.\n  |\n|\n\n|\n Lets you show or hide the Magic ETL DataFlow checklist, which shows a list of things to do before you can save a Magic ETL DataFlow.\n  |\n\n\n###\n\nETL DataFlow checklist\n\nThe checklist shows a list of things to do before you can save a Magic ETL DataFlow. You can show the checklist by clicking\n\nat the top of the canvas. The following example illustrates essential tasks to perform before saving a Magic ETL DataFlow.\n\nEssential tasks include the following:\n\n Create a Magic ETL Dataflow.\n* From the tiles pane on the left, drag Input DataSet tiles to the canvas and select the DataSets to transform.\n* Drag transform tiles to the canvas.\n\n\n For more information, see the following topics:\n\n+ Creating a New Magic ETL DataFlow\n\t+ New Magic ETL Tiles: DataSets\n\t+ New Magic ETL Tiles: Text\n\t+ New Magic ETL Tiles: Dates and Numbers\n\t+ New Magic ETL Tiles: Utility\n\t+ New Magic ETL Tiles: Filter\n\t+ New Magic ETL Tiles: Combine Data\n\t+ New Magic ETL Tiles: Aggregate\n\t+ New Magic ETL Tiles: Pivot\n\t+ New Magic ETL Tiles: Scripting\n\t+ New Magic ETL Tiles: Data Science\n\t+ New Magic ETL Tiles: Performance\n* Drag an Output DataSet tile to the canvas, then name the DataSet to be output from your transformed data.\n* Draw connections between the transform tiles to build a DataFlow that defines and sequences operations to transform the input DataSets (clean, aggregate, join, etc.).\n* (Optional) Configure settings for when the DataFlow runs.\n\n\n By default, the DataFlow runs in the cloud whenever the specified input DataSets change.\n* Name and save your Magic ETL Dataflow.\n\nFor more information about DataFlows, see\n\nViewing Dataflow Details\n\n.\n\n\n Accounts tab\n==============\n\nIn the Accounts tab, you can manage third-party system accounts associated with DataSets in Domo. You can view accounts associated with DataSets; add, edit, or delete accounts; and associate DataSets with another account.\n\n*Tip:**\n By creating accounts to data source systems, you can specify and maintain your credentials in one central place, then create DataSets in Domo using the account—without having to specify your credentials to the data source system.\n\nIn the\n **Accounts**\n tab, you can\n\n add user accounts for different connectors (similar to a DSN)\n* view a list of user accounts you have added\n* disconnect accounts you have added\n* share accounts with other users\n* see DataSets you have access to\n* transfer DataSets from one account to another account\n* change account associations\n* rename accounts\n* visually identify DataSets needing attention\n* edit credentials for accounts that require manual authentication (as opposed to those that use OAuth)\n\nThe following screenshot calls out the most important parts of the\n **Accounts**\n tab:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Search box\n  |\n Lets you filter the accounts in the list.\n  |\n|\n Add Account button\n  |\n Lets you add a new user account to this list.\n  |\n|\n Add Federated button\n  |\n Lets you add a Federated account to this list.\n  |\n|\n Assign Someone button\n  |\n Lets you assign someone to create an account for a specific Connector.\n  |\n|\n Connector accounts\n  |\n Provide information and options for all accounts you have used to connect to data sources, including the account name, the usernames or handles you use to connect, and options such as share, reconnect, etc.\n\n\n For each account, you can ado the following:\n * Click an account to open a panel in which you can edit the account information. For all accounts, you can edit the name. For non-OAuth accounts (those in which you must authenticate manually), you can also edit the account credentials.\n* Mouse over the\n **DataSets**\n item to see a list of DataSets powered by this account. These are categorized according to whether they are owned by you or another user. You can click a DataSet to open the\n\nDetails view\n\nfor that DataSet. You can also transfer ownership of the account to another user or change the account credentials for multiple DataSets.\n* Mouse over the account to display the\n **Options**\n icon.\n |\n|\n Options icon\n\n|\n Lets you access various options for working with this account, including the following:\n * **Edit account**\n . Lets you edit the name and credentials for this account.\n* **Share account**\n . Lets you share user accounts with others so they can access the DataSets through the connector.\n* **Reconnect**\n . Lets you reconnect any connectors that use oAuth for authentication. If the connector requires manual authentication, this icon does not appear.\n* **Delete account**\n . Lets you remove an account, in which case any associated DataSets depending on the account to power up cards may stop functioning.\n |\n\nFor more information about managing user accounts, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n Beast Mode Manager tab\n------------------------\n\nIn the\n **Beast Mode Manager**\n tab in the Data Center, you can view statistics on Beast Mode usage as well as perform various actions, such as editing formulas, locking and unlocking calculations, deleting unwanted calculations, and so on.\n\n\n The following screenshot calls out the most important parts of the main screen (Overview) of the\n **Beast Mode Manager**\n tab:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n List of calculations\n  |\n Shows all of the calculations in your Domo instance you have access to see. You can filter the list by entering search keywords in the\n **Search Beast Modes**\n field; by filtering on certain criteria such as name, owner, or status (valid or invalid); or by clicking on a card in the Dashboard.\n\n\n If you are the calculation owner or have a grant with the \"Manage All Cards and Pages\" role enabled, you can also select calculations in this list. When you select calculations, a wrench menu appears at the top of the list. This menu contains actions you can apply to calculations in bulk, such as locking/unlocking calculations, changing calculation owners, and duplicating calculations to other DataSets.\n  |\n|\n Filter button\n  |\n Lets you filter the calculations in the list by any of a variety of criteria, including  Beast Mode type (Card of DataSet), locked or unlocked status, owner, etc.\n  |\n|\n Dashboard\n  |\n Shows cards for various Beast Mode-related statistics, such as the total number of Beast Mode calculations, the number saved to a DataSet, the number not being used in a Card, etc. You can click on a card to filter the calculations list accordingly; for example, clicking \"Locked\" filters the list to show all calculations that have been locked.\n  |\n|\n Add Beast Mode button\n  |\n Lets you add a calculation to a selected DataSet.\n  |\n\nIf you click on a calculation in the list on the left, a details view for that calculation appears. Here you can see information specific to the calculation and access additional options. The following screenshot points out the most important parts of this view:\n\nYou can learn about these components in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Calculation data type\n  |\n Shows the data type for this calculation, such as String, Number, Date, etc. For more information about data types, see\n\nUnderstanding Chart Data\n\n.\n  |\n|\n Calculation owner\n  |\n Shows the owner of this calculation. By default, Beast Mode calculations on a DataSet are owned by the DataSet owner and calculations on a Card are owned by the Card owner. You can change the owner of a Beast Mode calculation by selecting\n **Change owner**\n in the options menu.\n  |\n|\n Tab navigation\n  |\n Lets you switch between the three views of the details view for this calculation.\n **Summary**\n , shown in the screenshot, provides an overview of the calculation.\n **Cards**\n displays all Cards this calculation is used in.\n **Data**\n shows the calculated column together with the column(s) it is derived from.\n  |\n|\n Parent DataSet\n  |\n Shows the parent DataSet for the calculation or, if the calculation is found on a Card rather than a DataSet, it shows the parent DataSet for the Card. You can click on the DataSet to open its\n\ndetails view\n\n.\n  |\n|\n Options menu\n  |\n Provides access to actions you can take on this calculation, including the following:\n * **Create Beast Mode**\n . Lets you add another Beast Mode calculation to the parent DataSet for this calculation.\n* **Edit formula**\n . Opens the Beast Mode editor for the calculation so you can make changes to the formula. You can also open the editor by mousing over the formula in the\n **Overview**\n tab and clicking the pencil icon.\n* **Lock**\n . Locks this calculation so that the formula can only be edited by the owner or an Admin-level user.\n* **Unlock**\n . Unlocks the calculation if it has been locked. This can only be done by the owner of an Admin-level user.\n* **Change owner**\n . Lets you select a new owner for the calculation. You must be the owner or an Admin-level user to do this.\n* **Buzz owner**\n . Lets you send a Buzz message to the calculation owner. For more information about Buzz, see\n\nChatting in Buzz\n\n.\n |\n|\n Dashboard\n  |\n Shows you statistics for this calculation, including the number of Cards using the calculation, the total number of views of the Card, and the last update date.\n  |\n|\n Location\n  |\n Shows the Card or DataSet this calculation is built on. You can jump to the details view for the Card or DataSet by clicking on the link.\n  |\n|\n Formula\n  |\n Shows the formula for this Beast Mode calculation. You can edit the calculation by mousing over it and clicking the pencil icon. For more information about editing Beast Mode, see\n\nTransforming Data Using Beast Mode\n\n.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360047553253\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004894\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nData Center Layout\n\n", "article_total_view_count": "\n\n\n 7,392\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:34 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "data_center_layout", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "working_with_datasets_in_domo", "url": "/s/topic/0TO5w000000Zan2GAC"}, {"text": "data_center_overview", "url": "/s/topic/0TO5w000000ZanRGAS"}]}