{"file_path": "../../raw_kb_v2\\article\\360042923994\\index.html", "content": {"title": "\n\n\n Drilling into Data\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn any KPI Card, by clicking on graph elements such as bars, points on a line, bubbles, etc., you can \"drill down\" to see filtered views or underlying data for those elements. The number of views in a drill path depends on the number of drill layers that have been incorporated into the Card; for example, if the Card designer added three drill layers into the Card, you would be able to see three unique filtered views for the Card.\n\n\n Drilldown is available in both the Details view and in Pages with Domo Stories Dashboards enabled. For drilldown to be available in a Dashboard, you must first go into the\n **Interaction settings**\n for the Card and enable\n **Drill in place**\n . For more information, see\n\nSetting Card Interactions\n\n. Many drilldown options are available only when drilling from the Details view, such as the ability to remove filters in a drill view.\n\n\n By default, the final view in a drill path is a table showing the underlying data for all of the filtered elements. If no drill layers have been incorporated into the Card, this is the view you see when you click any element in the chart. This table view provides many options for changing how the data displays, including applying Filters and sorting, grouping and ungrouping like rows, changing the date grain and formatting, and so on. The table view is available\n *only*\n when drilling down in the Details view for a Card; it is\n *not*\n available when drilling from the Page view.\n\n\n**Note:**\n Drilldown is\n *not*\n available in Funnel graphs.\n\n--\n\n*Tip:**\n You can filter to show the underlying data for any item in a Heat Map by clicking its scale label. For more information about Heat Maps, see\n\nHeat Map\n\n.\n\n\n In the Details view only, while drilling down through data layers in a Card, you can temporarily remove Filters to show more information. Only you see the data with the removed Filter, and when you exit the drill view the Filters reset.\n\n\n If the content in a Card is filtered due to PDP policies, those Filters are retained when you drill down. For example, if you were a member of a PDP policy allowing you to see only the data in western states, you would still see only data relevant to you upon drilldown. For more information about PDP, see\n\nPersonalized Data Permissions (PDP)\n\n.\n\n\n You can also export data from a drill layer into Excel or CSV (Details view only).\n\n\n This topic discusses drilling down into a Card and the options available when drilling. It does\n *not*\n discuss adding drill layers to a KPI Card. For information about adding drill layers, see\n\nAdding Drill Path to Your Chart\n\n.\n\n\n Domo also provides other means of performing in-depth data analysis, such as applying Filters. For more information, see\n\nFiltering Data in a Card Details View\n\n.\n\n\n Example Scenario of Drilling Down\n-----------------------------------\n\nThe following scenario shows how a user might navigate through a typical series of drill layers. Note that this scenario is specific to the Details view.\n\n\n The KPI Card, \"2010 Sales Chart,\" shows sales for a certain company throughout 2010. The top layer consists of a series of bars representing sales for each month of the year.\n\nThe user clicks the bar for July. A view appears, showing customers in a pie chart. In addition, a Filter is applied for the month of July. With the Filter, the chart shows only those customers who made purchases in July. If the user had clicked the bar for June, the view would be a pie chart of customers who made purchases in June. (The Card designer specifically designed the first drill layer to show sales by customer. The month is determined by the Filter.)\n\nThe user clicks the pie wedge for \"Risus, Inc.\" A third view appears, showing purchases by state. (Because the Card designer defined this view to show amounts by state, the view is always a map with both the month and customer determined by the Filters.) Due to the Filters, Maine is the only state that appears in the third view.\n\nThe user clicks the state of Maine in the map. The last view appears, showing a table with all the filtered data. (The last view is a default view that is not defined by the Card designer.)\n\nThe final table view is available only when drilling from the Details view; it is not available in the Page view.\n\n\n Removing Filters while Drilling\n---------------------------------\n\nWhen you navigate through drill layers within a Card, a new Filter is applied for every new level of drilldown. So, for example, the top level in a drill path might display a bar graph with sales for each month in the year. Clicking on the bar for a month might open a new view with a pie chart, with each slice in the pie showing amounts gained from different customers. In this case, a Filter for the month you clicked would be applied. As you drill deeper, new Filters would be applied\n *in addition*\n to those already added.\n\n\n In any view in a drill path, you can remove any Filters to show more information. (This option is available only in the Details view.) You do this by clicking the \"x\" on the right side of the Filter bar. Filter bars are blue and are displayed above the chart, as follows:\n\nIn the following sequential example, the user has drilled down two levels into a chart showing sales for 2010. In the first level, a Filter was applied for the month of January, and in the second level, an additional Filter was applied for the customer \"Mauris, Inc.\" In the resulting map shown below, the only state that passes the Filters is California.\n\nBecause this view does not contain much information, the user broadens the scope by removing the \"Cust\" Filter to show all states with customers who made purchases in the month of January:\n\nThe user removes the remaining Filter. The map shows all states with customers for the entire year:\n\n\n**Note:**\n Removing Filters from a drill path affects the view only for you. When you leave the view, the Filters reset.\n\nUnderstanding the Options in the End-of-Drill Table View\n----------------------------------------------------------\n\nIn the table view that appears at the end of a drill path (Details view only), you have various options for manipulating and formatting the data in the columns. These options are the same as those in\n **Column View**\n for a Sumo Card. For more information about Sumo, see\n\nAdding a Sumo Card\n\n.\n\nMousing over any column causes two icons to appear. You can click\n\nto sort a column. Clicking the icon once sorts the column alphabetically; clicking it a second time applies a descending sort; and clicking it a third time turns off sorting in the column.\n\n\n Click\n\nto access options for manipulating the data in a column. Available options include the following:\n\n\n Option\n  |\n Description\n  |\n| --- | --- |\n|\n Sort Ascending/Sort Descending\n  |\n Allows you to sort columns using an ascending or descending sort. You can have only one column sort at a time. For example, you could not sort by date and then have a separate sort for your values column for each represented date.\n  |\n|\n Group\n  |\n Combines all rows with like headings for the column you apply it to and aggregates the data in those rows. Cells in columns that cannot be aggregated display a value of \"Unique\" by default, which is a count of all unique items within that column. For example, if a column with salesperson names contained five instances of the name \"Bob Jones,\" that name would only be counted once in the \"Unique\" aggregation. You can change the aggregation type by clicking in the second row or by choosing\n **Change Aggregate**\n in the column dropdown menu and selecting the desired aggregation type. This option is available for all columns\n *except*\n date columns.\n  |\n|\n Ungroup\n  |\n Breaks apart rows that have been grouped.\n  |\n|\n Date Grain\n  |\n Lets you change how date data is represented, either by day, week, quarter, month, or year.\n  |\n|\n Change Aggregate\n  |\n Appears in the column dropdown menus after you have rolled up one or more columns (except for the column(s) you rolled up).\n\nYou can also change how your column totals are aggregated. You do this by clicking the aggregation indicator in a \"Total\" cell to pop up a list of alternate aggregation types. If you change the total aggregation type for a column that has itself been aggregated (by applying a \"Group\" or \"Date Grain\" to the table), the aggregation type for the column is also changed. Otherwise, changing the aggregation type affects only the total for the column.\n\nAvailable aggregations include the following:\n * **Total**\n : Totals all values in the rows for this column.\n* **Average**\n : Shows the average value for all rows.\n* **Unique**\n : Shows the number of unique items in the column.\n* **Count**\n : Shows the number of all items in the column.\n* **Min**\n : Shows the smallest value in the column.\n* **Max**\n : Shows the largest value in the column.\n |\n|\n Filter\n  |\n Filters rows. For a text column, you select the specific items that you want to appear in the table. For a value column, you select the desired value range from a number of comparisons like \"greater than,\" \"less than,\" etc. For a date column, you select a date range from a number of options. When you add a Filter, a bar for that Filter appears above the table. You can click the bar to open the Filter for editing or removal.\n  |\n|\n Formatting\n  |\n Lets you apply different formatting to numbers in value and date columns.\n  |\n|\n Conditional Formatting\n  |\n Lets you set rules for a value or string column so that any values or strings that meet certain conditions appear with a different text color and/or background.\n  |\n\nExporting Data from a Drill Path\n----------------------------------\n\nIn a KPI Card, you can export the filtered data from any layer in a drill path to Microsoft Excel or CSV (Details view only).\n\n\n For information about exporting Cards, see\n\nExporting KPI Cards\n\n.\n\n\n**To export data from a drill path layer,**\n\n. Open the Details view for the chart and drill down to the layer you want to export data from.\n2. Click the\n **Export**\n button in the top right corner of the Details view.\n3. Select\n **Excel**\n or\n **CSV**\n .  The filtered version of the data is exported to Excel or CSV.\n\nDrilling from the Page View\n-----------------------------\n\nYou can drill down into Cards from the Page view if the following conditions are met:\n\n Drill path has been enabled on the Card. For more information, see\n\nAdding Drill Path to Your Chart\n\n.\n* The Card is found in a Domo Stories Dashboard (but\n *not*\n in the Appendix). For more information, see\n\nCreating Domo Stories\n\n.\n* You have enabled \"Drill in place\" in the Interaction Settings for the Card. For more information, see Setting Card Interactions in\n\nCreating Domo Dashboards\n\n.\n\nPage drilldown has fewer options than Details drilldown. For example, you cannot see or interact with drilldown filters while drilling into a Card. However, you can still apply Card-to-Card Filters to change the view as you drill. For more information about Card-to-Card Filters, see\n\nApplying Card-to-Card Filters\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042923994\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004757\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDrilling into Data\n\n", "article_total_view_count": "\n\n\n 6,720\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:29 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "drilling_into_data", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "visualization_card_details_view_actions", "url": "/s/topic/0TO5w000000ZapOGAS"}]}