{"file_path": "../../raw_kb_v2\\article\\360043429613\\index.html", "content": {"title": "\n\n\n Waterfall Chart\n\n\n", "article_body": "\n\nIntro\n-------\n\nWaterfall charts are essentially Bar charts that show a series of profits and losses for a specified time period, with a summary bar showing the amount remaining at the end of the time period. Profits appear as green bars, losses appear as red bars, and start and summary bars appear as blue bars.\n\n\n Vertical and horizontal subtypes are available for Waterfall charts.\n\n\n Powering Waterfall Charts\n---------------------------\n\nA Waterfall chart requires three columns or rows of data from your DataSet—one for categories, one for series (generally dates), and one for values. The series data in your DataSet determines the order of the categories (for example, if your series data consisted of dates, the category bars would be arranged by date) but by default only appears when you mouse over a bar to show the hover text. However, you can show summary bars for individual series by checking a box in\n **Chart Properties**\n . For more information, see\n\nCustomizing Waterfall Charts\n\n.\n\n\n For information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your Waterfall chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n\n\n The following graphic shows you how the data from a typical column-based spreadsheet is converted into a vertical Waterfall chart:\n\nThe following graphic shows you how the data from the same column-based spreadsheet is converted into a horizontal Waterfall chart:\n\nCustomizing Waterfall Charts\n------------------------------\n\nYou can customize the appearance of a Waterfall chart by editing its\n **Chart Properties**\n . For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of Waterfall charts include the following:\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n General > Show Summary Bars\n  |\n Adds a summary column for each series in the chart. The screenshot shows an example of this, in which a summary column is provided for the bars for each individual date. Because the dates appear only on mouse-over, this is a good way of making the series for each date more distinguishable.\n  |\n\n|\n|\n General > Summary Text\n  |\n Lets you specify the text that appears below the summary bars. In the example, the user has replaced the word \"Summary\" with the word \"Total.\"\n  |\n\n|\n\nAdvanced Demo\n---------------\n\nWaterfall charts can be powerful tools for showing data, especially sales pipeline use case data. They can help you answer questions such as \"What was our sales pipeline at the beginning and end of the quarter, and what changed in between?\" and \"I know the values in my pipeline changed, but why?\" However, these charts can also be very challenging to build. We present this step-by-step demo to help you through all of the steps in building an effective waterfall chart.\n\n##\n Prerequisites\n\nTo follow this demo, you will need 2 DataSets—one with the snapshot data for the starting point of the sales opportunity and another with the snapshot data for the ending point of that opportunity. Both DataSets should be filtered to the snapshot date (BATCH\\_LAST\\_RUN usually works) and should contain the following information:\n\n Opportunity ID\n* Status or stage\n* Amounts\n* Anticipated close date\n\n##\n Part 1 - Joining the DataSets\n\n\n1. Start a new MySQL DataFlow in the Data Center.\n2. Add the 2 DataSets (the beginning and ending snapshot DataSets mentioned in the prerequisites) as input DataSets in your DataFlow.\n3. Add a transform in which you join the DataSets using a FULL OUTER JOIN (see the below screenshot for a code example).\n\n* Use a LEFT JOIN on both DataSets.\n\t* Include an\n\n ifnull\n\n statement on the \"Opportunity ID\" to make sure it's populated.\n\t* Include a\n\n where\n\n statement in which you filter to where the opportunity ID is null.\n\t* Give labels to each of the key dimensional columns to indicate whether they are at the beginning or end of the period. For example, if you had a column called \"Amount\" in your starting point DataSet, you would include the line\n\n ob. `Amount` as `Beginning Amount`,\n\n in the MySQL.\n4. Generate an output DataSet.\n\n\n Once you have done a successful FULL OUTER JOIN, you should have a new DataSet with one row for every opportunity. Each row should provide information for both the beginning and end snapshot dates, including the status, amount, and close date. The DataSet should look something like the following:\n\nThis DataSet becomes the basis for all the buckets you render in the waterfall chart.\n\n\n###\n Part 2 - Building the Buckets\n\n\n1. Start a new MySQL DataFlow in the Data Center.\n2. Add the DataSet you created in part 1 as the input DataSet in your DataFlow.\n3. For the transform, create a query for each bucket you want to render in your chart.\n\n* Give each bucket a hard-coded column called \"Bucket\" and enter the label for whatever that subset of data ties to.\n\n\n\t In the below example, each query returns opportunities that make up the beginning pipeline.\n\t* Include a\n\n union all\n\n statement after each bucket section. (UNIONs are recommended because it is possible an opportunity may fall into more than one bucket.)\n4. Generate an output DataSet.\n\n\n###\n Part 3 - Building the Card\n\n\n1. Build your Waterfall card in Analyzer, making sure to assign columns as follows:\n\n* **Summary Group - \"**\n\t Bucket\" column\n\t* **Item Names -**\n\t \"Bucket\" column\n\t* **Value -**\n\t The column with your amount data (use the default SUM aggregation)\n\nThis will give you a Waterfall chart showing your beginning and ending points with all increases and decreases in between.\n\n##\n Part 4 - Validating\n\nWith a Waterfall card, all of the positive amounts should be equal to the negative amounts, i.e. they should have a net of 0. If your values are not balanced, the chart will display a \"Summary Ending Pipeline\" value that tells you the discrepancy in the data. In the following example, the positive and negative amounts are off by $1000.\n\nThis indicates there is an issue in the data you need to fix. To do this, follow these steps:\n\n. Build a table card based on the DataSet being used to calculate the buckets.\n\n\n\t* Create a separate Beast Mode calculation for every bucket.\n\n\n\t For the \"Beginning Pipeline\" bucket, the Beast Mode would look something like this:\n\n\n\t`Sum(case when `Bucket` = ‘Beginning Pipeline’ then `Amount` else 0 end)`\n\t* Include your \"Amount\" column (using the default SUM aggregation) in the table as well, and change the label to \"Unexplained Variance.\"\n2. Go to the Details view for the table card you just built.\n3. Sort by the \"Unexplained Variance\" column to see which opportunities have problems.\n\n\n For example, in the following card, note that one opportunity has an unexplained variance of -$1,000. By sorting, it is easy to identify the problem opportunity. You can then look at the other columns to see if there has been any activity contributing to this discrepancy. Because there has been no activity here, we can assume the problem involves the query itself. In this case, you would go back into the DataFlow and try to pin down and fix the problem.\n4. Fix the situation.\n\n\n You will know the problem is fixed when all \"Unexplained Variance\" values go to 0 and the \"Summary Ending Pipeline\" bar disappears from the card.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429613\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004665\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nWaterfall Chart\n\n", "article_total_view_count": "\n\n\n 5,375\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:20 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "waterfall_chart", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}