{"file_path": "../../raw_kb_v2\\article\\360042926834\\index.html", "content": {"title": "\n\n\n Infusionsoft REST Hook Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nInfusionsoft automates your small business sales and marketing, while combining your CRM, email marketing, lead capture and e-commerce in one place. You can use this connector to automatically pull data from your Infusionsoft account anytime changes are made within your subscribed columns.\n\n\n Because this connector is webhook-based, DataSets created using this connector update automatically when new data is sent to your Infusionsoft account. You do\n *not*\n need to worry about scheduling updates when using this connector.\n\n\n You connect to your Infusionsoft account in the Data Center. This topic discusses the fields and menus that are specific to the Infusionsoft REST Hook connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n For more information about webhooks in Infusionsoft, see\n\nhttps://developer.infusionsoft.com/r...documentation/\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Infusionsoft account and create a DataSet, you must have the following:\n\n The email address associated with your Infusionsoft account\n* Your Infusionsoft password\n\n\n Connecting to Your Infusionsoft Account\n-----------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Infusionsoft REST Hook Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\nWhen you click\n **Add account**\n in this pane, you are taken to the Infusionsoft login screen, where you can log into your Infusionsoft account using your Infusionsoft credentials (the email address associated with your Infusionsoft account as well as your Infusionsoft password).\n\nOnce you have entered valid credentials for your Infusionsoft app and account, you can use the same account any time you go to create a new Infusionsoft Webhook DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nIn this pane, you configure webhook subscriptions for your Infusionsoft app by selecting the columns you want to subscribe to then clicking a button to register the subscriptions.\n\n\n**To configure webhook subscriptions for your app,**\n\n. In the Details pane in Domo, check the boxes for all of the columns you want to subscribe to.\n\n\n When changes are made to any of your subscribed columns in Infusionsoft, your DataSet will automatically update.\n\n*Note:**\n Ignore the\n **Webhook URL**\n field. You do\n *not*\n need to paste this URL in Infusionsoft for the connector to work.\n2. Click the green button under \"Register Subscriptions.\"\n3. (Conditional) If you want new data in your DataSet to be replaced instead of simply added onto, click\n **Change update settings**\n then choose\n **Replace.**\n4. Click\n **Save**\n .\n\nFAQs\n------\n\n\n#####\n How often can the data be updated?\n\nThe Infusionsoft Webhook connector updates automatically as Infusionsoft receives data.\n\n####\n Are there any API limits I should be aware of?\n\nNo.\n\n####\n What's the difference between this connector and the Infusionsoft connector?\n\nThe Infusionsoft Webhook connector automatically updates as Infusionsoft receives more data and does not update on a set schedule. The Infusionsoft connector, on the other hand, is an API-based connector in which you choose a report and set an update schedule.\n\n####\n How do I know my Infusionsoft credentials are secure?\n\nThe login process uses the OAuth process, so your Infusionsoft credentials are never seen or stored by Domo. You can revoke Domo's access to your account at any time.\n\n####\n Can I use the same account to create multiple DataSets?\n\nYes.\n\n####\n When I click\n **Connect**\n , why am I getting automatically validated without needing to enter credentials?\n\nIf you are already logged into Infusionsoft when you connect to Domo, you are authenticated automatically as you click\n **Connect**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Infusionsoft.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042926834\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003757\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nInfusionsoft REST Hook Connector\n\n", "article_total_view_count": "\n\n\n 2,366\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "infusionsoft_rest_hook_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}