{"file_path": "../../raw_kb_v2\\article\\4420495020567\\index.html", "content": {"title": "\n\n\n Databricks Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\n*Note:**\n The Databricks Connector is currently still in development and is not yet available for use.\n\n\n Databricks is a cloud-based collaborative data science, data engineering, and data analytics platform that combines the best of data warehouses and data lakes into a lakehouse architecture.\n\n\n With Databricks you can access all your data, analytics, and AI on one lake house platform. The simple, open, and collaborative environment helps reduce the infrastructure complexity, keeps control of your data, and makes it easy for your teams to partner across the entire data and workflow. For more information about the Databricks API, visit their website. (\n\nhttps://docs.databricks.com/dev-tools/api/index.html\n\n)\n\n\n The Databricks connector is a \"Database\" connector, meaning it retrieves data from a database using a query. In the Data Center, you can access the connector page for this and other Database connectors by clicking\n **Database**\n in the toolbar at the top of the window.\n\n\n You connect to your Databricks database in the Data Center. This topic discusses the fields and menus that are specific to the Databricks connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to a Databricks database and create a DataSet, you must have the following:\n\n The username and password you use to log into your Databricks host\n* The host name for the database\n* The port number for the database\n* The database name or schema name\n* The HTTP Path\n\nConnecting to Your Databricks Database\n----------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Databricks Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n**Note:**\n When using the copy/paste function for your credentials, ensure there is no whitespace at the beginning or end of the string. By accidentally pasting whitespace, it will cause the connector to error when trying to connect.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your database. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Host\n  |\n Enter the host name for the Databricks database.\n\n\n Example:\n\n\n db.company.com\n\n\n |\n|\n Port\n  |\n Enter the port number for the Databricks database.\n  |\n|\n Database Name\n  |\n Enter the name of the Databricks database.\n  |\n|\n Username\n  |\n Enter your Databricks username.\n  |\n|\n Password\n  |\n Enter your Databricks password.\n  |\n|\n HTTP Path\n  |\n Enter the HTTP path.\n  |\n\nOnce you have entered valid Databricks credentials, you can use the same account any time you go to create a new Databricks DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nIn this pane you create an SQL query to pull data from your database, with or without a parameter.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n How would you like to import data into Domo?\n\n\n |\n\nSelect whether you want to import your data by using the standard\n\n\n update method (replace/append), by using the partition, or upsert mode.\n\n|\n|\n Query Type\n  |\n Select the desired query type.\n\n\n|\n Query Type\n  |\n Description\n  |\n| --- | --- |\n|\n Custom Query\n  |\n Enter the query to execute.\n  |\n|\n Query Builder\n  |\n Select a table and fields to autogenerate your query.\n  |\n\n|\n|\n Standard update\n  |\n\n  |  |\n| --- | --- |\n|\n Replace\n  |\n Replaces the current dataset with a new dataset\n  |\n|\n Append\n  |\n Add the current dataset with a new dataset\n  |\n\n|\n|\n Use Partition\n  |\n\n  |  |\n| --- | --- |\n|\n Partition Criteria Selection\n  |\n Select whether you want to partition your data using the date keys or meta query\n  |\n|\n Partition Column Selection\n  |\n Select the partition column name. Only date fields will be shown in this discovery\n  |\n|\n Partition Support Format\n  |\n Select the partition format\n  |\n|\n Past Days\n  |\n Enter the number of past days that you want to get data for. Value can be X, where X is a positive integer. For example 30.\n  |\n|\n Past Days Months\n  |\n Enter the number of past months that you want to get data for. Value can be X, where X is a positive integer. For example 30.\n  |\n|\n Past Days Years\n  |\n Enter the number of past years that you want to get data for. Value can be X, where X is a positive integer. For example 30.\n  |\n|\n Future Months\n  |\n Enter the number of future months that you want to get data for. Value can be X, where X is a positive integer. For example 30.\n\n\n \"\n  |\n|\n Future Years\n  |\n Enter the number of future years that you want to get data for. Value can be X, where X is a positive integer. For example 30.\n  |\n|\n Partition Query\n  |\n Enter the partition meta query to determine the distinct partition tags(or keys). The column containing the <b>Date</b> data is your partition column. Example: SELECT DISTINCT(COLUMN\\_NAME) FROM TABLENAME\n  |\n\n|\n|\n Upsert\n  |\n\n  |  |\n| --- | --- |\n|\n Upsert Keys text field\n  |\n Please enter upsert key column name or a comma separated list of upsert key column names\n  |\n\n|\n|\n Query\n  |\n Enter the Structured Query Language (SQL) query to use in selecting the data you want.\n\n\n Example:\n\nselect \\* from Employee\n\nYou can use the\n ****Query Helper****\n parameter to help you write a usable SQL query. To use the\n ****Query Helper****\n , do the following:\n 1. Select your database table and table columns in the appropriate menus.\n2. Copy the SQL statement that appears in the\n ****Query Helper****\n field.\n3. Paste the copied SQL statement into the\n ****Query****\n field.\n |\n|\n Database Tables\n  |\n Select the database table you want to import into Domo.\n  |\n|\n Table Columns\n  |\n Select the table columns you want to import into Domo.\n  |\n|\n Query Helper\n  |\n Copy and paste the SQL statement in this field into the\n ****Query****\n field. For more information, see\n ****Query****\n , above.\n  |\n|\n Fetch Size\n  |\n\nEnter the fetch size for memory performance. The default value will be used if no fetch size specified. If an\n\n\n \"\n\n\n out of memory\n\n\n \"\n\n\n error occurs, retry decreasing the fetch size.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n FAQs\n\n\n####\n What kind of credentials do I need to power up this connector?\n\nYou need the username, password, host name, port number, and database name of your Databricks database. You also need to provide the HTTP path.\n\n###\n Where can I find the values that I need to enter for my credentials?\n\nYou can find the hostname, database, port number, and HTTP path by going to your cluster in Databricks and viewing the JDBC/ODBC tab in the Advanced section of the cluster details.\n\n###\n How frequently will my data update?\n\nAs often as needed.\n\n###\n Are there any API limits that I need to be aware of?\n\nLimits depend on your server configuration.\n\n###\n What do I need to be aware of while writing a query?\n\nMake sure that all the words, table names and field names are correctly spelled. Refer to the Query Helper field for query help.\n\n###\n What's the Fetch Size?\n\nThe fetch size is for memory performance. The default value will be used if no fetch size is specified. If an \"out of memory\" error occurs, retry decreasing the fetch size.\n\n##\n Selecting the Update Mode\n\nOnce you decide how you want to import your data into Domo\n\n(by using the standard\n\n\n update method (replace/append), by using partition, or upsert mode), you need to select the relevant update mode in the\n **Scheduling section in**\n the Connector.\n\n\n* If you select 'Partition' in the Details section, then you need to select the 'Append' update mode in the Scheduling section.\n\n If you select 'Upsert' in the Details section, then you need to select 'Merge' update mode in the Scheduling section.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 4420495020567\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003845\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nDatabricks Connector\n\n", "article_total_view_count": "\n\n\n 5,429\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:16 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "databricks_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "database_connectors", "url": "/s/topic/0TO5w000000ZaojGAC"}]}