{"file_path": "../../raw_kb_v2\\article\\1500000200221\\index.html", "content": {"title": "\n\n\n Migration from WSSE to JWT and OAuth authentication in the Adobe Analytics Connectors\n\n\n", "article_body": "\n\n\n###\n*What is happening?*\n\n\n Adobe has deprecated the use of WSSE in its APIs. Although Adobe has not announced a date when WSSE will completely be retired, we are recommending that customers start planning for a migration to the Adobe Connectors that use JWT or OAuth to authenticate. The migration will take place only after customer request.\n\n\n###\n*What is the impact of this change?*\n\n\n WSSE authentication was used to access Adobe Analytics API v1.4. Domo has updated all Adobe Analytics connectors that use the API version that require JWT or OAuth credentials when creating new datasets. Existing datasets using WSSE authentication are still running, but need to be updated to use JWT or OAuth authentication instead of WSSE to continue running without interruption.\n\n*Note:**\n\nThe Adobe Analytics Connectors are not being retired or deprecated, and the functionality of the Connectors has NOT changed.\n\n\n###\n*How do I know if my DataSets will be affected?*\n\nTo determine if an Adobe Analytics DataSet will be affected, do the following:\n\n. Navigate to your Adobe Analytics DataSet in the\n **Data Center**\n .\n2. Click on\n **Settings >>**\n**Credentials**\n to see which Account is being used.\n3. If the credentials say \"Adobe Analytics Account,\" then the dataset uses WSSE authentication and needs to be updated to use JWT or OAuth authentication. If the account name begins with \"Adobe Analytics JWT \" or \"Adobe Analytics OAuth\" then the dataset is already using JWT or OAuth authentication and no update is needed. If you still aren't sure, select\n **Add Account**\n from the dropdown to create a new Account for this dataset. If the required credentials are Username:Company and Secret, then the dataset is using  WSSE authentication and will need to be updated. If the credentials are Client ID and Client Secret, then the dataset is not using WSSE and is not impacted.\n\n\n###\n*What do I need to do?*\n\nIf you no longer need your Adobe Analytics DataSets to update, you do not need to take any action.\n\n\n If you need to continue updating your Adobe Analytics DataSets, you will need to do the following to keep the DataSets running uninterrupted:\n\n. Identify any DataSets that are affected. If you are not sure how to do that based on the description above, please contact Domo Support.\n2. Create a Support ticket and request these DataSets be updated to use JWT or OAuth.\n3. **After the migration**\n , create a new\n\nAdobe Analytics JWT or\n\nAdobe Analytics OAuth Account and associate it with the appropriate DataSets. Refer to the\n\nAssociating a newly created Adobe Analytics JWT or OAuth account with the existing DataSet\n\nsection for details.\n\n*Note:**\n JWT and OAuth use client id and secret that are not the same as the WSSE authentication tokens.\n\n##\n\nHow do I create a new project with JWT authentication in*\n*the Adobe Developer Console?*\n\nTo create a new project in Adobe Developer Console, do the following:\n\n\n 1. Log into\n\nhttps://console.adobe.io/projects\n\n.\n\n\n 2. Click\n **Create new project**\n button.\n\n3. Click on\n **Add API**\n to start using the Adobe services.\n\n4. The APIs available to you will be listed in the\n **Add an API**\n window. Select\n **Adobe Analytics**\n .\n\n5. Now, you need to select the authentication type. Select\n **Service Account (JWT)**\n here.\n\n6. Select and click\n **Generate a key pair**\n .\n\n7. A new key pair will be generated and downloaded to your system. The public key will be uploaded to your JWT project. The private key will be downloaded.\n\n8. Unzip the file \"config.zip\", open the directory \"config\", and open the file \"private.key\" with a basic text editor. This is the\n **Private Key**\n you will paste into Domo, in Credentials section.\n\n\n 9. Now, click\n **Next**\n .\n\n\n 10. Select the desired product profiles, then click\n **Save Configured API**\n .\n\n\n 11. This takes you to the\n **Project APIs and Services**\n page. If you scroll down, you will see the\n **Client ID, Client Secret, Technical Account ID**\n and\n **Organization ID**\n that you will use to create the Adobe Analytics JWT account in Domo.\n\n12. (Optional) Rename the project to something you will recognize later. Navigate to the\n **Project Overview**\n page, then click\n **Edit Project**\n .\n\n##\n\nHow do I create a new*\n*Adobe Analytics*\n*JWT*\n*Account?*\n\n*To add an Adobe Analytics JWT account to Domo from the Accounts view:**\n\n\n 1. Navigate to the\n **Accounts**\n section of the Data Center by clicking on the Accounts icon in the left-hand pane in the Data Center.\n\n2. In\n **Accounts**\n , click\n **Add Account**\n .\n\n3. Select the desired Adobe Analytics connector.\n\n4. The Log in window for Adobe Analytics will appear. Enter your Client ID, Client Secret, Technical Account ID, Organization ID, and Private Key for Adobe Analytics, and click\n\n\n**Connect**\n .\n\n5. An entry for the new Adobe Analytics JWT account will appear in the\n **Accounts**\n view listing.\n\n\n**To add an Adobe Analytics JWT account to Domo by adding a DataSet and entering new account information:**\n\n\n As you add the Adobe Analytics JWT account through the connector, an entry for the new account appears automatically in the\n **Accounts**\n view. While creating a new account, you need to enter the Client ID, Client Secret, Technical Account ID, Organization ID, and Private Key obtained from the\n\nAdobe Developer Console\n\nwhile creating a new project. To obtain client credentials for an app that accesses services on behalf of an end-user, you'll need to create a\n\n\n**JWT**\n connection using the Adobe Developer Console. Refer to the\n\nCreating a new JWT project in the Adobe Developer Console\n\nsection to learn how to create a new JWT project.\n\n##\n*How do I create a new OAuth project in the Adobe Developer Console?*\n\n\n####\n Creating a new OAuth project in the Adobe Developer Console\n\n\n1. Log in to\n\nhttps://console.adobe.io/projects\n\n.\n2. Click the\n **Create new project**\n button.\n3. Click on\n **Add API**\n to start using the Adobe services.\n\n\n 4. The APIs available to you will be listed in the\n **Add an API**\n window. Select\n **Adobe Analytics**\n .\n\n5. Now, you need to select the authentication type. Select\n **OAuth**\n here.\n\n6. Select\n **Web**\n platform to configure the API. Enter the redirect URI as -\n\nhttps://oauth.domo.com/api/data/v2/oauth/providers/adobe-analytics-oauth/exchange\n\n\n 7. Click\n **Save configured API**\n .\n\n##\n*How do I create a new*\n*Adobe Analytics*\n*OAuth*\n*Account?*\n\n*To add an Adobe Analytics OAuth account to Domo from the Accounts view:**\n\n\n 1. Navigate to the\n **Accounts**\n section of the Data Center by clicking on the Accounts icon in the left-hand pane in the Data Center.\n\n2. In\n **Accounts**\n , click\n **Add Account**\n .\n\n3. Select the desired Adobe Analytics Connector.\n\n4. The Log in window for Adobe Analytics will appear. Enter your Client ID and Client Secret for Adobe Analytics, and click\n **Connect**\n .\n\n5. An entry for the new Adobe Analytics OAuth account will appear in the\n **Accounts**\n view listing.\n\n\n**To add an Adobe Analytics OAuth account to Domo by adding a DataSet and entering new account information:**\n\n\n As you add the Adobe Analytics OAuth account through the Connector, an entry for the new account appears automatically in the\n **Accounts**\n view. While creating a new account, you need to enter the client ID and client secret obtained from the\n\nAdobe Developer Console\n\n.  To obtain client credentials for an app that accesses services on behalf of an end-user, you'll need to create an\n **OAuth**\n connection using the Adobe Developer Console. Refer to the\n\nCreating a new OAuth project in the Adobe Developer Console\n\nsection to learn how to create a new OAuth project.\n\n\n**OAuth connection workflow**\n\n. Create a project in Adobe Developer Console\n2. Add an API to your project using OAuth authentication and authorization\n\n\n###\n*After I enter the Client ID and Secret and click Create Account, the OAuth popup window that comes up is blank, or the Create Account process never finishes. What should I check?*\n\nMake sure that you followed the instructions to\n\ncreate a new Adobe Analytics OAuth project\n\nin the Adobe Developer Console, and the Client ID and Client Secret you enter are the same ones that you got during that process.\n\n##\n*How do I associate the Adobe Analytics*\n\nJWT or*\n\nOAuth Account with an existing DataSet?*\n\nAssociating a newly created Adobe Analytics JWT\n\nor Adobe Analytics OAuth\n\naccount with the existing DataSet:\n\n. Visit the\n **DataSets**\n page in the Data Center.\n\n\n 2. Locate your existing DataSet that you want to associate with a new JWT or OAuth account.\n\n3. The DataSet details will appear.\n\n4. Click the\n **Settings**\n tab. You will be redirected to the Connector's Credentials section.\n\n5. Here, you can select your new JWT or OAuth account if it's already created, or you can create a new account to associate with your selected DataSet.\n\n\n 6. Click\n **Save**\n .\n\n\n FAQs\n------\n\n\n####\n\nDo I need to migrate to JWT or OAuth right away?\n\n\n Although Adobe has not announced a date when WSSE will completely be retired, we are recommending that customers start planning for a migration to the Adobe Connectors that use JWT or OAuth to authenticate. However, the migration will take place only after customer request.\n\n\n####\n\nWhich authentication method should I prefer?\n\nAdobe Analytics OAuth has a refresh token that expires after two weeks (see\n\nAdobe documentation\n\nfor details.) This causes Adobe OAuth to no longer authenticate after two weeks. Adobe recommends JWT authentication instead. You may use the OAuth authentication but you will need to recreate your account every two weeks.\n\n###\n How long does it take to migrate DataSets?\n\nIt usually takes one business day to migrate DataSets.\n\n###\n Will my DataSets continue to run during the migration? Will my Cards and DataFlows I have built on these DataSets continue to run?\n\n\n Yes, they will continue to run while they are being migrated. Once they have been migrated to JWT or OAuth, they will stop running until they are associated with the new JWT or OAuth Account.\n\n\n####\n\nWill the update to JWT or OAuth change the functionality of the connector?\n\nNo, the update will neither add nor remove the functionality of the Connector.\n\n###\n Can’t Domo update the Account for me on all my DataSets?\n\nUnfortunately, that is not possible.\n\n###\n What if I don’t migrate my DataSets?\n\nIf your DataSets still require WSSE authentication by the time WSSE is retired, they will stop being able to authenticate to Adobe.\n\n###\n I need to use v1.4 of the Adobe Analytics API. If I migrate my DataSet to use JWT or OAuth, will the DataSet now use v2.0 of the Adobe Analytics API?\n\n\n No, your dataset will continue to use v1.4 of the Adobe Analytics API. This migration only updates the authentication mechanism from WSSE to JWT or OAuth, and does not change the version of API the dataset is using. No reports or schedule settings will be changed if a dataset is migrated from WSSE authentication to JWT or OAuth.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500000200221\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003274\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMigration from WSSE to JWT and OAuth authentication in the Adobe Analytics Connectors\n\n", "article_total_view_count": "\n\n\n 4,704\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:41 PM\n\n\n"}, "title": "migration_from_wsse_to_jwt_and_oauth_authentication_in_the_adobe_analytics_connectors", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}