{"file_path": "../../raw_kb_v2\\article\\360043429273\\index.html", "content": {"Title": "Sankey Chart", "Article Body": "Intro\n                       \n\n                        Sankey charts are a type of flow diagram in which the thickness of the connecting lines between elements is proportional to the flow rate. They are usually used in scientific applications, especially physics, in which they often show energy inputs, useful output, and wasted output. However, they are often used in business as well, especially in showing cost breakdowns, inventory flows, web traffic, and more.\n                       \n\n                        In a Sankey chart, items are connected to other items using colored lines or arrows. Each pairing has a value. The thickness of any connecting line is determined by the value of the pairing in comparison to other values found in the dataset. For example, if point A was connected to point B and had a value of 10,000, and this value was among the greater values in the dataset, the line would appear thick. On the other hand, if the value of 10,000 was among the smaller values in the dataset, it would appear thin.\n                       \n\n                        The following screenshot shows an example of a publicly available Sankey chart. This chart shows both production and imports of various fuel sources and their total final consumption for the country of Iceland. Note that the line for the production of geothermal energy is far larger than the others (indicated by the thick brown connector line).\n                        \n\n\n\n\n\n\n                        This screenshot was taken from the World Balance website at\n                        \n                         iea.org\n                        \n                        (International Energy Agency), which shows energy production and consumption for most nations in the world. To visit this site, see\n                        \n                         World Balance (2017)\n                        \n                        .\n                       \n\n                        For another interesting real-world example of a Sankey chart, see\n                        \n                         \"What are you going to do with that degree?\"\n                        \n                        This chart shows how college majors tie to professions, based on data from the American Community survey. It was created by Ben Schmidt, a professor of history at Northeastern University.\n                       \n\n                        Powering Sankey charts\n                       \n\n                        A Sankey chart requires three data columns or rows from your DataSet—one for the \"From\" column, one for the \"To\" column, and one for the values corresponding to each pairing. The items in the \"From\" column appear on the left side of the chart, and the items in the \"To\" column appear on the right side. For information about the different kinds of data in a chart, see\n                        \n                         Understanding Chart Data\n                        \n                        .\n                       \n\n                        At minimum, a Sankey chart contains two groupings—an \"input\" grouping on the left and an \"output\" grouping on the right. In this simple version of the chart, input items connect to one or more output items, but the output items themselves do not connect to other output items. So item A might connect to items B, C, and D, but B, C, and D would not have their own connections. This is exemplified in the following simple DataSet showing the flow of money between different nations. Note that all countries in the \"From\" column are paired with another country in the \"To\" category, but the \"To\" countries do not have their own connections; they are \"dead ends\" in the data.\n                       \n\n\n\n\n                        When this DataSet is visualized, the resulting chart looks something like the following, with direct connections between the input and output countries; no intermediary countries appear in the flow.\n                       \n\n\n\n\n                        You can also have a more complex chart, with multiple output groupings. You can do this by structuring your data so that output items that should have their own connections are shown in both the \"From\" and \"To\" columns. In the following example DataSet, all intermediary countries (i.e. those that receive money as well as send it to others) appear in both the \"To\"\n                        \n                         and\n                        \n                        \"From\" columns. For example, Portugal receives payment from Brazil, and Angola, China, and Japan receive payment from Portugal. Therefore, Portugal is represented in both the \"To\" and \"From\" columns.\n                       \n\n\n\n\n                        When this DataSet is visualized, the resulting chart looks something like the following, with an intermediary group both receiving input and sending output:\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n\n                               When structuring your data for a Sankey chart, make sure you do not make bidirectional connections between items. For example, if you had \"Brazil\" in your \"From\" column and \"Portugal\" in the corresponding \"To\" column, you could not also have \"Portugal\" in the \"From\" column and \"Brazil\" in the corresponding \"To\" column. Otherwise, you will get a \"Circular reference detected\" error and the chart preview will not load.\n                              \n\n\n\n\n                              If your \"From\" and \"To\" columns contain duplicate items, make sure the names are spelled the same, including any punctuation and spaces. Otherwise, the items will be considered distinct from each other and they will not be considered both input and output items.\n                             \n\n\n\n\n\n\n\n\n\n                        In the Analyzer, you choose the columns containing the data for your Sankey chart. For more information about choosing data columns, see\n                        \n                         Applying DataSet Columns to Your Chart\n                        \n                        .\n                       \n\n                        For more information about formatting charts in the Analyzer, see\n                        \n                         KPI Card Building Part 2: The Analyzer\n                        \n                        .\n                       \n\n                        The following graphic shows you how the data from a typical column-based spreadsheet is converted into a Sankey chart.\n                        \n\n\n\n\n                        Customizing Sankey charts\n                       \n\n                        You can customize the appearance of a Sankey chart by editing its\n                        \n                         Chart Properties\n                        \n                        . For information about all chart properties, see\n                        \n                         Chart Properties\n                        \n                        . Unique properties of Sankey charts include the following:\n                       \n\n\n\n\n                           Property\n                          \n\n                           Description\n                          \n\n                           Example\n                          \n\n\n\n\n\n                           General > Vertical Alignment\n                          \n\n\n                            Determines the vertical alignment of the chart. The default is\n                            \n                             Top\n                            \n                            .\n                           \n\n                            The examples at right show, in order, a Sankey chart with top alignment, middle alignment, and bottom alignment.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                           General > Outline Sort\n                          \n\n                           Applies outline (hierarchical) sorting in your Sankey chart if this has been enabled in your DataSet.\n                          \n\n                           —\n                          \n\n\n\n                           Node Options > Fill Color\n                          \n\n\n                            Determines the color of the nodes in the chart (i.e. the vertical lines separating each item on both the left and right sides). By default these are the same color as the output lines. If you choose a color here, all nodes will be the same color.\n                           \n\n                            In the example at right, all nodes are colored dark red.\n                           \n\n\n\n\n\n\n\n\n\n                           Node Options > Border Color\n                          \n\n\n                            Determines the border color for the nodes in the chart (i.e. the vertical lines separating each item on both the left and right sides). By default, no borders are shown.\n                           \n\n                            In the example at right, all nodes have dark blue borders.\n                           \n\n\n\n\n\n\n\n\n\n                           Node Options > Percent Space Between Nodes\n                          \n\n\n                            Determines the amount of space between nodes. You can enter any value between 0 (meaning no white space appears between nodes) and 80. The default is about 15.\n                           \n\n                            The first example at right shows a Sankey chart with a percent space of 0. The second example shows the same chart with a percent space of 60.\n                           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                           Node Options > Hover Text\n                          \n\n                           Lets you specify the hover text that appears when you mouse over a node. (By default, the hover text shows you the name and total value for the item.) A variety of replacement macros is available for dynamic text. For more information, see\n                           \n                            Formatting Data Label and Hover Text in Your Chart\n                           \n                           .\n                          \n\n                           —\n                          \n\n\n\n                           Flow Options > Fill Color\n                          \n\n\n                            Determines the color of the connector lines in the chart. By default these are all different colors to aid visibility. If you choose a color here, all connector lines will be the same color (however, shading will be added in spots where lines cross other lines so visibility is improved).\n                           \n\n                            In the example at right, all connector lines are colored purple.\n                           \n\n\n\n\n\n\n\n\n\n                           Flow Options > Show Borders\n                          \n\n                           When checked, all connector lines will have borders (as shown in the example at right).\n                          \n\n\n\n\n\n\n\n\n                           Flow Options > Node Margin\n                          \n\n\n                            Determines the amount of space between the nodes and their connector lines. You can enter any value between 0 (the default—no space separates the nodes and lines) and 20.\n                           \n\n                            In the example, a margin space of 10 has been set.\n                           \n\n\n\n\n\n\n\n\n\n                           Flow Options > Hover Text\n                          \n\n                           Lets you specify the hover text that appears when you mouse over a connector line. (By default, the hover text shows the \"From\" and \"To\" items followed by the value of the pairing.) A variety of replacement macros is available for dynamic text. For more information, see\n                           \n                            Formatting Data Label and Hover Text in Your Chart\n                           \n                           .\n                          \n\n                           —\n                          \n\n\n\n                           Data Label Settings > Hide\n                          \n\n                           Hides/shows the item names in the chart.\n                          \n\n                           —\n                          \n\n\n\n                           Data Label Settings > Text\n                          \n\n                           Lets you customize the data label text in the chart (which simply shows the item names by default). A variety of replacement macros is available for dynamic text. For more information, see\n                           \n                            Formatting Data Label and Hover Text in Your Chart\n                           \n                           .\n                          \n\n                           —\n                          \n\n\n\n                           Data Label Settings > Position\n                          \n\n\n                            Lets you set the position of data labels in your Sankey chart. The following positions are available:\n                           \n\n\n\n\n                               On Flows\n                              \n                              (default). The data label text is centered on the connector lines. This is shown in the first example at right.\n                             \n\n\n\n\n                               Centered\n                              \n                              . The data label text is centered over the nodes. This is shown in the second example at right.\n                             \n\n\n\n\n                               Outside\n                              \n                              . Data labels on the left and right side of the chart appear in the white space outside of the chart; labels within the chart appear centered over the nodes. This is shown in the third example at right.\n                             \n\n\n\n\n                               Inside Nodes\n                              \n                              . The data label text is centered within the nodes. This is shown in the fourth example at right.\n                             \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                           Data Label Settings > Font Size\n                          \n\n                           Sets the font size for data labels in the Sankey chart. The default size is\n                           \n                            Medium\n                           \n                           .\n                          \n\n                           —\n                          \n\n\n\n                           Data Label Settings > Text Color\n                          \n\n                           Determines the text color for data labels. The default is\n                           \n                            Black\n                           \n                           . If you select\n                           \n                            Complementary\n                           \n                           (shown in the example at right), colors are determined automatically based on the node color.\n                          \n\n\n\n\n\n\n\n\n                           Data Label Settings > Allow Overlap\n                          \n\n                           When set, if data labels overlap with each other, this is shown in the chart (otherwise they do not display).\n                          \n\n                           —\n                          \n\n\n\n                           Entry Indicator > Show\n                          \n\n\n                            Lets you turn on entry indicators for your Sankey chart. These indicators appear for nodes in which the value exiting the node is greater than the value entering the node. If you mouse over a node, hover text appears showing you the difference in values.\n                           \n\n                            The screenshot shows an example of a Sankey chart with two entry indicators, for Portugal and Spain.\n                           \n\n\n\n\n\n\n\n\n\n                           Entry Indicator > Color\n                          \n\n\n                            Lets you change the color of entry indicators in your Sankey chart.\n                           \n\n                            In the screenshot, the color of the indicators has been changed to dark red.\n                           \n\n\n\n\n\n\n\n\n\n                           Entry Indicator > Hover Text\n                          \n\n                           Lets you specify the hover text that appears when you mouse over an entry indicator. (By default, the hover text shows the difference in values between the input and output nodes.) A variety of replacement macros is available for dynamic text. For more information, see\n                           \n                            Formatting Data Label and Hover Text in Your Chart\n                           \n                           .\n                          \n\n                           —\n                          \n\n\n\n                           Exit Indicator > Show\n                          \n\n\n                            Lets you turn on exit indicators for your Sankey chart. These indicators appear for nodes in which the value entering the node is greater than the value exiting the node. If you mouse over a node, hover text appears showing you the difference in values.\n                           \n\n                            The screenshot shows an example of a Sankey chart with an exit indicator for England.\n                           \n\n\n\n\n\n\n\n\n\n                           Exit Indicator > Color\n                          \n\n\n                            Lets you change the color of exit indicators in your Sankey chart.\n                           \n\n                            In the screenshot, the color of the indicators has been changed to blue.\n                           \n\n\n\n\n\n\n\n\n\n                           Exit Indicator > Hover Text\n                          \n\n                           Lets you specify the hover text that appears when you mouse over an exit indicator. (By default, the hover text shows the difference in values between the input and output nodes.) A variety of replacement macros is available for dynamic text. For more information, see\n                           \n                            Formatting Data Label and Hover Text in Your Chart\n                           \n                           .\n                          \n\n                           —", "Preview Article": "Click here to preview", "URL Name": "360043429273", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004700", "Archived Date": "", "Language": "English", "Primary Version": "Sankey Chart", "Article Total View Count": "6,689", "": "", "Article Created Date": "10/24/2022, 10:25 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Sankey Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Chart Types\n              \n", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}