{"file_path": "../../raw_kb_v2\\article\\360042925854\\index.html", "content": {"Title": "Adding a Task List to a Project", "Article Body": "All projects in Domo, including your \"Personal Tasks\" project, start out with these basic task lists—\"To Do,\" \"Working On,\" and \"Completed.\" These lists are all part of a general chronological workflow. Generally speaking, tasks that work hasn't yet started on would be placed in the \"To Do\" list. You would then move them into the next column, \"Working On,\" when work actually began on them. Finally, you would move them into \"Completed\" when the work was finished. For more information about moving tasks, see\n                        \n                         Moving Tasks Through a Project Workflow\n                        \n                        .\n                       \n\n                        However, you may want additional lists in your workflow. The basic workflow stages that appear by default in Domo may not be specific enough for your project. For example, you may want to add stages such as \"Ideas,\" \"Customer requests,\" \"Won't fix,\" etc. Domo lets you add as many new workflow lists as you want. All new lists must conform to one of three basic types—\"To-Do,\" \"In Progress,\" and \"Completed.\"\n                       \n\n                        You can add a new list using the\n                        \n\n                          New List\n                         \n\n                        button, which is located in the top right corner of a project page.\n                       \n\n\n\n\n\n                         To add new task lists to a project,\n                        \n\n\n\n\n                          Open the\n                          \n\n                            Projects & Tasks\n                           \n\n                          page by selecting\n                          \n                           Projects and Tasks\n                          \n                          in the\n                          \n                           More\n                          \n                          menu at the top of the screen.\n                         \n\n\n\n                          Click the name of the project you want to add lists to.\n                         \n\n\n\n                          Click\n                          \n\n                            New List\n                           \n\n                          .\n                          \n                          A dialog appears.\n                         \n\n\n\n                          Enter a name for the new list.\n                         \n\n\n\n                          Select a list type.\n                         \n\n\n\n                          Click\n                          \n\n                            Save\n                           \n\n                          .\n                         \n\n\n\n                        The new list is added to the workflow. You can move the list to its appropriate position in the workflow.\n                       \n\n\n                         To move a list left or right in the workflow,\n                        \n\n\n\n\n                          Mouse over the top of the list.\n                         \n\n\n\n                          Mouse over the arrow that appears.\n                          \n                          A list of options pops up.\n                         \n\n\n\n                          Select\n                          \n\n                            Move Left\n                           \n\n                          or\n                          \n\n                            Move Right\n                           \n\n                          .\n                         \n\n\n\n                        You can also edit the name of an existing list.\n                       \n\n\n                         To edit a list name,\n                        \n\n\n\n\n                          Mouse over the arrow at the top of the list.\n                         \n\n\n\n                          Select\n                          \n\n                            Edit List Name\n                           \n\n                          .\n                         \n\n\n\n                          Type the new list name in the field.\n                         \n\n\n\n                          Press\n                          \n                           Enter\n                          \n                          .", "Preview Article": "Click here to preview", "URL Name": "360042925854", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004366", "Archived Date": "", "Language": "English", "Primary Version": "Adding a Task List to a Project", "Article Total View Count": "4,763", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Adding a Task List to a Project\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Projects And Tasks\n              \n", "url": "/s/topic/0TO5w000000Zao5GAC"}]}