{"file_path": "../../raw_kb_v2\\article\\360058716313\\index.html", "content": {"title": "\n\n\n HubSpot Upsert Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nHubSpot is an inbound marketing platform designed to help your business attract customers. The Hubspot Upsert connector gets real-time alerts for your ticket data. Use Domo's HubSpot Upsert connector to retrieve the data for your tickets based on various properties. This connector supports a merge mode to update your dataset, thus avoids duplicate entries. To learn more about the HubSpot API, visit their page (\n\nhttp://developers.hubspot.com/docs/overview\n\n).\n\n\n The HubSpot Upsert connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n ****Cloud App****\n in the toolbar at the top of the window.\n\n\n You connect to your HubSpot account in the Data Center. This topic discusses the fields and menus that are specific to the HubSpot Upsert connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your HubSpot account and create a DataSet, you must have the following:\n\n The username and password you use to log into HubSpot.\n\nConnecting to Your HubSpot Account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the HubSpot Upsert Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet\n\n,**\n are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo HubSpot Upsert connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing HubSpot accounts in Domo) to open the HubSpot OAuth screen where you can enter your HubSpot credentials. Once you have entered valid HubSpot credentials, you can use the same account any time you go to create a new HubSpot DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n*Note:**\n If you are already logged into HubSpot when you connect in Domo, you are authenticated automatically when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of HubSpot.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the HubSpot report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Calls\n  |\n Get all the calls available for your account.\n  |\n|\n Companies\n  |\n Get all the companies available for your account.\n  |\n|\n Contacts\n  |\n Get all the contacts available for your account.\n  |\n|\n Custom Objects\n  |\n Get all the records for a specific custom object available for your account.\n  |\n|\n Emails Report\n  |\n Get all the emails report available for your account.\n  |\n|\n Meetings Report\n  |\n Get all the meetings report available for your account.\n  |\n|\n Notes Report\n  |\n Get all the notes report available for your account.\n  |\n|\n Owners\n  |\n Get all the owners available for your account.\n  |\n|\n Postal Mail Report\n  |\n Get all the postal mail report available for your account.\n  |\n|\n Tasks Report\n  |\n Get all the tasks report available for your account.\n  |\n|\n Ticket Report\n  |\n Get all tickets from a portal.\n  |\n\n|\n|\n Select Company Properties to Retrieve\n  |\n Select whether to retrieve all or only specific company properties.\n  |\n|\n Company Properties\n  |\n Select company properties.\n  |\n|\n Select Contact Properties to Retrieve\n  |\n Select whether to retrieve all or only specific contact properties.\n  |\n|\n Contact Properties\n  |\n Select contact properties.\n  |\n|\n Custom Object Type\n  |\n Select the Custom Object.\n  |\n|\n Select Type of Owners\n  |\n Select whether you want to retrieve all owners or only archived owners.\n  |\n|\n Select Properties To Retrieve\n  |\n Select whether to retrieve tickets for all or only specific properties.\n  |\n|\n Properties\n  |\n Select the properties for the tickets to retrieve.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\nFAQs\n-------\n\n###\n\nWhat endpoint is the base URL for this connector?\n\nThe base URL for HubSpot Upsert is\n\nhttps://api.hubapi.com\n\n.\n\n###\n\nWhich endpoint(s) does each report call in this connector?\n\n\n|\n Report Name\n  |\n Endpoint URL(s)\n  |\n| --- | --- |\n|\n Companies\n  |\n /crm/v3/properties/company\n  |\n|\n Contacts\n  |\n /crm/v3/contacts\n  |\n|\n Custom Objects\n  |\n /crm/v3/schemas\n  |\n|\n Owners\n  |\n /crm/v3/owners/\n  |\n|\n Ticket Report\n  |\n /crm/v3/objects/tickets\n  |\n\n\n####\n\nWhat kind of credentials do I need to power up the HubSpot Upsert connector?\n\nYou need your Hubspot email address and password.\n\n###\n\nHow frequently will my data update?\n\nAs often as needed.\n\n###\n\nAre there any API limits that I need to be aware of?\n\nNo\n\n###\n\nCan I use the same HubSpot account to create multiple datasets?\n\nYes\n\n###\n\nWhat's the difference between the Hubspot and Hubspot Upsert connectors?\n\nThe Hubspot Upsert connector supports a Merge mode along with the Append and Replace modes to update your dataset. The Merge mode replaces all updated rows, while any new rows are appended. Thus, it avoids duplicate entries.\n\n\n The Hubspot connector supports the Append and Replace modes to update your datasets.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360058716313\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003290\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nHubSpot Upsert Connector\n\n", "article_total_view_count": "\n\n\n 4,745\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "hubspot_upsert_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}