{"file_path": "../../raw_kb_v2\\article\\360043437173\\index.html", "content": {"title": "\n\n\n Workbench 5 Training Topics\n\n\n", "article_body": "\n\nThis article discusses a number of training topics specific to Workbench.\n\nTopic #1: Migrating from an older version of Workbench to a newer version and installing updates\n---------------------------------------------------------------------------------------------------\n\nThere are many reasons to migrate to the newest version of Workbench—bug fixes, performance enhancements and added features, to name a few. Please consider regularly checking and upgrading to the latest version wherever possible. This will help you receive the best possible experience with Domo Workbench.\n\n##\n What version am I using right now?\n\nYou m\n\n\n ay be wondering whic\n\n\n h version you’re using now. You may also be asked by Domo Support to identify the version to provide customized support. There should be a blue icon in the system tray. If you hover over that icon, the version will be displayed.\n\nIf you don’t see the blue icon, try clicking this up arrow first\n\n. Alternatively, the version number will also be contained within the Workbench log files. (The default location for Workbench 4 log files is\n\n\n %PROGRAMDATA%\\Domo\\Workbench\\Logs\n\n\n ).\n\n*Note:**\n You may see multiple Workbench monitors in the system tray. You only need one monitor running and can close out all others.\n\n\n####\n Automatic updates\n\nBy default, automatic updates are enabled and applicable to the latest major version. We recommend leaving automatic updates turned on to ensure the best performance from your Workbench application.\n\n\n A\n\n\n utomatic updates include a restart of the Workbench service. If you want change control and planned maintenance, you may be interested in turning off the automatic update feature, as shown in the following screenshot:\n\n\n###\n\nUpgrading to Workbench 5\n\nThe latest version of Workbench is available in Domo.\n\n\n**Workbench 4 Users**\n . The latest version will install over the top of version 4. Once you install the latest version, your jobs will automatically migrate for you.\n\n###\n Check out the new interface\n\nCheck out\n\nUnderstanding the Workbench 5 User Interface\n\nto learn more about Workbench 5.\n\n\n Topic #2: Managing the Workbench job queue\n--------------------------------------------\n\nTo optimize the usage of your Workbench computer, you may want to put restrictions on how Workbench jobs are run. The following tips will help you manage your computer.\n\n###\n Limiting the Number of Jobs that Can Run at the Same Time\n\nChoosing this option limits how many jobs are running at a time. In this instance, jobs will wait in a queue until a slot is opened for them to run.\n\n. Under\n **Settings**\n , turn on\n **Limit Concurrent Jobs**\n .\n2. Select the limit for Workbench jobs.\n\n\n####\n Running Workbench Jobs Below Normal Priority Execution\n\n\n If you find that your Workbench Machine is using a lot of CPU, you can free up CPU for other applications by running the Workbench jobs at Below Normal Priority. This will limit the resources Workbench uses to execute your jobs and allow other applications to run normally. Typically, job execution will slow slightly.\n\n\n1. Under\n **Settings**\n ,\n\nturn on\n **Run job process as**\n**Below Normal priority**\n .\n\n\n####\n Canceling a Currently Running Job\n\nThere are a number of reasons you may want to stop a Workbench job. It may be that you encounter a long running query, or a job may be stuck in an error state. In this case, you can cancel the job.\n\n. Open the preview pane for the job you want to stop.\n2. Click the\n\nbutton at the top.\n\n\n####\n Manually Running a Job\n\nIf you want to update your data outside of the normal schedule, you can run the job manually.\n\n. In the\n **Jobs**\n list, open the job you would like to run.\n2. Click the\n\nbutton at the top.\n\nTopic #3: When and How to Use Impersonation\n-----------------------------------------------\n\n*What is impersonation?**\n Impersonation allows Workbench to run jobs as a specified user to allow access to restricted resources.\n\n\n**When should I use impersonation?**\n When running a job on a schedule, if the file is not located on the local machine Workbench is running on, you must set up impersonation for access rights.\n\n\n**Connecting to a network file.**\n When you connect to a file that is stored on a network location, the file is usually only accessible to a few users. When you turn on on impersonation, the Workbench job will run as the user specified, allowing access to the file.\n\n\n**Connecting to an ODBC/OLAP connection that requires NT Authentication.**\n When you connect to a database that uses NT Authentication, the database tables are usually only accessible to a limited number of users. By turning on impersonation, the Workbench job will run as the specified user, allowing access to the database.\n\n\n**QuickBooks jobs.**\n QuickBooks requires an interactive user session for Workbench to connect. Workbench will use the impersonation credentials to find the correct user session. This will allow your QuickBooks jobs to run consistently.\n\n\n**Connecting through a proxy.**\n Some proxies restrict access to the Internet by user. When you turn on impersonation, the Workbench job will run as the specified user, allowing access to the Internet through the proxy server.\n\n###\n Turning On Impersonation\n\n\n1. In the\n **Configure**\n subtab for the job, expand the\n **Impersonation**\n section, then turn on\n **Requires Impersonation**\n .\n2. Enter the\n **Domain**\n and\n **Username**\n and\n **Password**\n information.\n3. Click\n **Validate**\n .\n\nTopic #4: What To Do When Workbench Jobs Are Failing at a Fixed Interval\n----------------------------------------------------------------------------\n\nYou may find that a Job runs for a specific number of minutes and then fails each time.\n\n\n**To fix this problem,**\n\n. Check the logs for the Job.\n2. Find the point in the logs at which the query starts (look for the query string), and make note of the time stamp.\n3. Go down the log to the point of the error and find the time stamp there.\n4. Compare the difference.\n\nIf it’s five minutes, then there is a good chance that the execution query time needs to be increased in your Workbench Job because it is taking longer than five minutes to be passed. (Workbench has a default query execution timeout of 300 seconds/5 minutes.) You can change the timeout value by opening the\n **Configuration**\n subtab for your ODBC/OLEDB job, clicking the\n **Edit**\n button under \"Processing,\" then configuring the value in the\n **Query Execution Timeout**\n menu.\n\n\n**Note:**\n\nThere may be additional points of configuration for query timeout in your ODBC driver settings.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043437173\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004810\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nWorkbench 5 Training Topics\n\n", "article_total_view_count": "\n\n\n 4,960\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:31 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "workbench_5_training_topics", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "workbench", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "workbench_5", "url": "/s/topic/0TO5w000000ZapTGAS"}]}