{"file_path": "../../raw_kb_v2\\article\\1500001575002\\index.html", "content": {"title": "\n\n\n YouTube Reporting Enterprise Partition Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nYouTube Reporting Enterprise Partition supports predefined and Jobs reports that contain a comprehensive set of YouTube Analytics data for a channel or content owner. Use Domo's Youtube Reporting Enterprise Partition Connector to download the bulk data sets that you can query with the YouTube Analytics API. This Connector allows you to connect your YouTube analytics to Domo to refine your YouTube strategy.\n\n*Note:**\n There are currently 5 YouTube Connectors available in Domo. The difference between these may be difficult to understand, so here is an explanation of each:\n\n\n* **YouTube Reporting Connector -**\n This is our entry-level YouTube Connector. It requires only a Google username and password to authenticate. Most Domo users should use this Connector to retrieve YouTube data.\n* **YouTube Reporting Enterprise Connector -**\n This is the enterprise version of the YouTube Reporting Connector. This report has a few additional reports and requires you to enter a Google Client ID and Client Secret in addition to a basic Google username and password.\n* **YouTube Enterprise Advanced Connector -**\n This is Domo's most advanced YouTube Connector. (This is the only version of the YouTube Enterprise Connector; there is no Connector simply called \"YouTube Enterprise.\") It requires a Google Client ID and Client Secret as well as a Google username and password. It provides more reports and options than the other YouTube Connectors but is also more complicated and much more difficult to configure. This Connector is recommended for advanced users only.\n* **YouTube Reporting Partition Connector**\n**-**\n This offers the same reports as the YouTube Reporting Connector, with the added ability to use Partitioning in the DataSet.\n* **YouTube Reporting Enterprise Partition Connector**\n**-**\n This offers the same reports as the YouTube Reporting Enterprise Connector, with the added ability to use Partitioning in the DataSet.\n\nThe YouTube Reporting Enterprise Partition Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your YouTube Reporting Enterprise account in the Data Center. This topic discusses the fields and menus that are specific to the YouTube Reporting Enterprise Partition Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Best Practices\n----------------\n\n*When a Report is created a job is generated and takes 24 -72 hours before returning data.**\n\nAfter you schedule a reporting job, YouTube generates reports from that day forward and also generates reports covering the 180-day period prior to the time the job was scheduled.\n\n*Any date prior to the Job creation date for a Report Type is considered historical.**\n\nYouTube will generate up to 60 days of historical data. Historical reports are posted as soon as they are available and in no particular order. It takes roughly one month for all of the historical data to be posted for a job. So, a month after scheduling a reporting job, you will have access to around two months of data.\n\nPrerequisites\n---------------\n\nTo connect to your YouTube account and create a DataSet, you must have the following:\n\n A Google Client ID\n* A Google Client Secret\n* A Google username and password\n\nFor step-by-step instructions on obtaining a Client ID and Client Secret, see\n\nhttps://support.google.com/cloud/answer/6158849\n\n.\n\n*Note:**\n For multiple YouTube Reporting Enterprise accounts in Domo, you must click the Google+ API checkbox in the Google API when creating the Client ID and Client Secret. If the Google+ API box is not checked, then any new YouTube Reporting Enterprise account in Domo will override the current credentials.\n\nYou must also enable the Google People API to properly configure this Connector. For more information about this API, see\n\nhttps://developers.google.com/people/?hl=en\\_US\n\n.\n\n\n Connecting to Your YouTube Reporting Enterprise Account\n---------------------------------------------------------\n\nThis section enumerates the options in the Credentials and Details panes in the\n\nYouTube Reporting Enterprise Partition\n\nConnector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThis pane contains fields for entering credentials to connect to your\n\nYouTube\n\naccount. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Client ID\n  |\n Enter your Google Client ID.\n  |\n|\n Client Secret\n  |\n Enter your Google Client Secret.\n  |\n\n\n After you have entered valid credentials, you are taken to Google's OAuth page where you are prompted to enter your Google username and password. Once you have successfully authenticated, you can use the same account any time you go to create a new YouTube Reporting Enterprise Partition DataSet. You can manage Connector accounts in the\n\n*Accounts**\n\ntab in the Data Center.\n\nFor more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n\nSelect the desired YouTube Reporting Enterprise Partition report. Different reports are available depending on the API type you choose.\n\n  |  |\n| --- | --- |\n|\n Asset Names\n  |\n Returns the list of all assets.\n\n***Content Owner ID is required for this report.****\n |\n|\n Available Reports\n  |\n Returns the list of available reports based on report type.\n  |\n|\n Channel Details and Statistics\n  |\n Returns content details, snippets, and statistics data for the authenticated channel.\n  |\n|\n Jobs\n  |\n Lists reporting jobs that have been scheduled for a channel or content owner.\n  |\n|\n Other Video Details and Statistics\n  |\n Returns content details, snippets, and statistics data for the specified channel IDs.\n  |\n|\n Predefined Report Types\n  |\n Returns predefined Report types that the channel or content owner can retrieve.\n  |\n|\n Public Channel Information\n  |\n Returns public information of channels entered.\n  |\n|\n Video and Channel Names\n  |\n Returns the list of video and channel names.\n  |\n\n|\n|\n Call on Behalf of Content Owner\n  |\n Select\n ****Yes****\n if you are planning to retrieve a predefined report for another user (whose ID you will enter in the\n ****Content Owner ID****\n field). Select\n ****No****\n if you are the content owner for the report you plan to pull.\n\n\n****Note:****\n You must have content owner access and the Content ID API enabled in the developers console application to do this.\n  |\n|\n Content Owner ID\n  |\n Enter the content owner ID for the user with content you want to pull. If you do not specify a value for the parameter, the API server assumes the request is being made for your own channel.\n\n\n To find your content owner ID, you must be a member of an MCN (Multi-Channel Network). For more information, see\n\nhttps://support.google.com/youtube/answer/2737059?hl=en\n\n.\n\n\n To find your content owner ID, do the following:\n 1. Log into YouTube.\n2. Click your profile picture in the top right.\n3. Select\n ****Studio****\n in the dropdown menu.\n4. Copy the portion of the page URL following o=.\n\n\n For example, if the page URL is\n **https://www.youtube.com/dashboard?o=abc123\\_qrs\\_654**\n , the content owner ID would be\n **abc123\\_qrs\\_654**\n .\n\n\n****Note:****\n You must have content owner access and the Content ID API enabled in the developers console application to do this.\n  |\n|\n Preserve Column Names\n  |\n Specify whether you want column names in your DataSet to be preserved when a report is changed. The best practice is to set this to\n ****True****\n so cards do not break if the data is changed.\n  |\n|\n Retrieve Video and Channel Names\n  |\n Specify whether you want to retrieve video and channel names when a Video or Channel ID or both are present in a report.\n  |\n|\n Channel IDs\n  |\n Enter the channel ID you want to retrieve data for. If there are multiple channel IDs, separate them with commas.\n  |\n|\n Duration\n  |\n Select whether you want to pull data for a specific date or a date range.\n  |\n|\n Backfill Days\n  |\n Enter the number of backfill days.\n  |\n|\n Report Date\n  |\n Select whether the report data is for a specific date or for a relative number of days back from today.\n  |\n|\n Select Specific Date\n  |\n Select the date for the report.\n  |\n|\n Days Back\n  |\n Enter the number of past days that should appear in the report.\n  |\n|\n Start Date\n  |\n Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n ****End Date****\n .\n  |\n|\n End Date\n  |\n Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n ****Start Date****\n .\n  |\n|\n Select Specific Start Date\n  |\n Select the first date in your date range.\n  |\n|\n Select Specific End Date\n  |\n Select the second date in your date range.\n  |\n|\n Days Back to Start From\n  |\n Enter the number of the farthest day back that should be represented in the report. Combine with\n ****Days Back to End At****\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****Days Back to Start From****\n and 5 for\n ****Days Back to End At****\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n|\n Days Back to End At\n  |\n Enter the number of the most recent day back that should be represented in the report. Combine with\n ****Days Back to Start From****\n to create a range of represented days.\n\n\n For example, if you entered 10 for\n ****Days Back to Start From****\n and 5 for\n ****Days Back to End At****\n , the report would contain data for 10 days ago up until 5 days ago.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n FAQs\n------\n\n\n####\n What version of the YouTube Reporting API does this Connector use?\n\nThis Connector uses version 1 of the YouTube API (\n\n\n https://youtubereporting.googleapis.com/v1/\n\n\n ).\n\n###\n What kind of credentials do I need to power up this Connector?\n\nFirst you need to register an App with Google via\n\nGoogle Developer Console\n\n. This will provide you with a Client ID and Secret. Then you will need the username and password of the YouTube account that you wish to use. This account needs to have access to the Channel(s) that you are interested in. Depending on how and when a YouTube account was created, it may only have access to a single Channel. You may need a separate login for each Channel that you want to report on.\n\n###\n How do I create a Client ID and Client Secret?\n\n\n1. Using your Google account, log into the\n\nGoogle Developer Dashboard\n\n.\n2. Create a new Application. Give it a descriptive name such as \"YouTube Connection\".\n3. Using the Library section, the following APIs need to be enabled:\n\t* YouTube Analytics API\n\t* YouTube Data API\n\t* Google+ API\n4. In the Credentials section, there is a tab called \"OAuth consent screen\". Set the product name to the same name you gave the project.\n5. In the Credentials tab, press the Create Credentials button and create an OAuth Client ID.\n6. Create a Web Application.\n7. Set the following Authorized JavaScript origins:\n\t* https://domo.com\n\n .\n8. Set the following Authorized Redirect URIs:\n\t* https://oauth.dev.domo.com/api/data/v1/oauth/providers/youtube-enterprise/exchange\n\n .\n\t* https://oauth.domo.com/api/data/v1/oauth/providers/youtube-enterprise/exchange\n\n .\n9. This will then show the Client ID and Client Secret. Copy and paste them into Domo's account creation screen.\n\n\n####\n\nDo I need a certain kind of account to power up this Connector?\n\n\n Any YouTube account can be used to power up the Connector, since there is a default Channel associated with your account. However, the channel should have videos to return any meaningful results. An account that is connected to an organization's Content Management system will also work. These accounts have access to multiple channels instead of just their default one.\n\n\n####\n\nMy YouTube account has access to my company's Content Management account. How do I get information about my videos and channels?\n\nThe reports that are available in the Data and Content Owner APIs have fields that allow you to request information about channels and videos that are not in your default channel. For the reports in the Data API, set the field called \"Call on Behalf of Content Owner\" to \"True\" and then you can enter the name of the Content Owner. For the Content Owner reports, you can just enter the name of the Content Owner. This will give you access to the Content Owner's channels and videos\n\n###\n Are there any API limits I should be aware of?\n\nYouTube enforces different API call rate limits for each report. You should make sure that the datasets do not run more than once per day, and they only request the data that you need. Additional data may result in extra API calls.\n\n###\n How often can the data be updated?\n\nDatasets should be set to update once a day. Note that there are times when the most recent data that you can retrieve is 2 or more days old.\n\n###\n What's the difference between the YouTube Reporting Enterprise and YouTube Reporting Enterprise Partition Connectors?\n\nThe YouTube Reporting Enterprise Partition Connector supports Date partitioning and backfilling for the Available Reports and Predefined Report Types.\n\n\n Troubleshooting\n-----------------\n\n\n* Make sure your authentication remains valid.\n* Review the configuration to make sure that all required items have been selected.\n* Review the Connector history for error messages.\n* In rare cases, you may be requesting too much information and reaching API limitations or timeouts. If this is the case, you can review the history of the Connector run to see the error message and duration. If this is the case, you can reduce the number of accounts that are being pulled, choose a smaller number of metrics for the report that you are pulling, or reduce the timeframe that you are trying to pull.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 1500001575002\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003964\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nYouTube Reporting Enterprise Partition Connector\n\n", "article_total_view_count": "\n\n\n 2,406\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:17 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "youtube_reporting_enterprise_partition_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "partition_connectors", "url": "/s/topic/0TO5w000000ZapAGAS"}]}