{"file_path": "../../raw_kb_v2\\article\\360042924074\\index.html", "content": {"Title": "Adding Filters to Your Chart", "Article Body": "Intro\n                        \n\n\n\n                        You can apply filters to a chart either during the process of powering a Visualization Card or afterwards. When you request to add a filter for a column in your DataSet, Domo automatically determines the data type for that column and provides logical filter options. For example, if you choose to filter a column containing numerical values, the dialog provides \"greater than,\" \"less than,\" and \"between\" options; and if you choose to filter a column with multiple series, the dialog lets you pick one or more series to narrow down to. You can also filter dates using various date filtering criteria.\n                       \n\n                        Applying Quick Filters\n                       \n\n                        Quick Filters are pre-defined filters you can use to create a self-guided experience for others to explore data on a Card and answer questions for themselves. When you apply a Quick Filter to a column on a Card, a new pane is added to the Card containing quick filter checkboxes for those columns. Any user who opens the Details view for this Card can then show or hide columns quickly and easily just by selecting those columns in the Quick Filter pane.\n                       \n\n\n\n                          Video - Adding Quick Filters in Analyzer\n                         \n\n\n\n\n\n\n\n\n\n\n\n                          Video - Searching in Quick Filters\n                         \n\n\n\n\n\n\n\n\n                         To add Quick Filters to a Card,\n                        \n\n\n\n\n                          Open the Analyzer for the Card you want to add Quick Filters to.\n                         \n\n\n\n                          Drag the column you want to provide filters for into the\n                          \n                           Filters\n                          \n                          pane.\n                         \n\n\n\n                          Turn on the\n                          \n                           Display as Quick Filter\n                          \n                          option.\n                         \n\n\n\n                        For example, let's say Betty Symington, the creator of the \"Shipping Costs per State\" Card, wants to provide users with a quick filter for toggling states in the Card. In the Analyzer for the Card, she drags the \"Customer State\" column into the\n                        \n                         Filters\n                        \n                        pane then turns on\n                        \n                         Display as Quick Filter\n                        \n                        , as follows:\n                       \n\n\n\n\n                        This adds a \"Customer State\" Quick Filter to the chart, as shown here:\n                       \n\n\n\n\n                        Betty then saves the Card. The \"Customer State\" Quick Filter is now a permanent addition to the Card until someone removes it in the Analyzer.\n                       \n\n                        Let's next say that user Brad Storch, manager of the Southeast region for the company, opens the Details view for the Card. Brad only wants to compare data for the three states in his region—the data for all other states is unimportant to him and only clutters the graph. So he first checks and then unchecks the\n                        \n                         Select All\n                        \n                        box to clear all checkboxes. Then he checks the boxes for Florida, Georgia, and Alabama to compare data for those states.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Currently, Analyzer supports up to 20 quick filters on a Card. Adding more will not allow you to save the Card.\n                           \n\n\n\n\n\n\n\n                        Filter types for Quick Filters\n                       \n\n                        You can add Quick Filters for any of the three data types in Domo—string/text, values, and dates. You can have as many Quick Filters for a Card as you want. In the previous example, Betty could also add Quick Filters for the product categories as well as the actual shipping costs. Brad could then apply filters for these facets as well.\n                       \n\n                        When you add Quick Filters for string data, you can choose how users select the desired filters. You do this by clicking on the gear menu at the top of the Quick Filter and choosing\n                        \n                         Match values\n                        \n                        ,\n                        \n                         Multi select\n                        \n                        , or\n                        \n                         Single select\n                        \n                        . With\n                        \n                         Match values\n                        \n                        , users locate the filters they want using search filters such as\n                        \n                         contains\n                        \n                        ,\n                        \n                         starts with\n                        \n                        , etc. With\n                        \n                         Multi select\n                        \n                        , users check boxes for columns they want to show (as shown in the previous example). They can check the\n                        \n                         Select All\n                        \n                        box to select the boxes for all columns or select this box a second time to clear all the checkboxes. Note that clearing all checkboxes doesn't cause the graph to appear blank; all columns are still shown. Filtering does not occur until you select specific checkboxes. With\n                        \n                         Single select\n                        \n                        , users select a single filter by clicking radio buttons. The\n                        \n                         Multi select\n                        \n                        and\n                        \n                         Single select\n                        \n                        options both include standard search bar so you can narrow down the available filters.\n                       \n\n                        When you add Quick Filters for date data, users can select from a number of conditional options such as \"is greater than,\" \"is between,\" etc., as well as use a date picker to choose the date(s) they want to filter on.\n                       \n\n\n\n\n                        When you add Quick Filters for value data, users can select from a number of conditional options such as \"is greater than,\" \"is between,\" etc., as well as enter the specific value(s) they want to filter on. A slider is provided that shows the minimum and maximum values in the column and lets you select any number between these.\n                       \n\n\n\n\n                        You can hide any Quick Filter by clicking the downward-pointing arrow next to it.\n                       \n\n                        If you have multiple Quick Filters, you can rearrange them the way you want. You do this by clicking the\n                        \n                         Reorder\n                        \n                        link at the top of the Quick Filters pane then clicking the handles (the three-line icons) and dragging the bars to where you want. You can also rename your Quick Filters in this view by clicking on the current name and entering the desired new name.\n                       \n\n                        You can also now add Aggregated Filters as a Quick Filter. For more information, see\n                        \n                         Aggregated Filters\n                        \n                        .\n                       \n\n                        Editing Quick Filters\n                       \n\n                        A Quick Filter can be changed in Analyzer by accessing the current filters or in the Details view of the Card.\n                       \n\n                        To access existing\n                        \n                         Quick Filters\n                        \n                        in the Details view of a Card, click on the\n                        \n                         Expand Quick Filters\n                        \n                        toggle\n                        \n                        .\n                       \n\n\n\n\n\n                        The\n                        \n                         Quick Filters\n                        \n                        pane will open to view and edit all current Quick Filters.\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            If a Card has no Quick Filters saved, selecting the toggle\n                            \n                            will expand to show the Insights tab only.\n                           \n\n\n\n\n\n\n\n\n\n                        Filtering chart data\n                       \n\n                        You can apply filters to your DataSet data so your Visualization Cards display only the information you want viewers to see. Not only does this make it possible to glean the most valuable data from a lengthy report, but you can also create multiple charts from a single DataSet by applying different filters to that DataSet.\n                       \n\n                        This section discusses applying filters to Visualization Cards. For information about filtering all of the Visualization Cards on a Page, see\n                        \n                         Adding Drill Path to Your Chart\n                        \n                        .\n                       \n\n                        You can apply filters to a Visualization Card in the following locations:\n                       \n\n\n\n                          The Analyzer. When you apply filters to a Card in Analyzer, those filters become an integral element of the Card and are applied when others view the Card.\n                          \n                          For more information about the Analyzer, see\n                          \n                           Analyzer Layout\n                          \n                          .\n                         \n\n\n\n                          The\n                          \n                           Chart\n                          \n                          tab in the Details view. These filters apply only for you until you close the Details view, and are\n                          \n                           not\n                          \n                          applied when others view the Card.\n                          \n                          For more information, see\n                          \n                           Filtering Data in a Card Details View\n                          \n                          .\n                         \n\n\n\n                        Keep in mind the following when applying filters:\n                       \n\n\n\n                          You can filter off of metadata or column/row data that is\n                          \n                           not\n                          \n                          part of your table.\n                         \n\n\n\n                          Filters are applied to the raw data in your DataSet, not to your chart itself. For example, if you applied a filter to the \"Profit\" column, it would apply to each cell in that column, not to the summed data as shown in the chart.\n                         \n\n\n\n                          It is possible to filter on NULL values, but to do so you must use Beast Mode to convert the NULL values into values that can be filtered. For example:\n                          \n\n\n                           CASE WHEN `column` IS NULL then 'Filter' ELSE 'Do not Filter' END\n                          \n\n\n                          For more information about Beast Mode, see\n                          \n                           Adding a Beast Mode Calculation to Your Chart\n                          \n                          .\n                         \n\n\n\n                          Page filters may be applied to a Card when viewing the Card in the Details view or when drilling to the Card from the Details view. Page filters are\n                          \n                           not\n                          \n                          applied to a Card when viewing the Card directly, either through a link or a search. You can apply or edit filters in the Details view of a Card. For information about applying filters to a Page, see\n                          \n                           Applying Page-Level Filters\n                          \n                          .\n                         \n\n\n\n                          You can filter dates either using the method for filtering dates (the\n                          \n                           Filters\n                          \n                          field) described in this topic or using the date-specific filtering interface. For information on the date filtering interface, see\n                          \n                           Filtering dates\n                          \n                          , below.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Domo recommends that you use\n                           \n                            only one\n                           \n                           of the date-filtering methods. Because these methods function independently, using more than one method at a time may cause conflicts in date filters and date ranges.\n                          \n\n\n\n\n\n\n                          If you export a Card from the Details\n                          \n\n                          Page with filters applied, the data remains filtered in the exported Card. For more information about exporting Cards, see\n                          \n                           Sharing Content in Domo\n                          \n                          .\n                         \n\n\n\n                          If PDP (Personalized Data Permissions) is enabled for the DataSet powering your chart, your filter options are limited to what is available to you based on your policy. For example, if you are a member of a policy that can view content only for western states, you can filter only on content that is available to you. Likewise, if you have access to all rows in a policy, you can filter on any rows you want, and in the Details view of a Card (but not in Analyzer) you can choose whether to filter on all data or select specific policies. For more information about PDP, see\n                          \n                           Personalized Data Permissions (PDP)\n                          \n                          .\n                         \n\n\n\n                        Applying temporary filters\n                       \n\n                        Filters you apply in the Details view for a Card are TEMPORARY and will not be preserved when you leave the Details view. They are also viewable only by you; other users who open this Details view will not see the filters you set.\n                       \n\n\n                         To apply a TEMPORARY filter to a Card,\n                        \n\n\n\n\n                          Open the Details view for the Card.\n                         \n\n\n\n                          Click\n                          \n                          .\n                          \n\n                          A\n                          \n                           +\n                          \n                          button appears. If PDP policies are enabled on the DataSet\n                          \n                           and\n                          \n                          you have access to all the rows, a button reading\n                          \n                           Viewing All Data\n                          \n                          also appears. If you see this button, continue to the next step; otherwise, skip the next step.\n                         \n\n\n\n                          (Conditional) If you want to filter on all rows in the DataSet, ignore\n                          \n                           Viewing All Data\n                          \n                          . If you want to filter on a specific policy, do the following:\n                         \n\n\n\n                            Click\n                            \n                             Select Policies\n                            \n                            .\n                           \n\n\n\n                            Check the boxes for all policies you want to filter on.\n                           \n\n\n\n                            Click\n                            \n                             Apply\n                            \n                            .\n                            \n\n\n\n\n\n\n\n\n                          Click the\n                          \n                           +\n                          \n                          .\n                          \n                          A list of the column labels from your DataSet appears.\n                         \n\n\n\n                          Select the column you want to apply a filter to.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            If the selected column contains string data,\n                            \n\n\n\n\n\n\n                              Select the checkboxes for the items you want to be represented in the chart.\n                              \n                              You can select all of the checkboxes by clicking\n                              \n                               All\n                              \n                              or deselect all of the checkboxes by clicking\n                              \n                               None\n                              \n                              .\n                              \n                              You can filter the items that appear in the list by entering a keyword in the\n                              \n                               Filter by\n                              \n                              field.\n                             \n\n\n\n\n\n\n\n\n\n\n                                   Note:\n                                  \n                                  You can ignore the\n                                  \n                                  menu that appears here. In the Page view, this menu lets you filter columns by DataSet. However, since Cards are powered by only one DataSet, there is no need to filter.\n                                  \n\n\n\n\n\n\n\n\n\n                              Specify whether the items you have checked appear or do not appear in your chart by selecting\n                              \n                               In\n                              \n                              or\n                              \n                               Not\n                              \n                              In from the menu in the top right.\n                             \n\n\n\n                              Click\n                              \n                               Apply\n                              \n                              .\n                             \n\n\n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 Currently, only 500 unique values will show in the Filter menu.\n                                \n\n\n\n\n\n\n\n\n                            If the selected column or row contains amount data,\n                            \n\n\n\n\n\n\n                              Select a condition statement from the menu.\n                             \n\n\n\n                              Enter the desired amount in the field.\n                              \n                              For example, if you wanted the chart to show only data greater than $50,000, you would select is less than from the menu then enter \"50,000\" in the field.\n                             \n\n\n\n                              Click\n                              \n                               Apply\n                              \n                              .\n                             \n\n\n\n\n\n                            If the selected column or row contains date data,\n                            \n\n\n\n\n\n\n                              Select a condition statement from the menu.\n                             \n\n\n\n                              Click the field to display a calendar, then select the date you want in the calendar.\n                             \n\n\n\n                              (Conditional) If you selected between as the condition, click the second field and select the second date for your range from the calendar.\n                             \n\n\n\n                              Click\n                              \n                               Apply\n                              \n                              .\n                              \n                              For more information about using the Date field to filter dates, see\n                              \n                               Filtering dates\n                              \n                              , below.\n                             \n\n\n\n\n\n\n\n                        Your chart updates with the new filter(s) applied. Remember that because you applied the filters in the Details view, they are TEMPORARY and will not be preserved when you leave the Details view. They are also viewable only by you; other users who open this Details view will not see the filters you set. You can also apply an Aggregated Filter as a TEMPORARY filter. For more information, see\n                        \n                         Aggregated Filters\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are attempting to modify filters in a Card Details view and nothing happens when you check or uncheck a box for a filter, this is most likely because this filter has been set in the Analyzer and is an implicit element of the Card.\n                           \n\n\n\n\n\n\n\n\n                        Applying permanent filters\n                       \n\n                        Filters you apply to a Card in the Analyzer are PERMANENT until you or another user goes back into the Analyzer and modifies them. These filters become an implicit part of the Card. They are viewable by all users and persist when you leave the Details view.\n                       \n\n                        In the Analyzer, you can apply filters using one of three methods—\n                        \n                         Selection\n                        \n                        ,\n                        \n                         Range\n                        \n                        , and\n                        \n                         Match Values\n                        \n                        .\n                       \n\n\n\n                          With\n                          \n                           Selection\n                          \n                          , a list of values for the selected column is provided and you check the boxes for all of the values you want to filter. This option is available for string, amount, and date data.\n                         \n\n\n\n                          With\n                          \n                           Range\n                          \n                          , you specify the range of values you want to filter. This option is available for amount and date data only.\n                         \n\n\n\n                          With\n                          \n                           Match Values\n                          \n                          , you can apply keyword filters such as\n                          \n                           contains\n                          \n                          ,\n                          \n                           starts with\n                          \n                          ,\n                          \n                           does not end with\n                          \n                          , and so on. This option is available for string data only.\n                         \n\n\n\n\n                         To apply a PERMANENT filter to a Card,\n                        \n\n\n\n\n                          Open the Analyzer view for the Card.\n                         \n\n\n\n                          Drag the column you want to filter into the\n                          \n                           Filters\n                          \n                          box.\n                         \n\n\n\n                          If the selected column contains STRING data, do one of the following:\n                          \n\n\n\n\n\n\n\n                            Apply filters to a list of column values by doing the following:\n                           \n\n\n\n                              Leave the dropdown menu in the upper right corner of the dialog set to\n                              \n                               Selection\n                              \n                              .\n                             \n\n\n\n                              Check the checkboxes for the items you want to be represented in the chart.\n                              \n\n                              You can select all of the checkboxes by clicking\n                              \n                               All\n                              \n                              or deselect all of the checkboxes by clicking\n                              \n                               None\n                              \n                              .\n                              \n                              You can filter the items that appear in the list by entering a keyword in the\n                              \n                               Filter by\n                              \n                              field.\n                              \n                              You can also indicate whether the items you have checked appear or do not appear in your chart by selecting\n                              \n                               In\n                              \n                              or\n                              \n                               Not In\n                              \n                              from the menu in the top right.\n                             \n\n\n\n\n\n                            Apply keyword filters by doing the following:\n                           \n\n\n\n                              Select\n                              \n                               Match Values\n                              \n                              in the menu in the top right corner of the dialog.\n                             \n\n\n\n                              Select the desired conditional statement from the\n                              \n                               Contains\n                              \n                              menu.\n                             \n\n\n\n                              Enter the filter keyword in the\n                              \n                               Filter\n                              \n                              field.\n                              \n\n                              For example, if you wanted to filter out all strings containing the word \"South,\" you would select\n                              \n                               does not contain\n                              \n                              as the conditional statement then enter the word\n                              \n                               South\n                              \n                              in the\n                              \n                               Filter\n                              \n                              field.\n                             \n\n\n\n                              (Optional) To see a list of all strings that pass your filters, click\n                              \n                               Show preview\n                              \n                              .\n                             \n\n\n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 Currently, only 500 unique values will show in the Filter menu.\n                                \n\n\n\n\n\n\n\n                           Apply aggregations by doing the following:\n                           \n\n                             Select\n                             \n                              Aggregation\n                             \n                             in the menu in the top right corner of the dialog.\n                            \n\n                             The aggregation will be set to Count.\n                            \n\n                             Select a condition statement from the menu.\n                             \n                             One or more fields may appear, depending on the condition statement.\n                            \n\n                             (Conditional) If one or more fields appeared when you selected a condition statement, enter the desired amounts in the fields.\n                             \n\n                             For example, if you wanted your Card to show information for amounts between 200,000 and 300,000, you would select\n                             \n                              is between\n                             \n                             from the menu, enter \"200,000\" in the first field, and enter \"300,000\" in the second field.\n                            \n\n\n\n\n\n\n                          If the selected column contains AMOUNT data, do one of the following:\n                          \n\n\n\n\n\n\n\n                            Apply filters based on a range by doing the following:\n                           \n\n\n\n                              Leave the dropdown menu in the upper right corner of the dialog set to\n                              \n                               Range\n                              \n                              .\n                             \n\n\n                             Select the Aggregation method (default is No aggregation.)\n                            \n\n\n                              Select a condition statement from the menu.\n                              \n                              One or more fields may appear, depending on the condition statement.\n                             \n\n\n\n                              (Conditional) If one or more fields appeared when you selected a condition statement, enter the desired amounts in the fields.\n                              \n\n                              For example, if you wanted your Card to show information for amounts between 200,000 and 300,000, you would select\n                              \n                               is between\n                              \n                              from the menu, enter \"200,000\" in the first field, and enter \"300,000\" in the second field.\n                             \n\n\n\n\n\n                            Apply filters from a list of column values by doing the following:\n                           \n\n\n\n                              Select\n                              \n                               Selection\n                              \n                              in the menu in the top right corner of the dialog.\n                             \n\n\n\n                              Check the checkboxes for the values you want to be represented in the chart.\n                              \n\n                              You can select all of the checkboxes by clicking\n                              \n                               All\n                              \n                              or deselect all of the checkboxes by clicking\n                              \n                               None\n                              \n                              .\n                              \n                              You can filter the values that appear in the list by entering a keyword in the\n                              \n                               Filter by\n                              \n                              field.\n                              \n                              You can also indicate whether the values you have checked appear or do not appear in your chart by selecting\n                              \n                               In\n                              \n                              or\n                              \n                               Not In\n                              \n                              from the menu in the top right.\n                             \n\n\n\n\n\n\n\n                          If the selected column contains DATE data, do one of the following:\n                          \n\n\n\n\n\n\n                            Apply filters based on a range by doing the following:\n                           \n\n\n\n                              Leave the dropdown menu in the upper right corner of the dialog set to\n                              \n                               Range\n                              \n                              .\n                             \n\n\n\n                              Select a condition statement from the menu.\n                              \n                              One or more fields may appear, depending on the condition statement.\n                             \n\n\n\n                              Enter the desired dates in the fields as necessary.\n                              \n\n                              For example, if you wanted your Card to show information for dates between 1-31-2014 and 4-30-2015, you would select\n                              \n                               is between\n                              \n                              from the menu, select January 1, 2014 in the first field, and select April 30, 2015 in the second field.\n                             \n\n\n\n\n\n                            Apply filters from a list of dates found in the column by doing the following:\n                           \n\n\n\n                              Select\n                              \n                               Selection\n                              \n                              in the menu in the top right corner of the dialog.\n                             \n\n\n\n                              Check the checkboxes for the dates you want to be represented in the chart.\n                              \n\n                              You can select all of the checkboxes by clicking\n                              \n                               All\n                              \n                              or deselect all of the checkboxes by clicking\n                              \n                               None\n                              \n                              .\n                              \n                              You can filter the dates that appear in the list by entering a keyword in the\n                              \n                               Filter by\n                              \n                              field.\n                              \n                              You can also indicate whether the dates you have checked appear or do not appear in your chart by selecting\n                              \n                               In\n                              \n                              or\n                              \n                               Not In\n                              \n                              from the menu in the top right.\n                             \n\n\n\n\n                           Apply aggregations by doing the following:\n                          \n\n\n\n                           Select\n                           \n                            Aggregation\n                           \n                           in the menu in the top right corner of the dialog.\n                          \n\n                           The aggregation will be set to Count.\n                          \n\n                           Select a condition statement from the menu.\n                           \n                           One or more fields may appear, depending on the condition statement.\n                          \n\n                           (Conditional) If one or more fields appeared when you selected a condition statement, enter the desired amounts in the fields.\n                           \n\n                           For example, if you wanted your Card to show information for dates between 1-31-2014 and 4-30-2015, you would select\n                           \n                            is between\n                           \n                           from the menu, select January 1, 2014 in the first field, and select April 30, 2015 in the second field.\n                          \n\n\n\n\n                        Filtering dates\n                       \n\n                        In the Analyzer, you can filter date columns to show the information for a desired date range by doing either of the following:\n                       \n\n\n\n                          Selecting the desired Card date range, date grain (\"graph by\" option), date range field (if more than one date column have been applied to the Card) and date filter in the date options menu that appears above your chart (recommended). If you are building a\n                          \n                           Period-over-Period chart\n                          \n                          , you can also configure\n                          \n                           Compare To\n                          \n                          options.\n                         \n\n\n\n                          Dragging the desired date column into the\n                          \n                           Filters\n                          \n                          box, then specifying filter options.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Domo recommends that you use only one of the date-filtering methods. Because these methods function independently, using more than one method at a time may cause conflicts in date filters and date ranges.\n                          \n\n\n\n\n                        This topic discusses using the date filter menu that appears above your chart. For information about filtering dates using the\n                        \n                         Add Filter\n                        \n                        box, see\n                        \n                         Changing the Date Format in Your Chart\n                        \n                        .\n                       \n\n                        Date filter menu\n                       \n\n                        The date filter menu appears in the chart preview pane, above the top right corner of the preview. This menu only appears after you have applied a date column to the chart. Clicking on this menu opens a pop-up with a number of sub-menus:\n                       \n\n\n\n\n                           Card Date Range\n                          \n                          . This lets you choose the range of data shown in the chart. By default this is set to\n                          \n                           All Time\n                          \n                          , meaning that filters are not yet being applied to the dates in this column. (Only dates within 2000-2030 are supported.)\n                         \n\n\n\n\n                           Graph By\n                          \n                          . This lets you choose the date grain for the chart. The date grain determines whether the data is shown by week, by month, etc. This menu is described in more detail in\n                          \n                           Changing the unit of time used to represent data\n                          \n                          . By default no date grain is selected, meaning the chart uses the same date grain used in your DataSet (for example, if data is broken down by week in the DataSet, it is automatically broken down by week in the chart).\n                         \n\n\n\n\n                           Compare To\n                          \n                          . Available for Period-over-Period chart types only. Here you specify the time period(s) the period you selected in\n                          \n                           Card date range\n                          \n                          is being compared to. This menu is discussed in much more detail in\n                          \n                           Period-over-Period Charts\n                          \n                          .\n                         \n\n\n\n\n                           Date Range Field\n                          \n                          . This lets you choose the date column you want to filter. If only one date column has been applied to the chart, this menu is grayed out.\n                         \n\n\n\n\n                           Date Filter\n                          \n                          . This lets you filter dates within the date range selected in\n                          \n                           Card Date Range\n                          \n                          .\n                         \n\n\n\n\n                           Use Fiscal Calendar\n                          \n                          . This lets you toggle your fiscal calendar if one has been set up in your instance. For more information about having a fiscal calendar configured, see\n                          \n                           Using A Fiscal Calendar\n                          \n                          .\n                         \n\n\n\n                        Changing the date range for a chart\n                       \n\n                        Domo provides a wide variety of options you can use to determine the date range that appears in your chart. You can select a specific time period (this week, last year, week to date, etc.) or specify a custom range (such as between two specified dates).\n                       \n\n\n                         To change the date range for a chart,\n                        \n\n\n\n\n                          Click the date range in the top right corner of the chart preview area to show the date configuration options.\n                          \n                          If you do not see a date range, this means you have not yet applied a date range column to your chart.\n                         \n\n\n\n                          Select the desired date range in the\n                          \n                           Card Date Range\n                          \n                          menu.\n                         \n\n\n\n                        Changing the unit of time used to represent data (\"date grain\")\n                       \n\n                        You can use the\n                        \n                         Graph By\n                        \n                        menu to change the unit of time or\n                        \n                         date grain\n                        \n                        by which data is shown. For example, a chart could show data by day, by week, by month, etc. Essentially, by changing the date grain of a chart, the \"zoom level\" in the chart's timeline changes. For example, in a chart showing data for 2009, you could select a monthly date grain, in which case twelve data points would appear, one per month; a daily date grain, with 365 data points; an hourly date grain, with 24 date points; a yearly date grain with only a single data point; and so on. You could not zoom out farther than a year, however, because the date range includes only one year.\n                       \n\n\n                         To change the date grain for a chart,\n                        \n\n\n\n\n                          Click the date range in the top right corner of the chart preview area to show the date configuration options.\n                          \n                          If you do not see a date range, this means you have not yet applied a date range column to your chart.\n                         \n\n\n\n                          Select the desired date grain in the\n                          \n                           Graph By\n                          \n                          menu.\n                         \n\n\n\n                        In the following example, the user has selected\n                        \n                         Weekly\n                        \n                        from the date grain picker; therefore, the trendline represents the data in the column from week to week.\n                       \n\n\n\n\n                        The user then changes the date grain to\n                        \n                         Monthly\n                        \n                        . This allows the user to get a broader view of the data.\n                       \n\n\n\n\n                        Notice that the value increases sharply in July, which may warrant further investigation. This trend would have been more difficult to identify had the date grain been set to\n                        \n                         Daily\n                        \n                        or\n                        \n                         Weekly\n                        \n                        . However, a smaller date grain may help to identify spikes or lows for days or weeks.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n\n                               In supported chart types used to display time data, such as Line and Bar charts, the date grain is automatically determined and applied in a timescale. For example, if your DataSet contains seven months of data, the timeline would automatically be broken down into months, even if data items appeared for individual days in your DataSet. If you manually change the date grain, the timeline shows dates as they appear in your DataSet. You can reset the default date grain and automatic time scale in a chart by selecting\n                               \n                                None\n                               \n                               in the\n                               \n                                Graph By\n                               \n                               menu.\n                               \n                               If you do\n                               \n                                not\n                               \n                               want the time scale in a chart, you can disable it by clicking\n                               \n                                Chart Properties > Category Scale > Never Use Time Scale\n                               \n                               . When selected, date data appears as it does in your DataSet, using individual dates and applying the\n                               \n                                Date Output Format\n                               \n                               setting.\n                               \n                               For more information, see\n                               \n                                Chart Properties\n                               \n                               .\n                              \n\n\n\n\n\n                               By default, when a chart uses a weekly date grain, weeks are represented with week numbers, e.g. \"Week 4\" for the fourth week of the year. If you want, you can change this so weeks are shown with specific dates instead. For more information, see\n                               \n                                Changing the Date Format in Your Chart\n                               \n                               .\n                              \n\n\n\n\n\n                               Domo only displays data from the year 1990 and forward when using a date grain in chart. This is to ensure optimal performance in Card rendering. You can see all years that exist in your data if it is set to\n                               \n                                Graph by None\n                               \n                               .\n                              \n\n\n\n\n\n\n\n\n                        Limiting date data in a chart\n                       \n\n                        In addition to selecting the date range for your chart and choosing the date grain, you can filter the data that appears within the selected date range. You do this in the\n                        \n                         Date Filter\n                        \n                        sub-menu. You can filter date data using any of a number of conditional statements, such as \"is greater than,\" \"is less than or equal to,\" \"is between,\" etc. For example, if you only wanted your chart to show data for August 12th, 2014 and later, you would select\n                        \n                         is greater than or equal to\n                        \n                        , then select August 12th, 2014 in the calendar.\n                       \n\n                        When you set a filter for date data in this way, the filter appears in your\n                        \n                         Filters\n                        \n                        pane. If desired, you can quickly remove the filter by mousing over it and clicking the \"x\" that appears. For more information about the\n                        \n                         Filters\n                        \n                        pane, see\n                        \n                         Filtering chart data\n                        \n                        .\n                       \n\n\n                         To limit the date data in a chart,\n                        \n\n\n\n\n                          Click the date range in the top right corner of the chart preview area to show the date configuration options.\n                          \n                          If you do not see a date range, this means you have not yet applied a date range column to your chart.\n                         \n\n\n\n                          Select the desired conditional statement in the\n                          \n                           Date Filter\n                          \n\n\n                          menu.\n                         \n\n\n\n                          Click in the blank field to open the date picker tool.\n                         \n\n\n\n                          Select the desired date in the date picker.\n                          \n                          (If you chose\n                          \n                           is between\n                          \n                          as your conditional statement, you will need to select two dates, one as the start date and the other as the end date.)", "Preview Article": "Click here to preview", "URL Name": "360042924074", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004643", "Archived Date": "", "Language": "English", "Primary Version": "Adding Filters to Your Chart", "Article Total View Count": "14,309", "": "", "Article Created Date": "10/24/2022, 10:18 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Adding Filters to Your Chart\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Visualization Cards\n              \n", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "\n\n               Analyzer\n              \n", "url": "/s/topic/0TO5w000000ZaoUGAS"}]}