{"file_path": "../../raw_kb_v2\\article\\360043429873\\index.html", "content": {"title": "\n\n\n Powering a Visualization Card with Data\n\n\n", "article_body": "\n\nIntro\n-------\n\nBefore you can begin specifying the visual characteristics of your Visualization Card in the Analyzer, you must determine\n *how*\n to power it and\n *which*\n data you want to power it with. You can power a Card by doing any of the following:\n\n Creating a Visualization Card and then connecting a DataSet.\n* Choosing your DataSet and then adding a Visualization Card to it.\n* Uploading a\n *webform*\n , a Domo-powered spreadsheet you have filled with your own data. This is discussed in detail in\n\nWebforms Connector\n\n.\n\n*Video - Building a Card from an Excel Spreadsheet**\n\n\n The Card -> DataSet method\n----------------------------\n\nWith this method, you first locate the Page in Domo where you want your new Card to appear. You then specify the DataSet used to power the Card. After you power it with data, you can then determine the chart's visual characteristics as discussed in\n\nAnalyzer Overview\n\n.\n\n\n**To build a Card using the Card -> DataSet method,**\n\n. On the Page where you want to create a Card, click the\n\nicon in the upper right corner of the screen.\n2. Click\n **Create new Card**\n .\n\n\n A dialog appears with a number of upload options you can choose from.\n\n*Tip:**\n You can also open this dialog from anywhere in Domo by selecting\n\nin the app toolbar and selecting\n **Card**\n .\n3. Click\n **Visualization**\n .\n4. (Conditional) Do one of the following:\n\n* Use a DataSet that has already been uploaded to Domo by doing the following:\n\n\t1. Click\n\t\t **Existing Data**\n\t\t .\n\n\n\t\t A dialog appears in which you can choose a DataSet.\n\n\t This dialog includes many options for locating your desired DataSet. In addition to being able to search by name, you can also apply various filters to your search. If you click the\n\n\t icon, a dialog appears with a number of selectable filters such as\n\t\t **Owned by**\n\t\t ,\n\t\t **Created Date**\n\t\t ,\n\t\t **Tag**\n\t\t , and so on. You can choose any of these filters then specify the criteria for the filter. For example, if you chose\n\t\t **Tag**\n\t\t , you would then be prompted to select the tag associated with your desired DataSet. You can also customize filters by applying operators. These differ between filters. Most filters include the\n\t\t **Not**\n\t\t operator so you can indicate that specified criteria are excluded from your filter. For example, you might build a filter in which the status is\n\t\t *not*\n\t\t disabled. Date-based filters include the\n\t\t **On**\n\t\t ,\n\t\t **Not On**\n\t\t ,\n\t\t **Before**\n\t\t , and\n\t\t **After**\n\t\t operators so you can narrow down when when a DataSet was created or last run. Number-based filters include\n\t\t **Equal To**\n\t\t ,\n\t\t **Not Equal To**\n\t\t ,\n\t\t **Less Than**\n\t\t , and\n\t\t **Greater Than**\n\t\t operators.\n\n\n\t\t In the filter dialog, you can also choose from several quick filters by clicking\n\t\t **Favorite Filters**\n\t\t . These include\n\t\t **Recently run**\n\t\t (which defaults to 7 days),\n\t\t **Owned by you**\n\t\t , and\n\t\t **Needs attention**\n\t\t .\n\n\n\t\t You can apply multiple filters to narrow down your results; for example, you might apply an\n\t\t **Owned by**\n\t\t filter specifying user \"Kate Nickelby,\" a\n\t\t **Type**\n\t\t filter specifying \"Adobe Analytics,\" and a\n\t\t **Status**\n\t\t filter specifying \"Disabled.\"\n\n\n\t\t Once you have your results set, you can change the sort by clicking\n\t\t **Created Date (oldest to newest**\n\t\t**)**\n\t\t and then choosing the desired sort method and direction.\n\n\n\t\t You can add or manage DataSets in the Data Center. For more information, see\n\n\t Adding a DataSet Using a Connector\n\n\t and\n\n\t Data Center Layout\n\n\t .\n\t\t2. Select the desired DataSet.\n\n\n\t\t You can search for a DataSet by name or filter the DataSets in the list by type or user.\n\t* Use a Microsoft Excel spreadsheet or CSV file as your DataSet by doing the following:\n\n\t1. Click\n\t\t **Spreadsheet upload**\n\t\t .\n\t\t2. Specify the details of your Microsoft Excel spreadsheet or CSV file upload by following the instructions in\n\n\t File Upload Connector\n\n\t .\n\t* Connect to live data not yet in Domo by doing the following:\n\n\t1. Click\n\t\t **Connect live data**\n\t\t .\n\t\t2. Select the appropriate Connector and follow the steps to\n\n\t Add a DataSet Using a Data Connector\n\n\t .\n5. Specify the details of your chart as desired in the Analyzer.\n6. Click\n **Save & Finish**\n .\n\n\n Your new Card is created and added to the Page.\n\nThe DataSet -> Card method\n----------------------------\n\nWith this method, you go into the Data Center and locate the DataSet you want to build a Card from. After you select a DataSet, you can then determine the chart's visual characteristics as discussed in\n\nAnalyzer Overview\n\n. When you add a Card in this way, it appears on your Overview Page by default until you move it to another Page.\n\n\n**To build a Card using the DataSet -> Card method,**\n\n. Select\n **Data**\n in the toolbar at the top of the screen.\n2. Click\n\nin the left-hand navigation pane to access existing DataSets.\n3. Locate and click the DataSet you want to add the Card to.\n\n\n For more information about the filtering and navigation options in the Data Center, see\n\nData Center Layout\n\n.\n4. Click the\n **Cards**\n tab.\n5. Click\n **Add Card**\n .\n6. Specify the details of your chart.\n\n\n When you save the Card, it is added to the\n\n\n Overview Page. You can then move it to another Page if you want. For more information, see\n\nAdding a DataSet Using a Connector\n\n.\n\n*Note:**\n If you upload a Card with a large amount of data, a message may display reading \"WARNING! Not all of the data is shown.\" This indicates that all of the data\n *is*\n present, but for visualization purposes, the visualization has been truncated.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429873\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004753\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nPowering a Visualization Card with Data\n\n", "article_total_view_count": "\n\n\n 12,388\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:29 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "powering_a_visualization_card_with_data", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "powering_your_card", "url": "/s/topic/0TO5w000000ZapBGAS"}]}