{"file_path": "../../raw_kb_v2\\article\\360043429073\\index.html", "content": {"title": "\n\n\n Flex Table\n\n\n", "article_body": "\n\nIntro\n-------\n\nA flex table displays different rows for each series of a chart, with all series depicted as individual\n\nspark bar\n\ncharts. For each individual series, information about that series is provided in the other columns in the table. By default, this information includes the name of the series, an indicator showing whether the percent change for the series is positive or negative, and the degree of change. However, in the Chart Properties for the table, you can change columns to reflect any of a variety of other aspects of the series, such as the minimum or maximum value in the chart, the second-to-last value, a change value (as opposed to a percentage), etc. You can also add additional columns to the table (up to 10) with this information.\n\n\n As a visual example, let's look at how a standard chart might appear when represented instead as a flex table. In the following Stacked Bar chart, \"Finance: AR Aging,\" information is provided for May 2013 to April 2015. Three series are shown, \"AR <30,\" \"AR 30-60,\" and \"AR 60+.\"\n\nThis chart is helpful for showing overall trends in the data but not so much for revealing details about the individual AR buckets. For example, if a user was interested only in \"AR 60+,\" he would probably not find this chart useful at all, as that series is sandwiched between the other two series and is nearly impossible to analyze.\n\n\n If the data in the preceding chart were instead portrayed using a flex table with the default \"Line\" type, it would appear as follows:\n\nNow all three series are shown separately, making it significantly easier to compare trends over the given time period. In addition, red and green indicators show whether change for a series is positive or negative, and the last column shows the percentages of change. With this table, the user interested in \"AR 60+\" can see at a glance how this bucket is doing. If he wanted, he could even add additional columns to show more data, such as minimum and maximum values, last and penultimate values, etc.\n\n\n For information about standard and heat map tables, see\n\nTable Chart\n\n.\n\n##\n Alternate use cases\n\nFlex tables are usually used to show trend data, as explained in the preceding example. However, many other use cases are possible. For example, you could create a table that uses bars to show the difference between values for the previous and current years, like in the below screenshot:\n\nPowering flex tables\n----------------------\n\nFlex tables require at least three columns or rows of data from your DataSet.\n\n One of these contains the data being measured (category data), which will typically be dates. This column is dropped onto the\n **X Axis**\n field. Because the flex table divides up all series into separate rows, you do not actually see the x-axis with category labels. However, you can see the labels by hovering over the bars or the individual points in the line.\n* Another column contains the value data for the table; this column is dropped onto the\n **Y Axis**\n field.\n* A third column contains series data; this column is dropped onto the\n **Region**\n field. You can add as many additional series columns to your chart as you want. Each series you add to the chart is represented as an individual row with its line or bar chart.\n\nFor information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you choose the columns containing the data for your flex table. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n The following graphic shows how the data from a typical column-based spreadsheet is converted into a flex table:\n\nCustomizing flex tables\n-------------------------\n\nYou can customize the appearance of a flex table in a number of ways. Notably, in the Chart Properties, you can change the aspect of each series that appears in each column as well as add new columns. By default, flex tables include columns for series names, charts, change indicators (positive or negative), and the percent of change, as shown in the preceding screenshot. Other available aspects you can change include minimum value, maximum value, penultimate (second-to-last) value, change value, etc.\n\n\n Many other Chart Properties are available as well. For information about all chart properties, see\n\nApplying and Resetting Chart Properties\n\n. Unique properties of flex tables include the following. You can click a thumbnail image to see a larger image.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n General > Fixed Row Height\n  |\n Sets the height for all rows in the table. A minimum value of 28 is required, but there are no restrictions on the maximum value.\n  |\n —\n  |\n|\n General > Column 1-Column 10\n  |\n Lets you choose the aspect of the series that is portrayed in a given column. Four columns are included in a table by default, but you can add additional columns by choosing options for columns 5 through 10. For example, if you selected\n **Penultimate Value**\n for\n **Column 5**\n , a fifth column would be added to the table, portraying the penultimate value in the data for each series.\n\n\n The screenshot shows a flex table in which nearly all aspects are shown (except for\n **Penultimate Value**\n ).\n\n\n The options in this menu are as follows:\n\n\n|  |  |\n| --- | --- |\n|\n Default\n  |\n The default aspect of the series represented in each column. For column 1, this is the name of the series; for column 2, the chart; for column 3, a positive or negative indicator, and for column 4, the percent of change. All remaining columns default to\n **Empty**\n .\n  |\n|\n Empty\n  |\n If you choose this option, this column does not appear in the table. This is the default setting for columns 5-10.\n  |\n|\n Name\n  |\n The name of the series. This is the default setting for column 1.\n  |\n|\n Graph\n  |\n The line or bar chart for this series. This is the default setting for column 2. You can change the chart type under\n **Graph Settings > Type**\n .\n  |\n|\n Change Indicator\n  |\n An icon that shows whether overall change for the series is positive (green) or negative (red). This is the default setting for column 3.\n  |\n|\n Change Percent\n  |\n The percent of overall change for the series. This is the default setting for column 4.\n  |\n|\n Change Value\n  |\n The specific amount of change for the series.\n  |\n|\n First Value\n  |\n The first data value in the series.\n  |\n|\n Penultimate Value\n  |\n The second-to-last data value in the series.\n  |\n|\n Last Value\n  |\n The last data value in the series.\n  |\n|\n Minimum Value\n  |\n The minimum (lowest) data value in the series.\n  |\n|\n Maximum Value\n  |\n The maximum (highest) data value in the series.\n  |\n|\n Average Value\n  |\n The average data value in the series.\n  |\n|\n Total Value\n  |\n The sum of all the data values in the series.\n  |\n\n\n |\n\n|\n|\n General > Column 1-10 Title\n  |\n The name of a column, as it appears in the topmost row of the table.\n  |\n —\n  |\n|\n General > Column 1-10 Width\n  |\n Lets you set the width of a column as a percentage of the entire table (1-100).\n  |\n —\n  |\n|\n Header Row > Header Row Height\n  |\n Lets you set the height for the header row in the table (i.e. the row containing the column names). A minimum value of 28 is required, but no there are no restrictions on the maximum value.\n  |\n —\n  |\n|\n Graph Settings > Type\n  |\n Lets you choose the chart type in the column containing your series charts. Note that these will all be the same chart type for each series; you cannot include more than one type of chart in the same flex table.\n\n\n The following chart types are available:\n\n\n|  |  |\n| --- | --- |\n|\n Line\n  |\n Creates a\n\nspark line\n\nchart for each series. This is the default option. The first screenshot at right shows an example of this chart type.\n  |\n|\n Bar\n  |\n Creates a vertical\n\nspark bar\n\nchart for each series. The second screenshot at right shows an example of this chart type.\n  |\n|\n Horizontal Bar\n  |\n Creates a horizontal spark bar chart for each series. The third screenshot at right shows an example of this chart type.\n  |\n|\n Horizontal Single Bar\n  |\n Creates a horizontal bar chart in which all bars for each series are aggregated to yield a single bar. The fourth screenshot at right shows an example of this chart type.\n  |\n\n\n |\n\n\n |\n|\n Graph Settings > Bar Width Percentage\n  |\n Lets you specify the width of the bars as a percentage of the cell space. Not available when you select\n **Line**\n as your chart type.\n\n\n The screenshot shows an example of a horizontal bar chart in which this setting has been set to\n\n25\n\n. (In contrast, the preceding example is set to the default value of\n\n50\n\n.)\n  |\n\n|\n|\n Regression Line > Show Linear Regression Line\n  |\n Adds a linear regression line to all series charts in the table. Not available when you select\n **Horizontal Bar**\n or\n **Horizontal Single Bar**\n as your chart type.\n\n\n The first screenshot at right shows an example of this when used with a Line chart. The second example shows the same thing with a Bar chart.\n  |\n\n\n |\n|\n Regression Line > Include Last Data Point\n  |\n Lets you determine whether the last data point in a series is used to calculate the regression line.\n  |\n —\n  |\n|\n Regression Line > Line Style\n  |\n Lets you determine whether regression lines appear dashed (default) or solid.\n  |\n —\n  |\n|\n Regression Line > Line Color\n  |\n Lets you determine the color for regression lines.\n  |\n —\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429073\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004718\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nFlex Table\n\n", "article_total_view_count": "\n\n\n 5,802\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:25 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "flex_table", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}