{"file_path": "../../raw_kb_v2\\article\\360043429473\\index.html", "content": {"title": "\n\n\n Pivot Table\n\n\n", "article_body": "\n\nIntro\n-------\n\nIn Domo, Pivot Tables are a powerful alternative to\n\nHTML Tables\n\n. They allow you to more efficiently summarize large quantities of data from a DataSet and explore data by different dimensions and measures.\n\n\n HTML Tables, also known as Flat or Standard Tables, are useful for displaying information in a scannable format, but they are not always useful for summarizing and highlighting data. HTML Tables can be based on either columns or rows, but not both. This means you have to use a large amount of space to display information.\n\n\n Pivot Tables, on the other hand, allow you to display data using both rows and columns. Each cell in the table contains data for the intersecting column and row. You can also have multiple columns and/or rows. Each subsequent column or row you add becomes a new grouping within the previously added grouping.\n\n\n This article describes how to manage Pivot Tables in Domo in the following categories:\n\n Pivot Table capabilities\n* Power Pivot Tables\n* Customize Pivot Tables\n* Best practices for Pivot Tables\n\nPivot Table Capabilities\n----------------------------\n\nPivot Tables provide the following capabilities:\n\n Alert integration\n* Beast Mode support\n* Card-to-Card Filter support\n* Color rules\n* Color/attribute control by row and column\n* Connect and update data\n\n, as with any other chart type\n* Drill Path\n* Domo Embed support\n* Expand/collapse rows and columns\n* Export to\n\nExcel and CSV\n\nor\n\nPowerPoint\n* Full integration with Analyzer\n* Full mobile support\n* Highlighting and selection by row and column grouping\n* Independent control over row and column totals\n* Much larger table handling\n* Quick Filters support\n* Share via email\n* Summary Numbers\n\nPivot Tables have Table Calculation functionality. Follow this link to learn about\n\nTable Calculations\n\n.\n\n\n Pivot Tables also include several chart properties for configuring the look and feel of the chart. You can use chart properties to control the font size and color, text wrapping, header appearance, total and subtotal appearance, and more. For more information about changing chart properties, see the section about\n\nCustomizing Pivot Tables\n\nbelow.\n\n\n Just like in an HTML Table, you can include any DataSet columns you want in a Pivot Table and change the order of the columns as you like. For information about changing the order of columns, see the section about\n\nSorting Rows and Columns\n\nbelow.\n\n\n Power Pivot Tables\n----------------------\n\nUnlike with other chart types—where you must drag columns of a specific data type into specific fields in the\n **Columns**\n region above the chart—you create Pivot Tables by dragging columns into any field you want:\n **Rows**\n ,\n **Columns**\n , or\n **Values**\n .\n\n Columns you drag into the\n **Rows**\n region display as groupings on the left side of the chart.\n* Columns you drag into the\n **Columns**\n region display as groupings at the top of the chart.\n* Columns you drag into the\n **Values**\n region are used to populate the inner data pane of the chart, with one value appearing for each row-column pair.\n\nIf you drag more than one column into a field, each subsequent grouping becomes a subset of the previous grouping. You can change the order of a grouping by dragging a column to your desired location in the field.\n\n\n Columns retain their unique data types after you drag them into a field. You can select columns in the\n **Rows**\n ,\n **Columns**\n , and\n **Values**\n fields to access additional options, such as aggregation and formatting. The specific options that are available depend on the data type.\n\n\n Columns in the\n **Dimensions**\n pane allow you to only set basic aggregation options, enter a table label, and change the styling. Columns in the\n **Measures**\n pane provide more aggregation options, a label setting option, and number formatting options.\n\n\n The following articles provide more information on the following topics:\n\n See\n\nApplying DataSet Columns to Your Chart\n\nfor information about aggregation.\n* See\n\nFormatting Values in Your Chart\n\nfor information about formatting numbers.\n* See\n\nUnderstanding Chart Data\n\nfor information about value, category, and series data.\n\n\n In Analyzer, you choose the columns containing the data for your table. For more information about choosing data columns, see our article about\n\nApplying DataSet Columns to Your Chart\n\n, and for information about formatting charts in Analyzer, see our\n\nAnalyzer Overview\n\narticle.\n\nCustomize Pivot Tables\n--------------------------\n\nYou can customize the appearance of a Pivot Table in several ways, many of which are possible with the\n **Chart Properties**\n tool. For more information about this tool, see our article about\n\nChart Properties\n\n.\n\n##\n Pivot Table Properties\n\n\n####\n General Properties\n\n\n* **Font Color**\n — Change the font color used for all text in the table.\n* **Allow Text to Wrap**\n — When enabled, text wraps in columns instead of disappearing off the right side of the column.\n* **Financial Style Negatives**\n — When this checkbox is selected, negative numbers are enclosed in parentheses; otherwise, a minus sign is used.\n* **Show Negative Numbers in Red**\n — When this checkbox is selected, negative numbers display in red.\n\n\n####\n Header Row Properties\n\n\n* **Header Fill Color**\n — Select a background color for the header row of your table. If you select\n **Default**\n , no color is used.\n\nNote that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you select both a\n **Header Row**\n fill color and a\n **Header Column**\n fill color, the\n **Header Row**\n fill color takes precedence.\n* **Header Font Color**\n — Select the text color for the column names in your header row. This color overrides the table font color set in\n **General**\n >\n **Font Color**\n .\n\nNote that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you specify both a\n **Header Row**\n font color and a\n **Header Column**\n font color, the\n **Header Row**\n font color takes precedence.\n\n\n For example, if you set the general font color to blue and the header row font color to red, the header row font color displays as red instead of blue. If you then select\n **Default**\n , the header row color reverts to blue.\n* **Header Alignment**\n — Select the alignment (left, center, or right) for the column names in the header row. The default setting is\n **Left**\n .\n\nNote that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you specify both a\n **Header Row**\n alignment and a\n **Header Column**\n alignment, the\n **Header Row**\n alignment takes precedence.\n\n\n In the example below, the column names are centered.\n* **Header Font Style**\n — Select the font style (bold, italic, or bold-italic) for the column names in the header row. The default setting is\n **Bold**\n .\n\nNote that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you specify both a\n **Header Row**\n font style and a\n **Header Column**\n font style, the\n **Header Row**\n font style takes precedence.\n\n\n In the example below, the font style is\n **Bold-Italic**\n .\n\n\n####\n ​​​​​​Header Column Properties\n\n\n* **Header Fill Color**\n — Select a background color for the header column of your table. If you select\n **Default**\n , no color is used.\n\n\n Note that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you specify both a\n **Header Row**\n fill color and a\n **Header Column**\n fill color, the\n **Header Row**\n fill color takes precedence.\n* **Header Font Color**\n — Select the text color for the row names in your header column. This color overrides the table font color set in\n **General**\n >\n **Font Color**\n .\n\nNote that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you specify both a\n **Header Row**\n font color and a\n **Header Column**\n font color, the\n **Header Row**\n font color takes precedence.\n\n\n For example, if you set the general font color to blue and the header row font color to red, the header row font color displays as red instead of blue. If you then select\n **Default**\n , the header row color reverts to blue.\n* **Header Alignment**\n — Select the alignment (left, center, or right) for the column names in the header column. The default setting is\n **Left**\n .\n\nNote that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you specify both a\n **Header Row**\n alignment and a\n **Header Column**\n alignment, the\n **Header Row**\n alignment takes precedence.\n\n\n In the example below, the row names are centered.\n* **Header Font Style**\n — Select the font style (bold, italic, or bold-italic) for the row names in the header column. The default setting is\n **Bold**\n .\n\nNote that the names in the upper-left corner of your Pivot Table are considered both row and column names. If you specify both a\n **Header Row**\n font style and a\n **Header Column**\n font style, the\n **Header Row**\n font style takes precedence.\n\n\n In the example below, the font style is\n **Bold-Italic**\n .\n\n\n####\n Totals Properties\n\n\n* **Show Total Row**\n — Add a\n **Grand Total**\n row to the bottom of your table. This row sums all value columns and counts any string and date/time columns you added to the\n **Values**\n region.\n* **Total Row Position**\n — Specify whether the total row displays after the data rows in your table (default) or before the rows, at the top. This property is available only when the\n **Totals**\n >\n **Show Totals Row**\n checkbox is selected.\n\nThe example below shows a table with the total row placed before the data rows.\n* **Total Row Fill Color**\n — Select a background color for the total row in your table. If you select\n **Default**\n , no color is used. This property is available only when the\n **Totals**\n >\n **Show Total Row**\n checkbox is selected.\n* **Total Row Font Color**\n — Select the text color for the content in your total row. This color overrides the table font color set in\n **General**\n >\n **Font Color**\n , and this property is available only when the\n **Totals**\n >\n **Show Total Row**\n checkbox is selected.\n\nFor example, if you set the general font color to blue and the total row font color to red, the total row font color displays as red instead of blue. If you then select\n **Default**\n , the total row color reverts to blue.\n* **Show Total Column**\n — On the right side of your table, add separate totals columns for each column you have dragged into the\n **Values**\n region above the chart preview. Each column sums all value columns and counts any string and date/time columns you added to the\n **Values**\n region.\n\nIn the example below, a total column displays for both \"Profit\" and \"Sales.\"\n* **Total Column Fill Color**\n — Select a background color for the total column(s) in your table. If you select\n **Default**\n , no color is used. This property is available only when the\n **Totals**\n >\n **Show Total Column**\n checkbox is selected.\n* **Total Column Font Color**\n — Select the text color for the content in your total column(s). This color overrides the table font color applied in\n **General**\n >\n **Font Color**\n , and this property is available only when the\n **Totals > Show Total Column**\n checkbox is selected.\n\nFor example, if you set the general font color to blue and the total row font color to red, the total column font color displays as red instead of blue. If you then select\n **Default**\n , the total column color reverts to blue.\n* **Total Column Font Style**\n — Select the font style (bold, italic, bold-italic, or underline) for the cells in the total column(s). The default setting is\n **Bold**\n , and this property is only available when the\n **Totals**\n >\n **Show Total Column**\n checkbox is selected.\n\nIn the example below, the font style is\n **Bold-Italic**\n .\n\n\n####\n Subtotals Properties\n\n\n* **Show Subtotal Rows**\n — Add subtotal rows to your Pivot Table. Subtotal rows sum all value columns are summed and count any string and date/time columns you added to the\n **Values**\n field. One subtotal row displays for each of the primary\n **Rows**\n groupings in your table.\n\nIn the example below, one such row displays for the \"Furniture\" grouping and another for the \"Office Supplies\" grouping.\n* **Subtotal Row Position**\n — Specify whether subtotal rows display after the data rows in your table (default) or before the rows, at the top of each grouping. This property is available only when the\n **Subtotals**\n >\n **Show Subtotals Row**\n checkbox is selected.\n* **Subtotal Row Fill Color**\n — Select a background color for the subtotal rows in your table. If you select\n **Default**\n , no color is used. This property is only available when the\n **Subtotals**\n >\n **Show Subtotal Rows**\n checkbox is selected.\n* **Subtotal Row Font Color**\n — Select the text color for the content in your subtotal rows. This color overrides the table font color set in\n **General**\n >\n **Font Color**\n , and this property is only available when the\n **Subtotals**\n >\n **Show Subtotal Rows**\n checkbox is selected.\n\nFor example, if you set the general font color to blue and the subtotal row font color to red, the subtotal row font color displays as red instead of blue. If you then select\n **Default**\n , the subtotal row color reverts to blue.\n* **Subtotal Row Font Style**\n — Select the font style (bold, italic, bold-italic, or underline) for the text in the subtotal rows. The default setting is\n **Bold**\n , and this property is only available when the\n **Subtotals**\n >\n **Show Subtotal Rows**\n checkbox is selected.\n\nIn the example below, the font style is\n **Bold-Italic**\n .\n* **Show Subtotal Columns**\n — Add subtotal columns to your Pivot Table. Subtotal columns sum all value columns and count any string and date/time columns you added to the\n **Values**\n field. One subtotal column displays for each of the primary\n **Columns**\n groupings in your table.\n\nIn the example below, one such column displays for the \"Central\" regional grouping.\n* **Subtotal Column Fill Color**\n — Select a background color for the subtotal columns in your table. If you select\n **Default**\n , no color is used. This property is available only when the\n **Subtotals**\n >\n **Show Subtotal Columns**\n checkbox is selected.\n* **Subtotal Column Font Color**\n — Select the text color for the content in your subtotal columns. This color overrides the table font color set in\n **General**\n >\n **Font Color**\n , and this property is available only when the\n **Subtotals**\n >\n **Show Subtotal Columns**\n checkbox is selected.\n\nFor example, if you set the general font color to blue and the subtotal column font color to red, the subtotal column font color displays as red instead of blue. If you then select\n **Default**\n , the subtotal column color reverts to blue.\n* **Subtotal Column Font Style**\n — Select the font style (bold, italic, bold-italic, or underline) for the text in the subtotal columns. The default setting is\n **Bold**\n , and this property is available only when the\n **Subtotals**\n >\n **Show Subtotal Columns**\n checkbox is selected.\n\nIn the example below, the font style is\n **Bold-Italic**\n .\n* **Suppress Single Item Subtotals**\n — Hide subtotals for all groupings that contain only one item.\n\n\n###\n Specify Table Labels\n\nTo change the label that displays for any column or row in your table, follow these steps:\n\n. In the fields region above the chart, select the column for which you want to change the label.\n2. Enter your desired label in the\n **Data Label**\n field.\n\n\n###\n Change the Aggregation Type for a Column\n\nAll similar rows in a DataSet are automatically aggregated in a Pivot Table. The default aggregation is\n **Sum**\n , which sums the values for similar rows in a given column.\n\n\n You can change the aggregation type for a column to any of the following:\n\n\n Aggregation Type\n  |\n Description\n  |\n| --- | --- |\n|\n Sum\n  |\n Adds the values in similar rows.\n  |\n|\n Minimum\n  |\n Displays the lowest value in similar rows.\n  |\n|\n Maximum\n  |\n Displays the highest value in similar rows.\n  |\n|\n Average\n  |\n Displays the average value of all similar rows.\n  |\n|\n Count\n  |\n Displays the number of similar rows. For dimensional columns, this is the only available aggregation type.\n  |\n\nTo change the aggregation type for a column, follow these steps:\n\n. In the fields region above the chart, select the column for which you want to change the aggregation type.\n2. Select your desired aggregation in the\n **Aggregation**\n field.\n\n\n**Tip:**\n If you change the aggregation type for a column to something other than\n **Sum**\n , we recommend that you change the column label to reflect the change (as described in the previous steps). This is because most viewers automatically assume that similar rows in a DataSet are summed.\n\n\n For example, if you change the aggregation type for your \"Sales\" column to\n **Average**\n , you might want to change the label to something like \"Average Sales.\" Otherwise, your viewers might mistakenly think that the values in the column have been summed.\n\n\n###\n\n\n Sort Rows and Columns\n\nIn a Pivot Table, you can select the arrows to the left of any header row or column to change the sort pattern used. You can do this anywhere a card is displayed—in the Dashboard view, in the Details view, or in Analyzer.\n\nindicates that these rows or columns are in the same order as the original DataSet.\n\nindicates that these rows or columns are in alphanumeric order.\n\nindicates that these rows or columns are in reverse alphanumeric order.\n\n*Important:**\n Due to the back-end work that must be performed on your data in order for it to pivot, you MUST use the sorting arrows to sort the data, NOT the sorting field inside of Analyzer.\n\nBest Practices for Pivot Tables\n-----------------------------------\n\nTo keep Pivot Tables organized and to avoid displaying unneeded data, the maximum number of column and row combinations is 10. (Possible combinations include: 3 rows and 7 columns, 3 rows and 3 columns, 4 rows and 2 columns, 5 rows and 5 columns). When you drag a new value to a column or row, you must place the new value in one of the\n **Drag Column Here**\n boxes. Existing values are replaced when you drag over them.\n\n\n The maximum number of columns allowed in a\n **Values**\n field is 50.\n\n##\n Use Case #1\n\nThe following image shows a portion of a typical Pivot Table. It contains two row groupings, \"Product Category\" and \"Product Sub-Category,\" and two column groupings, \"Region\" and \"Customer State.\" Each product category is broken down into subcategories, and each region is broken down by state. For example, \"Furniture\" contains individual rows for \"Bookcases\" and \"Office Furniture,\" and \"Central\" contains individual columns for \"Illinois\" and \"Michigan.\"\n\n\n In addition, two columns of data are displayed: \"Profit\" and \"Sales.\" These columns allow you to efficiently find the profit and sales values for the combination of any product and geographic location. For example, if you are asked to find the profit of office furnishings for the state of Michigan, simply find the cell at the intersection of \"Office Furnishings\" and \"Michigan\"/\"Profit,\" which is $4,784.35.\n\n\n You can also find the totals for each column at the bottom of the table and individual columns for \"Profit\" total and \"Sales\" total on the right side of the table (not shown).\n\n\n###\n Use Case #2\n\n\n In this example, a sales manager uses a Pivot Table to show the profits earned for all product categories. The sales manager wants to display the product categories in the rows, so they:\n\n\n1. drag the \"Product Category\" column from the\n\n***Dimensions****\n\npane into\n\n*Rows**\n\nabove the chart preview.\n2. drag the \"Profit\" column from the\n\n*Measures**\n\npane into\n\n*Values**\n\nabove the chart preview.\n\n\n This generates a basic Pivot Table that displays the profits for the three categories and their grand total, as shown below.\n\n\n At this point, the table does not provide much useful information, so the sales manager decides to expand the table to include data for regions. They drag the \"Region\" column into\n **Columns**\n above the chart preview. This adds a \"Region\" header row at the top of the table, adds a \"Profit \" column to the right side of the table, and divides the table into four \"Profit\" columns, one for each region.\n\nThis is a little more helpful, but still lacks specifics. The table says that all the furniture generated a total profit of $152,374.80, but we don't know the breakdown of the furniture types and how they contribute to this total.\n\n\n The sales manager realizes this, so they decide to add another column, \"Product Sub-Category,\" to the table. They do this by dragging the \"Product Sub-Category\" column into\n **Rows**\n above the chart preview, just as they did with \"Product Category.\" This divides each product category into subcategories, and each subcategory now displays individual profit values.\n\n\n**Note:**\n You do not need to include columns or rows in their logical breakdown order like in the previous example. If the sales manager switches the order of \"Product Category\" and \"Product Sub-Category,\" the data will still display correctly.\n\nHowever, instead of the subcategories displaying in their own easy-to-read groupings, as shown above, each will be listed in alphabetical order and paired with its parent category, as shown below. Because this is harder to read, we recommend that you always arrange the columns in a field in their logical breakdown order.\n\nThe sales manager completes their Pivot Table by adding two more columns. They drag \"Customer State\" into\n **Columns**\n and \"Sales\" into\n **Values**\n . This divides the regions into individual states (similar to what the sales manager did with \"Product Category\" and \"Product Sub-Category\") and adds a new data column, \"Sales,\" for each state.\n\nAt this point, the sales manager can make various adjustments to the Pivot Table to make it more readable and useful to viewers. They could set color rules to draw attention to values in a certain range, change the sort and aggregation type for certain columns, highlight total and subtotal rows and columns, add a Drill Path, and much more. For more information about these customizations, see the section about\n\nCustomizing Pivot Tables\n\nabove.\n\n*Important:**\n If you see the message \"Warning: Not all data is shown\" with rows in your Pivot Table displaying as \"###\", numbers that may be in those places have not been included in the data used to create the Pivot Table because there are too many rows to process.\n\n\n In this case, there are some subtotals for the column, but because the number of rows of data is limited, the Pivot Table cannot be fully built. The \"###\" indicates that there is missing data to display. These cells may or may not actually have data, but they cannot be found due to the size of the data.\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043429473\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004682\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nPivot Table\n\n", "article_total_view_count": "\n\n\n 7,453\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:22 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "pivot_table", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}