{"file_path": "../../raw_kb_v2\\article\\7903767835031\\index.html", "content": {"Title": "Variables Overview", "Article Body": "Intro\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           A Variable is a value that functions in a Beast Mode. You can create a Variable without using it in a Beast Mode, but you cannot use the Variable in a card or on a dashboard unless you use it in a Beast Mode.\n                          \n\n\n\n\n\n\n\n                        Variables allow data analysts to interact with the data on cards and create dashboards that are fully functional apps, as well as effectively reducing content clutter. Variables provide low-code solutions for many use cases, including the following:\n                       \n\n\n                         What-if analysis\n                        \n\n                         KPI exploration\n                        \n\n                         Time comparison\n                        \n\n                         Score cards for product performance\n                        \n\n                         Guided analysis\n                        \n\n\n                        This article introduces Variables, default values, and controls; gives instructions on how to complete various tasks with Variables; and discusses Variables and governance.\n                       \n\n\n                         Variables - Terms to Know\n                        \n\n\n                        Variables have many uses and can show up in different ways around Domo.\n                       \n\n                        To help you learn about Variables, here is a short list of terms to know:\n                       \n\n\n\n\n\n                            Term\n                           \n\n\n\n                            Definition\n                           \n\n\n\n\n\n\n\n                            Variable\n                           \n\n\n\n                            A value that functions inside of a Beast Mode.\n                           \n\n                            Similar to variables in math, Variables can be of different data types and various kinds, depending on controls.\n                           \n\n\n\n\n\n\n\n                            Default value\n                           \n\n\n\n                            The default value of a Variable is set when the Variable is created.\n                           \n\n\n\n\n\n                            Value\n                           \n\n\n\n                            The value of a Variable can change, depending on your modifications.\n                           \n\n\n\n\n\n                            Control\n                           \n\n\n\n                            The way that you can interact with and modify the value of a Variable.\n                           \n\n                            There are three types of Variable controls:\n                            \n                             Default Controls\n                            \n                            ,\n                            \n                             Card Variable Controls\n                            \n                            , and\n                            \n                             Dashboard Variable Controls\n                            \n                            .\n                           \n\n\n\n\n\n                        The rest of this article explains how to use Variables generally, but if you have a specific question about using Variables with your data, contact your Customer Success Manager (CSM).\n                       \n\n                        Variables and the Beast Mode Editor\n                       \n\n                        Because Variables must be added to a Beast Mode to function, you can create them in the enhanced Beast Mode Editor.\n                       \n\n                        You can access the Beast Mode Editor from inside\n                        \n                         Analyzer\n                        \n                        by selecting the\n                        \n                         Beast Mode\n                        \n                        tile in the\n                        \n                         Visualize Tab\n                        \n                        , or by selecting\n                        \n                         Add Calculated Field\n                        \n                        from the left side rail in Analyzer.\n                       \n\n\n\n\n                        Inside the Beast Mode Editor, you can view all Variables in your Domo instance by selecting the\n                        \n                         Variables\n                        \n                        tab.\n                       \n\n\n\n\n                        Variables are organized by data type: Numbers, Strings, and Dates. Any user with the Edit Cards grant can use any Variable in an instance, but only those with the Edit Variables grant can create, edit, or delete Variables.\n                       \n\n                        To learn more about this grant, see\n                        \n                         Variables and Governance\n                        \n                        later in this article.\n                       \n\n\n\n\n                        When you create a Variable, you must give it a name, select a data type, and set a default value. This basic Variable can be added to a Beast Mode by any user in the instance with the right permissions. You can think of this basic Variable as a global Variable.\n                       \n\n                        If you create a Variable and later modify the default value or any of the other basic details, those changes are reflected everywhere that the Variable is being used, in any Beast Mode in your instance where it appears.\n                       \n\n\n                         Creating a Variable\n                        \n\n\n\n                         1. Identify the card that you would like to add a Variable to and open it with\n                         \n                          Analyzer\n                         \n                         .\n                        \n\n\n\n                         2. Access the\n                         \n                          Beast Mode Editor\n                         \n                         .\n                        \n\n\n\n                         3. Select the\n                         \n                          Variables\n                         \n                         tab.\n                        \n\n\n\n                         4. Below the list of Variables in your instance, select\n                         \n                          Add Variable\n                         \n                         .\n                         \n                         A\n                         \n\n                           (x)\n                          \n\n\n\n                           New Variable\n                          \n\n\n\n                         tab displays at the top of the editor.\n                        \n\n\n\n\n\n                        5. Under\n                        \n                         Variable Settings\n                        \n                        , enter a\n                        \n                         Variable name\n                        \n                        and an optional\n                        \n                         Description.\n                        \n\n                        The name now displays in the tab at the top of the editor.\n                       \n\n                        6. Under\n                        \n                         Variable Value\n                        \n                        , select a data type and enter a\n                        \n                         Default\n                        \n\n                         value\n                        \n                        . This default value is the value of the Variable every time it is used in a Beast Mode. If the default value is changed and saved here in the editor, the change is reflected in every Beast Mode in your instance where the Variable is being used.\n                       \n\n\n\n\n\n\n\n                         7. Select\n                         \n                          Create Variable\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n                         8. Select\n                         \n                          Save Variable\n                         \n                         .\n                        \n\n\n\n                         9. Select the\n                         \n                          New Calculated Field\n                         \n                         tab at the top of the editor.\n                         \n                         The\n                         \n                          Variables\n                         \n                         tab is open.\n                        \n\n\n\n                         10. Locate the basic or global Variable that you created, organized by data type and alphabetically by name.\n                        \n\n\n\n\n\n\n\n\n                         Editing/Deleting a Variable\n                        \n\n\n\n                         You can\n                         \n\n                          Edit\n                         \n                         or\n                         \n\n                          Delete\n                         \n                         a Variable from its place in the\n                         \n                          Variables\n                         \n                         tab.\n                        \n\n\n\n                         It is possible to lock a Variable so that it can't be edited or deleted. To learn more, see\n                         \n                          Variables and Governance.\n                         \n\n\n\n\n                         Controls\n                        \n\n\n\n                         As mentioned previously, you can configure and modify controls for your Variables. Controls allow you to update your Variable's value to find new insights, adjust selections, and update your cards dynamically on a dashboard or in card Details.\n                        \n\n\n\n                         If you are familiar with Domo, controls function with the same hierarchy as Quick Filters. In\n                         \n                          Analyzer\n                         \n                         , controls display in the same panel as Quick Filters, and that panel is labeled\n                         \n                          Controls\n                         \n                         , as a general term for both Variable controls and Quick Filters.\n                        \n\n\n\n\n\n\n\n\n\n                          If you aren't familiar with Quick Filters, what this means is that changes to a control on a dashboard override any changes to a particular control in Analyzer. The changes are only visible in the user's current location in Domo. For example, if you modify a control on a dashboard when you open the card in Analyzer, the control will have the same value as was last saved for it in Analyzer.\n                         \n\n\n\n\n                         Default Control\n                        \n\n\n\n                         The first type of control, a Default Control, is configured in the Beast Mode Editor. There are several kinds of Default Controls, such as dropdowns, pills, sliders, and textbox inputs. The kind of Default Control you can use with a Variable depends on the data type of the Variable.\n                        \n\n\n\n                         You can configure a Default Control when you create a Variable or come back later to add it by editing your Variable.\n                        \n\n\n\n\n                          If you change the default value for a Variable after creating the Default Control, the Default Control does not update automatically. To change the Default Control, you must make a change to it in the Beast Mode Editor and save the change.\n                         \n\n\n\n\n\n                          Default Control and Other Users\n                         \n\n\n\n\n                         If you create a Variable without a Default Control and return to add one later, or if you initially configure the Variable with a Default Control and later update it, your changes do not override the different controls other users may have created or modified as they use your Variable in their cards and dashboards. This is not the same as for the default value—if you change the default value for a Variable, every occurrence of that Variable in your instance reflects the change in the cards and dashboards of both you and other users.\n                        \n\n\n\n                         Another user can potentially adjust the Default Control for your Variable. If you then remove your Variable from a card or Beast Mode, when you try to add your Variable to another Beast Mode, the Variable's Default Control reflects the adjustments from the other user. You would need to go back to the Beast Mode Editor and adjust the Default Control to the original value if you want the your Variable's Default Control to have the original value. To prevent changes like this to Variables you create, see\n                         \n                          Locking/Unlocking a Variable\n                         \n                         , below.\n                        \n\n\n\n                         Creating a Default Control\n                        \n\n\n\n                         1. Are you creating a new Variable?\n                        \n\n\n\n\n\n                           Yes —\n                          \n                          After entering information in the\n                          \n                           Variable Value\n                          \n                          fields, move to step 2 of this workflow.\n                         \n\n\n\n\n                           No —\n                          \n                          In the\n                          \n                           Variables\n                          \n                          tab of the Beast Mode Editor, locate the Variable you want to create a Default Control for and select\n                          \n\n                           Edit.\n                          \n\n\n\n\n\n                         2. Under\n                         \n                          Default Control\n                         \n                         , select\n                         \n                          + Create\n                         \n\n                          Control\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n                         3. Choose the kind of control. Some options may be unavailable based on the Variable's data type.\n                        \n\n\n\n\n\n\n\n\n                         4. Configure the control based on the kind of control and the available values. You can preview how the control displays in Analyzer.\n                        \n\n\n\n\n\n\n\n\n                         5. (Optional) If you want to add the control to Analyzer so that you can try out different scenarios with the Variable, check the box for\n                         \n                          Add Control to Analyzer\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n                         If you add the control to Analyzer, it automatically displays in the\n                         \n                          Controls\n                         \n                         side panel of Analyzer.\n                        \n\n\n\n                         6. Select\n                         \n                          Save Variable\n                         \n                         .\n                        \n\n\n\n                         7. Exit the Beast Mode Editor.\n                        \n\n\n\n                         Adding a Variable to a Beast Mode\n                        \n\n\n\n                         Note: You must add a Variable to a Beast Mode before it can function or be modified in Analyzer or on a dashboard.\n                        \n\n\n\n                         1. Select a Beast Mode from inside Analyzer OR open the\n                         \n                          Beast Mode Editor\n                         \n                         and add a\n                         \n                          New Calculated Field\n                         \n                         tab at the top.\n                         \n                         Your Beast Mode calculation displays.\n                        \n\n\n\n                         2. Select the place in your Beast Mode calculation where you want to add a Variable.\n                        \n\n\n\n                         3. Select the\n                         \n                          Variables\n                         \n                         tab and locate the Variable you want to add.\n                        \n\n\n\n                         4. Double-click the Variable to add it to the place you selected in your calculation.\n                        \n\n\n\n                         5. (Optional) Repeat steps 3–4 to add as many Variables as you would like to your Beast Mode.\n                        \n\n\n\n\n\n\n\n\n                         6. (Optional) Select\n                         \n                          Validate\n                         \n                         to check that your calculation functions with the Variable.\n                        \n\n\n\n                         7. Select\n                         \n                          Save Calculated Field\n                         \n                         .\n                        \n\n\n\n                         8. Exit the Beast Mode Editor.\n                        \n\n\n                        Card Variable Controls\n                       \n\n                        When you bring a Variable into Analyzer, you can override the default value and the Default Control created in the Beast Mode Editor by using a Card Variable Control. This is helpful for performing what-if analysis and other tasks inside Analyzer.\n                       \n\n                        If when you created the Default Control you checked the box to\n                        \n                         Add control to Analyzer\n                        \n                        , the Card Variable Control displays automatically in the\n                        \n                         Controls\n                        \n                        side panel in Analyzer.\n                       \n\n                        In this example, the Niki Vendor Inflation Variable has a Default Control of 5.5%. The Variable displays as shown in the\n                        \n                         Controls\n                        \n                        side panel in Analyzer and is called a Card Variable Control. Card Variable Controls also refers to the controls when they appear in card Details and Story Presentation Mode.\n                       \n\n                        Follow this link to learn more about\n                        \n                         Story Presentation Mode\n                        \n                        .\n                       \n\n\n\n\n\n\n                        Modifying a Card Variable Control\n                       \n\n\n                         Note:\n                        \n                        To modify a Card Variable Control, the Variable must be in use in a Beast Mode on that card.\n                       \n\n                        Considering the example above, you can modify the Card Variable Control by moving the slider. In this example, the modified value of the Card Variable Control is now 10%. The Default Control for the basic or global Variable, as configured in the Beast Mode Editor, has not changed.\n                       \n\n                        Modifying the Card Variable Control affects only this occurrence of the Variable for this card. This allows you to use the Variable for your DataSet while also allowing other users to use the Variable in their DataSets and create other controls. If another user brings your Variable into Analyzer for their card, the default value and Default Control you configured are in effect unless they modify the Card Variable Control in Analyzer.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           If you modify the Card Variable Control and save the card, the next time you open the card in Analyzer, the modification remains. But if you use the card in a dashboard, the value of the Variable is the value of the Default Control—no modifications of the Card Variable Control transfer to the dashboard.\n                          \n\n                           Dashboard Variable Controls\n                          \n\n\n\n\n                        After you add a Variable to a Beast Mode, add the Beast Mode to a card in Analyzer, optionally adjust the Card Variable Control, and save the card, you can add the card to a dashboard. Note that any changes made to the Card Variable Control in Analyzer do not transfer to the Variable when you use it on a dashboard. When a Variable control is added to a dashboard, the control is called a Dashboard Variable Control.\n                       \n\n                        When you first add a Dashboard Variable Control to a dashboard, all cards on the dashboard that contain that Variable reflects the default value of the Variable at the basic or global level in\n                        \n                         Variable Settings\n                        \n                        . If you then modify the Dashboard Variable Control, all cards on the dashboard that use that Variable reflect the modification.\n                       \n\n                        Just as for Card Variables Controls, modifications to a Dashboard Variable Control do not transfer. If you modify a Dashboard Variable Control, the modification is not reflected in Analyzer, card Details, or Story Presentation Mode.\n                       \n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you refresh a dashboard, all Dashboard Variable Controls in use reset to the default value of the Variable at the basic or global level in\n                           \n                            Variable Settings\n                           \n                           .\n                          \n\n\n\n\n                        Adding a Dashboard Variable Control\n                       \n\n                        1. In the Edit Dashboard mode, click and drag a\n                        \n                         Control\n                        \n                        from the right side rail onto your dashboard.\n                       \n\n\n\n\n                        2. Select\n                        \n                         Add\n                        \n                        .\n                        \n                        A list of available Variables displays.\n                       \n\n\n\n\n                        3. Select the Variable you want to add to the dashboard from the list.\n                       \n\n                        The Dashboard Variable Control displays.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           You can only add each available Variable to a dashboard once. If you attempt to add a Variable and it does not display in the list of available Variables, it already appears somewhere on the dashboard. Locate it and move it to the desired place.\n                          \n\n\n\n\n\n\n                        Modifying a Dashboard Variable Control\n                       \n\n                        Anyone with permission to interact with a card can modify a Dashboard Variable Control.\n                       \n\n                        Modify a Dashboard Variable Control by interacting with it depending on its type: moving a slider or choosing another option in a dropdown, for example.\n                       \n\n                        If you modify a Dashboard Variable Control and open a card with that Variable in Analyzer, the Analyzer Variable Control does not reflect the modification—the value of the Card Variable Control is the last value that was saved in Analyzer.\n                       \n\n\n                         Page Filters\n                        \n\n\n                        Variables, by default, do not display in the dashboard Filters bar. If you add a Dashboard Variable Control and modify it (move the slider bar, for example), the Variable then displays in the Filters bar alongside other Filters and reflects the modified value.\n                       \n\n\n\n\n\n\n                        Variables and Governance\n                       \n\n                        Who can create, edit, and use Variables?\n                       \n\n                        Variables are part of the Domo base product, so after a Variable is created, anyone can use it.\n                       \n\n                        Variables have their own grant—the Edit Variables grant—that is automatically enabled for all users with the Edit Card grant enabled (Editor role and above), beginning with the October 2022 release. The Edit Variables grant allows a user to create, edit, and delete Variables in that instance. Admins can disable this grant for any user. If an admin turns off the Edit Variables grant for a user, that user can still use Variables, they just can't create, edit, or delete them.\n                       \n\n\n\n\n                        Locking/Unlocking a Variable\n                       \n\n                        It is also possible for a user to lock a Variable that they create. If a Variable is locked, others can view and use the Variable, including modifying the Card and Dashboard Variable Controls, but they can't edit or delete the Variable.\n                       \n\n                        To lock a Variable that you create, when you are creating the Variable in the Beast Mode Editor, locate the\n                        \n\n                         Lock\n                        \n                        under\n                        \n                         Variable Settings\n                        \n                        .\n                       \n\n                        Select\n                        \n\n                         Lock\n                        \n                        before saving your Variable.\n                       \n\n                        Now no other users can edit or delete your Variable unless you unlock it.\n                       \n\n                        Unlock the Variable by selecting\n                        \n\n                         Unlock\n                        \n                        under\n                        \n                         Variable Settings\n                        \n                        .\n                       \n\n                        DomoStats Reports\n                       \n\n                        There are three new DomoStats reports to help keep your instance organized:\n                       \n\n\n\n                          Variables —\n                         \n                         This report lets admins know what Variables exist in their instance.\n                        \n\n\n                          Variables Used in Beast Modes —\n                         \n                         This report details which Variables are currently in use in a Beast Mode.\n                        \n\n\n                          Beast Modes Used in Cards —\n                         \n                         This report shows which Beast Modes are currently in use in cards.\n                        \n\n\n                        For more information about DomoStats, see\n                        \n                         DomoStats - DataSets and DataFlows\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n\n                         Do I need to use a Variable in a Beast Mode?\n                        \n\n                        Yes. Variables must be used in a Beast Mode calculation to work with a card or dashboard.\n                        \n\n\n                         Are Variables saved to a card or DataSet?\n                        \n\n                        No. Variables are global and can be used across different DataSets on different cards and dashboards. This prevents creators from having to duplicate the same Variable across multiple DataSets. Variables are created in the Beast Mode Editor and all users in the instance can view them there.\n                        \n\n\n                         What permissions do I need to create a Variable?\n                        \n\n                        You need the Edit Variables grant. See\n                        \n                         Variables and Governance\n                        \n                        , above.\n                        \n\n\n                         Are Variables supported with Domo Everywhere?\n                        \n\n                        Yes. Variables are supported for embedding and publishing content with Domo Everywhere.\n                        \n\n\n                         Are Variables supported in publication groups?\n                        \n\n                        No. Variables are not supported in publication groups.\n                       \n\n\n                         Do Domo Bricks support Variables?\n                        \n\n                        No. Domo Bricks do not support Variables.\n                        \n\n\n                         Video — Variables Use Cases and Feature Walkthrough", "Preview Article": "Click here to preview", "URL Name": "7903767835031", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004978", "Archived Date": "", "Language": "English", "Primary Version": "Variables Overview", "Article Total View Count": "9,984", "": "", "Article Created Date": "11/1/2022, 11:15 PM", "First Published Date": "11/1/2022, 11:23 PM"}, "title": "\n              Variables Overview\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Variables\n              \n", "url": "/s/topic/0TO5w000000ZdTCGA0"}]}