{"file_path": "../../raw_kb_v2\\article\\360042923254\\index.html", "content": {"Title": "Moving or Copying Cards to Other Pages", "Article Body": "Intro\n                       \n\n                        You can move or copy a Card to one or more Pages in Domo from a Card Page or the Details view. When you copy a Card in this way, the copies are linked; any changes made to a copy of a Card are also made to all other copies. This is different from the\n                        \n                         Save As\n                        \n                        functionality in that duplicating a Card creates an entirely separate instance of that Card; making a change to a duplicated Card does\n                        \n                         not\n                        \n                        affect the original Card. For more information about\n                        \n                         Save As\n                        \n                        , see\n                        \n                         Duplicating Cards\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Notes:\n                             \n\n\n\n\n\n                              When copied, a Card is accessible by users with access to the Page or Card.\n                             \n\n\n\n                              If a Page has been locked, you can only move or copy Cards if you are the Page owner or you have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled. For more information about locking and unlocking content on Pages, see\n                              \n                               Managing Custom Roles\n                              \n                              .\n                             \n\n\n\n\n\n\n\n                        You can also move or copy multiple Cards at once in the Admin Settings. You must have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled to use this option.\n                        \n                         For more information about default security roles, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n\n\n                          Video - Move, Copy, and Duplicate Cards\n                         \n\n\n\n\n\n\n\n\n\n                        Moving or copying a single Card\n                       \n\n                        Follow these steps to move or copy one Card to any number of selected Pages.\n                       \n\n\n                         To move or copy a Card to another Page,\n                        \n\n\n\n\n                          Mouse over the Card you want to move or copy. (If you are in a Details view, skip this step.)\n                         \n\n\n\n                          Click\n                          \n                          , then select\n                          \n                           Move or Copy\n                          \n                          from the menu.\n                          \n                          A dialog appears. The names of Card Pages and/or Subpages in which this Card is located appear in the box.\n                         \n\n\n\n                          Do one of the following:\n                         \n\n\n\n                            If you plan to\n                            \n                             move\n                            \n                            the Card from its location(s), clear the default Page names from the box.\n                           \n\n\n\n                            If you plan to\n                            \n                             copy\n                            \n                            the Card, leave the default Page names as they are.\n                           \n\n\n\n\n\n                          Click the empty portion of the box to display a list of Pages.\n                         \n\n\n\n                          Select the Pages or Subpages to which you want to move the Card.\n                         \n\n\n\n                          (Optional) Select multiple destinations for the Card by repeating steps 4 and 5.\n                         \n\n\n\n                          Click\n                          \n                           Move\n                          \n                          .\n                         \n\n\n\n                        The following screenshot shows a scenario where a user wants to copy a Card to another Page (without removing it from the Pages its on). Thus, the user selects another new Page. If the user wanted to move this Card (removing it from the current Pages), the user would click the \"X\" next to the listed Pages from which the Card would be removed.\n                       \n\n\n\n\n                        Copying multiple Cards\n                       \n\n                        In\n                        \n                         More>\n                        \n\n                         Admin > Cards\n                        \n                        , you can copy multiple Cards to any number of selected Pages with a single action. You must have an \"Admin\" default security role or a custom role with \"Manage All Cards and Pages\" enabled to use this option.\n                        \n                         For more information about default security roles, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n\n                         To copy multiple Cards,\n                        \n\n\n\n\n                          Select\n                          \n                           More\n                          \n                          in the toolbar at the top of the screen, then select\n                          \n                           Admin\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Cards\n                          \n                          in the left-hand pane.\n                          \n                          A list of all Cards in your Domo instance appears.\n                         \n\n\n\n                          Check the boxes for all Cards you want to copy.\n                          \n                          You can use the column filters to filter the Cards in the list. You can also select or deselect all Cards passed through your selected filters.\n                         \n\n\n\n                          Select\n                          \n                           Edit > Add to Pages\n                          \n                          .\n                          \n                          A dialog opens in which you can specify the Pages where the copied Cards will be added.\n                         \n\n\n\n                          In the\n                          \n                           Search Pages\n                          \n                          field, enter the name of a Page where you want the copied Cards to live.\n                          \n                          The names of Pages matching the characters you've entered pop up in a list.\n                         \n\n\n\n                          Click the name of the desired Page to add it to the field.\n                         \n\n\n\n                          (Optional) To add more Pages to the field, repeat steps 5 and 6 as often as necessary.\n                         \n\n\n\n                          Click\n                          \n                           Add to Pages\n                          \n                          .\n                         \n\n\n\n                        The Cards are copied into the Pages you specified.", "Preview Article": "Click here to preview", "URL Name": "360042923254", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004111", "Archived Date": "", "Language": "English", "Primary Version": "Moving or Copying Cards to Other Pages", "Article Total View Count": "5,320", "": "", "Article Created Date": "10/24/2022, 9:22 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Moving or Copying Cards to Other Pages\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Content In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "\n\n               Card And Dashboard Management\n              \n", "url": "/s/topic/0TO5w000000ZanDGAS"}]}