{"file_path": "../../raw_kb_v2\\article\\360043435713\\index.html", "content": {"title": "\n\n\n YouTube Enterprise Advanced Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nYou can use Domo's YouTube Enterprise Connector to retrieve viewing statistics, popularity metrics, and demographic information for YouTube videos and channels. To learn more about the YouTube API, visit their page (\n\nhttps://developers.google.com/youtube/\n\n).\n\n*Note:**\n There are currently 5 YouTube Connectors available in Domo. The difference between these may be difficult to understand, so here is an explanation of each:\n\n\n* **YouTube Reporting Connector -**\n This is our entry-level YouTube Connector. It requires only a Google username and password to authenticate. Most Domo users should use this Connector to retrieve YouTube data.\n* **YouTube Reporting Enterprise Connector -**\n This is the enterprise version of the YouTube Reporting Connector. This report has a few additional reports and requires you to enter a Google Client ID and Client Secret in addition to a basic Google username and password.\n* **YouTube Enterprise Advanced Connector -**\n This is Domo's most advanced YouTube Connector. (This is the only version of the YouTube Enterprise Connector; there is no Connector simply called \"YouTube Enterprise.\") It requires a Google Client ID and Client Secret as well as a Google username and password. It provides more reports and options than the other YouTube Connectors but is also more complicated and much more difficult to configure. This Connector is recommended for advanced users only.\n* **YouTube Reporting Partition Connector**\n**-**\n This offers the same reports as the YouTube Reporting Connector, with the added ability to use Partitioning in the DataSet.\n* **YouTube Reporting Enterprise Partition Connector**\n**-**\n This offers the same reports as the YouTube Reporting Enterprise Connector, with the added ability to use Partitioning in the DataSet.\n\nThe YouTube Enterprise Connector is a \"Cloud App\" Connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the Connector page for this and other Cloud App Connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your YouTube Enterprise account in the Data Center. This topic discusses the fields and menus that are specific to the YouTube Enterprise Connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector.\n\nBest practices\n----------------\n\nWhen you first power up the Connector and request historical data, it takes around 30 days to bring in all the data. This is due to how the YouTube API functions. For example, if a report is first started on April 1, data from April 1 onward will be available 24-48 hours later. Every day, a few more days prior to April 1 will be available. After around 30 days, 6 months of backfill data will have been added to the report (though it comes in a rather sporadic order). In this example, by April 30 the user should end up with 7 months of —data for April, plus the 6 prior months.\n\n\n Prerequisites\n---------------\n\nTo connect to your YouTube Enterprise account and create a DataSet, you must have the following:\n\n A Google Client ID.\n* A Google Client Secret.\n* A Google username and password.\n\nFor step-by-step instructions on obtaining a Client ID and Client Secret, see\n\nhttps://support.google.com/cloud/answer/6158849\n\n.\n\n\n**Note:**\n For multiple\n\nYouTube Enterprise Advanced accounts in Domo, you must click the Google+ API checkbox in the Google API when creating the Client ID and Client Secret. If the Google+ API box is not checked, then any new YouTube Enterprise Advanced account in Domo will override the current credentials.\n\nYou must also enable the Google People API to properly configure this Connector. For more information about this API, see\n\nhttps://developers.google.com/people/?hl=en\\_US\n\n.\n\nConnecting to your YouTube Enterprise account\n-----------------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the YouTube Enterprise Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most Connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials pane\n\nThis pane contains fields for entering credentials to connect to your YouTube Enterprise account. For information about obtaining these credentials, see \"Prerequisites,\" above. The following table describes what is needed for each field:\n\n\n Field\n  |\n Description\n  |\n| --- | --- |\n|\n Client ID\n  |\n Enter your Google Client ID.\n  |\n|\n Client Secret\n  |\n Enter your Google Client Secret.\n  |\n\n\n**Note:**\n In order to create a client ID and secret, you will be asked to enter the following redirect URL:\n\nhttps://oauth.domo.com/api/data/v1/oauth/providers/youtube-enterprise/exchange\n\n\n After you have entered valid credentials, you are taken to Google's OAuth page where you are prompted to enter your Google username and password. Once you have successfully authenticated, you can use the same account any time you go to create a new YouTube Reporting Enterprise DataSet. You can manage Connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n##\n Details pane\n\nThis pane contains two primary menus,\n **API**\n and\n **Report**\n , along with other menus which may appear depending on the selected API and report type.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n API\n  |\n Select your YouTube Enterprise API type. Depending on the API you select, a different set of reports is available. You can choose from the following APIs:\n\n\n|  |  |\n| --- | --- |\n|\n Analytics API\n  |\n The Analytics API helps to understand your users and how they interact with your channel and your videos.\n  |\n|\n Ad Performance\n  |\n The Ad Performance API includes reports that provide impression-based metrics for ads that ran during video playbacks.\n  |\n|\n Content ID API\n  |\n The Content ID API is used to understand your content.\n  |\n|\n Content Owner\n  |\n The Content Owner API includes reports that contain metrics for channels linked to a specified YouTube content owner.\n  |\n|\n Data API\n  |\n The Data API is used to retrieve the resources of the user.\n  |\n\n\n |\n|\n Report (Analytics API)\n  |\n Select the desired Analytics API report.\n\n\n|  |  |\n| --- | --- |\n| **Report**  | **Description**  |\n|\n Basic User Activity\n  |\n Return basic information about how users are watching your videos\n  |\n|\n Content Sharing By Platform\n  |\n Returns information about video sharing, broken down by viewing platform\n  |\n|\n Device OS\n  |\n Returns information about which Operating Systems users are using to view your videos\n  |\n|\n Device Type\n  |\n Returns information about what devices are being used to view your videos\n  |\n|\n Device Type and OS\n  |\n Returns information about devices and their operating systems that are used to view your videos\n  |\n|\n Geographic Activity By Country\n  |\n Returns information about viewer activity by country\n  |\n|\n Geographic Activity By US State\n  |\n Returns information about viewer activity by US state\n  |\n|\n Time Activity By Country\n  |\n Returns information about how long viewers are watching your videos, broken down by country\n  |\n|\n Top Videos\n  |\n Returns information about your most-viewed videos\n  |\n|\n Top Videos By US State\n  |\n Returns information about your most-viewed videos, broken down by US state\n  |\n|\n Traffic Source\n  |\n Returns information based on the manner in which viewers reached your videos\n  |\n|\n Traffic Source Detail\n  |\n Returns information based on the referrers that generated the most views for the channel's content\n  |\n|\n Video Playback Location\n  |\n Returns information about the type of page or application where video playbacks occurred\n  |\n|\n Video Playback Location Detail\n  |\n Returns information about the embedded video players that generated the most views or viewing time for a channel's video\n  |\n|\n Viewer Demographic\n  |\n Returns information about viewers' age group and gender\n  |\n\n\n |\n|\n Report (Ad Performance)\n  |\n\n  |  |\n| --- | --- |\n|\n Ad Performance By Ad Types\n  |\n Returns information about ad performance, broken down by the type of ad\n  |\n|\n Country Specific Ad Performance\n  |\n Returns information about ads, broken down by country\n  |\n|\n Daily Earnings and Ad Performance\n  |\n Returns daily information about ad performance\n  |\n|\n Earnings and Ad Performance\n  |\n Returns information about total ad performance\n  |\n\n\n |\n|\n Report (Content ID API)\n  |\n\n  |  |\n| --- | --- |\n|\n Allowed Video Ads\n  |\n Returns information about the types of allowed ads for a specified partner- or user-uploaded video\n  |\n|\n Video Ad Settings\n  |\n Returns advertising settings for the specified video\n  |\n\n\n |\n|\n Report (Content Owner)\n  |\n\n  |  |\n| --- | --- |\n|\n Activity for Time Periods (including subscriber counts)\n  |\n Returns information about daily user activity\n  |\n|\n Basic Statistics (including subscriber counts)\n  |\n Returns information about user activity related to a content owner's channels and those channels' videos\n  |\n|\n Basic Statistics for US States\n  |\n Returns user activity statistics for U.S. states and the District of Columbia\n  |\n|\n Device Type\n  |\n Returns aggregates video viewing statistics based on device types\n  |\n|\n Device Type and OS\n  |\n Returns video viewing statistics based on viewers' operating systems and device type\n  |\n|\n Engagement and Content Sharing\n  |\n Returns statistics showing how frequently videos on the content owner's channels were shared on different social platforms\n  |\n|\n Geographic Activity including owned and claimed content\n  |\n Returns statistics related to user activity on a country-by-country basis for a channel\n  |\n|\n Geographic Activity including subscriber counts\n  |\n Returns statistics related to user activity on a country-by-country basis for a channel, including subscriber count\n  |\n|\n Operating System\n  |\n Returns video viewing statistics based on viewers' operating systems\n  |\n|\n Traffic Source\n  |\n Returns statistics based on the manner in which viewers reached videos on the content owner's channels\n  |\n|\n Traffic Source Detail\n  |\n Returns statistics based on the manner in which viewers reached videos on the content owner's channels\n  |\n|\n User Activity (including owned and claimed content)\n  |\n Returns information about users' actions on the channel\n  |\n|\n User Activity by Province\n  |\n Returns information related to geographic activity by province\n  |\n|\n User Activity in US\n  |\n Returns information related to geographic activity by US State\n  |\n|\n Video Playback Location\n  |\n Returns statistics related to the type of page or application where video playbacks occurred\n  |\n|\n Video Playback Location Detail\n  |\n Returns statistics related to the type of page or application where video playbacks occurred\n  |\n\n\n |\n|\n Report (Data API)\n  |\n\n  |  |\n| --- | --- |\n|\n Activities\n  |\n Returns information about actions that a particular channel, or user, has taken\n  |\n|\n Channel Sections\n  |\n Returns information about a set of videos that a channel has chosen to feature\n  |\n|\n Channels\n  |\n Returns information about the authenticated Channel\n  |\n|\n Channels by User\n  |\n Returns information about Channels owned by the designated users\n  |\n|\n Comment Threads by Video Id\n  |\n Returns information about comments on the selected Video\n  |\n|\n Guide Category by Id\n  |\n Returns information about the selected Category\n  |\n|\n Guide Category by Region\n  |\n Returns information about the Categories available in the selected Region\n  |\n|\n Languages\n  |\n Returns a list of languages supported by YouTube\n  |\n|\n Other Users' Video Statistics\n  |\n Return information about videos owned by the selected Users\n  |\n|\n Playlist\n  |\n Returns a list of the authenticated user's Playlists\n  |\n|\n Playlist By Id\n  |\n Returns information about the selected Playlist\n  |\n|\n Playlist By Item Id\n  |\n Returns information about Playlists that the selected video is in.\n  |\n|\n Regions\n  |\n Returns a list of Regions supposed by YouTube\n  |\n|\n Subscribers\n  |\n Returns information about the users that have subscribed to the authenticated Channel\n  |\n|\n Subscription\n  |\n Returns information about the channels that the authenticated user is subscribed to\n  |\n|\n Video Category by Id\n  |\n Returns information about the selected Category\n  |\n|\n Video Category by Region\n  |\n Returns information about the Categories available in the selected Region\n  |\n|\n Video Dislikes\n  |\n Returns a list of videos that the authenticated user has marked as disliked\n  |\n|\n Video Likes\n  |\n Returns a list of videos that the authenticated user has liked\n  |\n|\n Videos\n  |\n\nReturns a list of the user's videos\n\n|\n\n\n |\n|\n Call on Behalf of Content Owner\n  |\n Select\n **Yes**\n if you are planning to retrieve a report for another user (whose ID you will enter in the\n **Content Owner ID**\n field). Select\n **No**\n if you are the content owner for the report you plan to pull.\n  |\n|\n Content Owner ID\n  |\n Enter the ID of the content owner you want to pull data for. If you do not know the ID, ask your partner manager.\n  |\n|\n User IDs\n  |\n Enter comma-separated IDs for the users you want to retrieve data for. A user’s ID is located at the end of the URL for his YouTube channel. For example, in the URL\n\nhttps://www.youtube.com/user/google\n\n, “google” is the user ID.\n  |\n|\n Video ID\n  |\n Enter the ID of the video you want to retrieve comments for.\n  |\n|\n Region\n  |\n Select the country or region you want to pull data for.\n  |\n|\n Videos Published After (Days Ago)\n  |\n Enter a number of past days to retrieve data for all videos published after that date. For example, if you entered 20, your report would contain information on all videos published within the last\n\n20\n\ndays. If you leave this field blank, you will get a breakdown of all videos.\n  |\n|\n Videos Published Before (Days Ago)\n  |\n Enter a number of past days to retrieve data for all videos published before that date. For example, if you entered\n\n20\n\n, your report would contain information on all videos published more than 20 days ago. If you leave this field blank, you will get a breakdown of all videos.\n  |\n|\n Playlist\n  |\n Select the playlist you want to retrieve data for.\n  |\n|\n Legacy Reporting Mode\n  |\n**Advanced use only.**\n This is to enable support with data sources made with an old version of the Connector. When set to\n **True**\n , the report includes columns that are no longer reported,or whose meanings have changed.\n\n\n For the Videos report, the \"kind\", \"id\\_kind\", and \"id\\_videoId\" columns are different or available.\n  |\n|\n Number of Days Ago\n  |\n Enter the most recent past day for which you want to retrieve data. For example, you would enter\n\n2\n\nto get data for the day before yesterday. YouTube does not usually report data less than 2 days old.\n  |\n|\n Backfill Days\n  |\n Enter the number of days prior to\n **Number of Days Ago**\n for which you want to retrieve data. For example, if you entered\n\n7\n\nfor\n **Number of Days Ago**\n and\n\n14\n\nfor\n **Backfill Days**\n , your report would contain data for all of the days in the week before last.\n  |\n|\n Prior Days\n  |\n Enter the number of days prior to\n **Number of Days Ago**\n for which you want to retrieve data on the second and subsequent runs of the data source.\n  |\n|\n Dimension\n  |\n Specify whether you want a daily or summarized report.\n  |\n|\n US State\n  |\n Select the U.S. state you want to pull data for.\n  |\n|\n Traffic Filter\n  |\n Select a traffic option to filter by. For example, if you selected\n **Google Search**\n , only information related to Google would appear in your report.\n  |\n\n\n###\n Other panes\n\nFor information about the remaining sections of the Connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043435713\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003342\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nYouTube Enterprise Advanced Connector\n\n", "article_total_view_count": "\n\n\n 3,958\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:12 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "youtube_enterprise_advanced_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}