{"file_path": "../../raw_kb_v2\\article\\360043428513\\index.html", "content": {"title": "\n\n\n Bubble Chart (Deprecated)\n\n\n", "article_body": "\n\nIntro\n-------\n\n\n**Important:**\n The Bubble chart type has been deprecated, it is now part of the\n\nScatter Plot Chart\n\n.\n\nSimilar to\n\nscatter plot charts\n\n, bubble charts have two value scales, and x and y coordinate pairs are plotted on the chart. bubble charts are more complex than scatter plot charts in that they include an additional dimension—bubble size. The size of any bubble on the chart is relative to the size of the other bubbles in the chart. For example, if your chart contained two series, one with a size value of 25 and the other with a size value of 50, the bubble with a value of 50 would appear twice the size of the smaller bubble in the chart.\n\n\n You can also apply timeline data instead of value data to the x-axis. In this case, all bubbles are plotted on their appropriate date/time lines. The position of a bubble on a given line is still determined by its y coordinate value, however.\n\n\n Powering bubble charts\n------------------------\n\nA bubble chart requires three columns or rows of data from your DataSet:\n\n A column or row containing values to be measured on the y-axis.\n* A column or row containing values or date-time data to be measured on the x-axis\n* A column or row containing size values for each bubble.\n\nYou can also add an optional series column if you want. If you do not include a series column, no legend appears. Prior to our August 2017 release, series data was required, but this is no longer the case. You can still use the old version of the chart by selecting the bubble (Legacy) chart type.\n\n\n**Note**\n : When you drill down into a bubble chart, you can drill into the series data only,\n *not*\n the x- or y-axis data. For more information about drilling into data, see\n\nDrilling into Data\n\n\n .\n\nFor information about value, category, and series data, see\n\nUnderstanding Chart Data\n\n.\n\n\n In the Analyzer, you can choose the columns containing the data for your bubble chart. For more information about choosing data columns, see\n\nApplying DataSet Columns to Your Chart\n\n.\n\n\n For more information about formatting charts in the Analyzer, see\n\nKPI Card Building Part 2: The Analyzer\n\n.\n\n\n The following chartic shows how the data from a typical column-based spreadsheet is converted into a standard x-y coordinate bubble chart:\n\nThe following chartic shows how the data from a typical column-based spreadsheet is converted into a bubble chart with date-time data:\n\nCustomizing bubble charts\n---------------------------\n\nYou can customize the appearance of a bubble chart by editing its chart properties. For information about all chart properties, see\n\nChart Properties\n\n. Unique properties of bubble charts include the following. You can click a thumbnail image to see a larger image.\n\n\n Property\n  |\n Description\n  |\n Example\n  |\n| --- | --- | --- |\n|\n Grid Lines > Hide All Grids\n  |\n Turns off grid lines. This is useful when you want to create a \"quadrant chart\" (that is, a chart divided into four sections using two coordinate lines).\n  |\n —\n  |\n|\n Grid Lines > Y Zero Line Color\n  |\n Determines the color of the horizontal \"zero line\" in bubble and scatter plot charts. This attribute does not work if the zero line is also the baseline in the chart (that is, the chart must contain negative values). In the example, the color has been set to red.\n  |\n\n|\n|\n Grid Lines > Y Zero Line Width\n  |\n Determines the width of the horizontal \"zero line\" in bubble and scatter plot charts. This attribute does not work if the zero line is also the baseline in the chart (that is, the chart must contain negative values). In the example, this property has been set to\n\n5\n\n.\n  |\n\n|\n|\n Grid Lines > X Zero Line Color\n  |\n Determines the color for the vertical \"zero line\" in bubble and scatter plot charts. This attribute does not work if the vertical zero line is the leftmost line in the chart (that is, the chart must contain negative values). In the example, the color has been set to red.\n  |\n\n|\n|\n Grid Lines > X Zero Line Width\n  |\n Determines the width of the vertical \"zero line\" in bubble and scatter plot charts. This attribute does not work if the zero line is the leftmost line in the chart (that is, the chart must contain negative values). In the example, this property has been set to\n\n5\n\n.\n  |\n\n|\n|\n Quadrant Lines > X Scale Value\n  |\n Allows you to set the value for the vertical quadrant line when creating a \"quadrant chart.\" If you do not specify a value for this property, no vertical quadrant line appears.\n\n\n The example shows a bubble chart in which both the X and Y scale quadrant lines have been set to the midpoint value of 50. This dissects the chart into four quadrants of equal area.\n  |\n\n|\n|\n Quadrant Lines > Y Scale Value\n  |\n Allows you to set the value for the horizontal quadrant line when creating a \"quadrant chart.\" If you do not specify a value for this property, no horizontal quadrant line appears.\n  |\n —\n  |\n|\n Regression Lines > Show Linear Regression Lines\n  |\n Allows you to add a regression line for each series in a scatter plot or bubble chart.\n  |\n\n|\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043428513\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004744\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nBubble Chart (Deprecated)\n\n", "article_total_view_count": "\n\n\n 4,951\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 10:28 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "bubble_chart_deprecated", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_content_in_domo", "url": "/s/topic/0TO5w000000ZamoGAC"}, {"text": "visualization_cards", "url": "/s/topic/0TO5w000000ZaoNGAS"}, {"text": "chart_types", "url": "/s/topic/0TO5w000000ZaoeGAC"}]}