{"file_path": "../../raw_kb_v2\\article\\360043434893\\index.html", "content": {"Title": "Bitbucket Connector", "Article Body": "Intro\n                       \n\n                        Atlassian Bitbucket is a web-based hosting service used for source code and development projects that use either Mercurial or Git revision control systems.  To learn more about the Bitbucket API, visit their page (\n                        \n                         https://confluence.atlassian.com/bit...222724129.html\n                        \n                        ).\n                       \n\n                        You connect to your Bitbucket account in the Data Center. This topic discusses the fields and menus that are specific to the Bitbucket connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Bitbucket account and create a DataSet, you must have either Bitbucket or Google credentials.\n                       \n\n                        Connecting to Your Bitbucket Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Bitbucket Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n                        Credentials Pane\n                       \n\n                        The Domo Bitbucket connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n                        \n\n                          Connect\n                         \n\n                        (or select\n                        \n\n                          Add Account\n                         \n\n                        if you have existing Bitbucket accounts in Domo) to open the Bitbucket OAuth screen where you can choose to enter either Bitbucket or Google credentials. Once you have entered valid credentials, you can use the same account any time you go to create a new Bitbucket DataSet. You can manage connector accounts in the\n                        \n\n                          Accounts\n                         \n\n                        tab in the\n                        \n                         Data Center\n                        \n                        . For more information about this tab, see\n                        \n                         Managing User Accounts for Connectors\n                        \n                        .\n                       \n\n\n\n\n\n\n\n                            Note:\n                           \n                           If you are already logged into Bitbucket when you connect in Domo, you are authenticated automatically when you click\n                           \n                            Add account\n                           \n                           . If you want to connect to an account that is different from the one you are logged into, you must first log out of Bitbucket.\n                          \n\n\n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Bitbucket report you want to run. The following reports are available:\n                           \n\n\n\n\n                               Get Directory Contents\n                              \n\n                               Returns the list of all the directory contents on the specified commit hash.\n                              \n\n\n\n\n                                List Users\n                               \n\n\n\n                                Returns a list of all users.\n                               \n\n\n\n\n\n                                List Users for Account\n                               \n\n\n\n                                Returns details of users for the provided account name.\n                               \n\n\n\n\n\n                                List Followers for Username\n                               \n\n\n\n                                Returns a list of followers for the specified account name.\n                               \n\n\n\n\n\n                                List Followings for Username\n                               \n\n\n\n                                Returns a list of followings for the specified account name.\n                               \n\n\n\n\n\n                                List Team Details\n                               \n\n\n\n                                Returns a list of team details for the specified team.\n                               \n\n\n\n\n\n                                List Team Members\n                               \n\n\n\n                                Returns a list of team members for the specified team.\n                               \n\n\n\n\n\n                                List Team Followers\n                               \n\n\n\n                                Returns a list of team followers for the specified team.\n                               \n\n\n\n\n\n                                List Team Following\n                               \n\n\n\n                                Returns a list of teams following the specified team.\n                               \n\n\n\n\n\n                                List Team Repositories\n                               \n\n\n\n                                Returns a list of team repositories for the specified team.\n                               \n\n\n\n\n\n                                List Pullrequest Activity\n                               \n\n\n\n                                Returns a list of Pullrequest activities for the specified owner and repository.\n                               \n\n\n\n\n\n                                List Pullrequest\n                               \n\n\n\n                                Returns a list of Pullrequests for the specified owner and repository.\n                               \n\n\n\n\n\n                                List Branch Restriction\n                               \n\n\n\n                                Returns a list of branch restriction for the specified account name and repository.\n                               \n\n\n\n\n\n                                List Repository Privileges\n                               \n\n\n\n                                Returns a list of repository privileges for the specified account name and repository.\n                               \n\n\n\n\n\n                                List All Public Repositories\n                               \n\n\n\n                                Returns a list of all public repositories.\n                               \n\n\n\n\n\n                                List All Repositories for Owner\n                               \n\n\n\n                                Returns a list of all Repositories for the specified owner.\n                               \n\n\n\n\n\n                                List Forks on a Repository for Owner\n                               \n\n\n\n                                Returns a list of repository forks for the specified owner and repository.\n                               \n\n\n\n\n\n                                List Watchers on a Repository for Owner\n                               \n\n\n\n                                Returns a list of watchers on a repository for the specified owner and repository.\n                               \n\n\n\n\n\n                                List Commits on a Repository for Owner\n                               \n\n\n\n                                Returns a list of commits on a repository for the specified owner and repository.\n                               \n\n\n\n\n\n                                List Events for Repository\n                               \n\n\n\n                                Returns a list of events for the specified account name and repository.\n                               \n\n\n\n\n\n                                List Issue Component for Repository\n                               \n\n\n\n                                Returns a list of issue components for the specified account name and repository.\n                               \n\n\n\n\n\n                                List Issue Versions for Repository\n                               \n\n\n\n                                Returns a list of issue versions for the specified account and repository.\n                               \n\n\n\n\n\n                                List Issue Milestone for Repository\n                               \n\n\n\n                                Returns a list of issue milestones for the specified account and repository.\n                               \n\n\n\n\n\n                                List Group Privileges on a Repository\n                               \n\n\n\n                                Returns a list of group privileges for the specified account, repository, owner, and group.\n                               \n\n\n\n\n\n                                List Account Emails\n                               \n\n\n\n                                Returns a list of account emails for the specified account.\n                               \n\n\n\n\n\n                                List Account Events\n                               \n\n\n\n                                Returns a list of account events for the specified account.\n                               \n\n\n\n\n\n\n\n\n\n                            Account Name\n                           \n\n\n\n                            Enter the name of the account you want to retrieve data for.\n                           \n\n\n\n\n\n                            Team Name\n                           \n\n\n\n                            Enter the name of the team you want to retrieve data for.\n                           \n\n\n\n\n\n                            Owner Name\n                           \n\n\n\n                            Enter the name of the repository owner you want to retrieve data for.\n                           \n\n\n\n\n\n                            Group Name\n                           \n\n\n\n                            Enter the name of the group you want to retrieve data for.\n                           \n\n\n\n\n\n                            Repository Name\n                           \n\n\n\n                            Enter the name of the repository you want to retrieve data for.\n                           \n\n\n\n\n\n                            Report State Date\n                           \n\n\n\n                            Select whether to pull data for a specific date or a relative number of days back from the date the report is run.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of days back you want to pull data for every time the report is run. For example, if you entered\n                            \n                             7\n                            \n                            , the report would pull data for the last 7 days every time it ran.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043434893", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003422", "Archived Date": "", "Language": "English", "Primary Version": "Bitbucket Connector", "Article Total View Count": "2,397", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:39 PM"}, "title": "\n              Bitbucket Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}