{"file_path": "../../raw_kb_v2\\article\\360042922994\\index.html", "content": {"Title": "Creating a SQL DataFlow", "Article Body": "Intro\n                       \n\n                        Create DataFlows to combine and transform your data using SQL queries. This is a more technical DataFlow solution than using Magic ETL but may provide a greater breadth of options. For information about creating a Magic ETL DataFlow, see\n                        \n                         Creating a Magic ETL DataFlow\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Input DataSets in a DataFlow cannot be restricted by PDP policies—all available rows\n                            \n                             must\n                            \n                            pass through the DataFlow. Because of this, you must apply PDP policies to the output DataSets generated by a DataFlow.\n                            \n\n\n                            When you build a DataFlow using an input DataSet with PDP policies in place, the DataFlow breaks unless at least one of the following criteria applies:\n                           \n\n\n\n                              You have an Admin security profile or a custom role with the Manage DataFlows grant enabled.\n                             \n\n\n\n                              You are the DataSet owner.\n                             \n\n\n\n                              You are part of the \"All Rows\" policy. This gives you access to all of the rows in the DataSet.\n                             \n\n\n\n                            For more information about using PDP with DataFlows, see\n                            \n                             PDP and DataFusions/DataFlows\n                            \n                            .\n                           \n\n\n\n\n\n\n                         You access the interface for creating a SQL\n                        \n                        DataFlow\n                        \n                         from the Data Center. For more information about the Data Center, see\n                        \n\n                         Data Center Layout\n                        \n\n                         .\n                        \n\n\n\n                         Video - MySQL DataFlow Overview\n                        \n\n\n\n\n\n\n\n\n\n\n\n                          Video - Combining DataSets Using DataFlows\n                         \n\n\n\n\n\n\n\n\n\n                        Creating a SQL DataFlow\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Redshift does\n                             \n                              not\n                             \n                             support stored procedures, as documented here:\n                            \n\n                             http://docs.aws.amazon.com/redshift/latest/dg/c_unsupported-postgresql-features.html\n                            \n                            . The alternative is to use a MySQL DataFlow, as MySQL does support stored procedures.\n                            \n\n\n\n\n\n\n\n\n                         To create a SQL DataFlow,\n                        \n\n\n\n\n                          In Domo, click\n                          \n\n                            Data\n                           \n\n                          in the toolbar at the top of the screen.\n                         \n\n\n\n                          Click\n                          \n                           SQL\n                          \n                          in the\n                          \n                           Magic Transform\n                          \n                          toolbar at the top of the window.\n                         \n\n\n\n\n\n\n\n\n                               Tip:\n                              \n\n                             You can also open the SQL DataFlow editor from anywhere in Domo by selecting\n                             \n                             in the app toolbar and selecting\n                             \n                              Data > SQL\n                             \n                             .\n                            \n\n\n\n\n\n\n                          Select the type of DataFlow you want to create.\n                          \n                          This opens the\n                          \n                           Create DataFlow\n                          \n                          view.\n                         \n\n\n\n                          Enter a name and description for the DataFlow.\n                         \n\n\n\n                          Select the input DataSets you want in the DataFlow by doing the following:\n                         \n\n\n\n\n\n                              Click\n                              \n                               Select DataSet\n                              \n                              .\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 Input DataSets in a DataFlow\n                                 \n                                  must\n                                 \n                                 already exist in Domo; you cannot upload new DataSets in the\n                                 \n                                  Create DataFlow\n                                 \n                                 view. For information about uploading new DataSets to Domo, see\n                                 \n                                  Connecting to Data with Connectors\n                                 \n                                 .\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n                                  Important:\n                                 \n                                 The name of the DataSet and each column's name in the DataSet\n                                 \n                                  MUST\n                                 \n                                 be 64 characters or less (including spaces.) This is a limitation of the MySQL engine but is not seen in Magic ETL.\n                                \n\n\n\n\n\n\n\n\n\n                           Select the desired DataSet.\n                           \n                           Information appears for the DataSet you selected, including the owner of the DataSet, details of its run history, column names, etc.\n                           \n\n\n\n\n\n                            Click\n                            \n                             Choose DataSet\n                            \n                            .\n                            \n                            A tile for the selected DataSet appears on the screen. You can click the DataSet tile to view the preview window.\n                           \n\n\n\n                              (Optional) Under the\n                              \n                               Select Columns\n                              \n                              tab, you can remove columns you don't want to include in the DataSet by clicking the \"X\" to the right of the column name, or remove all columns by clicking\n                              \n                               None\n                              \n                              .\n                              \n\n                              You can also add individual columns back into the DataSet by clicking\n                              \n                               Add Column\n                              \n                              and selecting the columns, or add all columns back into the DataSet by clicking\n                              \n                               All\n                              \n                              .\n                              \n\n\n\n\n\n\n                              (Select how the DataSet will be processed. Options include processing the Entire DataSet or Only new rows appended since the last DataFlow run.\n                             \n\n\n\n\n\n\n\n                                  Note:\n                                 \n                                 This feature is currently in Beta. To be added to the Beta, please reach out to your Customer Success Manager (CSM).\n                                \n\n\n\n\n\n\n\n\n\n\n\n\n\n                                  Important:\n                                 \n                                 You can only use the DataFlow append processing method if that input DataSet is configured to update with an append method. For more information on scheduling your DataSet with an append type update, see\n                                 \n                                  Basic Scheduling of a DataSet\n                                 \n                                 .\n                                \n\n\n\n\n\n\n\n\n\n\n\n                                   Tip:\n                                  \n\n                                 If your input DataSet has a large number of rows, try using the append processing method. This will allow your DataFlow to run much quicker if it's only processing the new rows.\n                                \n\n\n\n\n\n\n\n\n\n\n                            Select as many additional input DataSets as you want by repeating step 5.\n                           \n\n\n\n\n\n                          (Optional) Add transforms by doing the following:\n                         \n\n\n\n                            Click\n                            \n                             Add Transform\n                            \n                            .\n                            \n                            A\n                            \n                             Transform\n                            \n                            dialog appears with various options. For more detailed information about these options, see\n                            \n                             Understanding Transform and Output DataSet options\n                            \n                            .\n                           \n\n\n\n                            Enter SQL code to make the desired transformations to the input DataSet(s).\n                           \n\n\n\n                            Click\n                            \n                             Apply\n                            \n                            .\n                           \n\n\n\n\n\n                          Click\n                          \n                           Add Output DataSet\n                          \n                          .\n                          \n                          An\n                          \n                           Output DataSet\n                          \n                          dialog appears with various options. For more detailed information about these options, see\n                          \n                           Understanding Transform and Output DataSet options\n                          \n                          .\n                         \n\n\n\n                            Enter SQL code to indicate how you want the input DataSets to be combined.\n                            \n                            If you have transformed the input DataSets in the\n                            \n                             Transform\n                            \n                            dialog, those transformations are applied here.\n                           \n\n\n\n                            (Optional) Add additional output DataSets by repeating the previous two steps.\n                           \n\n\n\n                            Click\n                            \n                             Done\n                            \n                            .\n                           \n\n\n\n\n\n                          Schedule your DataFlow in the\n                          \n                           Settings\n                          \n                          pane. For more information on the different scheduling options, see\n                          \n                           Scheduling DataFlows\n                          \n                          .\n                         \n\n\n\n\n\n\n\n                              Note:\n                             \n                             If a schedule hasn't been specified, your DataFlow will default to a manual schedule.\n                            \n\n\n\n\n\n\n                          (Conditional) If you want to run the DataFlow in Strict Mode, click the\n                          \n                           Settings\n                          \n                          button at the top of the screen then toggle the\n                          \n                           Strict Mode\n                          \n                          option to on.\n                          \n                          For more information about this option, see\n                          \n                           Understanding Strict Mode\n                          \n                          .\n                          \n\n\n\n\n\n\n                          (Conditional) Do one of the following to save your DataFlow:\n                         \n\n\n\n                            If you want to run the script that outputs this DataFlow to a usable DataSet in Domo, click the orange down arrow in the upper right corner of the screen, select\n                            \n                             Save and Run\n                            \n                            , enter a version description if desired, then click\n                            \n                             Save\n                            \n                            to confirm.\n                            \n\n                            This starts the process of generating DataSets from the DataFlow. This generation process may take from a minute to an hour or more, depending on the size of the input DataSets. In addition to generating DataSets, a card for the DataFlow is added to the\n                            \n                             DataFlows\n                            \n                            listing in the Data Center.\n                           \n\n\n\n                            If you want to save this DataFlow without outputting it to DataSets at this time, click\n                            \n                             Save\n                            \n                            , enter a version description if desired, then click\n                            \n                             Save\n                            \n                            again to confirm. A card for the DataFlow is added to the\n                            \n                             DataFlows\n                            \n                            listing in the Data Center, but no DataSets are generated. You can run the DataFlow to output DataSets at any time by mousing over the card for the DataFlow in the\n                            \n                             DataFlows\n                            \n                            listing, clicking\n                            \n                            , and selecting\n                            \n                             Run\n                            \n                            . This option and the other options available in this menu are discussed later in this topic.\n                           \n\n\n\n\n\n                        When you save a DataFlow, an entry for this version is added to the\n                        \n                         Versions\n                        \n                        tab in the Details view for the DataFlow. If you entered a description when saving, that description is shown in the entry for the DataFlow. For more information about versions, see\n                        \n                         Viewing the Version History for a DataFlow\n                        \n                        .\n                       \n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Many users ask why output DataSets for a DataFlow are not marked as \"Updated\" when the DataFlow runs successfully. This is usually because the data has not actually changed—no update has occurred. Therefore, the DataSets do not show as updated.\n                           \n\n\n\n\n\n\n\n\n\n                        Understanding Transforms and Output DataSet options\n                       \n\n                        When creating a new transform, you can choose to create either a table- or SQL-type transform.\n                       \n\n\n\n                          A\n                          \n                           Table Transform\n                          \n                          creates a new table using a SELECT statement and will always generate an output table. Due to an output table being generated, you can create\n                          \n                           easy indexes\n                          \n                          based on these tables.\n                         \n\n\n\n                          A\n                          \n                           SQL Transform\n                          \n                          creates a table that typically doesn't include a SELECT statement such as a stored procedure. This type of transform does not generate an output table.\n                         \n\n\n\n                        Both Transforms and output DataSets support the\n                        \n                         Run to here\n                        \n                        option. With Run to here, you can choose to run the DataFlow only up to the selected transform. In the case of very large DataFlows with numerous transforms or outputs, this may help you save time when testing your DataFlow's code. To use this option, select\n                        \n                         Run to here\n                        \n                        in the wrench menu for the transform or output DataSet, or open the editor for the transform or output DataSet, click the arrow next to the\n                        \n                         Run SQL\n                        \n                        menu, and select\n                        \n                         Run to here\n                        \n                        .\n                       \n\n                        You can also add transforms either above or below a given transform in your DataFlow. To do this, select\n                        \n                         Add transform above\n                        \n                        or\n                        \n                         Add transform below\n                        \n                        in the wrench menu for the transform, then select whether you want to create a table- or SQL-type transform.\n                       \n\n                        The following screenshot shows you the main components of the\n                        \n                         Transform\n                        \n                        dialog.\n                        \n\n\n\n\n\n\n\n                        You can use the following table to learn more about these components:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Inputs/Transforms List\n                           \n\n\n\n                            Shows the names of all input DataSets you have selected for this DataFlow for your convenience in writing SQL statements. In addition, any previously created transforms appear here. These names appear in both the\n                            \n                             Transform\n                            \n                            and\n                            \n                             Output DataSet\n                            \n                            dialogs. If you transform one or more input DataSets in the\n                            \n                             Transform\n                            \n                            dialog, those transforms are applied to the input DataSets when you refer to them in the\n                            \n                             Output DataSet\n                            \n                            dialog.\n                           \n\n                            Clicking on an input DataSet opens a list of all columns in the DataSet and their data types (decimal, text, date/time, etc.).\n                           \n\n\n\n\n\n                            Run SQL menu\n                           \n\n\n\n                            Provides access to several options:\n                           \n\n\n\n\n\n\n                                 Run SQL\n                                \n                                . Lets you run a test to determine whether your SQL is valid.\n                               \n\n\n\n\n                                 Run to here\n                                \n                                . Runs all previous transforms to this point.\n                               \n\n\n\n\n                                 Explain SQL\n                                \n                                . Shows the explain plan for the SQL—an ordered list of the steps the database will make when executing the query. This can be used to help you optimize your queries. However, because these steps are highly complex and technical, this feature is recommended for advanced users only.\n                               \n\n\n\n\n\n\n\n\n                                     Note:\n                                    \n                                    Because MySQL determines which indexes are needed to improve run-time efficiency, not all of your index transforms may show up in the Explain SQL if MySQL determined that running the index would cause inefficiencies.\n                                   \n\n\n\n\n\n\n\n\n\n\n\n\n\n                            SQL field\n                           \n\n\n\n                            Lets you create SQL code to transform and/or combine your input DataSets. The field contains an autocomplete feature for your convenience in writing code.\n                           \n\n\n\n\n                           Preview button\n                          \n\n                           Expands/Collapses the preview area at the bottom of the pane after you have chosen\n                           \n                            Run SQL\n                           \n                           or\n                           \n                            Run to here\n                           \n                           .\n                          \n\n\n\n\n                        Previewing the data\n                       \n\n                        The preview will display in the transform after you have chosen\n                        \n                         Run SQL\n                        \n                        or\n                        \n                         Run to here\n                        \n                        . You can select options in the preview menu\n                        \n                        to allow you to change how the results are displayed in the preview table for easier viewing.\n                       \n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            These settings do not affect the transform itself or how the data will be output. It only affects how the results are displayed in the preview table.\n                           \n\n\n\n\n\n\n\n\n                        The following components are available:\n                       \n\n\n\n\n                           Component\n                          \n\n                           Description\n                          \n\n\n\n\n\n                           Display Text\n                          \n\n\n\n\n                              Default\n                             \n                             - Displays the text in the standard font.\n                            \n\n\n                              Monospace\n                             \n                             - Displays the text with more spacing in between the letters.\n                            \n\n\n\n\n\n\n\n\n                           Null Handling\n                          \n\n\n\n\n                              Advanced\n                             \n                             - Displays the word\n                             \n                              null\n                             \n                             or\n                             \n                              empty string\n                             \n                             to specify which type of value is being displayed in the column.\n                            \n\n\n                              Basic\n                             \n                             - Shows blank cells in the table. (This is the default setting.)\n                            \n\n\n\n\n\n                           Decimal Precision\n                          \n\n\n\n\n                              Default\n                             \n                             - Displays the number as it appears in the DataSet.\n                            \n\n\n                              Set\n                             \n                             - Displays a specified amount of decimal places.\n                            \n\n\n\n\n\n\n\n\n\n                        Easy indexing\n                       \n\n                        An index is a data structure that improves the speed of operations in a table. With\n                        \n                         Easy Indexing\n                        \n                        , you can quickly add an index on one or more columns right to your input DataSet or table transform.\n                       \n\n\n                         To create an index in an input DataSet or transform,\n                        \n\n\n\n\n                          Open the editor for the input DataSet or transform.\n                         \n\n\n\n                          Select the\n                          \n                           Indexing\n                          \n                          tab.\n                          \n\n\n\n\n\n\n                          Choose your Index Type.\n                         \n\n\n\n                          Select which column to apply the index.\n                         \n\n\n\n                          Click\n                          \n                           Done\n                          \n                          .\n                         \n\n\n\n\n\n                         Video - SQL Explain Plans\n                        \n\n\n\n\n\n\n\n\n                        Understanding Strict Mode\n                       \n\n                        Strict Mode controls how MySQL handles invalid or missing values in data-change statements and also affects the handling of division by zero, zero dates, and zeroes in dates. You can find more info at\n                        \n                         https://dev.mysql.com/doc/refman/5.6/en/sql-mode.html#sql-mode-strict\n                        \n                        .\n                       \n\n                        Best Practices for Creating DataFlows\n                       \n\n                        Each DataFlow should...\n                       \n\n\n\n                          include descriptive names for each step of the transformation.\n                         \n\n\n\n                          include a description of the input DataSets being merged or manipulated and the DataSet being created, and should also indicate the owner of the data.\n                         \n\n\n\n                          be named the same as the output DataFlow—Because the outputs of a Dataflow become their own DataSet in the Data Center, this allows for easy identification of which DataSets are produced by which DataFlows.", "Preview Article": "Click here to preview", "URL Name": "360042922994", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004593", "Archived Date": "", "Language": "English", "Primary Version": "Creating a SQL DataFlow", "Article Total View Count": "15,693", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Creating a SQL DataFlow\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               SQL DataFlows\n              \n", "url": "/s/topic/0TO5w000000Zao9GAC"}]}