{"file_path": "../../raw_kb_v2\\article\\360043439913\\index.html", "content": {"Title": "January 2018 Release Notes", "Article Body": "New features and enhancements\n                        \n\n\n                        Features and enhancements in this release include the following:\n                       \n\n                        CourseBuilder\n                       \n\n                        CourseBuilder is a proprietary eLearning authoring tool that publishes training modules as apps within Domo. It allows you to customize, brand, and scale your training efforts, all within an intuitive interface. You can also track data around how your users are interacting with the apps you create.\n                       \n\n                        Use Coursebuilder to...\n                       \n\n\n\n                          customize Domo training content for your own teams\n                         \n\n\n\n                          create ANY training and publish it into Domo\n                         \n\n\n\n                          present scalable content to anyone, anytime, anywhere via Domo\n                         \n\n\n\n                          track user behavior in Domo via Google Analytics\n                         \n\n\n\n                          allow ANY user to create, share, and present content in a scalable way.\n                         \n\n\n\n                        Anyone can use CourseBuilder. However, if you intend to publish a CourseBuilder app to Domo, you must have Editor-, Privileged-, or Admin-level rights.\n                       \n\n                        Ready to try it out? All you need to do is search for “CourseBuilder” in the Domo Appstore and select the download option appropriate for you. The download process is unique for Mac or PC, so review the instructions\n                        \n                         here\n                        \n                        to get up and running.\n                       \n\n\n\n\n                        DataSet QuickStarts\n                       \n\n                        Just created your first DataSet and not sure what you need to do next? Our new Quickstart tiles in the details view for the DataSet suggest a number of common \"next steps\" and provide links to the tools you'll need to carry out those steps. For example, you can click\n                        \n                         Create a Visualization\n                        \n                        to jump right into the Analyzer so you can create a card. Or, if you would prefer to clean up your data first, you can click\n                        \n                         Tidy Up This DataSet\n                        \n                        to jump into the DataFlows interface.\n                       \n\n\n\n\n                        For more information, see\n                        \n                         Data Center Layout\n                        \n                        .\n                       \n\n                        Projects and Tasks in Search Results\n                       \n\n                        Staying organized and on track doesn't have to mean remembering where everything is. Now Projects and Tasks are part of Domo's new global search and can be found as easily as typing in a search term.\n                        \n\n\n\n\n                        For more information, see\n                        \n                         Searching in Domo\n                        \n                        .\n                       \n\n                        New Maps: United Kingdom Postal and France Department\n                       \n\n                        Our repertoire of country maps now includes a map representing postal regions in the United Kingdom and another representing department-level regions in France.\n                       \n\n\n\n\n\n\n\n\n\n                        For more information, see\n                        \n                         Country Map\n                        \n                        .\n                       \n\n                        Getting Help\n                       \n\n                        You can view the latest release notes information in the Help Center, which you can access from Domo by clicking\n                        \n\n                         > Help Center\n                        \n                        .\n                       \n\n                        If you have questions about Domo,\n                       \n\n\n\n                          search for a topic in the Help Center\n                         \n\n\n\n                          train in Domo University at\n                          \n                           http://www.domo.com/university\n                          \n\n\n\n\n                          get answers in the Domo Community at\n                          \n                           https://dojo.domo.com\n                          \n\n\n\n\n                          contact Technical Support by entering a help ticket in the Domo Support Portal, by sending a Buzz message to\n                          \n                           \\support,\n                          \n                          or by emailing\n                          \n                           support@domo.com\n                          \n                          .\n                         \n\n\n\n                          reach out to your Domo Customer Success Manager or Technical Consultant\n                         \n\n\n\n                        If you have feedback, please send it from within Domo (\n                        \n\n                         > Feedback\n                        \n                        ). Or send an email to\n                        \n                         product.feedback@domo.com\n                        \n                        .\n                       \n\n                        For more information about getting help, see\n                        \n                         Getting Help\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439913", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004434", "Archived Date": "", "Language": "English", "Primary Version": "January 2018 Release Notes", "Article Total View Count": "4,670", "": "", "Article Created Date": "10/24/2022, 10:09 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              January 2018 Release Notes\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Release Notes\n              \n", "url": "/s/topic/0TO5w000000ZamwGAC"}, {"text": "\n\n               Archived Feature Release Notes\n              \n", "url": "/s/topic/0TO5w000000Zan7GAC"}]}