{"file_path": "../../raw_kb_v2\\article\\360042932734\\index.html", "content": {"Title": "Connecting to ODBC Data in Workbench 5", "Article Body": "Intro\n                       \n\n                        You can create an ODBC DataSet Job in Workbench 5. When you select ODBC as your Data Source type, you can provide the details of your connection and configure your query.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Workbench 5 determines at runtime whether you are using a 32- or 64-bit version of Windows; thus you are not asked to specify a version.\n                           \n\n\n\n\n\n\n\n                        Connecting to ODBC Data\n                       \n\n\n                         To create an ODBC DataSet job in Workbench 5,\n                        \n\n\n\n\n                          Click the\n                          \n                          icon in the left-hand icon bar.\n                         \n\n\n\n                          Click the \"+\" button in the top right corner of the jobs listing pane.\n                         \n\n\n\n                          Select the desired account (Domo instance) in the\n                          \n                           Domo Domain\n                          \n                          dropdown menu.\n                          \n                          If you have only one account set up, that account is already chosen for you and the menu is unavailable.\n                         \n\n\n\n                          In the\n                          \n                           Name\n                          \n                          field, enter a name for the DataSet Job.\n                          \n                          This is the name of the job as it appears in Workbench,\n                          \n                           not\n                          \n                          the name of the uploaded DataSet in Domo.\n                         \n\n\n\n                          In the\n                          \n                           Transport Type\n                          \n                          menu, select\n                          \n                           ODBC Connection Provider\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Reader Type\n                          \n                          menu, select\n                          \n                           Database Query\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           DataSet Name\n                          \n                          field, enter the name of the DataSet. This is the name of the uploaded DataSet in Domo.\n                          \n                          This is the\n                          \n                           only\n                          \n                          setting you can change after saving the new job.\n                         \n\n\n\n                          In the\n                          \n                           DataSet Type\n                          \n                          field, select the type of DataSet in the dropdown.\n                          \n                          The DataSet type you select or enter here is reflected as the connector type in Domo after you execute the job.\n                         \n\n\n\n                          Enter a description for the DataSet if desired.\n                          \n                          This is the description of the DataSet as it appears in Domo.\n                         \n\n\n\n                          Click\n                          \n                           Create\n                          \n                          .\n                          \n\n                          A new ODBC DataSet Job is added to the list of jobs for the currently authenticated account. Note that after creating the job, you cannot edit any of the settings you just configured except for the DataSet name. If you want to change any of the other settings, you must create a new job.\n                         \n\n\n\n                          Click the\n                          \n                           Configure\n                          \n                          subtab.\n                         \n\n\n\n                          Click the\n                          \n                           Edit\n                          \n                          button under \"Source.\"\n                          \n\n                          A panel opens with options for configuring your ODBC connection and defining your query.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Workbench only executes one query. If you need to execute more than one query can handle, please create a stored procedure and use Workbench to execute the store procedure.\n                            \n\n\n\n\n\n\n                          In the\n                          \n                           Connection Type\n                          \n                          field, select a connection option.\n                          \n\n                          The following table describes the available options:\n                         \n\n\n\n\n\n                              Option\n                             \n\n\n\n                              Description\n                             \n\n\n\n\n\n\n\n                              System DSN\n                             \n\n\n\n                              You select the DSN to use for the desired DataSet from all of the DSNs available in your system. You can indicate whether credentials are required.\n                             \n\n\n\n\n\n\n\n\n\n\n\n                                    Notes:\n                                   \n\n\n\n\n\n\n                                     When uploading data from an ODBC DataSet, you must specify an existing Data Source Name (DSN). You can create a DSN using the Windows ODBC Data Source Administrator. (You can access the the Windows ODBC Data Source Administrator by entering \"ODBC\" in the Start Menu search, then selecting \"Data Sources (ODBC)\".) For more information about creating a DSN, refer to the Windows ODBC Help (by searching for \"ODBC\" in Windows Help and Support) or view the training video in\n                                     \n                                      above\n                                     \n                                     . For information about configuring a MySQL driver, see\n                                     \n                                      How can I improve the performance of a MySQL driver?\n                                     \n\n\n\n\n\n\n                                     For information about defining DataSet names (DSNs) and using Open Database Connectivity (ODBC) to access data, refer to documentation for ODBC.\n                                    \n\n\n\n\n\n                                     By default, the ODBC connection uses the settings defined in the DSN. This means that queries that could potentially be detrimental to databases that are allowed to be sent through the ODBC connection when previewing and executing jobs. This includes statements such as\n                                     \n                                      alter\n                                     \n                                     ,\n                                     \n                                      delete\n                                     \n                                     ,\n                                     \n                                      create table\n                                     \n                                     ,\n                                     \n                                      insert into\n                                     \n                                     , etc. If you want to prevent Workbench from being able to execute such commands, you must make these changes in the DSN.\n                                    \n\n\n\n\n\n\n\n\n\n\n\n\n                              Connection Builder\n                             \n\n\n\n                              You enter details for your ODBC connection, such as login credentials, driver, server URL, database name, port, timeout value, and connection parameters.\n                             \n\n\n\n\n\n                              Connection String\n                             \n\n\n\n                              You enter a single string for your connection.\n                             \n\n\n\n\n\n\n\n                          (Conditional) Do one of the following:\n                         \n\n\n\n                            If you selected\n                            \n                             System DSN\n                            \n                            as your\n                            \n                             Connection Type\n                            \n                            ...\n                           \n\n\n\n                              In the\n                              \n                               System DSN\n                              \n                              menu, select the desired system DSN from those available in your system.\n                             \n\n\n\n                              (Conditional) If this DSN connection requires credentials to connect, set\n                              \n                               Required Credentials\n                              \n                              to \"On,\" then enter your username and password in the appropriate fields. Otherwise set\n                              \n                               Required Credentials\n                              \n                              to \"Off.\"\n                             \n\n\n\n\n\n                            If you selected\n                            \n                             Connection Builder\n                            \n                            as your\n                            \n                             Connection Type\n                            \n                            ...\n                           \n\n\n\n                              Enter the appropriate information in the fields.\n                              \n\n                              Some parameters may or may not be required, depending on your connection.\n                              \n\n                              You can use the following table for reference:\n                             \n\n\n\n\n\n                                  Field\n                                 \n\n\n\n                                  Description\n                                 \n\n\n\n\n\n\n\n                                  Driver\n                                 \n\n\n\n                                  Specify the name of the driver used to access the database.\n                                  \n\n\n\n\n\n\n\n\n\n\n\n                                       Note:\n                                      \n                                      By default, Windows machines come with drivers for MSSQL and other Microsoft products. If you want to connect to a non-Microsoft database (e.g. Oracle, MySQL, PostgreSQL, Mongo, DB2, SAP HANA, etc.), you will need to obtain and install the appropriate driver.\n                                     \n\n\n\n\n\n\n\n\n\n                                  Server\n                                 \n\n\n\n                                  Specify the server name or URL for the database.\n                                 \n\n\n\n\n\n                                  Database\n                                 \n\n\n\n                                  Specify the name of the database to access.\n                                 \n\n\n\n\n\n                                  Port\n                                 \n\n\n\n                                  Enter the port number where the database is found. The default port is the MySQL port.\n                                 \n\n\n\n\n\n                                  Timeout\n                                 \n\n\n\n                                  Enter the desired timeout value in seconds that the connection is kept alive before it is refreshed from the DataSet.\n                                 \n\n\n\n\n\n                                  Username\n                                 \n\n\n\n                                  Specify the username you use to connect to the database.\n                                 \n\n\n\n\n\n                                  Password\n                                 \n\n\n\n                                  Specify the password you use to connect to the database.\n                                 \n\n\n\n\n\n                                  Connection Parameters\n                                 \n\n\n\n                                  Specify parameters for connecting to the DataSet.\n                                 \n\n\n\n\n\n\n\n\n\n                            If you selected\n                            \n                             Connection String\n                            \n                            as your\n                            \n                             Connection Type\n                            \n                            ...\n                           \n\n\n\n                              Enter a connection string to connect to the data source.\n                             \n\n\n\n\n\n\n\n                          Click\n                          \n                           Apply\n                          \n\n                           .\n                          \n\n\n\n\n                          Click the\n                          \n                           Edit\n                          \n                          button under \"Processing.\"\n                         \n\n\n\n                          Set a timeout value in the\n                          \n                           Query Execution Timeout\n                          \n                          menu.\n                          \n                          This is the amount of time in seconds before a long-running job times out.\n                         \n\n\n\n                          In the\n                          \n                           Query\n                          \n\n\n                          pane, enter a query for the data you want to retrieve. For example:\n                          \n\n\n                           SELECT\n                           \n                           order_audit_id,\n                           \n                           user_name,\n                           \n                           customer_name,\n                           \n                           order_source,\n                           \n                           order_total,\n                           \n                           created\n                           \n                           FROM order_audit\n                          \n\n\n\n\n                          (Optional) Define replacement variables for columns in the DataSet in the\n                          \n                           Replacement Variables\n                          \n                          and\n                          \n                           Global Replacement Variables\n                          \n                          tabs. For each replacement variable...\n                         \n\n\n\n                            Select the applicable column in the\n                            \n                             Column Section\n                            \n                            .\n                           \n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               The\n                               \n                                Column\n                               \n                               name is case sensitive and must match the column name found in the\n                               \n\n                                 Schema Subtab\n                                \n\n                               .\n                              \n\n\n\n\n\n\n                            Define replacement variables for the selected column in the\n                            \n                             Value\n                            \n                            section.\n                           \n\n\n\n\n\n                                Variable Type\n                               \n\n\n\n                                Description\n                               \n\n\n\n\n\n\n\n\n                                 lastvalue\n                                \n\n\n\n\n\n                                 lastvalue\n                                \n                                variables keep track of relevant fields for the last row of data that was sent with the most recent upload for the associated job. The syntax is\n                               \n\n\n                                 !{lastvalue:_name_}!\n                                \n\n\n\n                                 lastvalue\n                                \n                                variables values are updated by Workbench after an upload finishes.\n                                \n                                 lastvalue\n                                \n                                variables are stored in the job (\n                                \n                                 .xml\n                                \n                                ) file. This variable lets you construct a query that gets only the \"new\" rows each time it runs. For example, if your data has a column with a row \"id\" that increments with each new row, you can construct a query containing\n                               \n\n\n                                 !{lastvalue:id}!\n                                \n\n\n                                similar to the following:\n                               \n\n\n                                 select id, name, type, sales from tablename where id > !{lastvalue:id}! order by id\n                                \n\n\n                                In this example, the column \"id\"\n                                \n                                 must\n                                \n                                be in the\n                                \n                                 SELECT\n                                \n                                ,\n                                \n                                 WHERE\n                                \n                                , and\n                                \n                                 ORDER BY\n                                \n                                clauses for the variable to be used and updated.\n                               \n\n                                When uploading this job, Workbench replaces the\n                               \n\n\n                                 !{lastvalue:id}!\n                                \n\n\n                                variable with the current value of \"id\". After finishing the upload, Workbench stores the last uploaded value of \"id\" in the job (\n                                \n                                 .xml\n                                \n                                ) file.\n                               \n\n\n\n\n\n\n\n\n\n                                    Note:\n                                   \n                                   You\n                                   \n                                    must\n                                   \n                                   include any column you reference with a\n                                   \n                                    lastvalue\n                                   \n                                   variable in your\n                                   \n                                    SELECT\n                                   \n                                   ,\n                                   \n                                    WHERE\n                                   \n                                   , and\n                                   \n                                    ORDER BY\n                                   \n                                   clauses in order for the variable to be used and updated after the data upload.\n                                  \n\n\n\n\n\n\n\n\n\n                                 previewonly\n                                \n\n\n\n\n                                Used to indicate that certain actions should take place when loading a preview in Workbench. For example, you could request that your preview return only 100 rows of data instead of the 1,000,000 present in the data source. The syntax is\n                               \n\n\n                                 !{previewonly:Statement}!\n                                \n\n\n\n\n\n\n\n\n\n\n                          Click\n                          \n                           Apply\n                          \n                          .\n                         \n\n\n\n                          Select the desired update method in the\n                          \n                           Update Method\n                          \n                          menu:\n                         \n\n\n\n                            Select\n                            \n                             Replace DataSet\n                            \n                            if you want the DataSet to be replaced entirely upon updating.\n                           \n\n\n\n                            Select\n                            \n                             Append to DataSet\n                            \n                            if you want new data to be added to the existing data set upon updating.\n                           \n\n\n\n\n\n                        You are now ready to execute the DataSet Job, thereby creating an ODBC DataSet in Domo. However, there are many other actions you can take on the DataSet Job before you send it to Domo. These include the following:\n                       \n\n\n\n\n                           Scheduling a Job in Workbench 5\n                          \n\n\n\n\n\n                           Configuring notifications to be sent when the job update succeeds or fails\n                          \n\n\n\n\n\n                           Encrypting and decrypting Workbench data\n                          \n\n\n\n\n\n                           Creating new columns using calculations\n                          \n\n\n\n\n\n                           Setting a custom date format on a column\n                          \n\n\n\n\n\n                           Replacing a value in a column\n                          \n\n\n\n\n\n                           Combining DataSets\n                          \n\n\n\n\n\n                           Applying filters to columns\n                          \n\n\n\n\n\n                           Setting impersonation\n                          \n                          (which causes Workbench to run the job as an Active Directory user).", "Preview Article": "Click here to preview", "URL Name": "360042932734", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004825", "Archived Date": "", "Language": "English", "Primary Version": "Connecting to ODBC Data in Workbench 5", "Article Total View Count": "5,696", "": "", "Article Created Date": "10/24/2022, 10:31 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Connecting to ODBC Data in Workbench 5\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Workbench\n              \n", "url": "/s/topic/0TO5w000000ZaoPGAS"}, {"text": "\n\n               Workbench 5\n              \n", "url": "/s/topic/0TO5w000000ZapTGAS"}]}