{"file_path": "../../raw_kb_v2\\article\\360042929014\\index.html", "content": {"Title": "Qubole Connector", "Article Body": "Intro\n                       \n\n                        Qubole simplifies the provisioning, management and scaling of big data analytics workloads leveraging data stored on Amazon Web Services, Google Compute, or Microsoft Azure infrastructure.  To learn more about the Qubole API, visit their page (\n                        \n                         http://docs.qubole.com/en/latest/rest-api/\n                        \n                        ).\n                       \n\n                        You connect to your Qubole account in the Data Center. This topic discusses the fields and menus that are specific to the Qubole connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Qubole account and create a DataSet, you must have a Qubole API token. To find your API token, navigate to\n                        \n                         https://api.qubole.com/v2/control-panel\n                        \n                        and click the\n                        \n                         My Accounts\n                        \n                        tab in the left pane. Click\n                        \n                         Show\n                        \n                        for the account and copy the API token that is displayed.\n                       \n\n                        Connecting to Your Qubole Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Qubole Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Qubole account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Qubole API Token\n                           \n\n\n\n                            Enter your Qubole API token. For more information about obtaining an API token, see \"Prerequisites,\" above.\n                           \n\n\n\n\n\n                            Domain\n                           \n\n\n\n                            Select the domain you want to retrieve data from.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Qubole credentials, you can use the same account any time you go to create a new Qubole DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Qubole report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Account Information\n                               \n\n\n\n                                View the details of the current account.\n                               \n\n\n\n\n\n                                All Commands\n                               \n\n\n\n                                Returns the \"All Commands\" report containing the query metrics.\n                               \n\n\n\n\n\n                                Bootstrap\n                               \n\n\n\n                                Return details for a Hive bootstrap in the account.\n                               \n\n\n\n\n\n                                Cluster Metrics\n                               \n\n\n\n                                Returns metrics for running clusters.\n                               \n\n\n\n\n\n                                Cluster Nodes\n                               \n\n\n\n                                Returns data about cluster nodes.\n                               \n\n\n\n\n\n                                Cluster Usage\n                               \n\n\n\n                                Returns cluster usage data.\n                               \n\n\n\n\n\n                                Command Status\n                               \n\n\n\n                                Returns the status for any command within the last 30 days.\n                               \n\n\n\n\n\n                                Command Status with Results\n                               \n\n\n\n                                Returns the command status and its results from the last 30 days.\n                               \n\n\n\n\n\n                                Groups with Specific Role\n                               \n\n\n\n                                Returns a list of groups assigned with a specific role.\n                               \n\n\n\n\n\n                                Hadoop Jobs\n                               \n\n\n\n                                Returns details of the Hadoop jobs spawned on a cluster from the last 30 days.\n                               \n\n\n\n\n\n                                List Actions\n                               \n\n\n\n                                Returns a list of actions run by the scheduler.\n                               \n\n\n\n\n\n                                List Clusters\n                               \n\n\n\n                                Returns configuration details of all clusters in the account.\n                               \n\n\n\n\n\n                                List Command Templates\n                               \n\n\n\n                                Returns a list of command templates.\n                               \n\n\n\n\n\n                                List Data Stores\n                               \n\n\n\n                                Returns a list of data stores.\n                               \n\n\n\n\n\n                                List Schedule Actions\n                               \n\n\n\n                                Returns a list of actions run for a scheduler.\n                               \n\n\n\n\n\n                                List Schedules\n                               \n\n\n\n                                Returns all existing schedules created to run command automatically at a certain frequency within a specified interval.\n                               \n\n\n\n\n\n                                Monthly Usage\n                               \n\n\n\n                                Returns monthly usage details for an account.\n                               \n\n\n\n\n\n                                Object Policy\n                               \n\n\n\n                                Returns policies set for an individual object, notebook, or cluster.\n                               \n\n\n\n\n\n                                Pending Users\n                               \n\n\n\n                                Returns users in an account who are awaiting approval.\n                               \n\n\n\n\n\n                                Qubole Computer Unit Hour\n                               \n\n\n\n                                Returns Qubole Computer Unit Hour (QCUH) details for a specific AWS account.\n                               \n\n\n\n\n\n                                Roles Mapped to Group\n                               \n\n\n\n                                Returns all roles mapped to a given Qubole group.\n                               \n\n\n\n\n\n                                Table Definition\n                               \n\n\n\n                                Returns the Hive table definition as well as the AVRO table schema.\n                               \n\n\n\n\n\n                                Table Properties\n                               \n\n\n\n                                Returns the Hive table properties.\n                               \n\n\n\n\n\n                                Tables in Data Store\n                               \n\n\n\n                                Returns all tables in a data store.\n                               \n\n\n\n\n\n                                Users\n                               \n\n\n\n                                Returns users for an account.\n                               \n\n\n\n\n\n                                Users in Existing Group\n                               \n\n\n\n                                Returns all users in a given Qubole group.\n                               \n\n\n\n\n\n                                View Command History\n                               \n\n\n\n                                Returns the command history.\n                               \n\n\n\n\n\n\n\n\n\n                            Command ID\n                           \n\n\n\n                            Select the command you want to retrieve data for.\n                           \n\n\n\n\n\n                            Cluster ID\n                           \n\n\n\n                            Select the cluster you want to retrieve data for.\n                           \n\n\n\n\n\n                            Schedule ID\n                           \n\n\n\n                            Select the schedule you want to retrieve data for.\n                           \n\n\n\n\n\n                            Commands for All Users?\n                           \n\n\n\n                            Select\n                            \n                             Yes\n                            \n                            if you want your report to show commands for all users. Select\n                            \n                             No\n                            \n                            to show commands for the current user only.\n                           \n\n\n\n\n\n                            Include Query Parameters?\n                           \n\n\n\n                            Select\n                            \n                             Yes\n                            \n                            if you want your report to include query properties such as \"tags\" and \"query history comments.\" Otherwise select\n                            \n                             No\n                            \n                            .\n                           \n\n\n\n\n\n                            Include Secret and Keys?\n                           \n\n\n\n                            Select\n                            \n                             Yes\n                            \n                            if you want your report to display \"Private Key,\" \"Public Key,\" and \"Secret.\" Otherwise select\n                            \n                             No\n                            \n                            .\n                           \n\n\n\n\n\n                            Metrics Type\n                           \n\n\n\n                            Select the metrics type you want to retrieve data for.\n                           \n\n\n\n\n                               Aggregated Cluster Metrics\n                              \n                              returns metrics values across clusters.\n                             \n\n\n\n\n                               Hadoop Metrics\n                              \n                              returns metrics values related to JobTracker.\n                             \n\n\n\n\n                               System Metrics\n                              \n                              returns metrics values for the specified host.\n                             \n\n\n\n\n\n\n\n                            Metrics\n                           \n\n\n\n                            Select the metrics you want to show in your report.\n                           \n\n\n\n\n\n                            Hadoop Metrics\n                           \n\n\n\n                            Select the Hadoop metrics you want to show in your report.\n                           \n\n\n\n\n\n                            Host Name\n                           \n\n\n\n                            Enter the host name (private DNS name) for which metrics values are required.\n                           \n\n\n\n\n\n                            Account ID (Optional)\n                           \n\n\n\n                            Enter the ID of the account you want to retrieve data for. If you do not enter an ID, data will be returned for the current user.\n                           \n\n\n\n\n\n                            Interval\n                           \n\n\n\n                            Select the interval for which metrics values are required.\n                           \n\n\n\n\n\n                            Group\n                           \n\n\n\n                            Select the ID of the group you want to retrieve data for.\n                           \n\n\n\n\n\n                            Role ID\n                           \n\n\n\n                            Select the role you want to retrieve data for.\n                           \n\n\n\n\n\n                            Schema\n                           \n\n\n\n                            Select the schema with data you want to pull into Domo.\n                           \n\n\n\n\n\n                            Table\n                           \n\n\n\n                            Select the table with data you want to pull into Domo.\n                           \n\n\n\n\n\n                            Data Store\n                           \n\n\n\n                            Select the data store with data you want to pull into Domo.\n                           \n\n\n\n\n\n                            Sort Column\n                           \n\n\n\n                            Select whether you want to sort your data by CPU, Bytes Read, Bytes Written, or Time (default).\n                           \n\n\n\n\n\n                            Clusters\n                           \n\n\n\n                            Select the clusters you want to retrieve usage data for.\n                           \n\n\n\n\n\n                            Date From\n                           \n\n\n\n                            Select whether you want the start date in your report to be a specific date or a relative number of days back from today's date.\n                           \n\n\n\n\n\n                            Specific Start Date\n                           \n\n\n\n                            Select the start date for your report.\n                           \n\n\n\n\n\n                            Date From Offset\n                           \n\n\n\n                            Select the number of days back from today you want as the first date in your report.\n                           \n\n\n\n\n\n                            Date To\n                           \n\n\n\n                            Select whether you want the end date in your report to be a specific date or a relative number of days back from today's date.\n                           \n\n\n\n\n\n                            Specific End Date\n                           \n\n\n\n                            Select the end date for your report.\n                           \n\n\n\n\n\n                            Date To Offset\n                           \n\n\n\n                            Select the number of days back from today you want as the last date in your report.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360042929014", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003551", "Archived Date": "", "Language": "English", "Primary Version": "Qubole Connector", "Article Total View Count": "2,366", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Qubole Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}