{"file_path": "../../raw_kb_v2\\article\\360043884834\\index.html", "content": {"title": "\n\n\n Google Maps Pinboard Implementation Guide\n\n\n", "article_body": "\n\nIntro\n-------\n\nThank you for choosing to install the Google Maps Pinboard App! This guide is intended to help you connect this app with your own data. The first steps are making sure that the app's DataFlow has been properly downloaded from the Appstore and that your data is in the correct format to be used correctly by the app.\n\n\n Prerequisites\n----------------\n\nThis app utilizes a tool called the Grid Builder that maps your data to the schema the app requires. If you are not already familiar with Grid Builder, please read our Grid Builder walkthrough\n\nhere\n\n. Though it not required, it is also useful to have a working knowledge of how MySQL query works as well.\n\n\n Below is diagram that shows the order in which your data will be fed through the DataFlow and then output to the Google Maps Pinboard App.\n\nWhen you are familiar with how the Grid Builder works, follow these next steps to make sure that the app and the DataFlow have been properly deployed to your instance in Domo:\n\n If you have purchased the Google Maps Pinboard App through the Domo Appstore, first make sure that you have selected the\n **Try It**\n button on the app's page in order to deploy the app and its DataFlow to your instance. You will be asked to name the page where you'd like the app to live in Domo.\n* Double check that the DataFlow has been properly deployed to your instance. To do this, navigate the the Data Center by clicking the Data button located in the top left corner of Domo (see image below for example.)\n* Select\n **DataFlows**\n on the left side of the Data Center screen, then use the Data Center's search bar to search for \"Google Maps Pinboard\". You should see a DataFlow that matches the name you searched for.\n* If you've followed these steps and you still aren't able to locate the app on the page you've created or its DataFlow in the Data Center, contact Technical Support. For information on how to contact Support, please see:\n\nGetting Help\n\n.\n\nStep 1: Prepare Your Data\n---------------------------\n\nThe Google Maps Pinboard shows location data through display pins on the map - this means that you'll need to get your data into a format where each row of data represents a location and the corresponding columns represent quantitative or qualitative data for location. A location can be listed on more than one row and the app will then aggregate the data for that specific location when the data is run. Part of the location data that is required by the app is the location's latitude and longitude.\n\n\n If you do not have longitude and latitude data, you can obtain it in one of three ways:\n\n. Use a geocoding application to get longitude and latitude for you location data\n2. Join your data to a government database to get approximate longitudes and latitudes, this is usually done by zip code or your country's equivalent\n3. Contact your Domo consultant contact for assistance in obtaining longitude and latitude for you location data or contact Technical Support. For information on how to contact Support, please see:\n\nGetting Help\n\n.\n\nHere is an example of what your data might look like:\n\nThe app has five required fields called: \"ID\", \"Date\", \"Node\", \"Latitude\", and \"Longitude\".\n\n\n \"ID\" is a location's ID and \"Node\" is a location's name. However, if you do not have location ID numbers, you can use a location name instead for both the \"ID\" and \"Node\" columns. Additionally, if you don't have a \"Date\" field in your data, you can choose to use the current date for that required column instead.\n\n\n The column labeled \"Sales\" and \"Region\" are examples of additional quantitative and qualitative columns that you might include for display in the app or to use as filters. You may have as many of additional columns as you'd like.\n\nYou can use more than one DataSet as source data for the app, as long as the data can be joined together using your date and/or location columns. Information on how to do joins in the Grid Builder will be found in later sections of this guide. It is also worth noting that the app can do simple calculations to calculate metrics. For example, if you had a \"Sales\" column, as in the example DataSet above, then a column with a count of employees at each location would be done like the following:\n `SUM(Sales)/AVG(Employees)`\n , this calculation would give you sales per employee.\n\n\n It is usually better to calculate ratios in the app later, rather than beforehand in the actual DataFlow. Note that there will be more on creating metric calculations in later sections of this guide.\n\n\n The Google Maps Pinboard App can only display a limited number of pins at a time, between 3000 and 5000 pins. If you have more locations to be displayed, consider how you might aggregate or narrow down the number of locations or set filters to only display a smaller portion of locations at a time.\n\nStep 2: Add Your Source Data to the DataFlow\n----------------------------------------------\n\nAs soon as you have successfully prepped your data, you will then need to navigate to the DataFlow in Domo and add your data as inputs to your app's DataFlow. Follow these next steps to add your data:\n\n First, navigate the the Data Center by clicking the Data button located in the top left corner of Domo (see image below for example.)\n* Once in the Data Center, select\n **DataFlows**\n from the left side of the screen. Search for \"Google Maps Pinboard\" in the Data Center's search bar - you should see a DataFlow labeled \"Google Maps Pinboard\".\n* Select the Google Maps Pinboard DataFlow and go into the detail view, then click on the pencil icon on the right side of the page to edit the DataFlow.\n* Remove the sample DataSet, \"Google Maps Store Sample\", by clicking the\n **x**\n on the upper right corner of the DataSet. Keep the \"Google Maps Pinboard - Grid Builder\" and \"Google Maps Pinboard - Settings\" as inputs in the DataFlow.\n* Click the\n **Select DataSet**\n button, then add your DataSets to the DataFlow.\n* After you have added your DataSets, scroll to the bottom of the page and select the\n **Save**\n button.\n* Navigate back to the Data Center in Domo.\n\n\n Step 3: Edit the Grid Builder\n-------------------------------\n\nFor this third step you will need to edit the appropriate fields in the Grid Builder in order to match your input data.\n\n*Important:**\n This guide presents the basic set of steps needed, but for a more comprehensive tutorial on how the Grid Builder works please review the\n\nGrid Builder Walkthrough\n\n. To see the correct column order, scroll down to \"3. The MYSQL columns (SELECT, FROM, WHERE, GROUP BY, AS)\".\n\nAs you make changes, it may be wise to copy your work into an Excel Spreadsheet to track all of your changes, in case your web browser encounters any errors throughout the process.\n\n\n Follow these steps for editing the Grid Builder:\n\n Navigate to the Grid Builder webform that came with the app, it will be named \"Google Maps Pinboard - Grid Builder\". Select\n **DataSets**\n from the left side of the Data Center and search for \"Google Maps Pinboard - Grid Builder\". Select that dataset then in the details view click the wrench icon on the right side, then select\n **Edit Webform**\n .\n* This app doesn't usually use a date filter, but if you like to include one refer to the\n\nGrid Builder Walkthrough\n\n.\n* Under the FROM column, change the value on the C100 row to match the name of your first DataSet (see #1 in example image below.)\n* Under the SELECT column, replace the row values with the column names in your DataSet, which should now be listed in the FROM column. The first five rows (C100-C500) are the required fields. On the first row, enter the name of the column from your data that you'd like to use as the location ID. Remember, that if you don't have a location ID, you can use a location name column here instead. On the second row, enter the name of your date column, if you have one, or leave the value as \"CURRENT\\_DATE()\" if you'd like the use the current date instead. For the third row use your location name column. On the fourth and fifth rows, use your latitude and longitude columns, respectively. Note that these five rows MUST be in this order (see #2 in the example image below.)\n\n In the SELECT column, enter the names of the columns in your DataSet that you'd like to use as additional quantitative columns for metrics and qualitative columns for filters.\n* In the AS column, do not change the values at all in the first five rows, these are the names that your data is being mapped and the app's DataFlow is expecting. For the rows that have information for your additional quantitative and qualitative metrics, you can either re-enter those columns in this column or choose new names for those column, if you'd like (see #3 in the example image above.)\n* The \"Include\" column should either be left blank or there should be a \"1\" in each row that you've entered your information into (see #4 in the example image above.)\n* If you are joining additional tables, repeat this process for any additional tables you'd like to join. Each new DataSet should be assigned to the next set of 100's values in the \"C\" column. Additional joins usually use LEFT for the \"JoinType\" and join on the date and location from your first DataSet. For example, your join condition might be: C100.Node =\n `C200.Location AND C100.Date = C200.Date`\n .  Edit the \"JoinType\" and \"JoinCondition\" columns and for more information on joins in the Grid Builder please refer to the\n\nGrid Builder Walkthrough\n\n(see #5 in the example image above.)\n* As soon as you have your DataSet information entered, you'll then need to configure your filters. On the rows in Grid Builder that you'd like to use as your filters, you'll need to update the three filter columns with these rows: \"FilterId\", \"FilterName\", and \"FilterInputType\".\n* Starting from top to bottom, on each row that will be used as a filter, assign each a number starting from 1 and incrementing for each following row in the \"FilterId\" column. Name your filter in the \"FilterName\" column and then choose either \"Multi Select\" or \"Single Select\" for the value in the \"FilterInputType\" column. (Refer to the\n\nGrid Builder Walkthrough\n\nfor more information on what the Multi Select and Single Select filter types do.)\n* Lastly, select\n **Save & Continue**\n at the top of the page to save the DataSet.\n\nAs soon as you've made the necessary changes to the Grid Builder, go to the Data Center and run the Google Maps Pinboard DataFlow. If the DataFlow runs successfully, then you've most likely edited the Grid Builder correctly. If you encounter any errors along the way, review\n\nGrid Builder Walkthrough\n\nor contact Technical Support. For information on how to contact Support, please see:\n\nGetting Help\n\n.\n\n\n Step 4: Edit the Metrics Form\n-------------------------------\n\nThe final step for setting up the app is editing the Metrics form.\n\n*Important:**\n Columns must be used as filters or metrics to be usable in the app.\n\nFollow these steps to edit the Metrics form:\n\n In the Data Center, navigate to the Metrics form, it will be named \"Google Maps Pinboard - Metrics\".\n* Select the DataSet and then select the wrench menu to edit the webform.\n\n For each metric that you would like displayed in the app, fill out a row in the form. The first column is the \"Id\" column, so assign a number starting from 1 and increment onward for the preceding rows for each metric.\n* In the \"Name\" column, enter the name of the metric that you'd like displayed in the app.\n* In the \"Calculation\" column, enter the calculation for each metric. Note that only simple calculations are supported, you can use simple sums, averages, max, and min. Calculations include: \"SUM(column)\" or \"AVG(column)\", simple single operations \"SUM(columnA)\" + \"SUM(columnB)\" or \"SUM(columnA)\" \\* MIN(columnB)\" or ratio calculations \"SUM(columnA)/\"SUM(columnB) \\* 100\". More complicated calculations will need to be calculated in part beforehand in the Grid Builder.\n* In the \"DataType\" column, enter \"Currency\", \"Number\", or \"Percent\"- this tells the app how to display your metrics.\n* In the \"SortHighToLow\" column, put \"true\" if you want the metric's bar chart to display highest to lowest. Input \"false\" if you'd like the metric's bar chart to display lowest to highest.\n* In the \"UnitOfMeasurement\" column, write the unit of the metric, or leave the row blank. (Ex: Dollars, People, Referrals, etc.)\n* In the \"Description\" column, write a short description about the metric, or leave the row blank.\n\nStep 5: Validation\n--------------------\n\nNow that you have configured the Grid Builder and the Metrics form, you should now be ready to check your app in order to validate your metrics. We suggest that you follow this process for validation:\n\n. Build KPI cards to test your metrics, build these cards based off of your source data and not the app's output data. For example, if you are displaying sales by location in the app, build a bar chart type card that displays sales per location and, if applicable, have the date range in the KPI card match one of the date ranges that your app displays.\n2. Compare your data in the KPI card and the data in the app. Remember to make sure that your filtering options and date ranges match between the app and the KPI card.\n3. If you do find any discrepancies, check to see if you need to change any join conditions or groupings in the Grid Builder. Be sure to also double check any calculations you have.\n4. Repeat this process for any metrics that you need to validate.\n\n\n####\n Congratulations!\n\nYour Google Maps Pinboard App should now be good to go! Enjoy getting the best value out of your data. If you have any further questions or need help troubleshooting, contact Technical Support. For information on how to contact Support, please see:\n\nGetting Help\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360043884834\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004151\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nGoogle Maps Pinboard Implementation Guide\n\n", "article_total_view_count": "\n\n\n 4,693\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:26 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "google_maps_pinboard_implementation_guide", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "creating_custom_visualizations", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "available_apps", "url": "/s/topic/0TO5w000000Zan9GAC"}]}