{"file_path": "../../raw_kb_v2\\article\\360043432133\\index.html", "content": {"Title": "Zift Solutions Connector", "Article Body": "Intro\n                       \n\n\n                         Zift Solutions (formerly known as Elastic Grid) maximizes lead generation for resellers and brands by delivering a marketplace used to access, create and publish marketing campaigns.\n                        \n                        You connect to your Zift Solutions account in the Data Center. This topic discusses the fields and menus that are specific to the Zift Solutions connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your Zift Solutions account and create a DataSet, you must have the following:\n                       \n\n\n\n                          An Zift Solutions client ID\n                         \n\n\n\n                          An Zift Solutions client secret\n                         \n\n\n\n                        To obtain these credentials, reach out to your Zift Solutions representative.\n                       \n\n                        Connecting to Your Zift Solutions Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the Zift Solutions Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your Zift Solutions account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n\n                            Client ID\n                           \n\n\n\n                            Enter your Zift Solutions client ID.\n                           \n\n\n\n\n\n                            Client Secret\n                           \n\n\n\n                            Enter your Zift Solutions client secret.\n                           \n\n\n\n\n\n\n                         Once you have entered valid Zift Solutions credentials, you can use the same account any time you go to create a new Zift Solutions DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the Zift Solutions report you want to run. The following reports are available:\n                           \n\n\n\n\n\n                                Advanced Data for Customer Engagement\n                               \n\n\n\n                                Returns an advanced set of customer engagement data that can be used to access details about customer interaction on campaign micro-sites.\n                               \n\n\n\n\n\n                                Advanced Data for Partner Engagement\n                               \n\n\n\n                                Returns an advanced set of partner engagement data used to access campaign metrics by partner company.\n                               \n\n\n\n\n\n                                Advanced Data for Collateral Vendor\n                               \n\n\n\n                                Returns itemized download information including name, file, language, campaign, solutions, and more.\n                               \n\n\n\n\n\n                                Advanced Data for Partner Execution\n                               \n\n\n\n                                Returns an advanced set of partner execution data, including traffic, language, status and user information for each execution. The data set can be segmented by any applicable global filters.\n                               \n\n\n\n\n\n                                Chart Data for Partner Engagement\n                               \n\n\n\n                                Returns charting data, including individual metric totals.\n                               \n\n\n\n\n\n                                Chart Data for Partner Execution\n                               \n\n\n\n                                Returns charting data, including individual metric totals by date.\n                               \n\n\n\n\n\n                                Grid Data for Partner Engagement\n                               \n\n\n\n                                Returns tabulated metrics grouped by campaign per partner company.\n                               \n\n\n\n\n\n                                Grid Data for Partner Execution\n                               \n\n\n\n                                Returns tabulated metrics grouped by the individual execution.\n                               \n\n\n\n\n\n                                Paginated Data for Customer Engagement\n                               \n\n\n\n                                Returns a simple set of customer engagement data that can be used to access high-level details about customer interaction on campaign micro-sites.\n                               \n\n\n\n\n\n                                Paginated Data for Partner Engagement\n                               \n\n\n\n                                Returns a simple set of partner engagement data.\n                               \n\n\n\n\n\n                                Partner Deals Summary\n                               \n\n\n\n                                Returns a summary of deals data recorded in the Lead CRM, including information like total number of deals in progress and their status.\n                               \n\n\n\n\n\n                                Partner Deals Advanced\n                               \n\n\n\n                                Returns all data recorded in the Lead CRM including complete lead contact details and deal data.\n                               \n\n\n\n\n\n                                Paginated Data for Partner Deals\n                               \n\n\n\n                                Returns data recorded in the Lead CRM for deals, including lead name, customer, maturity, and close value.\n                               \n\n\n\n\n\n                                Simple Data for Partner Execution\n                               \n\n\n\n                                Returns all data recorded in the Lead CRM such as contact details and deal data.\n                               \n\n\n\n\n\n                                Simple Paginated Data for Collateral Vendor\n                               \n\n\n\n                                Returns aggregated collateral download information by file.\n                               \n\n\n\n\n\n                                Total Per Day Data for Customer Engagement\n                               \n\n\n\n                                Returns a total count of the requested data metric (e.g. Leads, Visits, etc.) broken down by daily totals for the requested period.\n                               \n\n\n\n\n\n                                Total Per Day Data for Partner Engagement\n                               \n\n\n\n                                Returns a total count of the requested data metric (e.g. Leads, Visits, etc.) broken down by daily totals for the requested period.\n                               \n\n\n\n\n\n                                Vendor Tracking Emails\n                               \n\n\n\n                                Returns email metrics such as number of emails sent and delivered, bounces, etc.\n                               \n\n\n\n\n\n                                Vendor Tracking Visits\n                               \n\n\n\n                                Returns lead visit information for campaigns including partner, source, and region information.\n                               \n\n\n\n\n\n                                Vendor Lead Data\n                               \n\n\n\n                                Returns lead totals for campaigns including partner, source, and region information.\n                               \n\n\n\n\n\n                                Vendor Campaign Details\n                               \n\n\n\n                                Returns vendor campaign data.\n                               \n\n\n\n\n\n                                Vendor Collateral Performance\n                               \n\n\n\n                                Returns itemized download information.\n                               \n\n\n\n\n\n\n\n\n                           Vendor ID\n                          \n\n                           Enter the ID of the vendor you want to retrieve information for.\n                          \n\n\n\n                           Metric\n                          \n\n                           Select the metric you want to retrieve information for.\n                          \n\n\n\n                           Breakdown Value\n                          \n\n                           Select how you would like the data in your report to be broken down.\n                          \n\n\n\n                           Country (Optional)\n                          \n\n                           Check the boxes for all countries you want to retrieve data for. If you do not select any countries, data will be returned for all countries.\n                          \n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n                           Partner User ID\n                          \n\n                           Enter the user ID of the partner you want to retrieve information for.\n                          \n\n\n\n                           Partner Company ID\n                          \n\n                           Enter the company ID of the partner you want to retrieve information for.\n                          \n\n\n\n                           Language\n                          \n\n                           Enter the language you want to return results for, e.g.\n                           \n                            en-US\n                           \n                           for American English.\n                          \n\n\n\n                           Maturity\n                          \n\n\n                            Enter the single-digit number representing the maturity you want to retrieve information for. You can use the following table for help:\n                           \n\n\n\n\n\n                                Number\n                               \n\n\n\n                                Maturity\n                               \n\n\n\n\n\n\n\n                                0\n                               \n\n\n\n                                All\n                               \n\n\n\n\n\n                                1\n                               \n\n\n\n                                Leads\n                               \n\n\n\n\n\n                                2\n                               \n\n\n\n                                Opportunity in progress\n                               \n\n\n\n\n\n                                3\n                               \n\n\n\n                                Opportunity on hold\n                               \n\n\n\n\n\n                                4\n                               \n\n\n\n                                Won\n                               \n\n\n\n\n\n                                5\n                               \n\n\n\n                                Lost\n                               \n\n\n\n\n\n\n\n\n                           Grid Vendor Campaign ID\n                          \n\n                           Enter the Grid Vendor Campaign ID you want to retrieve information for.\n                          \n\n\n\n                           Source\n                          \n\n                           Enter the unique identifier for the Source. Enter\n                           \n                            0\n                           \n                           for all,\n                           \n                            1\n                           \n                           for Direct, or\n                           \n                            2\n                           \n                           for Anonymous.\n                          \n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        FAQ\n                       \n\n                        How often can the data be updated?\n                       \n\n                        As often as needed.\n                       \n\n                        Are there any API limits I should be aware of?\n                       \n\n                        No.", "Preview Article": "Click here to preview", "URL Name": "360043432133", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003695", "Archived Date": "", "Language": "English", "Primary Version": "Zift Solutions Connector", "Article Total View Count": "2,358", "": "", "Article Created Date": "10/24/2022, 9:14 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Zift Solutions Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}