{"file_path": "../../raw_kb_v2\\article\\360043427773\\index.html", "content": {"Title": "Old Magic ETL Tiles: Scripting", "Article Body": "Note:\n                             \n                             This feature is available\n                             \n                              on demand and paid\n                             \n                             .\n                            \n\n\n\n\n                            To request this feature be enabled,\n                           \n\n\n\n                              Reach out to your Domo Customer Success Manager, Technical Consultant, or AE.\n                             \n\n\n\n                              If you do not have contact information for your CSM, TC, or AE, contact Technical Support by using /Support in Buzz or by email at\n                              \n                               support@domo.com\n                              \n\n\n\n\n                            Depending on the feature, you may be required to complete training before you can use the feature.\n                           \n\n\n\n\n\n                        Intro\n                       \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           This article is for the old Magic ETL. For information on the new Magic ETL, see\n                           \n                            Magic ETL\n                           \n                           .\n                          \n\n\n\n\n                        Scripting tiles are a powerful tool within Domo's Magic ETL feature. They allow you to write custom R or Python algorithms and implement them directly into DataFlows. With this, you can create complex data science analyses that run every time your data updates.\n                       \n\n                        General Information for All Scripting Tiles\n                       \n\n                        This section provides information pertinent to all scripting tiles in Magic ETL. For information on specific tiles, click on any of the following links to jump to the section for that tile:\n                       \n\n\n\n\n                           Python Package API Reference\n                          \n\n\n\n\n\n                           R Package API Reference\n                          \n\n\n\n\n                        Take A Tour\n                       \n\n                        All scripting tiles have the same look. The only difference between them is the supported language.\n                       \n\n                        The main body of the tile is the code editor. This is where you write your script. It includes syntax highlighting for the specific language the tile supports.\n                       \n\n\n\n\n                        On the right side of the tile is a searchable list of input tiles currently connected to the scripting tile. Click on the name of an input to inject a code snippet into the script at the location of the cursor. This code snippet will read the data into the script and store it in a variable. Rename the variable to whatever you would like.\n                       \n\n\n\n\n                        There is a second tab on the right side of the tile called\n                        \n                         Packages\n                        \n                        . When you click the tab, a searchable list of available packages for the supported language is displayed. Hover over the package name for a description, or click on the arrow that appears to go to the package's documentation website. As with inputs, if you click on a package, a code snippet is injected into the script at the location of the cursor. This code snippet imports the selected library for use in the script.\n                       \n\n\n\n\n                        On the right side of the tile editor panel toolbar is a template icon button\n                        \n                        . Clicking this button resets the script to the example code template that exists when you first open a scripting tile. Be careful though—if you have already written a script, clicking this button overwrites your script (after a confirmation prompt). However, as long as you do not close the tile, you can retrieve your overwritten script by placing the cursor within the code editor and pressing Command+z or CTRL+z.\n                       \n\n                        In the\n                        \n                         Schema\n                        \n                        tab, you tell the tile what the results of your script looks like. To use this, click\n                        \n                         Schema\n                        \n                        in the tile editor panel toolbar. For a deep dive into this tab, see the\n                        \n                         Populating the Resulting Schema\n                        \n                        section of this documentation.\n                       \n\n\n\n\n                        In the\n                        \n                         Console\n                        \n                        tab, you can see the standard out (\n                        \n                         stdout\n                        \n                        ) and standard error (\n                        \n                         stderr\n                        \n                        ) that your script produces. This tab is not available until after preview is run on the tile, when it will appear as an option in the tile editor panel toolbar.\n                       \n\n\n\n\n                        In the\n                        \n                         Preview\n                        \n                        tab, you can see the results of running your script. This tab also does not appear until after a preview is run. It will then appear as an option in the tile editor panel toolbar.\n                       \n\n\n\n\n\n\n                        Getting Data In and Out of the Scripting Action\n                       \n\n                        Domo provides a basic API for importing data (read) from the Domo ecosystem into your script and then for exporting your results out (writing) of the script and back into the Domo ecosystem. The API is different for each scripting language and tries to follow the semantics of the language.\n                       \n\n\n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             Be aware of the following data type issues when using scripting tiles in Domo:\n                            \n\n\n\n\n                              In Python, LONG becomes DOUBLE in Python because NumPY does not support NULLs in integer columns.\n                             \n\n\n\n                              In both Python and R, DECIMAL becomes DOUBLE because there is no analogous type in NumPY or R.\n                             \n\n\n\n\n\n\n\n\n\n                        The easiest way to see the specific API calls for your language is to examine the initial code template that is provided in a newly created and connected Scripting tile.\n                       \n\n                        Step 1: Import The Domo Package\n                       \n\n                        The first line in any script should be used for importing the language-specific Domo package into the script. This follows standard package import semantics for the chosen language. It is part of the initial code template. Alternatively, you can search for \"domo\" in the\n                        \n                         Packages\n                        \n                        list to the right of the code editor and click on the package to inject the code snippet into the editor.\n                       \n\n                        Step 2: Read Data Into The Script\n                       \n\n                        The next step in writing a script is getting access to the data. Each language will have its own semantic version of a Domo \"read\" method. This is included in the initial code template. Alternatively, you can click on one of the inputs in the input list to the right of the code editor. This injects a code snippet that is reading the input data and storing it in a variable. You can rename this variable if you like.\n                       \n\n                        Step 3: Export Data Out Of The Script\n                       \n\n                        The last step in writing a script is returning the results to the Domo ecosystem. Each language has its own semantic version of a Domo \"write\" method. This is also included in the initial code template. There is no other way of injecting a code snippet for this, however. Provide the name of the variable that is storing the results of your script to this \"write\" method.\n                        \n                         There can only be one export per script.\n                        \n\n\n                        Populating The Resulting Schema\n                       \n\n                        There are three ways to tell the tile what schema your script produces. These methods can be mixed and matched as necessary to get the proper result. You perform all of these in the\n                        \n                         Schema\n                        \n                        tab of the tile.\n                       \n\n                        Manually Adding the Columns\n                       \n\n                        To add the columns manually...\n                       \n\n\n\n                          Type the name of a column that your script will produce into the\n                          \n                           Column Name\n                          \n                          field.\n                          \n\n\n\n\n\n\n                          In the list of available data types, select the data type for this column.\n                          \n\n\n\n\n\n\n                          Add another column by clicking the\n                          \n                           Add Column button\n                          \n                          .\n                          \n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Important:\n                             \n                             All added columns\n                             \n                              must\n                             \n                             be filled out in order for the tile to be considered configured.\n                            \n\n\n\n\n\n\n                        Bulk Adding the Columns\n                       \n\n                        To add the columns in bulk...\n                       \n\n                        1. Add all of the columns from a particular \"Input DataSet\" tile in bulk by clicking on the\n                        \n                         Add From DataSet\n                        \n                        button and selecting the \"Input DataSet\" tile you want to populate from.\n                        \n\n\n\n\n                        2. Remove any excess columns using the \"X\" button on the far right side of the column.\n                        \n\n\n\n\n                        Letting Domo Run The Script\n                       \n\n                        To have Domo run the script for you...\n                       \n\n\n                         Click either the\n                         \n                         button on the right side of the tile editor panel toolbar or the\n                         \n                          Run Preview\n                         \n                         button in the toolbar at the top of the canvas. (If there is an issue with your preview, see the\n                         \n                          Troubleshooting\n                         \n                         section of this documentation.)\n                         \n\n                         After the preview has finished running, a sentence appears under the text inputs for creating new columns. This tells you how many columns the preview returned that are not currently listed as being part of the tile's schema.\n                         \n\n\n                         Click the button at the end of the sentence.\n                        \n\n\n                        After you populate the schema, the tile knows what the results of your script look like and will be marked as configured (as long as you have also written a script).\n                       \n\n                        The columns listed in the\n                        \n                         Schema\n                        \n                        tab will be passed to the next tile in the DataFlow.\n                       \n\n                        Configuration Steps\n                       \n\n                        If you have not done so already, check out the\n                        \n                         Take a Tour\n                        \n                        section of this article to become familiar with the different features of the scripting tile.\n                       \n\n\n\n                          Start a new Magic ETL DataFlow.\n                         \n\n\n\n                          Drag an \"Input DataSet\" tile onto the canvas and select the DataSet you want to use.\n                          \n\n                          You will find the Scripting tiles under the \"Data Science\" section of the left sidebar.\n                         \n\n\n\n                          Drag the Scripting tile for the language you want to write onto the canvas and then drag a connection from the \"Input DataSet\" to this Scripting tile.\n                          \n\n\n\n\n\n\n                          (Conditional) If the editor panel is not open at the bottom of the screen, click the Scripting tile you just added to the canvas so that it is selected; the editor panel will then open.\n                          \n\n                          The code editor will be auto-populated with an initial code template. For more information on what is included in the template, see the\n                          \n                           Getting Data In and Out of the Scripting Action\n                          \n                          section of this documentation. A yellow banner will also be displayed. Ignore this for now; it will be addressed later on in the configuration steps.\n                          \n\n                          You will see that the template is pulling the data from the \"Input DataSet\" tile that is connected to the Scripting tile and storing it in a variable. This is the variable that your script should manipulate.\n                          \n\n\n\n\n\n\n                          (Conditional) If you have multiple data sources, simply drag out another \"Input DataSet,\" select the next DataSet you need, connect this tile to the Scripting Action, and add another import statement to the script.\n                          \n\n\n\n\n                          Underneath the line that is creating the variable to hold your data, you will see a space for you to write your script.\n                          \n\n\n\n\n\n\n                          Write your script in the line provided, making sure that the export statement at the very bottom of the template is exporting the variable that represents the final product of your script.\n                          \n\n                          You will notice that your tile is still not marked as configured and there is still a yellow banner at the top of the tile telling you this. This is because the tile does not yet know what the result of your script looks like.\n                         \n\n\n\n                          To provide the tile with this information...\n                         \n\n\n\n                            Click the\n                            \n                             Schema\n                            \n                            tab in the toolbar of the tile editor panel.\n                           \n\n\n\n                            Choose one of the methods listed in the\n                            \n                             Populating The Resulting Schema\n                            \n                            section of this article and follow the steps there. Afterwards, continue the rest of the steps listed below.\n                           \n\n\n\n\n\n                          Drag an \"Output DataSet\" tile from the sidebar and drop it onto the canvas.\n                         \n\n\n\n                          Drag a connection from the Scripting tile to this new \"Output DataSet\" tile.\n                          \n\n\n\n\n\n\n\n\n                          Open the \"Output DataSet\" tile and give it a name and description.\n                          \n\n                          The tiles within the DataFlow are now fully configured.\n                         \n\n\n\n                          Next, enter a name for the DataFlow in the field in the top left corner.\n                         \n\n\n\n                          Configure the settings in the panel using the\n                          \n                           Settings\n                          \n                          button in the canvas toolbar.\n                         \n\n\n\n                          Save the DataFlow.\n                         \n\n\n\n                        Congratulations! You have created a DataFlow that utilizes a Scripting tile. This has been a very basic configuration that only uses a single Input DataSet tile, a single Scripting tile, and a single Output DataSet tile. Don't forget that you can still use all of the classic DataFlow tiles to manipulate the data before and after your Scripting tile.\n                       \n\n                        API Reference\n                       \n\n                        domomagic is the simple API provided to both the Magic ETL \"Python Action\" and \"R Action\" authors, allowing them to load and unload data to and from the Python and R contexts.\n                       \n\n                        Python Module API Reference\n                       \n\n\n\n\n\n                            Method Signature\n                           \n\n\n\n                            Parameters\n                           \n\n\n\n                            Returns\n                           \n\n\n\n\n\n\n\n\n                             read_dataframe(input_name=None)\n                            \n\n\n\n\n\n                             input_name:\n                            \n                            Name of the Magic ETL input tile. Not required if only one input is available.\n                           \n\n\n\n                            A Pandas DataFrame representing the tiles input.\n                           \n\n\n\n\n\n\n                             write_dataframe(dataframe)\n                            \n\n\n\n\n\n                             dataframe:\n                            \n                            Pandas DataFrame that will be used as the output for the Magic ETL tile.\n                           \n\n\n                           N/A\n                          \n\n\n\n\n                            read_array(column_name,input_name=None)\n                           \n\n\n\n                            column_name\n                           \n                           : Name of the column.\n                           \n\n\n                            input_name:\n                           \n                           Name of the Magic ETL input tile. Not required if only one input is available.\n                          \n\n                           A single column from the input as a NumPy array.\n                          \n\n\n\n\n                            read_array_dict(input_name=None)\n                           \n\n\n\n                            input_name:\n                           \n                           Name of the Magic ETL input tile. Not required if only one input is available.\n                          \n\n                           The input as an OrderedDict of column names mapping to NumPy arrays.\n                          \n\n\n\n\n                            write_array_dict(array_dict)\n                           \n\n\n\n                            array_dict\n                           \n                           : The dictionary of column names mapping to NumPy arrays as output to the Magic ETL context. The arrays must be of equal length.\n                          \n\n                           N/A\n                          \n\n\n\n\n                        R Package API Reference\n                       \n\n\n\n\n\n                            Method Signature\n                           \n\n\n\n                            Parameters\n                           \n\n\n\n                            Returns\n                           \n\n\n\n\n\n\n                             read.dataframe(\n                             \n                              input.name\n                             \n                             =NULL, see below)\n                            \n\n\n\n\n\n\n                              input.name\n                             \n\n\n                             :\n                            \n                            Name of the Magic ETL input tile. Optional if only one input is available.\n                           \n\n\n\n                            The tiles input data.frame.\n                           \n\n\n\n\n\n\n                             write.dataframe(table)\n                            \n\n\n\n\n\n                             table\n                            \n\n                             :\n                            \n                            Exports a data.frame or matrix as the output for a Magic ETL tile.\n                           \n\n\n\n                            N/A\n                           \n\n\n\n\n\n                        The R Package\n                        \n                         read.dataframe\n                        \n                        function also supports the following parameters that allow you to customize its behavior:\n                       \n\n\n\n\n\n                            Parameter\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n\n                             colClasses\n                            \n\n\n\n\n                            A named character vector of classes to be assigned to the named columns.\n                           \n\n\n\n\n\n\n                             stringsAsFactors\n                            \n\n\n\n\n                            Logical value determining whether or not string columns will be read as factors. Defaults to false, and is overridden by colClasses.\n                           \n\n\n\n\n\n\n                             integersAsNumerics\n                            \n\n\n\n\n                            Logical value determining whether integers should be read as numerics (floating point numbers). Defaults to true, and is overridden by colClasses.\n                           \n\n\n\n\n\n\n                             allVerbatimExcept\n                            \n\n\n\n\n                            Character vector of column names which should be read according to default behavior. All other columns will be read in verbatim as strings and written out with their original types. Useful when translation to and from the R context is causing loss of precision or errors and the column is not necessary for the calculation being performed.\n                           \n\n\n\n\n\n\n                             allIgnoredExcept\n                            \n\n\n\n\n                            Character vector of column names which will be read. All other columns will be ignored.\n                           \n\n\n\n\n\n                        Troubleshooting\n                       \n\n\n\n                          If your tile is not marked as configured after writing the script, make sure you have provided a resulting schema. See the\n                          \n                           Populating The Resulting Schema\n                          \n                          section of this article for more info.\n                         \n\n\n\n                          Running a preview is the easiest way to get feedback on the behavior of your script. You can run a preview by clicking the preview button on the right side of the tile editor panel toolbar or the preview button in the toolbar at the top of the canvas.\n                         \n\n\n\n                          After running a preview, a\n                          \n                           Console\n                          \n                          tab appears in the tile editor panel toolbar. This displays the standard out (\n                          \n                           stdout\n                          \n                          ) and standard error (\n                          \n                           stderr\n                          \n                          ) that your script produces. If the preview fails, check this console for errors.\n                         \n\n\n\n                          If a script is failing, check that you have properly finished all three of the steps listed in the\n                          \n                           Getting Data In and Out of the Scripting Action\n                          \n                          section of this article. Double-check the variable name that you are writing back to Domo to make sure it is correct.\n                         \n\n\n\n                          Previews run on just a sample of your dataset. If your script requires a certain variability in data to function properly, the sample grabbed by the preview might not meet this variability requirement. You can control the size of the preview sample by changing the\n                          \n                           Row Limit\n                          \n                          in the canvas toolbar.\n                         \n\n\n\n\n\n\n\n\n\n\n                               Note:\n                              \n\n\n\n                             Note that larger sample sizes will result in longer preview run times.\n                            \n\n\n\n\n\n\n                          Have you explicitly imported the packages/libraries that you need for your script to run? A list of available packages is in the\n                          \n                           Package\n                          \n                          tab of the section to the right of the code editor.\n                         \n\n\n\n                          If a column is resulting in all null values, it could mean that the column is not actually produced by your script. If a column is provided in the list in the\n                          \n                           Schema\n                          \n                          tab, that column is added to the results regardless of whether the script actually produces it or not. If the script does not produce that column, then all of the values for that column are set to null. You can see which of your columns are and are not created by the script by running a preview and then looking at the\n                          \n                           Schema\n                          \n                          tab. The status of each column will be displayed to the right of the column data type.\n                         \n\n\n\n                          If your script is failing during runtime with an out of memory error, your input DataSet could be too large or your script could be doing some sort of join that is causing the data to explode. Try filtering the data before it gets injected into the scripting tile and/or refactoring your script to prevent data explosion.", "Preview Article": "Click here to preview", "URL Name": "360043427773", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000002990", "Archived Date": "", "Language": "English", "Primary Version": "Old Magic ETL Tiles: Scripting", "Article Total View Count": "5,212", "": "", "Article Created Date": "10/24/2022, 8:58 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Old Magic ETL Tiles: Scripting\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}, {"text": "\n\n               Tiles\n              \n", "url": "/s/topic/0TO5w000000ZdTHGA0"}]}