{"file_path": "../../raw_kb_v2\\article\\360043439133\\index.html", "content": {"Title": "Configure User Language in Domo", "Article Body": "Intro\n                       \n\n                        You can set the interface language for your entire Domo instance as well as for individual users. Supported languages include:\n                       \n\n\n                         Dutch\n                        \n\n                         English\n                        \n\n                         French\n                        \n\n                         German\n                        \n\n                         Japanese\n                        \n\n                         Portuguese\n                        \n\n                         Simplified Chinese\n                        \n\n                         Spanish\n                        \n\n\n\n\n                          Video - Domo Language Settings\n                         \n\n\n\n\n\n\n\n\n\n\n\n\n\n                        Set the Global Language\n                       \n\n                        You can change the global language for the Domo user interface in the browser version as well as in mobile applications.\n                       \n\n                        Web Version\n                       \n\n                        Users with an Admin default security role or a custom role with the Manage All Company Settings grant enabled can configure the global language for their instance by going to\n                        \n                         More >\n                        \n\n                         Admin > Company settings > Company overview > Language\n                        \n                        then selecting the desired language. To save the setting and apply it for all users you must click the\n                        \n                         Save\n                        \n                        button. This changes the user interface language for all users. We recommend that you notify your users before changing the language settings.\n                       \n\n\n\n\n                        Mobile Version\n                       \n\n                        The language for the Domo mobile applications on iOS and Android match the language of the device. To change the language of the application you must change your device language. If you use a language that is not currently supported, the application will default to English.\n                       \n\n                        Set the Language for an Individual User\n                       \n\n                        For Domo users whose primary language differs from the global language set by their company, Domo provides the ability to set the interface language on a user basis. You can make this change in either of two places:\n                       \n\n\n\n                          The Domo login screen, or\n                         \n\n\n\n                          the user settings screen, available by clicking your profile picture and then clicking the globe/gear icon.\n                         \n\n\n\n                        To set your individual user language from the Domo login screen, select your desired language from the language menu under the login panel.\n                       \n\n\n\n                        Follow these steps to set your individual user language from the user\n                        \n                         Settings\n                        \n                        :\n                       \n\n\n\n                          In the navigation header, select your profile picture.\n                         \n\n\n\n\n\n\n                          Select\n                          \n\n                           Settings\n                          \n                          .\n                         \n\n\n\n                         The user\n                         \n                          Settings\n                         \n                         page displays.\n                         \n\n\n\n\n\n                          Under\n                          \n                           Language\n                          \n                          expand the menu to view the available languages and select the language you want.\n                         \n\n\n\n\n\n\n\n\n\n                              Note:\n                             \n                             If this option is locked it means your company has included\n                             \n                              Locale\n                             \n                             as a managed attribute. To get this changed, contact your Domo admin.\n                            \n\n\n\n\n\n\n\n\n\n\n                        This changes the user interface language to match that of the language you have selected. Formatting conventions based on your region will also now be used to display numerical, financial, and date/time values based on your region. You can reset the language at any time by selecting\n                        \n                         Reset to Company Settings\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "360043439133", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003055", "Archived Date": "", "Language": "English", "Primary Version": "Configure User Language in Domo", "Article Total View Count": "5,007", "": "", "Article Created Date": "10/24/2022, 9:09 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Configure User Language in Domo\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Specifying Company Settings\n              \n", "url": "/s/topic/0TO5w000000ZaoGGAS"}]}