{"file_path": "../../raw_kb_v2\\article\\360043437933\\index.html", "content": {"Title": "Using the Domo Excel Plugin", "Article Body": "Intro\n                       \n\n                        Use the Domo Excel plugin to download DataSets from Domo into Excel. You can then edit the data in Excel just as you could with any Excel spreadsheet. You can also add data to a DataSet through the use of \"query tables.\" These are subsets of DataSets or single values you pull into Excel based on aggregates, filters, limits, etc. After editing data from a DataSet in Excel, you can upload the edited data into the same DataSet you downloaded it from, create a new Domo DataSet from this data, or upload the data to another existing DataSet.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Notes:\n                            \n\n\n\n\n                              The Domo Excel plugin works\n                              \n                               only\n                              \n                              in Excel on Windows machines and is only supported by Office 2000 and later.\n                             \n\n\n\n                              Multi-factor verification is\n                              \n                               not\n                              \n                              available for the Excel Plugin.\n                             \n\n\n                             Admin- and  Privileged-level users can use this plugin.\n                            \n\n\n\n\n\n\n\n\n                          Video - Domo Excel Plugin\n                         \n\n\n\n\n\n\n\n\n\n                        What you can do with the plugin\n                       \n\n                        Using this plugin, you can do all of the following:\n                       \n\n\n\n                          Connect to the server for the desired Domo instance.\n                         \n\n\n\n                          Download any DataSet from your connected instance as an Excel file.\n                         \n\n\n\n                          Edit the data in your downloaded DataSet.\n                         \n\n\n\n                          Add filtered or aggregated data to your DataSet through the use of \"query tables.\"\n                         \n\n\n\n                          Refresh the DataSet—if anything has changed in this DataSet, it will be \"redownloaded.\"\n                         \n\n\n\n                        Downloading the plugin\n                       \n\n                        You can download the Domo Excel plugin in the Admin Settings.\n                       \n\n\n                         To download the Domo Excel plugin,\n                        \n\n\n\n\n                          In Domo, navigate to\n                          \n                           More > Admin\n                          \n                          .\n                         \n\n\n\n                          Select the\n                          \n                           More > Tool Downloads\n                          \n                          sub-tab.\n                         \n\n\n\n                          Scroll down to the\n                          \n                           Domo Excel plug-in\n                          \n                          section.\n                         \n\n\n\n                          Click\n                          \n                           Try the Excel Plug-In\n                          \n                          .\n                         \n\n\n\n                        Installing the plugin\n                       \n\n                        You can install the plugin either through the wizard that opens after installation or by command line.\n                       \n\n                        Wizard Install\n                       \n\n\n\n                          After the plugin finishes downloading, follow the steps in the wizard to install it to your computer.\n                         \n\n\n\n                        The plugin will now be available when you open Excel.\n                       \n\n                        Command Line Install\n                       \n\n\n                         First, ensure that you are an Admin on the Windows machine.\n                        \n\n\n                          Open up the Command Prompt by clicking the\n                          \n                           Start Menu\n                          \n                          .\n                         \n\n\n\n                          Type CMD in the search bar.\n                         \n\n\n\n                          Right-click\n                          \n                           Command Prompt\n                          \n                          then click\n                          \n                           Run as Administrator\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Navigate to the Domo Excel Plugin download from your Admin Portal > Tool Downloads\n                         \n\n\n\n                          In the command line terminal, run a command line using the file pathway that points to the Domo Excel Plugin downloaded file similar to this:\n                          \n\n\n                           C:\\Windows\\system32>\\Users\\user_account_name\\Downloads\\domoexcelsetup.msi\n                          \n\n\n\n\n                          This will start of the Domo Excel Add-in Setup Wizard.\n                         \n\n\n\n                          Follow the prompts to install the Domo Excel plugin.\n                         \n\n\n\n                        Sequence of steps\n                       \n\n                        The process for using the plugin to download and upload DataSets can be summarized as follows:\n                       \n\n\n\n\n                           Connect to the server\n                          \n                          for the Domo instance you want to retrieve DataSets from.\n                         \n\n\n\n\n                           Download the desired DataSet\n                          \n\n\n                          into Excel.\n                         \n\n\n\n                          Edit the DataSet in Excel as desired.\n                         \n\n\n\n\n                           Upload the DataSet\n                          \n                          back into Domo.\n                         \n\n\n\n\n                           Refresh the data\n                          \n                          as necessary to keep everything up to date.\n                         \n\n\n\n                        Parts of the Domo tab in Excel\n                       \n\n                        After you have installed the Domo Excel plugin, a\n                        \n                         Domo\n                        \n                        tab appears near the end of the main tab row in Excel. This tab appears as follows:\n                       \n\n\n\n\n                        The following table describes the components of this tab:\n                       \n\n\n\n\n\n                            Component\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Connect to Domo\n                           \n\n\n\n                            Lets you connect to a specified Domo instance. You can be connected to multiple instances at once. If you are already connected to an instance, this button reads\n                            \n                             Connected\n                            \n                            . In this case, you can add new connections or delete connections using this option.\n                           \n\n\n\n\n\n                            Download\n                           \n\n\n\n                            Lets you download a DataSet from your connected Domo instance. If you are connected to multiple instances, you can choose which instance to download from.\n                           \n\n\n\n\n\n\n\n\n\n\n                                 Important:\n                                \n                                Your downloaded DataSet will replace whatever content is appearing in the current sheet in Domo. For this reason, it is strongly recommended that you open a blank sheet before downloading a DataSet.\n                               \n\n\n\n\n\n\n\n\n\n                            Upload\n                           \n\n\n\n                            Lets you upload your edited DataSet back to Domo. You can choose from either of these upload options:\n                           \n\n\n\n                              You can upload the DataSet back to the same DataSet you pulled it from.\n                             \n\n\n\n                              You can upload the DataSet into a new DataSet.\n                             \n\n\n\n\n\n\n\n\n\n\n\n                                Note:\n                               \n                               If the original DataSet was created and uploaded from the Excel Plugin, both of these options are available. If the originally downloaded DataSet is not an Excel DataSet, only the second option is available.\n                              \n\n\n\n\n\n\n\n\n                            Refresh\n                           \n\n\n\n                            Refreshes this DataSet. If any changes have been made to the DataSet on the Domo side, those changes will be made in the Excel version of the DataSet. In essence, you are doing a \"re-download\" of the DataSet data.\n                           \n\n\n\n\n\n                            Linked/Not Linked\n                           \n\n\n\n                            Indicates whether this DataSet is linked to the same DataSet on the Domo side. You can unlink the DataSet by clicking\n                            \n                             Linked\n                            \n                            and choosing the\n                            \n                             Unlink\n                            \n                            option. Or, you can link an unlinked DataSet back to its Domo DataSet by clicking\n                            \n                             Not Linked\n                            \n                            and choosing the\n                            \n                             Link\n                            \n                            option.\n                           \n\n\n\n\n                           Query Table\n                          \n\n                           Lets you add a \"query table\" to this Excel sheet—a subset of data from a DataSet in which you can optionally add filters or aggregations.\n                          \n\n\n\n\n                            Help\n                           \n\n\n\n                            Lets you see the version number for this version of Domo Excel as well as check for newer versions.\n                           \n\n\n\n\n\n                        Connecting to a Domo server\n                       \n\n                        You can connect to the server for any Domo instance for which you have access. You can be connected to multiple instances at once.\n                       \n\n\n                         To connect to a Domo server,\n                        \n\n\n\n\n                          Click the\n                          \n                           Connect to Domo\n                          \n                          button on the left side of the Domo tab in Excel. (If you are already connected to any servers, the button reads\n                          \n                           Connected\n                          \n                          .)\n                          \n\n\n\n\n                          A dialog appears requesting that you add a connection.\n                         \n\n\n\n                          Click\n                          \n                           Add\n                          \n                          .\n                         \n\n\n\n                          Enter the URL for your Domo server in the field, then click\n                          \n                           Next\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Enter your Domo credentials in the fields, then click\n                          \n                           Next\n                          \n                          .\n                          \n\n\n\n\n                          You must have a default security role of \"Admin\" or \"Privileged\" security profile to connect. Alternatively, you can connect if you have a custom security role with the \"View DomoApps,\" \"Edit DataSets,\" \"Export from Domo,\" and \"Manage All Access Tokens\" grants enabled. For more information about default security roles, see\n                          \n                           Managing Custom Roles\n                          \n                          .\n                          \n\n                          If you have entered your credentials correctly, a \"Success\" dialog appears.\n                         \n\n\n\n                          Click\n                          \n                           Finish\n                          \n                          .\n                         \n\n\n\n                        Deleting a server connection\n                       \n\n                        You can delete a connection to a server in the same dialog in which you add a server connection.\n                       \n\n\n                         To delete a server connection,\n                        \n\n\n\n\n                          Click the\n                          \n                           Connected\n                          \n                          button on the left side of the Domo tab in Excel.\n                         \n\n\n\n                          Select the server you want to disconnect from.\n                         \n\n\n\n                          Click\n                          \n                           Delete.\n                          \n\n\n\n\n                          Click\n                          \n                           Yes\n                          \n                          to confirm the deletion.\n                         \n\n\n\n                        Downloading a DataSet from Domo to Excel\n                       \n\n                        After you have connected to a Domo server, you can download a DataSet from that instance into Excel. You do this by clicking\n                        \n                         Download\n                        \n                        then following the steps in the wizard.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            Y\n                           \n\n                            our downloaded DataSet will replace whatever content is appearing in the current sheet in Domo. It is strongly recommended that you open a blank sheet before downloading a DataSet so you do not accidentally overwrite important data.\n                           \n\n\n\n\n\n\n                         To download a Domo DataSet into Excel,\n                        \n\n\n\n\n                          Click\n                          \n                           Download\n                          \n                          in the Domo toolbar.\n                         \n\n\n\n                          (Conditional) If you are connected to more than one Domo server, you are asked to select the server you want to retrieve data from. Select the desired server, then click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Use the various filter options to locate the DataSet you want to download. You can filter by type (connector), owner, or DataSet name.\n                         \n\n\n\n                          Select the desired DataSet, then click\n                          \n                           Next\n                          \n                          .\n                          \n                          A warning appears stating that any data in the current sheet will be replaced if you continue.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          When the download has finished, click\n                          \n                           Finish\n                          \n                          .\n                         \n\n\n\n                        Building a Query Table\n                       \n\n                        You can add a \"query table\"—a subset of a DataSet in which you can optionally configure filters or aggregations—to a DataSet in Excel. You can specify the location in the downloaded DataSet in which the query table data should appear. When you add a query table, it is stored in your Excel so you can reuse it or edit it later.\n                       \n\n\n                         To add a query table to a DataSet in Excel,\n                        \n\n\n\n\n                          Click\n                          \n                           Query Table\n                          \n                          in the Domo toolbar.\n                          \n                          A pane appears listing all query tables you have added. If you have not added any query tables, this pane appears blank.\n                         \n\n\n\n                          Click\n                          \n                           Add\n                          \n                          .\n                          \n                          A list of all DataSets in your connected Domo instance appears.\n                         \n\n\n\n                          Select the DataSet you want to add as a query table, then click\n                          \n                           Next\n                          \n                          to proceed to the next screen.\n                          \n                          You can use the various search/filter options to narrow down the DataSets in the list.\n                          \n\n\n\n\n\n\n                          (Conditional) Select the radio button for the desired option:\n                         \n\n\n\n                            Select\n                            \n                             Select a subset of columns from this DataSet\n                            \n                            if you want to pull specified columns into your DataSet in Excel. If you want to pull all columns (not a subset of columns), choose this option and then simply leave all boxes checked.\n                           \n\n\n\n                            Choose\n                            \n                             Create an aggregate from the DataSet\n                            \n                            if you want to aggregate a specified value column.\n                           \n\n\n\n\n\n                          (Conditional) If you chose to select a subset of columns in step 4, uncheck the boxes for all columns you do not want in your query table. If you chose to create an aggregate, select the value column to aggregate in the first dropdown, then select the desired aggregation type in the second dropdown.\n                          \n\n\n\n\n\n\n                          (Optional) Add additional aggregates if desired by clicking\n                          \n                           Add an aggregation\n                          \n                          then repeating the aggregation steps in the previous step.\n                         \n\n\n\n                          (Optional) Once you have selected your options in this pane, click\n                          \n                           Refresh\n                          \n                          to show how the subset of data will appear.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to proceed to the next screen.\n                         \n\n\n\n                          (Optional) Configure filters as follows:\n                         \n\n\n\n                            In the first dropdown, select the column you want to filter.\n                           \n\n\n\n                            In the second dropdown, select the condition for the filter.\n                           \n\n\n\n                            In the last dropdown, enter the value for the condition.\n                            \n\n\n\n\n                            For example, if you wanted your query table to show only those rows in which your number of daily visitors is less than 20, you would select \"Daily Visitors\" in the first dropdown, select\n                            \n                             is less than\n                            \n                            in the second dropdown, and enter\n                            \n                             20\n                            \n                            in the last dropdown.\n                           \n\n\n\n\n\n                          (Optional) Add additional filters if desired by clicking\n                          \n                           Add a filter\n                          \n                          then repeating the previous step.\n                         \n\n\n\n                          (Optional) Once you have selected your options in this pane, click\n                          \n                           Refresh\n                          \n                          to show how the subset of data will appear.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to proceed to the next screen.\n                         \n\n\n\n                          (Optional) To change the order of rows in your query table, select the column to order by in the first dropdown under \"Order rows by,\" then select the order type (\n                          \n                           ascending\n                          \n                          or\n                          \n                           descending\n                          \n                          ) in the next dropdown.\n                          \n\n\n\n\n\n\n\n                          (Optional) To limit the rows of data returned, enter the row number in which you want to begin returning data in the first dropdown under \"Limit,\" then specify the number of rows of data to return in the next dropdown.\n                          \n\n\n\n\n                          For example, if you only wanted to return rows 10 through 20, you would enter\n                          \n                           10\n                          \n                          in both dropdowns (the first signifying that the import should begin at row 10, and the second signifying that 10 rows of data should be imported).\n                         \n\n\n\n                          (Optional) Once you have selected your options in this pane, click\n                          \n                           Refresh\n                          \n                          to show how the subset of data will appear.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to proceed to the next screen.\n                          \n\n\n\n\n\n\n                          Provide a name for your query in the top field.\n                          \n                          When you go back into the\n                          \n                           Query Table\n                          \n                          wizard after importing your table, the table will be referred to by the name you enter.\n                         \n\n\n\n                          In the two fields under \"Insert into your spreadsheet at location,\" enter the column and row where you want the query table to appear.\n                          \n                          Be aware that if any data already exists within the area you specify, that data will be replaced with the data in your query table.\n                         \n\n\n\n                          (Conditional) If you do not want headers to be included in your query table, uncheck the first checked box; otherwise leave it checked.\n                         \n\n\n\n                          (Conditional) If you do not want the first cell in your query table to be highlighted (to indicate that it is a query table), uncheck the first box; otherwise leave it checked.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          to download your query table into Excel.\n                         \n\n\n\n                        Uploading a DataSet from Excel to Domo\n                       \n\n                        After you have made your desired changes to a Domo DataSet in Excel, you can upload it back to Domo. You have two options for doing this:\n                       \n\n\n\n                          You can upload the DataSet back to the same DataSet you pulled it from.\n                         \n\n\n\n                          You can upload the DataSet into a new DataSet.\n                         \n\n\n\n                        If the original DataSet was created and uploaded from the Excel Plugin, both of these options are available. If the originally downloaded DataSet is not an Excel DataSet, only the second option is available.\n                       \n\n                        Uploading a DataSet back to its original DataSet\n                       \n\n                        When you upload a DataSet to Domo using this method, the updated content replaces the content in the original DataSet.\n                       \n\n\n                         To upload a DataSet back to its original DataSet,\n                        \n\n\n\n\n                          Click\n                          \n                           Upload\n                          \n                          in the Domo toolbar.\n                         \n\n\n\n                          Select\n                          \n                           Upload data to currently linked DataSet \"[your DataSet]\"\n                          \n                          then click\n                          \n                           Next\n                          \n                          .\n                          \n                          A warning appears stating that the data in the DataSet in DOmo will be replaced if you continue.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          Click\n                          \n                           Finish\n                          \n                          after the upload completes.\n                         \n\n\n\n                        Creating a new DataSet\n                       \n\n                        When you use this option, a new DataSet is created in Domo using the content in the currently open sheet. You specify the DataSet name and the Domo instance (if you are connected to more than one Domo server). You can also set a few other optional settings, such as whether headers appear in the first row.\n                       \n\n\n                         To create a new DataSet using the data in the currently open sheet,\n                        \n\n\n\n\n                          Click\n                          \n                           Upload\n                          \n                          in the Domo toolbar.\n                         \n\n\n\n                          Select\n                          \n                           Create a new DataSet in Domo\n                          \n                          then click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Data Handling\n                          \n                          dialog, set options as follows:\n                         \n\n\n\n                            Enter the name for the new DataSet in the\n                            \n                             DataSet Name\n                            \n                            field.\n                           \n\n\n\n\n\n                            (Conditional) If you are connected to more than one Domo server, select the instance where you want the new DataSet in the\n                            \n                             Domo Instance\n                            \n                            menu.\n                           \n\n\n\n                            (Optional) Check the\n                            \n                             First row contains headers\n                            \n                            box if you want the first row in your DataSet to be the header row.\n                           \n\n\n\n                            (Optional) Specify a range of data to be pulled into your DataSet by entering the numbers of first and last rows to be ignored. For example, if you wanted the new DataSet to contain all data from the second row to the last (i.e. skipping the first row), you would enter\n                            \n                             1\n                            \n                            in the\n                            \n                             Ignore First Rows\n                            \n                            box.\n                           \n\n\n\n\n\n                          Click\n                          \n                           Next\n                          \n                          when you have specified all options.\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          When the upload has finished, click\n                          \n                           Finish\n                          \n                          .\n                         \n\n\n\n                        Refreshing data in a sheet\n                       \n\n                        If your currently open Excel sheet contains data downloaded from a DataSet and any data changes in that DataSet in Domo, a dialog appears asking if you would like to refresh the data in the sheet. If you choose yes, the data from the DataSet in Domo replaces the data in the currently open sheet. You can open this dialog manually by choosing the\n                        \n                         Refresh\n                        \n                        option. If the original DataSet has been unlinked, this option is not available.\n                       \n\n\n                         To refresh the data in a sheet,\n                        \n\n\n\n\n                          Click\n                          \n                           Refresh\n                          \n                          in the Domo tab to open the Domo Datasource Download Wizard. (If the data changes in the linked DataSet in Domo, a dialog appears asking if you want to refresh the data; click\n                          \n                           Yes\n                          \n                          to proceed to the wizard.)\n                         \n\n\n\n                          Click\n                          \n                           Next\n                          \n                          .\n                         \n\n\n\n                          After the download has completed, click\n                          \n                           Finish\n                          \n                          .\n                         \n\n\n\n                        Unlinking or relinking a DataSet\n                       \n\n                        When you download a DataSet from Domo, by default the downloaded data stays linked to the original DataSet. As a preventative measure, you may want to unlink the downloaded data from the DataSet in Domo until you are ready to upload. That way, changes to one version of the data will not immediately affect the other.\n                       \n\n\n                         To unlink the downloaded data from the original DataSet,\n                        \n\n\n\n\n                          Click the\n                          \n                           Linked\n                          \n                          button in the Domo toolbar.\n                         \n\n\n\n                          Click\n                          \n                           Unlink from \"[DataSet Name].\"\n                          \n\n\n\n\n\n                         To relink the downloaded data to its original DataSet,\n                        \n\n\n\n\n                          Click the\n                          \n                           Not Linked\n                          \n                          button in the Domo toolbar.\n                         \n\n\n\n                          Click\n                          \n                           Link to \"[DataSet Name].\"\n                          \n\n\n\n\n                        Troubleshooting\n                       \n\n                        Several customers have reported an issue in which Microsoft disables the plugin after a crash; hence the plugin is still installed but is in a disabled state, so the\n                        \n                         Domo\n                        \n                        tab doesn't appear. Reinstalling the plugin leaves it in the disabled state. Below are instructions to re-enable the plugin.\n                       \n\n\n                         To re-enable the Excel Plugin\n                        \n\n                         ,\n                        \n\n\n\n\n                          Open Excel.\n                         \n\n\n\n                          Select\n                          \n                           File > Options\n                          \n                          .\n                         \n\n\n\n                          Select\n                          \n                           Add-ins\n                          \n                          .\n                         \n\n\n\n                          In the\n                          \n                           Manage\n                          \n                          dropdown, select\n                          \n                           COM Add-ins\n                          \n                          , then click\n                          \n                           Go\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Check the box next to\n                          \n                           DomoExcel\n                          \n                          then click\n                          \n                           OK\n                          \n                          .\n                          \n\n\n\n\n\n\n                        If the box is already checked and the\n                        \n                         Domo\n                        \n                        tab still doesn't appear, make sure you don't have multiple versions of the plugin installed. You can remove extra instances by doing the following:\n                       \n\n\n\n                          In the Windows Control Panel, go to\n                          \n                           Add/Remove Programs\n                          \n                          .\n                         \n\n\n\n                          Remove all instances of \"Domo Excel.\"\n                         \n\n\n\n                          Reinstall the plugin.\n                         \n\n\n\n                        If you are experiencing the error message \"There was a problem authenticating with '\n                        \n                         company.como.com\n                        \n                        '\" when attempting to connect to your Domo instance, try the following items:\n                       \n\n\n                         If it isn't already, set your default internet browser to Chrome so that when the authentication window opens, it does so in Chrome.\n                        \n\n\n                          Sign out of Domo before attempting to authenticate in the Excel Plugin.\n                         \n\n\n\n                          Uninstall and reinstall the Plugin as an Administrator on your own machine.", "Preview Article": "Click here to preview", "URL Name": "360043437933", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004257", "Archived Date": "", "Language": "English", "Primary Version": "Using the Domo Excel Plugin", "Article Total View Count": "15,164", "": "", "Article Created Date": "10/24/2022, 9:35 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Using the Domo Excel Plugin\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Distributing Domo Content\n              \n", "url": "/s/topic/0TO5w000000ZamqGAC"}, {"text": "\n\n               Plugins For Sharing Domo Content\n              \n", "url": "/s/topic/0TO5w000000Zao3GAC"}]}