{"file_path": "../../raw_kb_v2\\article\\4415839663639\\index.html", "content": {"Title": "Governance Toolkit: Group Management", "Article Body": "Intro\n                       \n\n                        Group Management allows you to manage your Domo groups in bulk. You can also set a landing page for members of a group.\n                       \n\n                        Accessing the Toolkit\n                       \n\n                        To access the Governance Toolkit, do the following:\n                       \n\n\n                         In the navigation header, go to\n                         \n                          More\n                         \n                         >\n                         \n                          Admin.\n                         \n\n\n                         In the\n                         \n                          Governance\n                         \n                         menu, select\n                         \n                          Toolkit.\n                         \n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           If the\n                           \n                            Toolkit\n                           \n                           option does not display in the\n                           \n                            Governance\n                           \n                           menu, make sure your user role has the required grants. You may need to enable the Toolkit by reaching out to your Account Executive (AE).\n                          \n\n\n\n\n                        Required Grants\n                       \n\n\n                         To access the Governance Toolkit, a user will need one of two grants enabled for their role: Create Custom Pipeline Processes or Administer Custom Pipeline Processes. Grants can be added to a custom user role. By default, the Administer Custom Pipeline Process grant is enabled for Admin users.\n                        \n\n\n\n                         Create Custom Pipeline Processes\n                        \n\n\n\n\n                          Allows the user to create, update, share, and delete jobs.\n                         \n\n\n\n                          Only allows the user to view jobs that they created or jobs that have been shared with them.\n                         \n\n\n\n\n                         Administer Custom Pipeline Processes\n                        \n\n\n\n\n                          Allows the user to create, update, share, and delete jobs.\n                         \n\n\n\n                          Allows the user to see all jobs within the pipeline.\n                         \n\n\n\n\n                         To learn more about custom roles and grants, see\n                         \n                          Managing Custom Roles.\n                         \n\n\n\n                        Configuration DataSet for Adding Members to a Group\n                       \n\n                        This section describes the columns in the configuration DataSet for adding members to a group.\n                       \n\n\n                         User\n                         \n                         - The users that should be included in the group.\n                         \n                         - Multiple users can be pipe ‘|’ separated.\n                         \n                         - User id and email can be used.\n                         \n\n\n                         Group\n                         \n                         - The name or id of the group that users should be added to.\n                         \n\n\n\n\n\n                        Configuration DataSet for Setting a Group Landing Page\n                       \n\n                        This section describes the columns in the configuration DataSet for setting a landing page for a group.\n                       \n\n\n\n                          priority —\n                         \n                         If a user is a member of multiple groups, the priority determines which landing page they have.\n                         \n                         - If both a card_id and page_id are given, the page is set as the landing page.\n                         \n                         - If a user is a member of multiple groups of equal priority, the landing page is assigned alphabetically based on the group name.\n                         \n\n\n\n                          group —\n                         \n                         The name or ID of the group that the landing page is set for.\n                         \n\n\n\n                          page_id —\n                         \n                         The ID of the page set as the landing page.\n                         \n\n\n\n                          card-id —\n                         \n                         The ID of the card to be set as the landing page.\n                        \n\n\n\n\n\n                        Creating a Job\n                       \n\n                        Follow these steps to create a job in Group Management:\n                       \n\n                        1. In the navigation header, go to\n                        \n                         More\n                        \n                        >\n                        \n                         Admin.\n                        \n\n\n                        2. In the\n                        \n                         Governance\n                        \n                        menu, select\n                        \n                         Toolkit.\n                        \n\n\n                        3. In\n                        \n                         Toolkit\n                        \n                        , select\n                        \n                         Group Management\n                        \n                        .\n                       \n\n                        4. Select\n                        \n                         + New Job\n                        \n                        .\n                        \n                        The new job creation page displays.\n                       \n\n\n\n\n                        5. Enter a\n                        \n                         Job name\n                        \n                        and optional\n                        \n                         Job description.\n                        \n\n\n                        6. In the\n                        \n                         Configuration\n                        \n                        section, check one or both of the boxes for your\n                        \n                         Job options:\n                        \n\n\n\n\n                          Manage Groups —\n                         \n                         Use this option to create membership groups as necessary and manage them.\n                        \n\n\n                          Manage Landing Pages —\n                         \n                         Use this option to assign landing pages or cards to members of existing groups. This option includes assigning landing pages for directory groups inherited from SSO.\n                        \n\n\n                        7. (Required) Select a Configuration DataSet for each selected job option.\n                       \n\n\n                         The\n                         \n                          Group Management Configuration DataSet\n                         \n                         defines your groups and users in each group.\n                        \n\n                         The\n                         \n                          Landing Page Management Configuration DataSet\n                         \n                         defines which landing pages are set.\n                        \n\n\n                        8. (Required for group management) Choose how to handle creating new groups. Select the radio button for\n                        \n                         Open\n                        \n                        or\n                        \n                         Closed\n                        \n                        .\n                       \n\n                        9. In\n                        \n                         Reporting\n                        \n                        , select where you would like to save run logs.\n                       \n\n\n\n                          New DataSet —\n                         \n                         This option creates a new DataSet in your Domo instance and all runs of the job write logging to the new DataSet.\n                        \n\n\n                          Existing DataSet —\n                         \n                         This option allows you to combine multiple Group Management jobs into a single logging DataSet.\n                         \n\n\n\n\n\n\n\n                              Important:\n                             \n                             The DataSet must be a DataSet created by the Group Management tool. The DataSet must also already contain rows of data.\n                            \n\n\n\n\n\n\n                        10. In\n                        \n                         Reporting\n                        \n                        , enter any email addresses you would like to receive notifications from Domo each time the job runs. The notification outlines what the job did during the run and any failures that occurred.\n                       \n\n\n                         Sample Notification Email\n                        \n\n\n\n\n                        11. After you fill out the new job creation page, select\n                        \n                         Submit\n                        \n                        .\n                       \n\n                        Running a Job\n                       \n\n                        You can run a job by using the\n                        \n                         Enabled\n                        \n                        toggle. The toggle displays on the\n                        \n                         Group Management\n                        \n                        page after you create a job.\n                       \n\n                        When you switch the toggle to\n                        \n                         Active\n                        \n                        , the job will execute every six hours and when the configuration DataSet is updated. When the toggle is\n                        \n                         Disabled\n                        \n                        , the job only executes when it is manually run.\n                       \n\n\n\n\n                        Example Job Run\n                       \n\n\n                         Groups before run:\n                         \n\n\n\n\n\n                         Configuration DataSet:\n                         \n\n\n\n\n\n                         Groups after run:\n                         \n\n\n\n\n\n                         Logging DataSet:", "Preview Article": "Click here to preview", "URL Name": "4415839663639", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003032", "Archived Date": "", "Language": "English", "Primary Version": "Governance Toolkit: Group Management", "Article Total View Count": "5,480", "": "", "Article Created Date": "10/24/2022, 9:04 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Governance Toolkit: Group Management\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Administrating Domo\n              \n", "url": "/s/topic/0TO5w000000ZamlGAC"}, {"text": "\n\n               Governance Tools\n              \n", "url": "/s/topic/0TO5w000000ZannGAC"}]}