{"file_path": "../../raw_kb_v2\\article\\360042930074\\index.html", "content": {"title": "\n\n\n Twitter Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nThe Domo Twitter Connector integrates Domo with Twitter to extract data from the Twitter API. The Domo Twitter Connector provides access to Twitter data including followers, timelines, retweets and many other Twitter entities. To learn more about the Twitter API, visit their site (\n\nhttps://dev.twitter.com/rest/public\n\n).\n\n\n The Twitter connector is a \"Cloud App\" connector, meaning it retrieves data stored in the cloud. In the Data Center, you can access the connector page for this and other Cloud App connectors by clicking\n **Cloud App**\n in the toolbar at the top of the window.\n\n\n You connect to your Twitter account in the\n\nData Center\n\n. This topic discusses the fields and menus that are specific to the Twitter connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n  |  |\n| --- | --- |\n|\n**Primary Use Cases**\n | * Social media followers on platform\n* Response to specific tweets\n* Retweets (engagement)\n* Follower demographics\n* Replies to followers\n |\n|\n**Primary Metrics**\n | * Follower count\n* Retweet count\n* Followers of followers and friends of followers (influence)\n |\n|\n**Primary Company Roles**\n | * Social media manager\n* CMO\n |\n|\n**Average Implementation Time**\n |\n 10 minutes\n  |\n|\n**Ease of Use (on a 1-to-10 scale with 1 being easiest)**\n |\n 2\n  |\n\nBest Practices\n----------------\n\nSome Twitter reports provide a snapshot in time, so these reports should be set up in \"Append\" mode to show trends. These reports include:\n\n Followers\n* Favorites\n* Friends\n\nPrerequisites\n---------------\n\nTo connect to your Twitter account and create a DataSet, you must have the following:\n\n Your Twitter username or your email address\n* Your password\n\nConnecting to Your Twitter Account\n------------------------------------\n\nThis section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Twitter Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n Credentials Pane\n\nThe Domo Twitter connector uses OAuth to connect, so there is no need to enter credentials within Domo. Click\n **Connect**\n (or select\n **Add Account**\n if you have existing Twitter accounts in Domo)\n\n\n to open the Twitter OAuth screen where you can enter your Twitter username and password. Once you have entered valid Twitter credentials, you can use the same account any time you go to create a new Twitter DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the\n\nData Center\n\n. For more information about this tab, see\n\nManaging User Accounts for Connectors.\n\n\n**Note:**\n If you are already logged into Twitter when you connect in Domo, you are authenticated automatically and taken to the \"Authorize Domo, Inc. to use your account?\" screen when you click\n **Add account**\n . If you want to connect to an account that is different from the one you are logged into, you must first log out of Twitter.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Report\n\ns**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Twitter report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Account\n  |\n Returns information about the authenticated user, such as time zone, screen name, language, etc.\n  |\n|\n Favorites\n  |\n Returns the 20 most recent Tweets marked as Favorites by the authenticated user.\n  |\n|\n Followers\n  |\n Returns a list of users that are following the authenticated user.\n  |\n|\n Friends\n  |\n Returns a list of users the authenticated user is following.\n  |\n|\n Home Timeline\n  |\n Returns the list of Tweets from the authenticated user’s main timeline screen at twitter.com.\n  |\n|\n Mentions Timeline\n  |\n Returns a list of Tweets in which the authenticated user is mentioned (referred to by “@username”).\n  |\n|\n Retweeters\n  |\n Returns a list of users who have retweeted posts from the authenticated user.\n  |\n|\n Retweets\n  |\n Returns a list of the 100 most recent retweets of the tweet specified in the\n **Tweet ID**\n field.\n  |\n|\n Retweets of Me\n  |\n Returns a list of the most recent tweets authored by the authenticated user that have been retweeted by others.\n  |\n|\n Search Tweets\n  |\n Returns a collection of relevant Tweets matching or related to specific text (which you specify in the\n **Search Text**\n field). Twitter's search service is not meant to be an exhaustive source of Tweets. Not all Tweets will be indexed or made available via the search interface.\n  |\n|\n Search Users\n  |\n Provides a simple, relevance-based search interface to public user accounts on Twitter. You can search for user names by entering a comma-separated list of names into the\n **Screen Name**\n field, or you can search for text by entering that text into the\n **Search Text**\n field. If search text is specified, then the list of names will be ignored, and a list of users related to the search text will be returned. If there is no search text, the report will return information about the specified user names. User names are case-sensitive.\n  |\n|\n User Info\n  |\n Returns a variety of information about the authenticated user. The author's most recent Tweet will be returned inline when possible.\n  |\n|\n User Timeline\n  |\n Returns a collection of the most recent Tweets posted by the users indicated in the\n **Screen Name**\n field.\n  |\n\n|\n|\n Screen Name\n  |\n Enter a comma-separated list of names for the report. Names must be capitalized correctly. If no names are entered, the authenticated user's screen name is used for the report.\n  |\n|\n Tweet ID\n  |\n Enter the ID for the tweet you want to retrieve information for.\n\n*Note:**\n You can find the ID for a tweet in Twitter by doing the following:\n\n\n1. Click the\n **Tweets**\n link under your username.\n2. Locate the tweet you want to find the ID for.\n3. Click the tweet's timestamp.\n\n\n A page opens for this tweet. The tweet ID is the long number at the end of the URL.\n\n|\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n##\n FAQ\n\n\n####\n How do I get engagement metrics for organic (non-promoted) tweets?\n\nTo get engagement metrics for tweets that have not been promoted, you need to use the Twitter Engagement connector which uses the Twitter Engagement API.\n\n\n The Twitter Engagement API is one of Twitter’s Enterprise-level APIs. This means that your business will need to sign a contract with Twitter to use this API. See Twitter Enterprise data for more information and to set up a contract with Twitter to access this API.\n\n\n Once your company has access to the Twitter Engagement API, contact your Account Executive or Customer Success Manager. They will ensure that you have access to the connector in your Domo instance.\n\n###\n What kind of credentials do I need to power up this connector?\n\nYou need the email address or Twitter handle, and password associated with your Twitter account.\n\n###\n How do I know my Twitter credentials are secure?\n\nThe login process uses the OAuth process, so your credentials are never seen or stored by Domo. This keeps your login secure. You can revoke Domo's access to your account at any time.\n\n###\n How frequently will my data update?\n\nMost information is available immediately. It is recommended to configure the datasets to run every 24 hours.\n\n###\n What else do I need to do to power up my connector?\n\nTweet ID and Screen Name can be provided optionally for certain reports.\n\n###\n Why didn't my dataset return any new rows when it ran?\n\nThis generally happens if there is no data for the connector to return. Most frequently this happens if there is no activity (new tweets, retweets, etc.) on the account after the Start Date.\n\n\n This can also happen if the \"Retrieve All Available Data\" is set to \"No\" and you run the dataset too frequently. With this value set, the connector will return the data that is new since the last time the dataset ran successfully. If there were no new tweets, retweets, etc., the dataset will return no rows.\n\n###\n Why is the report taking so long to run? Is this normal?\n\nSome of the reports can take a very long time to run. They have to read through several levels of data, making multiple calls to Twitter at each step. This can take a long time. The time increases even more if the Start Date is far in the past and the \"Retrieve All Available Data\" is set to \"Yes\".\n\n###\n What's the difference between this connector and the Twitter Advanced connector?\n\nThe Twitter Advanced connector returns more data in most reports, but it is a little harder to set up.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042930074\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003453\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nTwitter Connector\n\n", "article_total_view_count": "\n\n\n 4,886\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:13 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:42 PM\n\n\n"}, "title": "twitter_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}