{"file_path": "../../raw_kb_v2\\article\\1500000196462\\index.html", "content": {"Title": "AWS Cost and Usage Dashboard", "Article Body": "Intro\n                       \n\n\n                         Millions of businesses worldwide rely on AWS to power their cloud computing platforms. It's a reliable and efficient way to harness the power of cloud computing and scale your company's technological capabilities, but it's critical. You have a way to monitor usage so you don't run into surprises and can easily budget for your access to the cloud.\n                        \n\n\n                         The AWS Cost and Usage connector provides visibility into your organization's AWS usage, letting you optimize your AWS spend.\n                        \n\n                         Get all the critical metrics you need in one glance, drilling down to get more detailed information when needed.\n                        \n\n\n                        The AWS Cost & Usage Report contains the most comprehensive set of AWS cost and usage data available, including additional metadata about AWS services, pricing, and reservations (Example: Amazon EC2 Reserved Instances (RIs)). With this connector you can pull your most updated AWS Cost and Usage report data. The first run of the connector pulls data from the current year. Subsequent runs pull historical data. During subsequent runs, the connector will also look at the modified dates on the files and re-pull any modified data. For more information about the AWS API, visit their website (\n                        \n                         https://docs.aws.amazon.com/AmazonS3/latest/dev/auth-request-sig-v2.html\n                        \n                        ).\n                       \n\n                        You connect to your AWS Cost and Usage account in the Data Center. This topic discusses the fields and menus that are specific to the AWS Cost and Usage connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To configure this connector, you must have the following:\n                       \n\n\n\n                          Your Amazon S3 Bucket name where your CUR report is located\n                         \n\n\n\n                          The report name used when you set up the CUR report in AWS billing\n                         \n\n\n\n                          Your AWS Access Key and Secret Key\n                         \n\n\n\n                          AWS region where your S3 bucket is located\n                         \n\n\n\n                        Creating the Cost and Usage report in AWS:\n                       \n\n\n                         Visit\n                         \n                          https://console.aws.amazon.com/billing/home#/reports\n                         \n\n\n                         Click the\n                         \n                          Create Report\n                         \n                         button.\n                        \n\n                         Enter the report name, select the required options, and click the\n                         \n                          Next\n                         \n                         button.\n                        \n\n\n\n\n\n                        4. Now, set the delivery options for your report.\n                       \n\n                        5. In order to receive AWS Cost & Usage Reports, you must have an Amazon S3 bucket created and configured with the appropriate access permissions. You can add an existing bucket or create a new one.\n                       \n\n\n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n\n                           Ensure to note the\n                           \n                            Report path prefix\n                           \n                           and the\n                           \n                            Report name\n                           \n                           while creating your cost and usage report. You will need these to enter in the connector UI credentials section.\n                          \n\n\n\n\n                        6. Click the\n                        \n                         Next\n                        \n                        button, review your report configuration, and create the report.\n                       \n\n                        Connecting to Your AWS Cost and Usage Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the\n                        \n                        AWS Cost and Usage\n                        \n                         Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your\n                        \n                        AWS Cost and Usage\n                        \n                         account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           Bucket\n                          \n\n                           Enter your Amazon S3 Bucket name where your CUR report is located.\n                          \n\n\n\n                           Region\n                          \n\n                           Select the Amazon S3 Region.\n                          \n\n\n\n                           Report Path Prefix\n                          \n\n                           Enter the path where your CUR report is located.\n                          \n\n\n\n                           Report Name\n                          \n\n                           Put in the same value you used when you set up the CUR report in AWS billing.\n                          \n\n\n\n                           Authentication Type\n                          \n\n                           Select method of authentication.\n                          \n\n\n\n                           Key-Access\n                          \n\n                           Enter your AWS access key.\n                          \n\n\n\n                           Key-Secret\n                          \n\n                           Enter your AWS secret key.\n                          \n\n\n\n\n\n                         Once you have entered valid\n                        \n                        AWS Cost and Usage\n                        \n                         credentials, you can run the connector to pull your cost and usage report data.\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            While selecting the Authentication Type, ensure that your authentication parameters have Read access to the S3 folder where all the data is located.\n                           \n\n\n\n\n\n                        Details Pane\n                       \n\n\n                         AWS Cost and Usage Running Procedure\n                        \n\n\n\n                         The first run of the connector pulls the current month of data. Subsequent runs will check if this month is updated and then start traveling back pulling data month by month.\n                        \n\n\n\n                         The Connector is designed to look at the modified dates on the files and again pull the modified data, if any.\n                        \n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         Adding a DataSet Using a Data Connector\n                        \n                        .", "Preview Article": "Click here to preview", "URL Name": "1500000196462", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003284", "Archived Date": "", "Language": "English", "Primary Version": "AWS Cost and Usage Dashboard", "Article Total View Count": "4,768", "": "", "Article Created Date": "10/24/2022, 9:12 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              AWS Cost and Usage Dashboard\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}