{"file_path": "../../raw_kb_v2\\article\\360042923934\\index.html", "content": {"title": "\n\n\n Card Details View Layout\n\n\n", "article_body": "\n\nIntro\n-------\n\nAll of the different types of Cards have special views called Details views. In a Details view, you can get a closer look at the data in the Card. You also have access to options not available in pages.\n\n\n Some options are the same for the Details\n\nviews for all Card types. For example, in the Details view for any Card type you can add the Card as a Favorite. Other options may be available depending on the Card type. For example, in the Details view for a Visualization Card you can open the Analyzer and make edits to the chart data; in the Details view for a Doc Card you can download documents; and so on. This topic discusses these similarities and differences.\n\n\n Opening the Card Details view\n-------------------------------\n\nIn a standard Page, you can open the Details view for a Card by doing any of the following:\n\n Clicking the Card.\n* Opening\n\nand selecting\n **Details**\n .\n* Clicking any of the icons at the bottom of the Card.\n\nWith poll Cards, you can also open the Details view by clicking any of the links that allow you to see the poll results. For more information, see\n\nPoll Cards\n\n.\n\n\n In a Domo Stories Page, you can open the Details view by doing either of the following:\n\n Mousing over the Card and clicking\n\n.\n* Opening\n\nand selecting\n **Details**\n .\n\nGeneral Details view layout\n-----------------------------\n\nThe following screenshot calls out components and options found in Details views for all Card types:\n\nYou can learn more about these components and options in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Previous Card button\n  |\n Opens the Details view for the previous Card on the page. When you mouse over the icon, a thumbnail image of the previous Card appears.\n  |\n|\n Card name\n  |\n The name of this Card. The process for naming a Card depends on the Card type. For example, for a Visualization Card, you specify the name of the Card in Analyzer; for a Doc Card, the original filename is used unless you indicate a custom name; for a notebook Card, you specify a name when you create the Card; and so on.\n\n\n If you click the name of a Card, you can view its description (if one has been given) along with a list of pages the Card is found in.\n\n\n For information about changing the name of a Visualization Card, see\n\nEditing the Name or Description of a Visualization Card\n\n.\n  |\n|\n Content\n  |\n Shows the actual data represented on this Card. You may be able to interact with the content, depending on the Card type.\n  |\n|\n Invite icon\n  |\n Lets you share this Card with specified team members and invite them to join Domo, all in a single action. If you do not have share access for this Card, the button only allows you to invite users, not share the Card. For more information, see\n\nInviting Others to Join Domo\n\n.\n  |\n|\n Buzz icon\n  |\n Opens the Buzz channel for this Card. For more information, see\n\nChatting in Buzz\n\n.\n  |\n|\n Share icon\n  |\n Provides access to share options for this Card:\n * **Share**\n lets you share access to this Card with other Domo users.\n* **Save As**\n lets you create a duplicate version of this Card you can then manipulate independent of the original version.\n* **Export**\n lets you export the Card. The specific export options available depend on the Card type. All Card types let you send the Card to email or a printer; certain Card types may also let you export to Excel, CSV, or PowerPoint.\n\n\n For more information about sharing access, see\n\nExporting Visualization Cards\n\n.\n  |\n|\n Problem icon\n  |\n Opens the\n **Issues Reported**\n tab for this chart. In this tab, you can read about reported issues, report new issues, and mark issues as resolved. For more information, see\n\nReporting Issues with Cards\n\n.\n  |\n|\n Options icon\n  |\n Displays a menu of options for this Card, such as\n **Share**\n ,\n **Follow on Buzz**\n , and so on. For more information about these options, see\n\nDetails view Options menu\n\n.\n  |\n|\n Next Card button\n  |\n Opens the Details view for the next Card on the page. When you mouse over the icon, a thumbnail image of the next Card appears.\n  |\n|\n Link option\n  |\n Allows you to create a link between this Details view and the Details view for another Card. For more information, see\n\nLinking Related Cards\n\n.\n  |\n|\n Edit control\n  |\n Allows you to restrict editing to the Card owner and users with an \"Admin\" default security role or a custom role with the \"Manage All Cards and Pages\" privilege enabled . If you do not meet any of these criteria, the checkbox and accompanying text do not appear. For more information, see\n\nRestricting Edit Capability for a Card\n\n.\n  |\n|\n Change owner link\n  |\n Allows you to change the owner assigned to this Card. If the Card is a template Card that has not yet been assigned an owner, this link reads\n **Assign an owner to this Card**\n . For more information, see\n\nAssigning or Changing a Card Owner\n\n.\n  |\n|\n Statistics\n  |\n Provides statistics for the number of times the Details page has been viewed in the Domo product, including Embed views, since Card creation. Statistics also displays the number of users who have access to this Card and the who have added the Card to their Favorites.\n  |\n|\n Access link\n  |\n Allows you to specify who has access to this Card. For more information, see\n\nSharing and Removing Access to Content\n\n.\n  |\n|\n Report an Issue icon\n  |\n Allows you to write a description of an issue in this Card and send it to the Card owner and any followers via email/text. The report message is also posted to Buzz. When a Card has reported issues, a warning icon appears on the Card. You can click the warning icon to view the\n **Issues Reported**\n tab of the Details view. For more information, see\n\nReporting Issues with Cards\n\n.\n  |\n\nAlso available in the Details view for all Card types but not shown in the above screenshot:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Map zoom buttons\n\n\n |\n Allow you to zoom in and out of maps. You can also pan across a map by clicking on the map and dragging.\n  |\n|\n Map cities toggle\n\n\n |\n Hides or shows cities in geographical maps. When this is turned on, you can progressively show more cities by zooming in closer and closer on the map.\n  |\n\nVisualization Card Details view\n---------------------------------\n\nIn the Details view for a Visualization Card, you can take many actions not available in other Card types, including the following:\n\n create a drill path\n\nfor the chart so that users can drill down into a graph element and see additional data\n* explore the drill layers\n\nin the Card if a drill path has been added\n* edit the chart\n* apply Filters to the chart\n* add date annotations to the chart\n* add snapshot annotations to the chart\n* select a different chart type using chart picker\n* hide or show elements by clicking on legend items\n* apply quick sorts to the chart data\n* zoom in on the chart data\n* view the underlying data in table format\n* view past versions of the chart\n\nThe following screenshot shows components and options in the Visualization Card Details view layout not found in Details views for other Card types. To see training information about these options, see\n\nAnalyzer Card Basics\n\n.)\n\n(For information about the toolbar icons not called out in the preceding screenshot, see\n\nGeneral Details view layout\n\n.)\n\n\n You can learn more about these components and options in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Summary number\n  |\n The single value in a chart that best represents the data in that chart. For more information about configuring summary numbers, see\n\nConfiguring Your Chart Summary Number\n\n.\n  |\n|\n Date range\n  |\n The period of time and date grain (that is, the unit of time by which the data is shown) represented by the data in this chart. A date range appears only if the chart is powered by a date column. You can change the date range in the Details view by clicking on the range and selecting the desired Filter from the list. For more information about implementing a date range and/or grain in a chart, see\n\nAdding Filters to Your Chart\n\n.\n  |\n|\n Filters icon\n\n|\n Opens the\n **Filters**\n tab for this chart. In this tab, you can add, edit, or remove Filters for the chart. For more information, see\n\nFiltering Data in a Card Details View\n\n.\n  |\n|\n Chart/Table view toggle\n  |\n Switches between the\n **Chart**\n and\n **Table**\n views for this Details view.\n  |\n|\n Annotate icon\n\n|\n Provides access to annotation options for this Card. These options are as follows:\n * **Take a Snapshot**\n lets you save a static version of the Card; add annotations if desired; then download the Card or share with other users. For more information, see\n\nTaking Snapshots of Cards\n\n.\n* **Create Date Annotation**\n lets you add explanatory notes to data points in the graph to provide context for your viewers, and\n **Hide Data Annotations**\n turns off data annotations for this Card. For more information, see\n\nAdding Date Annotations\n\n.\n |\n|\n Alert icon\n\n|\n Opens the\n **Alerts**\n tab. In this tab, you can set, edit, and delete alerts. For more information, see\n\nNotifications and Alerts\n\n.\n  |\n|\n Analyzer icon\n\n|\n Opens the Analyzer view for this Visualization Card. In this view you can edit various details of the Card, such as applied columns, chart properties, filters, sorts, Beast Mode calculations, color rules, and more. You can also open the Analyzer view by selecting\n **Edit in Analyzer**\n in the\n\nmenu.\n  |\n|\n Insights/Quick Filters pane\n  |\n Provides subtabs letting you switch between Insights and Quick Filters for this Card. If the pane is not open, you can open it by clicking\n\n.\n * In the\n **Quick Filters**\n subtab of this pane, you can view any Quick Filters that have been added to this Visualization Card. Quick Filters are pre-defined filters you can use to create a self-guided experience for others to explore data on a Card and answer questions for themselves. Any user who opens the Details view for this Card can show or hide columns quickly and easily just by checking or unchecking the boxes for those columns in the Quick Filter pane. For more information, see\n\nApplying Quick Filters\n\n.\n* In the\n **Insights**\n\nsubtab of this pane, you can view an analysis of the elements of the Card, automatically generated by \"Mr. Roboto,\" Domo's native Natural Language Generation tool. You can also view a number of automatically-generated summary graphics for this Card. Alerts may be based on anomaly detection, finding correlations, distribution mapping, and so on. You can tailor your\n **Insights**\n feed to show you the most meaningful analyses by rating each alert using a \"thumbs up\" or \"thumbs down\" icon, as shown below:\n\nNote that Insights analyses are not yet supported in Table Cards, single-value Cards, or very large Cards. Mr. Roboto\n *does*\n respect PDP policies.\n |\n|\n DataSet\n  |\n Indicates the name of a DataSet being used to power this Card. If a Card is being powered by multiple DataSets, all of these DataSets appear in the Details view. You can click the name of a DataSet to see the details for that DataSet in the Data Center.\n  |\n|\n Chart\n  |\n Represents your data as a graph, table, or map. You can click graph elements such as bars, line points, or pie wedges to see the data filtered for those elements or to see any drill path layers. For more information, see\n\nDrilling into Data\n\n.\n  |\n|\n Update link\n  |\n Allows you to update the DataSet for this chart. For more information, see\n\nUpdating or Refreshing the DataSet for a Visualization Card\n\n.\n  |\n|\n Data Lineage link\n  |\n Opens the Data Lineage for this chart. This shows you all of the DataSets being used to power this chart and their relationships with each other. For more information, see\n\nViewing the Lineage of a DataSet in Analyzer\n\n.\n  |\n\nThe following components are not shown in the preceding screenshot but are also important to note:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Chart picker icon\n\n|\n Lets you change the chart type for the currently displayed chart without having to first open Analyzer. In contrast to the chart type picker in Analyzer, which only shows icons for each chart type, the Details view chart type picker shows you actual thumbnail versions of each available chart type with your chart data applied.\n\n\n The chart type picker only displays thumbnails for chart types that are compatible with your data. If your chart has a chart type not compatible with any other charts (such as a Calendar chart), the\n\nicon is grayed out. The exception to this is Maps, for which this icon does not appear at all (as in the above screenshot).\n  |\n|\n Edit in Analyzer option\n  |\n A\n\noption that opens the Analyzer for this Card. In this view, you can edit various physical characteristics of the chart, such as its name, chart type, applied columns, etc.\n  |\n|\n History option\n  |\n A\n\noption that displays the\n **History**\n view for this Card. In this view, you can see the chart's version history and access older versions. Saving a Card triggers a new version.\n  |\n|\n PDP (Personalized Data Permissions)\n  |\n If PDP (Personalized Data Permissions) has been set on the DataSet powering this Card, a\n\nlabel appears next to the Card name. This indicates to the user viewing the page that they may not be seeing all of the data behind this chart, based on their PDP access. For more information about PDP, see\n\nPersonalized Data Permissions (PDP)\n\n.\n  |\n\n\n###\n Viewing modes in the Visualization Card Details view\n\nThere are various viewing modes in the Details view for a Visualization Card—\n **Chart**\n ,\n **Table**\n ,\n **Edit**\n , and\n **History**\n . Each of these modes provides different functionality for viewing and interacting with the Card data.\n\n\n You switch between the\n **Chart**\n and\n **Table**\n views by clicking the\n\nand\n\nbuttons at the top of the screen. You access the\n **Edit**\n and\n **History**\n views in the\n\nmenu.\n\n###\n Chart view\n\nThe\n **Chart**\n view, the default view for the Visualization Card Details view, shows you the standard graphical depiction for the Card.\n\nIn most Visualization Cards, you can drill down on any chart element (bar, pie wedge, state, etc.) to see the data filtered for that chart element. If a Card has drill path layers, you can click a chart element to drill down to see underlying data for the associated column. For more information about adding a drill path, see\n\nDrilling into Data\n\n.\n\n\n You can also add Filters to the chart data while in this view. For more information, see\n\nFiltering Data in a Card Details View\n\n.\n\n\n In the\n **Chart**\n view (and also in the\n **Table**\n view, described in the next section), you can access tabs with different functionality. These include the\n **Filters**\n ,\n **Issues Reported**\n , and\n **Alerts**\n tabs. You can open a tab by clicking its link in the top right corner of the screen.\n\n####\n Filters tab\n\nWhen you click\n\n, the\n **Filters**\n tab appears with a\n **New Filter**\n button appears that allows you to add Filters to your chart. For more information, see\n\nFiltering Data in a Card Details View\n\n.\n\n####\n Issues Reported tab\n\nWhen you click\n\n, the\n **Issues Reported**\n tab appears. In this tab, you can read about reported issues, mark issues as resolved, and report new issues. For more information, see\n\nReporting Issues with Cards\n\n. A number next to the name of this tab indicates the number of issues that have been reported on the Card. (If no issues have been reported, this tab does not appear.)\n\n####\n Alerts tab\n\nWhen you click\n\n, the\n **Alerts**\n tab appears. In this tab, you can create an alert on the Card, follow or unfollow an alert, edit an alert, delete an alert, or view the history of all alerts that have been triggered on the Card. A number next to the name of this tab indicates that one or more alerts have been triggered on this Card. For more information, see\n\nManaging Custom Alerts\n\n.\n\n###\n Table view\n\nThe\n **Table**\n view shows a table of the non-graphical underlying data for the Visualization Card. This view of the chart provides the\n *raw*\n data in the DataSet; it does not include any HTML formatting.\n\n\n The column header labels that appear in this view are the same as those in the\n\nDataSet\n\npowering the Card. However, you can change the column header labels in the\n\n*Edit**\n\nview for the Card. For more information, see\n\nEditing the Column Header Labels for Your Chart Table View\n\n.\n\nYou can change the sorting for any column in the table by clicking the up or down arrow to the right of a column heading. For example, in the table in the preceding screenshot, clicking the arrow to the right of \"Widgets Sold\" would cause the numerical data to be sorted from high to low.\n\n###\n Analyzer\n\nIn the\n **Analyzer**\n view, you can change elements of the Visualization Card, such as its name, description, chart type, applied DataSet columns, Filters, and sorting criteria. For more information about the\n **Analyzer**\n view, see\n\nAnalyzer Layout\n\n.\n\n\n This view is only accessible by users with \"Admin,\" \"Privileged,\" or \"Editor\" default security roles OR a custom security role with the \"Edit Cards\" privilege enabled. For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n\n###\n History view\n\nIn the\n **History**\n view, you can see all past versions of this Visualization Card. A new version is created every time you save the Card. When you open this view, a list of versions is shown, with the specific changes for each version. Also, if the updating user added a comment to explain why certain changes were made, the comment is shown as well.\n\nWhen you click\n **View**\n for a version of the Visualization Card in the list, that version displays. While in this mode, you can see the previous or next version in the list by clicking\n **Previous revision**\n or\n **Next revision**\n , respectively. You can return to the version listing by clicking\n **View all history**\n .\n\nDoc Card Details view\n-----------------------\n\nIn the Details view for a Doc Card, you have access to many options not available in Details views for other Card types. For example, you can\n\n download the document,\n* edit the name and description for the document,\n* see the upload history for the document,\n* view and download old versions of the document,\n* refresh the source file, and\n* open the document in a \"reading view\" that provides easier readability and navigation.\n\nThe following screenshot shows components and options in the Doc Card Details view layout not found in Details views for other Card types:\n\nYou can learn more about these components and options in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Timestamp\n  |\n Shows the date and time when this document was last updated.\n  |\n|\n Document name\n  |\n Shows the name of this document. You can rename the document by clicking the name and typing the new name.\n  |\n|\n New version option\n  |\n Allows you to upload a new version of this document. All versions of a document appear as thumbnails in the\n **Versions**\n panel. For more information, see\n\nUpdating a Doc Card\n\n.\n  |\n|\n Document\n  |\n The uploaded document or image. If the document consists of more than one page, you can navigate between pages using the navigation buttons that appear when you mouse over the document.\n  |\n|\n Download icon\n\n|\n Lets you download this document to your own computer. If you select a non-current version of the document in the\n **Versions**\n panel, this is the version that is downloaded when you click this icon. For more information, see\n\nDownloading a Document from Domo\n\n.\n  |\n|\n Preview icon\n  |\n Opens the preview mode for this document. For more information, see\n\nPreviewing a Document\n\n.\n  |\n|\n Versions panel\n  |\n Displays all versions of this document as thumbnails. When you click any version of the document in this panel, that version replaces the one currently appearing in this page. However, if you leave the Details view, the current version of the document is restored. You can open or close the\n **Versions**\n panel using\n\n.\n  |\n\nNotebook Card Details view\n----------------------------\n\nIn the\n **Details**\n view for a Notebook Card, you can view the full text of the Card as well as edit the text.\n\n\n Ben Green\n\nJun 21, 2017, 11:27 AM\n\nWhen you open the edit view for a notebook Card, it becomes locked (i.e. no one else can edit it) until you leave the edit view.\n\n\n The following screenshot shows components and options in the Notebook Card Details view layout not found in Details views for other Card types:\n\nYou can learn more about these components and options in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Notebook name\n  |\n The name of this Notebook. By default the name of a Notebook is\n\n(Creator)'s Notebook (date)\n\n, but if you are the Card owner you can change the name by clicking and editing the text. If you are not the Card owner, you cannot edit the name.\n\n*Note:**\n You\n *can*\n change the owner of a Card even if you are not the assigned owner, so long as you have sufficient\n\naccess rights\n\nbased on your security role.\n\n|\n|\n Notebook content\n  |\n The text for this Notebook. If you are the Card owner, you can edit the text by clicking anywhere within it and making your changes. If you are not the Card owner, you cannot edit the text.\n\n*Note:**\n You\n *can*\n change the owner of a Card even if you are not the assigned owner, so long as you have sufficient\n\naccess rights\n\nbased on your security role.\n\n|\n|\n Edit button\n  |\n Allows you to open the edit view for the Notebook. For information about the available edit options, see\n\nAdding a Notebook Card\n\n.\n  |\n\nPoll Card Details view\n------------------------\n\nIn the Details view for a poll Card, you can edit the poll data, such as the question, answer choices, and poll options.\n\n\n The following screenshot shows components and options in the poll Card Details view layout not found in Details views for other Card types:\n\nYou can learn more about these components and options in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Poll question\n  |\n The question for this poll, which also functions as the name. You can click the question to see the pages in which the poll Card is found.\n  |\n|\n Poll content\n  |\n The content of the poll. The preceding screenshot shows the content for the\n **Chart**\n view, which differs depending on whether you have already voted in the poll.\n  |\n\n\n###\n Viewing modes in the poll Card Details view\n\nIn the Details view for a poll Card, there are\n **Chart**\n and\n **Edit**\n view modes. Each mode provides a different way of seeing or interacting with the poll.\n\n###\n Chart view\n\nThe\n **Chart**\n view is the default view in the Details view for a poll. If you have not yet voted in the poll, this view provides the answer choices for the poll, along with a\n **Vote Now**\n button so you can cast your vote. This is the view that is shown in the following screenshot:\n\nIf you have already voted, this view shows the results of the poll up to this point. This is the view that is shown in the following screenshot.\n\n\n####\n Edit view\n\nYou can access the\n **Edit**\n view in the\n\nmenu in the top right corner of the Details view. In the\n **Edit**\n view, you can change various aspects of the poll, including the question, answer choices, and polling options. This option is only available to users with \"Admin,\" \"Privileged,\" or \"Editor\" default security roles OR a custom security role with the \"Edit Cards\" privilege enabled. For more information about default security roles, see\n\nManaging Custom Roles\n\n.\n\nTo return to the\n **Chart**\n view from the\n **Edit**\n view, click\n **Save**\n or\n **Cancel**\n .\n\n\n The layout of this view is the same as the page that appears when you create a poll. For more information about creating a poll, see\n\nAdding a Poll Card to Domo\n\n.\n\n\n Sumo Card Details view\n------------------------\n\nIn the Details view for a Sumo Card, you have access to many options not available in Details views for other Card types. For example, you can\n\n see both views of the table—the\n **Column View**\n and\n **Pivot View**\n ,\n* edit the Sumo Card name, description, DataSet, and formatting, and\n* enter an \"analyze\" mode in which you can make formatting changes that apply only to you.\n\nThe following screenshot shows components and options in the Sumo Card Details view layout not found in Details views for other Card types. This screenshot shows\n **Pivot View**\n ; however, most of these components are found in\n **Column View**\n as well.\n\nYou can learn more about these components and options in the following table:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Edit toggle\n  |\n In either view, hides/shows the columns on the left side of the screen that you can add or remove from your Sumo table.\n  |\n|\n Card name\n  |\n Shows the name of this Sumo Card. You can also click the name to see the description for the Card if one has been specified, along with the names of the pages it is found in. (You can also see this information by clicking the \"i\" icon.) You can change the name and description of a Sumo Card in the\n **Edit**\n view.\n  |\n|\n View toggle\n  |\n Let you switch between the\n **Column View**\n and\n **Pivot View**\n . These essentially show you two different views of a Sumo table.\n **Column View**\n shows a standard column-based view, and\n **Pivot View**\n presents the data in a more complex and powerful pivot table, like those created using Microsoft Excel. For more information about what you can do in both views, see\n\nSumo Editor Layout\n\n.\n  |\n|\n Totals toggle\n  |\n Shows/hides all \"Total\" rows and columns in the Sumo table.\n  |\n|\n Table\n  |\n Shows the Sumo table. The table appears in a standard column-based format in\n **Column View**\n and as a more complex pivot table in\n **Pivot View**\n . Vertical and/or horizontal scroll bars are provided in both views if there is more data than will fit on the screen. In\n **Pivot View**\n , when you scroll vertically, the totals column on the right also scrolls vertically, but the totals row along the bottom remains in place; this lets you always see the sum of all values in a column. Conversely, when you scroll horizontally, the totals row along the bottom scrolls, and the totals column on the right remains in place.\n\n\n Also in\n **Pivot View**\n , when you apply an aggregation, the totals reflect the aggregation you have applied, not just the sum of a row or column. For example, if you select\n **Average**\n as your aggregation, the total for each row and column is the average of all the averages in that row or column.\n  |\n\n\n Also, i\n\n\n f\n\nPDP\n\nhas been enabled for the\n\nDataSet\n\npowering this Sumo Card, a\n\nlabel appears next to the Card name. This indicates to the user viewing the page that they may not be seeing all of the data behind this table, based on their PDP\n\n\n access. For more information about\n\n\n PDP\n\n\n , see\n\n\n Creating and Deleting PDP Policies\n\n\n .\n\nFor more information about building and editing Sumo Cards, see\n\nAdding a Sumo Card\n\n.\n\n\n Custom App Details view\n-------------------------\n\nFor information about the Details view for a custom App, see\n\nGeneral Details view layout\n\n.\n\n\n Doc Card Details view\n-----------------------\n\nFor more information about the Details view for a Doc Card, see\n\nAdding a Doc Card to Domo\n\n.\n\n\n Details view Options menu\n---------------------------\n\nThe Chart view in the Details view for a Card contains a\n\nmenu with many available options. Some options may not be available in your personal view, depending on the Card type and the access rights of your security role. For more information about security roles, see\n\nManaging Custom Roles\n\n.\n\n\n The options you can select in the Details view are as follows:\n\n\n Name\n  |\n Description\n  |\n| --- | --- |\n|\n Edit in Analyzer (Visualization Cards only)\n  |\n Opens the\n **Edit**\n view for this Card. For more information about this view for a Visualization Card, see\n\nVisualization Card Building Part 2: The Analyzer\n\n.\n  |\n|\n History\n  |\n Opens the\n **History**\n view for this chart.\n  |\n|\n Full Screen\n  |\n Opens the full-screen mode for a Card. This viewing mode provides much but not all of the same functionality found in the standard Details view, such as the ability to set Quick Filters and change chart types. The full-screen mode persists until you leave the Details view, so if you\n\nnavigate to another Card using a link\n\n, that Card will also appear in the full-screen mode. This mode is available for all types of Cards.\n\n\n You can exit full-screen mode by clicking the\n\nicon or pressing Escape.\n  |\n|\n Edit Drill Path (Visualization Cards only)\n  |\n Allows you to add new drill layers or edit the drill path for this chart. For more information, see\n\nAdding Drill Path to Your Chart\n\n.\n  |\n|\n Embed Card\n  |\n Allows you to embed Domo Cards into SSO-enabled websites, portals, or applications. You do this by copying an automatically generated HTML string from Domo and pasting it into the website, portal, or application as an iFrame or via a JavaScript API. Domo Embed is available for all types of Cards. For more information, see\n\nSharing Cards Outside of Domo Using Domo Embed\n\n.\n  |\n|\n Add to Favorites\n  |\n Allows you to mark or unmark this Visualzation Card as a Favorite. When you add a Card as a Favorite, it appears in your\n **Favorites**\n page; when you remove a Card as a Favorite, it is removed from your\n **Favorites**\n page. For more information about Favorites, see\n\nAdding Cards as Favorites\n\n.\n  |\n|\n Notify Me on Issues/Do Not Notify Me on Issues\n  |\n Adds this Card to your \"Following\" queue, meaning you are notified when anyone reports an issue on this Card. If the Card is already in your \"Following\" queue, this option reads\n **Do Not Notify Me on Issues**\n . Choosing this option removes the Card from your \"Following\" queue.\n  |\n|\n Move / Copy\n  |\n Allows you to move or copy this Card to a different page. Cards copied in this way are still linked, so changes made to one copy are made to all other copies. For more information, see\n\nMoving or Copying Cards to Other Pages\n\n.\n  |\n|\n Save As (formerly called Duplicate)\n  |\n Allows you to create a new instance of this Card. Duplicated Cards are completely separate from the originals; changes made to one are\n *not*\n made to the other. For more information, see\n\nDuplicating Cards\n\n.\n\n\n |\n|\n Schedule as Report\n  |\n Lets you set a report schedule for this Card. For more information, see\n\nScheduling Reports\n\n.\n  |\n|\n Edit Scheduled Reports\n  |\n Opens the manager interface for scheduled reports. For more information, see\n\nManaging your scheduled reports\n\n.\n  |\n|\n Send Now\n  |\n Allows you to send this Card via email to a Domo user. For more information, see\n\nSending a scheduled report immediately\n\n.\n  |\n|\n Feedback to Domo\n  |\n Allows you to send Domo a request to change the Card.\n  |\n|\n Connect / Update Data (Visualization Cards only)\n  |\n Opens the\n **Connect to Data**\n dialog for this chart, in which you can upload an existing DataSet or a new Excel or Google spreadsheet. For more information, see\n\nUpdating or Refreshing the DataSet for a Visualization Card\n\n.\n  |\n|\n Delete\n  |\n Deletes this Card from Domo, including all copied versions. Duplicate versions are\n *not*\n deleted. For more information about copying and duplicating Cards, see\n\nDuplicating Cards\n\n, respectively.\n\n\n The\n **Delete**\n option is available in Details views.\n\n*Note:**\n This option removes the Card from Domo. For information about removing a Card from a page, see\n\nRemoving Cards from a Page\n\n.\n\nFor more information about deleting a Card from Domo, see\n\nDeleting Cards from Domo\n\n.\n  |\n\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042923934\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000004052\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nCard Details View Layout\n\n", "article_total_view_count": "\n\n\n 5,984\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:19 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:40 PM\n\n\n"}, "title": "card_details_view_layout", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "consuming_data_in_domo", "url": "/s/topic/0TO5w000000ZamnGAC"}, {"text": "interacting_with_cards_and_dashboards", "url": "/s/topic/0TO5w000000ZansGAC"}]}