{"file_path": "../../raw_kb_v2\\article\\360042926974\\index.html", "content": {"title": "\n\n\n Mailjet Connector\n\n\n", "article_body": "\n\nIntro\n-------\n\nMailjet brings marketers and developers together on one platform to accelerate their business growth with email. To learn more about the Mailjet API, visit their page (\n\nhttps://dev.mailjet.com/\n\n).\n\n\n You connect to your Mailjet account in the Data Center. This topic discusses the fields and menus that are specific to the Mailjet connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n Prerequisites\n---------------\n\nTo connect to your Mailjet account and create a DataSet, you must have the following:\n\n A Mailjet API key\n* A Mailjet API secret\n\nYou should be able to find these credentials in your Mailjet API Key Management page.\n\n\n Connecting to Your Mailjet Account\n------------------------------------\n\n\n This section enumerates the options in the\n **Credentials**\n and\n **Details**\n panes in the Mailjet Connector page. The components of the other panes in this page,\n **Scheduling**\n and\n **Name & Describe Your DataSet**\n , are universal across most connector types and are discussed in greater length in\n\nAdding a DataSet Using a Data Connector\n\n.\n\n\n###\n\nCredentials Pane\n\n\n This pane contains fields for entering credentials to connect to your Mailjet account. The following table describes what is needed for each field:\n\n\n|\n\nField\n\n|\n\nDescription\n\n|\n| --- | --- |\n|\n API Key\n  |\n Enter your Mailjet API key.\n  |\n|\n API Secret\n  |\n Enter your Mailjet API secret.\n  |\n\n\n Once you have entered valid Mailjet credentials, you can use the same account any time you go to create a new Mailjet DataSet. You can manage connector accounts in the\n **Accounts**\n tab in the Data Center. For more information about this tab, see\n\nManaging User Accounts for Connectors\n\n.\n\n\n###\n Details Pane\n\nThis pane contains a primary\n **Reports**\n menu, along with various other menus which may or may not appear depending on the report type you select.\n\n\n Menu\n  |\n Description\n  |\n| --- | --- |\n|\n Report\n  |\n Select the Mailjet report you want to run. The following reports are available:\n\n\n|  |  |\n| --- | --- |\n|\n Bounce Events\n  |\n Retrieves a list of all bounce events and details about them, such as message, contact and campaign IDs, timestamp, etc.\n  |\n|\n Click Events\n  |\n Retrieves a list of all click events and details about them, such as message and contact IDs, timestamp, URL, and click delay.\n  |\n|\n Contacts\n  |\n Retrieves a list of contacts.\n  |\n|\n Contacts List\n  |\n Retrieve details for all contact lists, such as name, subscriber count, creation timestamp, and deletion status.\n  |\n|\n Messages\n  |\n Retrieves details about messages, such as sending time, delivery and contact engagement info, recipients, message size, etc.\n  |\n|\n Open Events\n  |\n Retrieve a list of all open events and details about them, such as message, campaign and contact IDs, timestamp, etc.\n  |\n|\n Segmentation\n  |\n Retrieves a list of all segments and details on their configuration. Segments can be applied to contact lists when campaigns are sent.\n  |\n|\n Sent Campaigns\n  |\n Retrieve details about a list of sent campaigns, such as creation and sending time, sender, subject, tracking options enabled, etc.\n  |\n\n|\n|\n Select Filter Type\n  |\n Select whether to filter by campaigns and event dates, contact lists and sent dates, or all campaigns.\n  |\n|\n Filter by Campaign\n  |\n Select whether you want to retrieve data for all campaigns or specific ones.\n  |\n|\n Campaigns\n  |\n Select the campaigns you want to retrieve data for.\n  |\n|\n Contact Lists\n  |\n Select the contact lists you want to retrieve data for.\n  |\n|\n Include Data for Deleted Lists?\n  |\n Select whether you want to pull data for contact lists that have been deleted.\n  |\n|\n Include Data for Deleted Campaigns?\n  |\n Select whether you want to pull data for campaigns that have been deleted.\n  |\n|\n Include Campaigns Created by the Newsletter Tool?\n  |\n Select whether you want to pull data for campaigns created in Mailjet's legacy Newsletter Tool.\n  |\n|\n Include Data for Starred Items?\n  |\n Select whether you want to pull data that has been marked as starred.\n  |\n|\n Status\n  |\n Select a status to pull only segments with that status (used, unused, or deleted).\n  |\n|\n Include Data for All Archived Campaigns, Drafts, and AB Testing Objects?\n  |\n Select whether you want to pull data for all archived campaigns, drafts, and AB testing objects.\n  |\n|\n Filter by Counter Resolution?\n  |\n Select to filter by CounterResolution. The Lifetime option cannot be used with\n\nCounterTiming=Event\n\n. The maximum time period that can be selected between\n\nFromTSand ToTS\n\nequals 100 times the time scale selected for CounterResolution. So if\n\nCounterResolution=Highest\n\n, the period will be 500 minutes (8 hours and 20 minutes); if\n\nCounterResolution=Hour\n\n, it is 100 hours (4 days and 4 hours); if\n\nCounterResolution=Day\n\n, it is 100 days.\n  |\n|\n Filter by Counter Timing?\n  |\n Select whether to filter your data by CounterTiming.\n  |\n|\n Filter by Counter Source?\n  |\n Select whether to filter your data by CounterSource.\n\nList: Contact list\n\noption can be only be used with\n\nCounterTiming=Message\n\nand\n\nCounterResolution=Lifetime\n\n. Also, the\n\nSender : Sender email address\n\noption can only be used with\n\nCounterTiming = Message\n\n.\n  |\n|\n Date Filter by Update Date\n  |\n Select whether to pull data modified since the last run or since a selected date (which you enter using the\n **Dates**\n option). If you choose the first option, be sure to select\n **Append**\n as your update mode in the\n **Scheduling**\n section.\n  |\n|\n Dates\n  |\n Select the date you want to retrieve data for.\n  |\n\n\n###\n Other Panes\n\nFor information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n\nAdding a DataSet Using a Data Connector\n\n.\n\n", "preview_article": "\n\nClick here to preview\n\n", "url_name": "\n\n\n 360042926974\n\n\n", "summary____________________________________________briefly_describe_the_article_the_summary_is_used_in_search_results_to_help_users_find_relevant_articles_you_can_improve_the_accuracy_of_search_results_by_including_phrases_that_your_customers_use_to_describe_this_issue_or_topic": "\n\n", "article_number": "\n\n\n 000003752\n\n\n", "archived_date": "\n\n\n", "language": "\n\n\n English\n\n\n", "primary_version": "\n\nMailjet Connector\n\n", "article_total_view_count": "\n\n\n 2,349\n\n\n", "": "\n\n", "article_created_date": "\n\n\n 10/24/2022, 9:14 PM\n\n\n", "first_published_date": "\n\n\n 10/24/2022, 10:39 PM\n\n\n"}, "title": "mailjet_connector", "breadcrumbs": [{"text": "domo", "url": "/s/knowledge-base/"}, {"text": "connecting_data_to_domo", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "connectors", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "api_connectors", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}