{"file_path": "../../raw_kb_v2\\article\\360044296573\\index.html", "content": {"Title": "Writing a Filter Formula in Magic ETL", "Article Body": "Intro\n                       \n\n                        Filter Formulas enable Magic ETL DataFlow authors to easily filter out data using SQL-style syntax. The filter formula needs to be a logical (Boolean) expression. In other words, the result of your formula must be a True/False return. Now you can save time by using expressions like\n                        \n                         'Column name' >= 7\n                        \n                        or\n                        \n                         `Column name` BETWEEN 15 AND 20\n                        \n                        rather than navigate the traditional Filter Configuration tab.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            There are significant behavioral differences in Magic ETL. Read the\n                            \n\n                              Behavior Changes and Feature Updates in Magic ETL\n                             \n\n                            article before converting mission-critical Magic ETL DataFlows.\n                            \n                             Failure to do so may risk an unintended change to your DataFlow’s behavior.\n                            \n\n\n\n\n\n\n                        Common Logical Filters\n                       \n\n                        A few examples of common logical filters are as follows:\n                       \n\n\n\n                          `id` >= 7\n                         \n\n\n\n                          `Percent Change` BETWEEN .35 AND .65\n                         \n\n\n\n                          `Phone Number` LIKE ‘801%’ AND `Age` < 35 AND `State` = ‘California’\n                         \n\n\n\n                          (`Age` > 20 AND (`Salary` / 12) > 40000) or `Age` > 50\n                         \n\n\n\n                          REGEXP_LIKE(`Email`, ‘@\n                          \n                           gmail.com\n                          \n                          ’)\n                         \n\n\n\n                          `Product Type` IN (1, 3, 7, 9)\n                         \n\n\n\n                        Filter Rows\n                       \n\n                        Null values are treated differently by the comparison functions. In SQL and Magic ETL DataFlows, the result of any comparison with null is always null, which is treated by the\n                        \n                         Filter Rows\n                        \n                        tile like a false result. In most contexts in Magic ETL, null is not equal to null, but null is also not not equal to null; null is not greater than zero, but it is also not less than zero, nor is it equal to zero. If you have nulls in columns referenced by\n                        \n                         Filter Rows\n                        \n                        tiles, all of those rows will be dropped, regardless of the function or its other argument. The only functions that can deal with nulls truthfully are “is null” and “is not null”. In v1, a filter might have tested “column = null”. This will no longer have the same result; such filters should be changed to use the “is null” operator.\n                       \n\n                        If after switching a flow from Magic ETL v1 to Magic ETL v2, it runs successfully, but the output seems to be missing rows, this change is a likely culprit. It can be especially surprising with the “is not equal to” function. It might seem like “column <> 5” should only drop rows where column’s value is 5, but in fact it will also drop rows where column is null, for the reason described above. The table below has additional examples of null behavior in\n                        \n                         Filter Rows\n                        \n                        .\n                       \n\n\n\n\n\n                            Test\n                           \n\n\n\n                            Evaluated Result\n                           \n\n\n\n                            Filter Effect\n                           \n\n\n\n\n\n\n                           4 <> 5\n                          \n\n                           true\n                          \n\n                           keep\n                          \n\n\n\n                           5 <> 5\n                          \n\n                           false\n                          \n\n                           drop\n                          \n\n\n\n                           null <> 5\n                          \n\n                           null\n                          \n\n                           drop\n                          \n\n\n\n                           null = null\n                          \n\n                           null\n                          \n\n                           drop\n                          \n\n\n\n                           null <> null\n                          \n\n                           null\n                          \n\n                           drop\n                          \n\n\n\n                           null is null\n                          \n\n                           true\n                          \n\n                           keep\n                          \n\n\n\n                           null is not null\n                          \n\n                           false\n                          \n\n                           drop\n                          \n\n\n\n                           5 is not null\n                          \n\n                           true\n                          \n\n                           keep\n                          \n\n\n\n                           5 is null\n                          \n\n                           false\n                          \n\n                           drop\n                          \n\n\n\n\n                        To handle nulls in more complex ways, use the new formula system. The\n                        \n                         Filter Rows\n                        \n                        tile is one of three tiles (\n                        \n                         Group By\n                        \n                        and\n                        \n                         Add Formula\n                        \n                        being the other two) which supports formula evaluation. The IFNULL() function works particularly well for handling a null result from a filter expression. For example, if column “col” has null values, and we want to filter for rows whose value for “col” is not 5, preserving our nulls, we could write this expression: IFNULL(col <> 5, TRUE)\n                       \n\n                        Besides null handling, there are many other scenarios that filter formulas make easier. In the previous version of Magic ETL, the single formula below would have required two separate\n                        \n                         Filter Rows\n                        \n                        tiles with multiple conditions each.", "Preview Article": "Click here to preview", "URL Name": "360044296573", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004579", "Archived Date": "", "Language": "English", "Primary Version": "Writing a Filter Formula in Magic ETL", "Article Total View Count": "9,066", "": "", "Article Created Date": "10/24/2022, 10:15 PM", "First Published Date": "10/24/2022, 10:41 PM"}, "title": "\n              Writing a Filter Formula in Magic ETL\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Transforming Data In Domo\n              \n", "url": "/s/topic/0TO5w000000ZamzGAC"}, {"text": "\n\n               Magic ETL\n              \n", "url": "/s/topic/0TO5w000000ZanvGAC"}]}