{"file_path": "../../raw_kb_v2\\article\\360042935754\\index.html", "content": {"Title": "Instructor-Led Courses", "Article Body": "Intro\n                       \n\n                        Domo University is Domo's education hub. In Domo University, you will find valuable resources to help you make the most of your Domo experience. This article contains information about instructor-led courses available to Domo users.\n                        \n\n                        All courses are 3-hour trainings, with a live instructor. They are offered as public virtual courses on a regular basis, or as private trainings, either virtually or in-person. For more details on purchasing or scheduling training, please contant your Domo account team.\n                        \n\n\n\n\n\n\n                            Available Courses:\n                           \n\n\n\n\n\n\n\n\n\n                              Data Literacy\n                             \n\n\n\n                            Description\n                           \n\n                           This course is designed to help trainees become familiar with and communicate basic data insights. In this course, trainees will explore the basics of data literacy and consider how to communicate those insights to others. They will be encouraged to participate in group discussions and ask questions. Toward the end of the course, trainees will have the opportunity to demonstrate what they have learned through a culminating knowledge check.\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Describe the structure and use the data tables\n                            \n\n                             Describe the relationship between data tables\n                            \n\n                             Interpret and communicate information represented in data visualizations\n                            \n\n\n\n                             Who Should Take This Course?\n                            \n\n                            Domo users needing an understanding of how data works\n                           \n\n\n\n\n\n\n\n                              Creating Content in Domo\n                             \n\n\n\n                            Description\n                           \n\n                           This course will introduce new Domo content creators to the tools and skills needed to turn data into actionable insights. Starting with an introduction to the visualization tools available in Domo, learners will then get hands-on experience building Cards in Analyzer and crafting their first Domo Dashboards.\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Describe the available Domo visualization tools and when to use them.\n                            \n\n                             Build basic cards and dashboards in Analyzer and the Dashboard Editor.\n                            \n\n                             Apply card and dashboard features and interactions to create actionable visualizations.\n                            \n\n                             Create visualizations in Domo that answer business questions.\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           New Domo users who will be creating cards and dashboards in Domo\n                           \n\n\n\n\n\n\n\n                              Connecting Data to Domo\n                             \n\n\n\n                            Description\n                           \n\n                           In this course, trainees will be introduced to the various connection methods available to connect data to Domo, e.g., Connectors, Workbench, CLI. Through hands-on activities and demonstrations, users will learn how to create accounts and connectors in Domo and utilize the Workbench. Users will also learn about data accumulation methods (replace, append, upsert (merge), and partitioning) and when each could be used in a data pipeline.\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Discuss the different Connection Methods that Domo offers and when they are best utilized\n                            \n\n                             Identify when to use the various data accumulation methods and explain the differences between them\n                            \n\n                             Connect data to Domo using Connectors\n                            \n\n                             Navigate the Workbench interface and recognize when to use it\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           Beginner to Intermediate users who will be connecting with data\n                           \n\n\n\n\n\n\n\n                              Transforming Data in Domo\n                             \n\n\n\n                            Description\n                           \n\n                           In this course, trainees will be introduced to the various transformation tools available in Domo, with specific emphasis on Magic ETL and DataSet Views. Through hands-on activities and demonstrations, users will learn how to combine data from multiple datasets, filter and aggregate data, and prepare data for use in cards and dashboards.\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Understand tools available in Domo to transform data with guidelines on when to use each tool\n                            \n\n                             Create basic transformations in Magic ETL and Dataset Views\n                            \n\n                             Solve common challenges with combining data from different datasets\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           Beginner users who will be transforming data in Domo\n                           \n\n\n\n\n\n\n\n                              Creating Effective Cards in Domo\n                             \n\n\n\n                            Description\n                           \n\n                           In this course, users will learn skills and best practices that will help them create informative, interactive cards that guide users to answers to their business questions. Moving beyond the basics, learners will become familiar with the available chart types and when to employ them, dive into common and powerful chart properties, and build their first calculated fields (Beast Mode).\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Choose suitable charts to create meaningful visualizations\n                            \n\n                             Enhance existing cards using additional chart properties\n                            \n\n                             Build basic calculated fields with Beast Mode\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           Beginner to intermediate Domo Content Creators\n                           \n\n\n                            Prerequisites\n                           \n\n\n                             Creating Content in Domo Course completion or equivalent experience\n                            \n\n\n\n\n\n\n\n\n                              Creating Effective Dashboards in Domo\n                             \n\n\n\n                            Description\n                           \n\n                           In this course, users will learn skills and best practices that will help them create informative, interactive dashboards that guide users to answers to their business questions. Learners will be taught data visualization and storytelling principles and gain experience improving interactivity and self-service functionality in dashboards.\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Leverage Domo dashboard functionality to empower users to find answers to their questions\n                            \n\n                             Apply principles of Data Visualization to design engaging dashboards\n                            \n\n                             Wireframe a dashboard around answering a business issue\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           Beginner to intermediate Domo Content Creators\n                           \n\n\n                            Prerequisites\n                           \n\n\n                             Creating Content in Domo Course completion or equivalent experience\n                            \n\n\n\n\n\n\n\n\n                              Advanced Data Connection and Transformation\n                             \n\n\n\n                            Description\n                           \n\n                           In this course, users will build on their knowledge of workbench, recursive data flows, period-over-period using Beast Modes, and advanced data connections.\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Connect data with Domo connectors (advanced options)\n                            \n\n                             Create a Recursive DataFlow\n                            \n\n                             Use Regular Expression in ETL\n                            \n\n                             Create a DataSet View\n                            \n\n                             Create intermediate Beast Mode calculations\n                            \n\n                             Govern your Data Ecosystem\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           Power Users, Data specialists, MajorDomos\n                           \n                           Experience Level: Intermediate to Advanced\n                           \n\n\n                            Prerequisites\n                           \n\n\n                             Connecting Data to Domo and Transforming Data in Domo Course completions\n                            \n\n\n\n\n\n\n\n\n                              Governance and Administration\n                             \n\n\n\n                            Description\n                           \n\n                           In this course, users will learn how to administrate their Domo instances using Bulk-Admin features, custom roles, publication groups, and single sign-on. Users will also gain insights on Domo usage through DomoStats and learn some of our best practices to be highly successful.\n                           \n\n\n                            Learning Objectives\n                           \n\n\n                             Onboard new users\n                            \n\n                             Apply custom roles\n                            \n\n                             Create certification processes for cards and DataSets\n                            \n\n                             Create an offboard users dashboard\n                            \n\n                             Use Bulk Admin features\n                            \n\n                             Explain Single Sign-On and Publication Groups\n                            \n\n                             Install and use DomoStats\n                            \n\n                             Explain the customer journey\n                            \n\n                             Create a 4D value statement\n                            \n\n                             Explain the User Ecosystem\n                            \n\n                             Define MajorDomo best practices\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           Domo Administrators\n                           \n                           Experience Level: Beginner through advanced\n                          \n\n\n\n\n\n\n                        For Domo users wanting an immersive, comprehensive training experience, Domo University offers 3.5 day Domo Immersion training.\n                       \n\n\n\n\n\n                            Domo Immersion Options Available\n                           \n\n\n\n\n\n\n\n\n\n                              Domo Immersion (Virtual)\n                             \n\n\n\n                            Description\n                           \n\n                            The Domo Immersion Experience will propel NEW and INTERMEDIATE users down the path to becoming a Domo Master.\n                           \n\n                            In this course, our technical trainers will guide learners through the process of implementing a new Domo use case from start to finish. From uncovering business questions, to connecting, transforming, and visualizing data, users will gain hands-on experience with the core features of Domo learn how to apply governance and administration best practices along the way.\n                           \n\n                            Learning Objectives\n                           \n\n\n                             Set and manage governance best practices for datasets, dashboards, users, and cards\n                            \n\n                             Assess and evaluate data connection options and general requirements\n                            \n\n                             Combine and transform multiple datasets to improve value and relevance for answering business requirements\n                            \n\n                             Create cards and dashboards to address business objectives\n                            \n\n                             Build an operational dashboard framework for multiple audiences\n                            \n\n                             Use available resources to answer questions and improve user capabilities\n                            \n\n                             Discuss how to apply lessons learned to live environment\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           New and Intermediate Domo users needing experience in data connection and transformation, content creation, and platform governance.\n                           \n\n\n                            Course Format\n                           \n\n                           Public or Private Course - Six 4-hour sessions over two weeks (6 days)\n                           \n\n\n\n\n\n\n\n                              Domo Immersion (In-Person at Domo HQ)\n                             \n\n\n\n                            Description\n                           \n\n                           This course combines our first 4 Core courses and a little bit of Governance and delivers them in an immersive experience, culminating in a capstone project.\n                           \n                           You will learn about the best data visualization strategy for your business questions, explore how to employ chart properties to maximize the capabilities of your cards, and practice creating dashboard wireframes and cards based on authentic scenarios. We’ll introduce you to several different types of commonly used cards, build cards as well as a keener sense of how to manage and display your data in Domo.\n                           \n\n                           Additional Benefits\n                           \n\n                             Brilliance Bar\n                            \n\n                             Meet Support Staff\n                            \n\n                             Group dinner and activity\n                            \n\n\n                            Learning Objectives\n                           \n\n\n                             Set and manage governance best practices for datasets, dashboards, users, and cards\n                            \n\n                             Assess and evaluate data connection options and general requirements\n                            \n\n                             Combine and transform multiple datasets to improve value and relevance for answering business requirements\n                            \n\n                             Create cards and dashboards to address business objectives\n                            \n\n                             Build an operational dashboard framework for multiple audiences\n                            \n\n                             Use available resources to answer questions and improve user capabilities\n                            \n\n                             Discuss how to apply lessons learned to live environment\n                            \n\n\n                            Who Should Take This Course?\n                           \n\n                           New and Intermediate Domo users needing experience in data connection and transformation, content creation, and platform governance.\n                           \n\n\n                            Course Formats\n                           \n\n                           Public or Private Course - Seven 3-hour sessions (3.5 days)", "Preview Article": "Click here to preview", "URL Name": "360042935754", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004552", "Archived Date": "", "Language": "English", "Primary Version": "Instructor-Led Courses", "Article Total View Count": "5,638", "": "", "Article Created Date": "10/24/2022, 10:14 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Instructor-Led Courses\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Training\n              \n", "url": "/s/topic/0TO5w000000ZamyGAC"}, {"text": "\n\n               Paid Training\n              \n", "url": "/s/topic/0TO5w000000Zao1GAC"}]}