{"file_path": "../../raw_kb_v2\\article\\4577172785559\\index.html", "content": {"Title": "Configuring Goals Settings", "Article Body": "Intro\n                       \n\n                        As an admin, you can change the Domo Goals settings for your organization.\n                        \n                         Some actions will need to be taken before others can use Domo Goals. This article discusses how to configure various administrative features.\n                        \n\n\n\n                         Actions in this article can only be executed by Admin users or those with the Manage All Goals grant enabled. For more information, see\n                         \n                          Managing Custom Roles\n                         \n                         .\n                        \n\n\n\n\n\n                         Managing General Settings\n                        \n\n\n\n                         Admins can specify general settings for Domo Goals. This includes choosing nomenclature, creating time periods for goals, and setting the check-in cadence.\n                        \n\n\n\n\n\n                         Configuring Goals Nomenclature\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. In\n                         \n                          General\n                         \n                         tab, select an option from the\n                         \n                          Goals Nomenclature\n                         \n                         menu.\n                        \n\n\n\n                         Several choices display allowing you to determine if your organization will use Goals and Metrics, Objectives and Key Results, Objectives and KPIs, or Priorities and Action Items. Your choice of terminology will not affect the Goals functionality.\n                        \n\n\n\n\n\n\n\n\n                         4. Select\n                         \n                          Save\n                         \n                         .\n                        \n\n\n\n                         The Goals feature now uses your organization's chosen nomenclature.\n                        \n\n\n\n\n\n                         Configuring Goals Time Periods\n                        \n\n\n                        In Domo Goals, you use time periods to determine when a goal should be completed. These generally correspond to your company’s fiscal quarters, months, or years (depending on how often you expect people to create new goals). The\n                        \n                         Name\n                        \n                        is what the people will see when selecting the time period during the goal creation process.\n                       \n\n\n\n\n\n\n\n\n\n                            Important:\n                           \n                           You\n                           \n\n                           will NOT be able to create any goals until time periods are created.\n                          \n\n\n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. In the\n                         \n                          General\n                         \n                         tab, go to the\n                         \n                          Select a period to edit\n                         \n                         menu.\n                        \n\n\n\n                         4. From the menu, choose a period to edit. Give the time period a\n                         \n                          Name\n                         \n                         ,\n                         \n\n                         and select T\n                         \n                          ime period start and end dates\n                         \n                         .\n                        \n\n\n\n                         5. Select\n                         \n                          Save\n                         \n                         .\n                        \n\n\n                        6. (Optional)\n                        \n                         Repeat this process\n                        \n                        for multiple time periods.\n                       \n\n\n                         Members of your organization can now create goals within the specified time period(s).\n                        \n\n\n\n\n\n                         Configuring a Check-In Cadence\n                        \n\n\n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. In the\n                         \n                          General\n                         \n                         tab, locate the\n                         \n                          Weekly Goals email\n                         \n                         toggle.\n                        \n\n\n\n                         Switching the toggle to \"enabled\" sends a weekly email to members of your organization with reminders to update the progress of their goals and metrics.\n                        \n\n\n\n                         4. (Conditional) Select the day and time you wish the weekly goals check-in reminder email to be sent to all people who have active goals.\n                        \n\n\n\n\n\n\n\n\n                         Weekly reminders send at the specified time. Switch the toggle to\n                         \n                          Disabled\n                         \n                         if you no longer wish to send check-in emails.\n                        \n\n\n\n\n\n                         Configuring Goal Status Settings\n                        \n\n\n\n\n\n                           Administrators\n                          \n\n                           can give users the option for goal statuses to be automatically or manually updated.\n                          \n\n\n\n\n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. In the\n                         \n                          Objectives and Key Results\n                         \n                         tab, locate the\n                         \n                          Automatic Objective Status\n                         \n                         toggle.\n                        \n\n\n\n\n\n\n\n\n                         By enabling Automatic Objective Status, the status for all new goals will automatically be determined by the average progress of associated metrics. Users can choose to override the Automatic Objective Status for individual goals.\n                        \n\n\n\n\n\n                         By disabling Automatic Objective Status, the status for all new goals will be chosen by their owners.  Users can choose to enable Automatic Objective Status for individual goals.\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n                            Note:\n                           \n                           Enabling or disabling the Automatic Objective Status does not affect the status of existing goals.\n                          \n\n\n\n\n\n\n\n                         Managing Delegates Settings\n                        \n\n\n\n                         In Goals, you can allow someone else to create and manage goals on your behalf. This person is called a delegate. For example, an operations specialist might create goals for a team, or an executive assistant might create goals for a CFO.\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. Select the\n                         \n                          Delegates\n                         \n                         tab.\n                        \n\n\n\n                         4. Specify\n                         \n                          What person or group you want to assign a delegate to\n                         \n                         and\n                         \n                          Select a delegate.\n                         \n\n\n\n\n                         5. Select\n                         \n                          Add\n                         \n                         .\n                        \n\n\n\n                         6. (Optional) Search for existing delegates in the\n                         \n                          Search delegates\n                         \n                         field.\n                        \n\n\n\n                         People/groups and their delegates appear in a list in the main\n                         \n                          Delegates\n                         \n                         tab.\n                        \n\n\n\n\n\n\n\n                        Managing Tag Categories\n                       \n\n\n                         In Domo Goals, you can use tags to help identify your goals. Tags can be created and assigned to a goal at anytime. To stay organized, Admins can create pre-defined tags for other users and add levels of hierarchy with tag categories.\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. Select the\n                         \n                          Tag Categories\n                         \n                         tab.\n                        \n\n\n\n                         4. To create a new tag category, select the\n                         \n                          Create\n                         \n                         button.\n                        \n\n\n\n                         The new category is added to the\n                         \n                          Tag Category\n                         \n                         list. The\n                         \n                          Number of tags list\n                         \n                         displays the number of tags within each category.\n                        \n\n\n\n\n\n\n\n                        5. To add a tag to a category, hover next to the number of tags.\n                       \n\n                        A\n                        \n                         Manage\n                        \n                        option displays.\n                       \n\n\n\n\n                        6. Select\n                        \n                         Manage.\n                        \n                        A list of tags in the chosen category displays. In the\n                        \n                         Select tags\n                        \n                        menu, add new tags to the category. To create a new tag, begin typing a new title and select the\n                        \n                         +\n                        \n\n                         Your Tag\n                        \n                        button.\n                       \n\n                        7. (Optional) To remove tags from the category, select\n                        \n                        delete next to the tag.\n                       \n\n                        8. (Optional) To remove a tag category, select the box next to the category's name. Select\n                        \n                        delete.\n                       \n\n                        A modal displays confirming the category's deletion.\n                        \n                         The tags associated with this category will be uncategorized.\n                        \n\n\n\n                         9. Select\n                         \n                          Delete\n                         \n                         .\n                        \n\n\n\n\n                        Managing Tags\n                       \n\n\n                         Teams and individuals can track and organize goals with tags. Tags can be created by admins or regular users. They can also be sorted into any of the tag categories.\n                        \n\n\n\n                         Adding a Tag\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. Select the\n                         \n                          Tag\n                         \n                         tab.\n                        \n\n\n\n                         4. To add a new tag, begin typing its title in the\n                         \n                          New name\n                         \n                         field. (Optional) select a tag category and click\n                         \n                          Create.\n                         \n\n\n\n\n                         The new tag is added to the\n                         \n                          Tag name\n                         \n                         list.\n                        \n\n\n\n                         5. (Optional) To assign a tag to a category, hover next to the existing category name or\n                         \n                          Uncategorized\n                         \n                         . Select\n                         \n                         edit.\n                        \n\n                         From the menu, select an existing category and click\n                         \n                          Save\n                         \n                         .\n                        \n\n\n\n                         The tag is added to the specified category and can be viewed in the\n                         \n                          Tag Categories\n                         \n                         tab.\n                        \n\n\n\n\n\n                         Deleting a Tag\n                        \n\n\n\n                         1. To delete a tag, check the box next to its name. Select\n                         \n                         delete.\n                        \n\n\n\n                         A window displays confirming the tag's deletion.\n                        \n\n\n\n                         2. Select\n                         \n                          Delete.\n                         \n\n\n\n\n\n\n                         Renaming a Tag\n                        \n\n\n\n                         To rename a tag, select\n                         \n                         edit next to its name.\n                        \n\n\n\n\n\n                         Merging a Tag\n                        \n\n\n\n                         1. To merge a tag, select the boxes next to multiple tag names. Select\n                         \n                         merge.\n                        \n\n\n\n                         The\n                         \n                          Merge tags\n                         \n                         modal displays.\n                        \n\n\n\n                         2.. Select which tag you'd like to keep. This merges all other selected tags with it.\n                        \n\n\n\n\n\n\n\n\n\n                        Managing Key Results\n                       \n\n                        Admins can manage their organization's key result (or metric) attributes. This includes changing progress percentages, enabling pacing, and determining if a card-based metric will continue to be updated even after the goal's time period has passed.\n                       \n\n\n\n                        Setting the\n                        \n                         Key Result Progress Color Changer\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n                         3. Select the\n                         \n                          Key Results\n                         \n                         tab.\n                        \n\n\n\n                         4. Use the sliders to determine which percentages will make a metric At Risk (Red), Needs Attention (Yellow), or On Track (Green).\n                        \n\n\n\n                         5. After adjusting the sliders to your preferred percentages, select\n                         \n                          Save\n                         \n                         .\n                        \n\n\n\n\n\n\n\n\n\n\n                         Enabling Key Result Pacing\n                        \n\n\n\n                         In Domo Goals, you can enable key result pacing. This calculates key result progress based on time remaining until the achieve by date and percent completion towards the value target. Key result pacing is optional.\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n\n                          3.In\n                         \n                         the\n                         \n                          Key Results\n                         \n                         tab, toggle\n                        \n\n\n                          Key Results Pacing\n                         \n                         to enabled.\n                        \n\n\n\n                         Metrics now uses key result pacing to determine progress.\n                        \n\n\n\n\n\n                         Enabling Continuous Card Metric Updates\n                        \n\n\n\n                         In Domo Goals, you can allow card-linked data to continue updating the key result after the achieve by date. This can be useful if all the data for your time period isn’t reflected until after the time period ends. Continuous card-based metric updates are optional.\n                        \n\n\n\n                         1. In the navigation header, go to\n                         \n                          More > Admin\n                         \n                         .\n                        \n\n\n\n                         2. From the\n                         \n                          Features\n                         \n                         section, select\n                         \n                          Goals\n                         \n                         .\n                        \n\n\n\n\n                          3.In\n                         \n                         the\n                         \n                          Key Results\n                         \n                         tab, toggle\n                        \n\n\n                          Continue updating card data after achieve by date\n                         \n                         to enabled.\n                        \n\n\n\n                         Card-based metrics will continue to be updated even after the goal's time period has passed.", "Preview Article": "Click here to preview", "URL Name": "4577172785559", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000004349", "Archived Date": "", "Language": "English", "Primary Version": "Configuring Goals Settings", "Article Total View Count": "2,570", "": "", "Article Created Date": "10/24/2022, 9:45 PM", "First Published Date": "10/24/2022, 10:40 PM"}, "title": "\n              Configuring Goals Settings\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Getting To Know Domo\n              \n", "url": "/s/topic/0TO5w000000ZamsGAC"}, {"text": "\n\n               Goals Center\n              \n", "url": "/s/topic/0TO5w000000ZanmGAC"}]}