{"file_path": "../../raw_kb_v2\\article\\360043432693\\index.html", "content": {"Title": "Amazon Web Services Billing Connector", "Article Body": "Intro\n                       \n\n                        Amazon Web Services (AWS) is a collection of web services that make up a cloud computing platform by\n                        \n                         Amazon.com\n                        \n                        .  For more information about the AWS API, visit their website. (\n                        \n                         http://docs.aws.amazon.com/AmazonS3/...tication2.html\n                        \n                        )\n                       \n\n                        You connect to your AWS account in the Data Center. This topic discusses the fields and menus that are specific to the AWS connector user interface. General information for adding DataSets, setting update schedules, and editing DataSet information is discussed in\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Prerequisites\n                       \n\n                        To connect to your AWS account and create a DataSet, you must have the following:\n                       \n\n                        You must have the access rights to work with the connector\n                       \n\n\n\n                          Your AWS access key\n                         \n\n\n\n                          Your AWS secret key\n                         \n\n\n\n                          You must have the required permission to access the connector.\n                         \n\n\n\n                        For information about obtaining these keys, refer to the following article:\n                        \n                         http://docs.aws.amazon.com/AWSSimple...edentials.html\n                        \n                        .\n                       \n\n                        You must also set up an S3 bucket with a scheduled push of ZIP files to use this connector. For more information, consult Amazon's documentation at\n                        \n                         http://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/billing-reports.html\n                        \n                        .\n                       \n\n                        Connecting to Your AWS Account\n                       \n\n\n                         This section enumerates the options in the\n                         \n                          Credentials\n                         \n                         and\n                         \n                          Details\n                         \n                         panes in the AWS Connector page. The components of the other panes in this page,\n                         \n                          Scheduling\n                         \n                         and\n                         \n                          Name & Describe Your DataSet\n                         \n                         , are universal across most connector types and are discussed in greater length in\n                         \n                          Adding a DataSet Using a Data Connector\n                         \n                         .\n                        \n\n\n\n                         Credentials Pane\n                        \n\n\n\n                         This pane contains fields for entering credentials to connect to your AWS account. The following table describes what is needed for each field:\n                        \n\n\n\n\n\n\n\n                             Field\n                            \n\n\n\n\n\n                             Description\n                            \n\n\n\n\n\n\n\n                           AWS Access Key\n                          \n\n                           Enter your AWS access key.\n                          \n\n\n\n                           AWS Secret Key\n                          \n\n                           Enter your AWS secret key.\n                          \n\n\n\n\n                        Special characters, slashes and any other non-url compliant characters are not allowed as valid bucket names. Dash and Undescore are valid characters in the bucket name path. For more information on setting up the AWS Billing S3 bucket, please see the\n                        \n                         API Documentation\n                        \n                        .\n                       \n\n                        For information about obtaining these credentials, see \"Prerequisites,\" above.\n                       \n\n\n                         Once you have entered valid AWS credentials, you can use the same account any time you go to create a new AWS DataSet. You can manage connector accounts in the\n                         \n                          Accounts\n                         \n                         tab in the Data Center. For more information about this tab, see\n                         \n                          Managing User Accounts for Connectors\n                         \n                         .\n                        \n\n\n                        Details Pane\n                       \n\n                        This pane contains a primary\n                        \n\n                          Reports\n                         \n\n                        menu, along with various other menus which may or may not appear depending on the report type you select.\n                       \n\n\n\n\n\n                            Menu\n                           \n\n\n\n                            Description\n                           \n\n\n\n\n\n\n\n                            Report\n                           \n\n\n\n                            Select the AWS report you want to run. Currently only a single report type is available.\n                           \n\n\n\n\n\n                                Cost and Usage\n                               \n\n\n\n                                Returns Amazon Web Services Billing cost and usage data.\n                               \n\n\n\n\n\n\n\n\n\n                            Filter\n                           \n\n\n\n                            Select a filter for your report data. The following filters are available:\n                           \n\n\n\n\n\n                                All\n                               \n\n\n\n                                Receives data for both invoiced and estimated Billing reports.\n                               \n\n\n\n\n\n                                Invoiced\n                               \n\n\n\n                                Receives data for invoiced Billing report data.\n                               \n\n\n\n\n\n                                Estimated\n                               \n\n\n\n                                Receives estimated Billing report data. When using this filter, you should only go back 2 months and use\n                                \n                                 Relative\n                                \n                                mode.\n                               \n\n\n\n\n\n\n\n\n\n                            Bucket Name\n                           \n\n\n\n                            Enter the name of the bucket where billing records are redirected. For example:\n                            \n                             aws-billing-yourcompany\n                            \n\n\n\n\n\n\n                            Report Prefix\n                           \n\n\n\n                            Enter the Cost and Usage report prefix. For more information, consult the AWS Billing\n                           \n\n\n\n\n\n                            Report Name\n                           \n\n\n\n                            Select the AWS Billing Cost and Usage report name.\n                           \n\n\n\n\n\n                            Duration\n                           \n\n\n\n                            Select whether you want to pull data for a specific date or a date range.\n                           \n\n\n\n\n\n                            Report Date\n                           \n\n\n\n                            Select whether the report data is for a specific date or for a relative number of days back from today.\n                           \n\n\n\n\n\n                            Select Specific Date\n                           \n\n\n\n                            Select the date for the report.\n                           \n\n\n\n\n\n                            Days Back\n                           \n\n\n\n                            Enter the number of past days that should appear in the report.\n                           \n\n\n\n\n\n                            Start Date\n                           \n\n\n\n                            Specify whether the first date in your date range is a specific or relative date. You select the last date in your range in\n                            \n                             End Date\n                            \n                            .\n                           \n\n\n\n\n\n                            End Date\n                           \n\n\n\n                            Specify whether the second date in your date range is a specific or relative date. You select the first date in your range in\n                            \n                             Start Date\n                            \n                            .\n                           \n\n\n\n\n\n                            Select Specific Start Date\n                           \n\n\n\n                            Select the first date in your date range.\n                           \n\n\n\n\n\n                            Select Specific End Date\n                           \n\n\n\n                            Select the second date in your date range.\n                           \n\n\n\n\n\n                            Days Back to Start From\n                           \n\n\n\n                            Enter the number of the farthest day back that should be represented in the report. Combine with\n                            \n                             Days Back to End At\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                            Days Back to End At\n                           \n\n\n\n                            Enter the number of the most recent day back that should be represented in the report. Combine with\n                            \n                             Days Back to Start From\n                            \n                            to create a range of represented days.\n                           \n\n                            For example, if you entered\n                            \n                             10\n                            \n                            for\n                            \n                             Days Back to Start From\n                            \n                            and\n                            \n                             5\n                            \n                            for\n                            \n                             Days Back to End At\n                            \n                            , the report would contain data for 10 days ago up until 5 days ago.\n                           \n\n\n\n\n\n                        Other Panes\n                       \n\n                        For information about the remaining sections of the connector interface, including how to configure scheduling, retry, and update options, see\n                        \n                         a DataSet Using a Data Connector\n                        \n                        .\n                       \n\n                        Trobleshooting\n                       \n\n                        Error message, \"Failed to authenticate. Verify the credentials and try again. Domo is ready, but the credentials you entered are invalid. Verify your account credentials and try again.\" appears while trying to connect to the connector.\n                       \n\n                        This issue is related to authentication. You must have the required permission to use this connector.\n                       \n\n                        FAQ\n                       \n\n                        My AWS DataSet is returning an error of “Domo is ready, but Redshift returned: ERROR: current transaction is aborted, commands ignored until end of transaction block.” What do I do?\n                       \n\n                        This error is caused by a connection issue between AWS and Domo servers. This is an intermittent error that usually self-resolves. If it does not, you will need to submit a bug report to determine if the connector needs to have autocommit turned on.\n                       \n\n                        Are there any API limits that I need to be aware of?\n                       \n\n                        The connector only supports the Cost and Usage report. Amazon AWS is ending support for all other reports at a future date.\n                       \n\n                        How often can the data be updated?\n                       \n\n                        Due to large API returns from Amazon AWS, the data should only be updated once per day.", "Preview Article": "Click here to preview", "URL Name": "360043432693", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000003630", "Archived Date": "", "Language": "English", "Primary Version": "Amazon Web Services Billing Connector", "Article Total View Count": "4,758", "": "", "Article Created Date": "10/24/2022, 9:13 PM", "First Published Date": "10/24/2022, 10:42 PM"}, "title": "\n              Amazon Web Services Billing Connector\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Connecting Data To Domo\n              \n", "url": "/s/topic/0TO5w000000ZammGAC"}, {"text": "\n\n               Connectors\n              \n", "url": "/s/topic/0TO5w000000ZanLGAS"}, {"text": "\n\n               API Connectors\n              \n", "url": "/s/topic/0TO5w000000ZaoQGAS"}]}