{"file_path": "../../raw_kb_v2\\article\\360043438113\\index.html", "content": {"Title": "Apple TV App", "Article Body": "Intro\n                       \n\n                        Domo can be consumed and viewed across all platforms: mobile, desktop web, and now on TV. The Domo Apple TV app is ideal for Domo users who have large gathering areas, meeting rooms, or operating centers, allowing them to have a constant real-time view into their business. The Apple TV app displays any card on a page with the option to have a running slideshow or just a single card view.\n                       \n\n\n\n                        Downloading the app\n                       \n\n                        You can download\n                        \n                         the Domo Apple TV app for free in the Apple TV App Store. (4th generation or later).\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            The Apple TV App Store can only be accessed through an Apple TV.\n                           \n\n\n\n\n\n                        Log in\n                       \n\n\n                         When you open the Apple TV app, you must first log in.\n                        \n\n\n\n\n\n\n                         You can log in using the Easy sign-in method, using the Domo iOS app on your iPhone or iPad, or using your Domo domain and scanning a QR code.\n                        \n\n\n\n                         Easy sign in\n                        \n\n\n\n\n\n\n\n\n\n\n\n                             Important:\n                            \n                            To log in using this method, your mobile device and Apple TV must be on the same WiFi network.\n                           \n\n\n\n\n\n\n\n                           To use the Easy sign in,\n                          \n\n\n\n\n\n                         Click the\n                         \n                          Easy sign in\n                         \n                         option to be given a code.\n                         \n\n\n\n\n\n                          Open the Domo mobile app on your iPhone or iPad.\n                         \n\n\n\n                          Navigate to settings by tapping\n                          \n                          and select\n                          \n                           Sign in for Apple TV\n                          \n                          .\n                          \n\n\n\n\n\n\n                          Select your Apple TV.\n                         \n\n\n\n                          Enter the code from your Apple TV on your mobile device.\n                          \n\n\n\n\n\n\n                        Domain sign in using a QR code\n                       \n\n\n                         To use the domain and QR code sign in,\n                        \n\n\n\n                         Input your domain name and click\n                         \n                          Connect\n                         \n                         to be given a code.\n                         \n\n\n\n\n\n                          Open your camera app on your mobile device.\n                         \n\n\n\n                          Scan the QR code on the TV screen.\n                         \n\n\n\n                          Tap the notification banner on your device.\n                         \n\n\n\n                          Enter the code give from your Apple TV on your mobile device.\n                         \n\n\n\n                        Domain sign in using a link\n                       \n\n                        Alternatively, if you are unable to scan a QR code, you can sign in using your domain and a secure sign in through a link.\n                       \n\n\n                         To use the domain and secure link sign in,\n                        \n\n\n\n                         Input your domain name and click\n                         \n                          Connect\n                         \n                         .\n                        \n\n\n                          Click\n                          \n                           sign in with link.\n                           \n\n\n\n\n\n\n\n                          Go to the URL provided on another device and enter the code given.\n                          \n\n\n\n\n\n\n                          Lastly, you will be asked to sign in to Domo to grant the Apple TV access to your account.\n                         \n\n\n\n                        Using the app\n                       \n\n                        Home page\n                       \n\n                        Once you have successfully signed into the app, you will see the Home page. This is where your Overview and Favorites pages are located. From here, if you tap into one of the pages, you have the option to view the entire set of cards as a slideshow.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            All card types are shown in the Domo Apple TV app. However, Sumo cards and custom apps are displayed at a smaller size.\n                           \n\n\n\n\n\n\n\n\n                        Dashboards\n                       \n\n                        Choose from the pages to which you have access to view as a slideshow on the Apple TV.\n                       \n\n\n\n\n\n\n\n\n\n\n                             Note:\n                            \n                            Company Pages can be found in the Dashboards section.\n                           \n\n\n\n\n\n\n\n\n\n\n\n                        Search\n                       \n\n                        Search for and display specific cards that you have access to.\n                       \n\n\n\n\n                        Publications\n                       \n\n                        Choose from the Publications to which you have access to view as a slideshow on the Apple TV.\n                       \n\n\n\n\n                        Settings\n                       \n\n                        Under the\n                        \n                         Settings\n                        \n                        page you can,\n                       \n\n\n                         View and edit the slideshow speed.\n                        \n\n\n                          View all of the available card gestures.\n                          \n\n\n\n\n\n\n                          Sign out of your Domo account.\n                         \n\n\n\n                        Slideshow functionality\n                       \n\n\n                         If you swipe up on your remote during a slideshow, you are presented with a list of every card in that publication or page\n                        \n\n                         To gain even more insight into the data, you can also long click on a card, after swiping up, to be given a QR code. This links to the card on the Domo mobile app so that you can drill and filter into the data further.\n                        \n\n\n                        Troubleshooting\n                       \n\n                        Use the following steps to troubleshoot the Domo Apple TV app.\n                       \n\n\n                         Sign out and back in on the Apple TV app.\n                        \n\n\n                          Force quit the Apple TV app\n                         \n\n\n\n                            To force quit the app, double tap on the Home button on the Apple TV remote.\n                           \n\n\n\n                            Swipe left or right until the application selector is centered on the problematic application\n                           \n\n\n\n                            Slide your finger up the Apple TV remote trackpad until the preview of the app begins to slide off the screen.\n                           \n\n\n\n\n\n                          Restart your Apple TV. See\n                          \n                           Apple Support\n                          \n                          for more information on how to restart your Apple TV.\n                         \n\n\n\n                          Confirm that there is a working internet connection within your Apple TV settings.\n                         \n\n\n\n                          Uninstall and reinstall the Domo Apple TV app from the Apple TV App Store.", "Preview Article": "Click here to preview", "URL Name": "360043438113", "Summary\n                     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Briefly describe the article. The summary is used in search results to help users find relevant articles. You can improve the accuracy of search results by including phrases that your customers use to describe this issue or topic.": "", "Article Number": "000005004", "Archived Date": "", "Language": "English", "Primary Version": "Apple TV App", "Article Total View Count": "2,596", "": "", "Article Created Date": "11/2/2022, 8:16 PM", "First Published Date": "11/2/2022, 8:37 PM"}, "title": "\n              Apple TV App\n             ", "breadcrumbs": [{"text": "\n\n               Domo\n              \n", "url": "/s/knowledge-base/"}, {"text": "\n\n               Creating Custom Visualizations\n              \n", "url": "/s/topic/0TO5w000000ZampGAC"}, {"text": "\n\n               Available Apps\n              \n", "url": "/s/topic/0TO5w000000Zan9GAC"}]}